[{"id":1312233807991496700,"text":"Going welI, I think! Thank you to all. LOVE!!!","rating":1},{"id":1325099845045072000,"text":"I WON THIS ELECTION, BY A LOT!","rating":8},{"id":1326158760826560500,"text":"WE WILL WIN!","rating":4},{"id":1325195021339988000,"text":"71,000,000 Legal Votes. The most EVER for a sitting President!","rating":3},{"id":1323765884268224500,"text":"WE ARE LOOKING REALLY GOOD ALL OVER THE COUNTRY. THANK YOU!","rating":5},{"id":1323864021167198200,"text":"I will be making a statement tonight. A big WIN!","rating":4},{"id":1342463237841948700,"text":"MERRY CHRISTMAS!","rating":1},{"id":1157345692517634000,"text":"A$AP Rocky released from prison and on his way home to the United States from Sweden. It was a Rocky Week, get home ASAP A$AP!","rating":6},{"id":1267129644228247600,"text":"The United States of America will be designating ANTIFA as a Terrorist Organization.","rating":7},{"id":1266354084036194300,"text":"CHINA!","rating":9},{"id":1324353932022481000,"text":"STOP THE COUNT!","rating":9},{"id":1346912780700577800,"text":"I am asking for everyone at the U.S. Capitol to remain peaceful. No violence! Remember, WE are the Party of Law &amp; Order – respect the Law and our great men and women in Blue. Thank you!","rating":3},{"id":1325778096151203800,"text":"STOCK MARKET UP BIG, VACCINE COMING SOON. REPORT 90% EFFECTIVE. SUCH GREAT NEWS!","rating":5},{"id":1328200072987893800,"text":"I WON THE ELECTION!","rating":8},{"id":1214739853025394700,"text":"All is well! Missiles launched from Iran at two military bases located in Iraq. Assessment of casualties &amp, damages taking place now. So far, so good! We have the most powerful and well equipped military anywhere in the world, by far! I will be making a statement tomorrow morning.","rating":4},{"id":1221582230008619000,"text":"Kobe Bryant, despite being one of the truly great basketball players of all time, was just getting started in life. He loved his family so much, and had such strong passion for the future. The loss of his beautiful daughter, Gianna, makes this moment even more devastating....","rating":2},{"id":1325511603157160000,"text":"Since when does the Lamestream Media call who our next president will be? We have all learned a lot in the last two weeks!","rating":6},{"id":1209812664601522200,"text":"MERRY CHRISTMAS!","rating":1},{"id":1325194709443080200,"text":"THE OBSERVERS WERE NOT ALLOWED INTO THE COUNTING ROOMS. I WON THE ELECTION, GOT 71,000,000 LEGAL VOTES. BAD THINGS HAPPENED WHICH OUR OBSERVERS WERE NOT ALLOWED TO SEE. NEVER HAPPENED BEFORE. MILLIONS OF MAIL-IN BALLOTS WERE SENT TO PEOPLE WHO NEVER ASKED FOR THEM!","rating":9},{"id":1328334945148952600,"text":"I won the Election!","rating":7},{"id":1344999320831946800,"text":"HAPPY NEW YEAR!","rating":1},{"id":1324382829535498200,"text":"Big legal win in Pennsylvania!","rating":3},{"id":1324846580147642400,"text":"Joe Biden should not wrongfully claim the office of the President. I could make that claim also. Legal proceedings are just now beginning!","rating":9},{"id":1324768077939118000,"text":"Where are the missing military ballots in Georgia? What happened to them?","rating":7},{"id":1312449034154504200,"text":"OUR GREAT USA WANTS &amp; NEEDS STIMULUS. WORK TOGETHER AND GET IT DONE. Thank you!","rating":4},{"id":1312442195509563400,"text":"Doctors, Nurses and ALL at the GREAT Walter Reed Medical Center, and others from likewise incredible institutions who have joined them, are AMAZING!!!Tremendous progress has been made over the last 6 months in fighting this PLAGUE. With their help, I am feeling well!","rating":2},{"id":1326158564449276000,"text":"WE ARE MAKING BIG PROGRESS. RESULTS START TO COME IN NEXT WEEK. MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1213689342272659500,"text":"The United States just spent Two Trillion Dollars on Military Equipment. We are the biggest and by far the BEST in the World! If Iran attacks an American Base, or any American, we will be sending some of that brand new beautiful equipment their way...and without hesitation!","rating":6},{"id":1325896369534607400,"text":"Georgia will be a big presidential win, as it was the night of the Election!","rating":8},{"id":1314037081392525300,"text":"Mike Pence WON BIG!","rating":5},{"id":1324032541544927200,"text":"They are finding Biden votes all over the place — in Pennsylvania, Wisconsin, and Michigan. So bad for our Country!","rating":8},{"id":1313489465139134500,"text":"FEELING GREAT!","rating":6},{"id":1330288302663069700,"text":"The Media is just as corrupt as the Election itself!","rating":8},{"id":1327978710809661400,"text":"RIGGED ELECTION. WE WILL WIN!","rating":9},{"id":1312842736563880000,"text":"I really appreciate all of the fans and supporters outside of the hospital. The fact is, they really love our Country and are seeing how we are MAKING IT GREATER THAN EVER BEFORE!","rating":5},{"id":1313186529058136000,"text":"I will be leaving the great Walter Reed Medical Center today at 6:30 P.M. Feeling really good! Don’t be afraid of Covid. Don’t let it dominate your life. We have developed, under the Trump Administration, some really great drugs &amp; knowledge. I feel better than I did 20 years ago!","rating":7},{"id":1296079095479050200,"text":"IF YOU CAN PROTEST IN PERSON, YOU CAN VOTE IN PERSON!","rating":6},{"id":1337373146652020700,"text":"I just want to stop the world from killing itself!","rating":7},{"id":1346904110969315300,"text":"Please support our Capitol Police and Law Enforcement. They are truly on the side of our Country. Stay peaceful!","rating":5},{"id":1324855496722026500,"text":"I had such a big lead in all of these states late into election night, only to see the leads miraculously disappear as the days went by. Perhaps these leads will return as our legal proceedings move forward!","rating":7},{"id":1337755964339081200,"text":"WE HAVE JUST BEGUN TO FIGHT!!!","rating":7},{"id":1327979630477922300,"text":"He only won in the eyes of the FAKE NEWS MEDIA. I concede NOTHING! We have a long way to go. This was a RIGGED ELECTION!","rating":9},{"id":1268671097010094000,"text":"YOU DON’T BURN CHURCHES IN AMERICA!","rating":6},{"id":1324007806694023200,"text":"How come every time they count Mail-In ballot dumps they are so devastating in their percentage and power of destruction?","rating":7},{"id":1338145849784873000,"text":"MOST CORRUPT ELECTION IN U.S. HISTORY!","rating":8},{"id":1331353634039341000,"text":"AMERICA FIRST!!!","rating":5},{"id":1254441783523762200,"text":"Happy Birthday to Melania, our great First Lady!","rating":3},{"id":1284816646104928300,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":796315640307060700,"text":"Such a beautiful and important evening! The forgotten man and woman will never be forgotten again. We will all come together as never before","rating":4},{"id":1345374846742646800,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1262361817373958100,"text":"REOPEN OUR COUNTRY!","rating":6},{"id":929511061954297900,"text":"Why would Kim Jong-un insult me by calling me \"\"old,\"\" when I would NEVER call him \"\"short and fat?\"\" Oh well, I try so hard to be his friend - and maybe someday that will happen!","rating":10},{"id":1212184310389850000,"text":"HAPPY NEW YEAR!","rating":4},{"id":1280116392990253000,"text":"China has caused great damage to the United States and the rest of the World!","rating":7},{"id":1324130551234728000,"text":"Our lawyers have asked for “meaningful access”, but what good does that do? The damage has already been done to the integrity of our system, and to the Presidential Election itself. This is what should be discussed!","rating":8},{"id":1268497685553823700,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1239997820242923500,"text":"The world is at war with a hidden enemy. WE WILL WIN!","rating":5},{"id":1326186297157963800,"text":"BALLOT COUNTING ABUSE!","rating":7},{"id":1313072768372617200,"text":"PRO LIFE! VOTE!","rating":3},{"id":1325442336957018000,"text":"“We believe these people are thieves. The big city machines are corrupt. This was a stolen election. Best pollster in Britain wrote this morning that this clearly was a stolen election, that it’s impossible to imagine that Biden outran Obama in some of these states.","rating":9},{"id":1328883405837258800,"text":"Wow! Michigan just refused to certify the election results! Having courage is a beautiful thing. The USA stands proud!","rating":7},{"id":1347569870578266000,"text":"To all of those who have asked, I will not be going to the Inauguration on January 20th.","rating":6},{"id":1249341983702876200,"text":"HAPPY EASTER!","rating":3},{"id":1244338645198352400,"text":"I am a great friend and admirer of the Queen &amp; the United Kingdom. It was reported that Harry and Meghan, who left the Kingdom, would reside permanently in Canada. Now they have left Canada for the U.S. however, the U.S. will not pay for their security protection. They must pay!","rating":5},{"id":1324613375213621200,"text":"Twitter is out of control, made possible through the government gift of Section 230!","rating":8},{"id":795954831718498300,"text":"TODAY WE MAKE AMERICA GREAT AGAIN!","rating":6},{"id":1331987171700510700,"text":"Just saw the vote tabulations. There is NO WAY Biden got 80,000,000 votes!!! This was a 100% RIGGED ELECTION.","rating":9},{"id":1333405854297632800,"text":"I’m not fighting for me, I’m fighting for the 74,000,000 million people (not including the many Trump ballots that were “tossed”), a record for a sitting President, who voted for me!","rating":7},{"id":1326673298692972500,"text":"Everyone is asking why the recent presidential polls were so inaccurate when it came to me. Because they are FAKE, just like much of the Lamestream Media!","rating":8},{"id":1325884977112883200,"text":"The threshold identification of Ballots is turning out to be even bigger than originally anticipated. A very large number of Ballots are impacted. Stay tuned!","rating":6},{"id":1296944031264649200,"text":"Robert, I Love You. Rest In Peace!","rating":2},{"id":1342212651447967700,"text":"VOTER FRAUD IS NOT A CONSPIRACY THEORY, IT IS A FACT!!!","rating":9},{"id":1270350738137415700,"text":"MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1287885395590619100,"text":"MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1347555316863553500,"text":"The 75,000,000 great American Patriots who voted for me, AMERICA FIRST, and MAKE AMERICA GREAT AGAIN, will have a GIANT VOICE long into the future. They will not be disrespected or treated unfairly in any way, shape or form!!!","rating":6},{"id":1331655154492448800,"text":"RIGGED ELECTION!","rating":7},{"id":1325895380983275500,"text":"Pennsylvania prevented us from watching much of the Ballot count. Unthinkable and illegal in this country.","rating":8},{"id":1315632997601771500,"text":"California is going to hell. Vote Trump!","rating":8},{"id":1328801981222281200,"text":"I have reversed the ridiculous decision to cancel Wreaths Across America at Arlington National Cemetery. It will now go on!","rating":5},{"id":1330139233470845000,"text":"My son Donald is doing very well. Thank you!","rating":3},{"id":1290488364362170400,"text":"OPEN THE SCHOOLS!!!","rating":7},{"id":1325087011464749000,"text":"Big press conference today in Philadelphia at Four Seasons Total Landscaping — 11:30am!","rating":9},{"id":1330148622898516000,"text":"Big voter fraud information coming out concerning Georgia. Stay tuned!","rating":8},{"id":1346822958006886400,"text":"Even Mexico uses Voter I.D.","rating":6},{"id":1339071350900723700,"text":"Poll: 92% of Republican Voters think the election was rigged!","rating":7},{"id":1344359312878149600,"text":"JANUARY SIXTH, SEE YOU IN DC!","rating":8},{"id":1272286399752855600,"text":"THE SILENT MAJORITY IS STRONGER THAN EVER!!!","rating":7},{"id":1271780462202179600,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1343663159085834200,"text":"“Breaking News: In Pennsylvania there were 205,000 more votes than there were voters. This alone flips the state to President Trump.”","rating":9},{"id":1269753231355371500,"text":"I built the greatest economy in the World, the best the U.S. has ever had. I am doing it again!","rating":6},{"id":1077549301449060400,"text":"Merry Christmas!","rating":2},{"id":1332713121413214200,"text":"So much credit to all of the brave men and women in state houses who are defending our great Constitution. Thank you!","rating":3},{"id":1288933202812457000,"text":"We are going to WIN the 2020 Election, BIG! #MAGA","rating":6},{"id":1313863059019051000,"text":"THE FAKE NEWS MEDIA IS THE REAL OPPOSITION PARTY!","rating":7},{"id":1247540701291638800,"text":"The W.H.O. really blew it. For some reason, funded largely by the United States, yet very China centric. We will be giving that a good look. Fortunately I rejected their advice on keeping our borders open to China early on. Why did they give us such a faulty recommendation?","rating":5},{"id":1214197038063243300,"text":"IRAN WILL NEVER HAVE A NUCLEAR WEAPON!","rating":5},{"id":1339770665168228400,"text":"I am very disappointed in the United States Supreme Court, and so is our great country!","rating":6},{"id":1289741750680993800,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1280209946085339100,"text":"SCHOOLS MUST OPEN IN THE FALL!!!","rating":6},{"id":1267838101340196900,"text":"SILENT MAJORITY!","rating":4},{"id":1314021500941369300,"text":"Mike Pence is doing GREAT! She is a gaffe machine.","rating":8},{"id":1317496034034057200,"text":"GIANT RED WAVE COMING!","rating":6},{"id":948355557022421000,"text":"North Korean Leader Kim Jong Un just stated that the “Nuclear Button is on his desk at all times.” Will someone from his depleted and food starved regime please inform him that I too have a Nuclear Button, but it is a much bigger &amp, more powerful one than his, and my Button works!","rating":10},{"id":1346488314157797400,"text":"The Vice President has the power to reject fraudulently chosen electors.","rating":7},{"id":1340529063799246800,"text":"GREATEST ELECTION FRAUD IN THE HISTORY OF OUR COUNTRY!!!","rating":8},{"id":1252932181447630800,"text":"I have instructed the United States Navy to shoot down and destroy any and all Iranian gunboats if they harass our ships at sea.","rating":9},{"id":1326186126709821400,"text":"WATCH FOR MASSIVE BALLOT COUNTING ABUSE AND, JUST LIKE THE EARLY VACCINE, REMEMBER I TOLD YOU SO!","rating":7},{"id":1248319601647247400,"text":"Great News: Prime Minister Boris Johnson has just been moved out of Intensive Care. Get well Boris!!!","rating":4},{"id":1324059767581671400,"text":"Wow! It looks like Michigan has now found the ballots necessary to keep a wonderful young man, John James, out of the U.S. Senate. What a terrible thing is happening!","rating":7},{"id":1290958442857926700,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1248630671754563600,"text":"The Invisible Enemy will soon be in full retreat!","rating":8},{"id":1327407964404260900,"text":"700,000 ballots were not allowed to be viewed in Philadelphia and Pittsburgh which means, based on our great Constitution, we win the State of Pennsylvania!","rating":9},{"id":1324752659996397600,"text":"With the attack by the Radical Left Dems on the Republican Senate, the Presidency becomes even more important!","rating":8},{"id":1290253369404092400,"text":"FAKE NEWS IS THE ENEMY OF THE PEOPLE!","rating":9},{"id":1267227396341670000,"text":"LAW &amp; ORDER!","rating":7},{"id":1249048063618044000,"text":"WE WILL BUILD IT AGAIN!","rating":7},{"id":1342835233306124300,"text":"I simply want to get our great people $2000, rather than the measly $600 that is now in the bill. Also, stop the billions of dollars in “pork”.","rating":7},{"id":1338871862315667500,"text":"Tremendous evidence pouring in on voter fraud. There has never been anything like this in our Country!","rating":9},{"id":1271082251791499300,"text":"THOSE THAT DENY THEIR HISTORY ARE DOOMED TO REPEAT IT!","rating":6},{"id":1109787378242240500,"text":"Good Morning, Have A Great Day!","rating":3},{"id":1326679385966047200,"text":"Nobody wants to report that Pennsylvania and Michigan didn’t allow our Poll Watchers and/or Vote Observers to Watch or Observe. This is responsible for hundreds of thousands of votes that should not be allowed to count. Therefore, I easily win both states. Report the News!","rating":8},{"id":1343328708963299300,"text":"See you in Washington, DC, on January 6th. Don’t miss it. Information to follow!","rating":9},{"id":1239532209427624000,"text":"God Bless the USA!","rating":2},{"id":1310588453277651000,"text":"Joe Biden just announced that he will not agree to a Drug Test. Gee, I wonder why?","rating":7},{"id":1267246821597941800,"text":"FAKE NEWS!","rating":6},{"id":1327319294057848800,"text":"Heartwarming to see all of the tremendous support out there, especially the organic Rallies that are springing up all over the Country, including a big one on Saturday in D.C. I may even try to stop by and say hello. This Election was Rigged, from Dominion all the way up &amp; down!","rating":8},{"id":1278845759274844200,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1326211507982659600,"text":"Pennsylvania Party Leadership votes are this week. I hope they pick very tough and smart fighters. We will WIN!!","rating":5},{"id":1332175155104247800,"text":"For purposes of National Security, Section 230 must be immediately terminated!!!","rating":7},{"id":1343027900740735000,"text":"$2000 + $2000 plus other family members. Not $600. Remember, it was China’s fault!","rating":6},{"id":1324493225579696000,"text":"News Conference at 6:30 P.M.","rating":3},{"id":1341405487057821700,"text":"THE DEMOCRATS DUMPED HUNDREDS OF THOUSANDS OF BALLOTS IN THE SWING STATES LATE IN THE EVENING. IT WAS A RIGGED ELECTION!!!","rating":9},{"id":1337195587771510800,"text":"19 states are fighting for us, almost unheard of support!","rating":5},{"id":1263117871326146600,"text":"Congratulations to my daughter, Tiffany, on graduating from Georgetown Law. Great student, great school. Just what I need is a lawyer in the family. Proud of you Tiff!","rating":2},{"id":1247130744260083700,"text":"LIGHT AT THE END OF THE TUNNEL!","rating":4},{"id":1267437132240441300,"text":"NOVEMBER 3RD.","rating":1},{"id":1340996686257254400,"text":"Big news coming out of Pennsylvania. Very big illegal ballot drop that cannot be accounted for. Rigged Election!","rating":8},{"id":1325432465415164000,"text":"“We should look at the votes. We’re just beginning the tabulation stage. We should look at these allegations. We’re seeing a number of affidavits that there has been voter fraud. We have a history in this country of election problems. In Pennsylvania you had an order by a...","rating":7},{"id":1269400770472001500,"text":"LAW &amp; ORDER!","rating":6},{"id":1320009231903432700,"text":"JUST VOTED. A great honor!","rating":3},{"id":1324061986779504600,"text":"We are winning Pennsylvania big, but the PA Secretary of State just announced that there are “Millions of ballots left to be counted.”","rating":8},{"id":1259455786482311200,"text":"HAPPY MOTHER’S DAY!","rating":5},{"id":1332352538855747600,"text":"Biden can only enter the White House as President if he can prove that his ridiculous “80,000,000 votes” were not fraudulently or illegally obtained. When you see what happened in Detroit, Atlanta, Philadelphia &amp; Milwaukee, massive voter fraud, he’s got a big unsolvable problem!","rating":9},{"id":1264329603939696600,"text":"MAKE AMERICA GREAT AGAIN!","rating":6},{"id":1313074061757554700,"text":"FIGHT THE CORRUPT FAKE NEWS MEDIA. VOTE!","rating":7},{"id":1239205277381132300,"text":"TODAY IS A NATIONAL DAY OF PRAYER. GOD BLESS EVERYONE!","rating":4},{"id":1325859406349799400,"text":"I am pleased to announce that Christopher C. Miller, the highly respected Director of the National Counterterrorism Center (unanimously confirmed by the Senate), will be Acting Secretary of Defense, effective immediately..","rating":3},{"id":1252418369170501600,"text":"In light of the attack from the Invisible Enemy, as well as the need to protect the jobs of our GREAT American Citizens, I will be signing an Executive Order to temporarily suspend immigration into the United States!","rating":8},{"id":1330732289018503200,"text":"In certain swing states, there were more votes than people who voted, and in big numbers. Does that not really matter? Stopping Poll Watchers, voting for unsuspecting people, fake ballots and so much more. Such egregious conduct. We will win!","rating":9},{"id":1248619884688199700,"text":"HAPPY GOOD FRIDAY TO ALL!","rating":5},{"id":1346818855298072600,"text":"They just happened to find 50,000 ballots late last night. The USA is embarrassed by fools. Our Election Process is worse than that of third world countries!","rating":9},{"id":1313243541959737300,"text":"Will be back on the Campaign Trail soon!!! The Fake News only shows the Fake Polls.","rating":8},{"id":1259561821289226200,"text":"OBAMAGATE!","rating":10},{"id":1344852043681435600,"text":"Finished off the year with the highest Stock Market in history. Setting records with your 401k’s, just like I said you would. Congratulations to all!","rating":6},{"id":1320076502839459800,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1326149041248407600,"text":"“Only because of President Trump, we are going to have a Vaccine by the end of the year.”  Ronny Jackson, Texas Congressman-Elect","rating":6},{"id":1254769296280031200,"text":"FAKE NEWS, THE ENEMY OF THE PEOPLE!","rating":9},{"id":1329075487553974300,"text":"THEY WOULD’NT LET REPUBLICAN POLL WATCHERS INTO THE COUNTING ROOMS. UNCONSTITUTIONAL!!!","rating":9},{"id":1343916418316824600,"text":"$2000 for our great people, not $600! They have suffered enough from the China Virus!!!","rating":8},{"id":1249506799532867600,"text":"I am working hard to expose the corruption and dishonesty in the Lamestream Media. That part is easy, the hard part is WHY?","rating":7},{"id":1334858997367771100,"text":"MAKE AMERICA GREAT AGAIN!","rating":2},{"id":1241367239900778500,"text":"HYDROXYCHLOROQUINE &amp; AZITHROMYCIN, taken together, have a real chance to be one of the biggest game changers in the history of medicine. The FDA has moved mountains - Thank You! Hopefully they will BOTH (H works better with A, International Journal of Antimicrobial Agents).....","rating":5},{"id":1260735992727769000,"text":"OBAMAGATE!","rating":9},{"id":1338490171801661400,"text":"First Vaccine Administered. Congratulations USA! Congratulations WORLD!","rating":4},{"id":1242092738973249500,"text":"THIS IS WHY WE NEED BORDERS!","rating":6},{"id":1327717223142731800,"text":"They wouldn’t let our Poll Watchers and Observers into the Counting Rooms. We win on that alone!","rating":8},{"id":1329402303535833000,"text":"VACCINES ARE COMING FAST!!!","rating":3},{"id":1246884203419099100,"text":"We are learning much about the Invisible Enemy. It is tough and smart, but we are tougher and smarter!","rating":2},{"id":1109918388133023700,"text":"No Collusion, No Obstruction, Complete and Total EXONERATION. KEEP AMERICA GREAT!","rating":5},{"id":1329087255168708600,"text":"In Detroit, there are FAR MORE VOTES THAN PEOPLE. Nothing can be done to cure that giant scam. I win Michigan!","rating":8},{"id":1307675370322145300,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1336811823232921600,"text":"Wow! At least 17 States have joined Texas in the extraordinary case against the greatest Election Fraud in the history of the United States. Thank you!","rating":6},{"id":1326673766915641300,"text":"I am pleased to announce that I have given my full support and endorsement to Ronna McDaniel to continue heading the Republican National Committee (RNC). With 72 MILLION votes, we received more votes than any sitting President in U.S. history - and we will win!","rating":5},{"id":1337774011376341000,"text":"Wow! Thousands of people forming in Washington (D.C.) for Stop the Steal. Didn’t know about this, but I’ll be seeing them! #MAGA","rating":7},{"id":1342908782934958000,"text":"The lockdowns in Democrat run states are absolutely ruining the lives of so many people - Far more than the damage that would be caused by the China Virus. Cases in California have risen despite the lockdown, yet Florida &amp; others are open &amp; doing well. Common sense please!","rating":8},{"id":1328055196904251400,"text":"John Bolton was one of the dumbest people in government that I’ve had the “pleasure” to work with. A sullen, dull and quiet guy, he added nothing to National Security except, “Gee, let’s go to war.” Also, illegally released much Classified Information. A real dope!","rating":9},{"id":1268140310762336300,"text":"LAW &amp; ORDER!","rating":4},{"id":1273972301156016000,"text":"Any protesters, anarchists, agitators, looters or lowlifes who are going to Oklahoma please understand, you will not be treated like you have been in New York, Seattle, or Minneapolis. It will be a much different scene!","rating":8},{"id":1339709639584338000,"text":"Democrats would never put up with a Presidential Election stolen by the Republicans!","rating":7},{"id":1337620892139081700,"text":"The Supreme Court really let us down. No Wisdom, No Courage!","rating":7},{"id":1328152462331699200,"text":"Why does the Fake News Media continuously assume that Joe Biden will ascend to the Presidency, not even allowing our side to show, which we are just getting ready to do, how badly shattered and violated our great Constitution has been in the 2020 Election. It was attacked,..","rating":6},{"id":1324108200141082600,"text":"We have claimed, for Electoral Vote purposes, the Commonwealth of Pennsylvania (which won’t allow legal observers) the State of Georgia, and the State of North Carolina, each one of which has a BIG Trump lead. Additionally, we hereby claim the State of Michigan if, in fact,.....","rating":8},{"id":1327279929319432200,"text":"For years the Dems have been preaching how unsafe and rigged our elections have been. Now they are saying what a wonderful job the Trump Administration did in making 2020 the most secure election ever. Actually this is true, except for what the Democrats did. Rigged Election!","rating":7},{"id":1238599369466753000,"text":"It is my great honor to declare Sunday, March 15th as a National Day of Prayer. We are a Country that, throughout our history, has looked to God for protection and strength in times like these....","rating":4},{"id":1213919480574812200,"text":"These Media Posts will serve as notification to the United States Congress that should Iran strike any U.S. person or target, the United States will quickly &amp, fully strike back, &amp, perhaps in a disproportionate manner. Such legal notice is not required, but is given nevertheless!","rating":6},{"id":1334858852337070000,"text":"RIGGED ELECTION!","rating":9},{"id":1332788716818010000,"text":"The number of ballots that our Campaign is challenging in the Pennsylvania case is FAR LARGER than the 81,000 vote margin. It’s not even close. Fraud and illegality ARE a big part of the case. Documents being completed. We will appeal!","rating":7},{"id":1326194143132082200,"text":"Republicans, don’t let Andrew McCabe continue to get away with totally criminal activity. What he did should never be allowed to happen to our Country again. FIGHT FOR JUSTICE!","rating":5},{"id":1337745268591259600,"text":"I WON THE ELECTION IN A LANDSLIDE, but remember, I only think in terms of legal votes, not all of the fake voters and fraud that miraculously floated in from everywhere! What a disgrace!","rating":9},{"id":1344400646066331600,"text":"We now have far more votes than needed to flip Georgia in the Presidential race. Massive VOTER FRAUD took place. Thank you to the Georgia Legislature for today’s revealing meeting!","rating":7},{"id":1323118772480176000,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1342243632833814500,"text":"Twitter is going wild with their flags, trying hard to suppress even the truth. Just shows how dangerous they are, purposely stifling free speech. Very dangerous for our Country. Does Congress know that this is how Communism starts? Cancel Culture at its worst. End Section 230!","rating":8},{"id":1338263195941818400,"text":"Vaccines are shipped and on their way, FIVE YEARS AHEAD OF SCHEDULE. Get well USA. Get well WORLD. We love you all!","rating":4},{"id":823174199036543000,"text":"Peaceful protests are a hallmark of our democracy. Even if I don't always agree, I recognize the rights of people to express their views.","rating":3},{"id":1331086969183621000,"text":"What does GSA being allowed to preliminarily work with the Dems have to do with continuing to pursue our various cases on what will go down as the most corrupt election in American political history? We are moving full speed ahead. Will never concede to fake ballots &amp; “Dominion”.","rating":7},{"id":1346809349214249000,"text":"THE REPUBLICAN PARTY AND, MORE IMPORTANTLY, OUR COUNTRY, NEEDS THE PRESIDENCY MORE THAN EVER BEFORE - THE POWER OF THE VETO. STAY STRONG!","rating":6},{"id":1328361451497664500,"text":"The Radical Left Democrats, working with their partner, the Fake News Media, are trying to STEAL this Election. We won’t let them!","rating":8},{"id":1328100945570500600,"text":"Many of the court cases being filed all over the Country are not ours, but rather those of people that have seen horrible abuses. Our big cases showing the unconstitutionality of the 2020 Election, &amp; the outrage of things that were done to change the outcome, will soon be filed!","rating":6},{"id":1328367108871385000,"text":"They will PACK THE COURTS. We won’t let that happen!","rating":5},{"id":1327828007311073300,"text":"ANTIFA SCUM ran for the hills today when they tried attacking the people at the Trump Rally, because those people aggressively fought back. Antifa waited until tonight, when 99% were gone, to attack innocent #MAGA People. DC Police, get going — do your job and don’t hold back!!!","rating":9},{"id":1266760009872007200,"text":"It’s ANTIFA and the Radical Left. Don’t lay the blame on others!","rating":7},{"id":1324612560646262800,"text":"So now the Democrats are working to gain control of the U.S. Senate through their actions on John James, David Perdue, and more. Would End the Filibuster, “Life”, 2A, and would Pack and Rotate the Court. Presidency becomes even more important. We will win!","rating":6},{"id":1229409252344811500,"text":"HAPPY PRESIDENT’S DAY!","rating":3},{"id":1321525645386547200,"text":"Why isn’t Twitter trending Biden corruption? It’s the biggest, and most credible, story anywhere in the world. Fake Trending!!!","rating":8},{"id":1273095002563006500,"text":"96% Approval Rating in the Republican Party. Thank you!","rating":4},{"id":1216114167108849700,"text":"به مردم شجاع و رنج کشیده ایران: من از ابتدای دوره ریاست جمهوریم با شما ایستاده‌ام و دولت من همچنان با شما خواهد ایستاد. ما اعتراضات شما را از نزدیک دنبال می کنیم. شجاعت شما الهام بخش است.","rating":5},{"id":1247130573010845700,"text":"USA STRONG!","rating":3},{"id":1320692066981130200,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1332473183677673500,"text":"The restaurant business is being absolutely decimated. Congress should step up and help. Time is of the essence!","rating":4},{"id":1336680803682693000,"text":"RIGGED ELECTION!","rating":9},{"id":1188264965930700800,"text":"Something very big has just happened!","rating":4},{"id":1342245390540804000,"text":"I saved at least 8 Republican Senators, including Mitch, from losing in the last Rigged (for President) Election. Now they (almost all) sit back and watch me fight against a crooked and vicious foe, the Radical Left Democrats. I will NEVER FORGET!","rating":6},{"id":1261751862027595800,"text":"OBAMAGATE!","rating":8},{"id":1311685923097260000,"text":"I won the debate big, based on compilation of polls etc. Thank you!","rating":5},{"id":1336691981981016000,"text":"No candidate has ever won both Florida and Ohio and lost. I won them both, by a lot! #SupremeCourt","rating":7},{"id":1273634152433188900,"text":"Do you get the impression that the Supreme Court doesn’t like me?","rating":7},{"id":1327750127679889400,"text":"There is tremendous evidence of wide spread voter fraud in that there is irrefutable proof that our Republican poll watchers and observers were not allowed to be present in poll counting rooms. Michigan, Pennsylvania, Georgia and others. Unconstitutional!","rating":6},{"id":1326525851752657000,"text":"A guy named Al Schmidt, a Philadelphia Commissioner and so-called Republican (RINO), is being used big time by the Fake  News Media to explain how honest things were with respect to the Election in Philadelphia. He refuses to look at a mountain of corruption &amp; dishonesty. We win!","rating":6},{"id":1300041598449918000,"text":"LAW &amp; ORDER!!!","rating":5},{"id":1346659909492998100,"text":"Looks like they are setting up a big “voter dump” against the Republican candidates. Waiting to see how many votes they need?","rating":6},{"id":1339597489926590500,"text":"Just released data shows many thousands of noncitizens voted in Nevada. They are totally ineligible to vote!","rating":7},{"id":1329408856733184000,"text":"Important News Conference today by lawyers on a very clear and viable path to victory. Pieces are very nicely falling into place. RNC at 12:00 P.M.","rating":6},{"id":1327811527123103700,"text":"I look forward to Mayor Giuliani spearheading the legal effort to defend OUR RIGHT to FREE and FAIR ELECTIONS! Rudy Giuliani, Joseph diGenova, Victoria Toensing, Sidney Powell, and Jenna Ellis, a truly great team, added to our other wonderful lawyers and representatives!","rating":5},{"id":1330499656003039200,"text":"Just arrived at Virtual G20. Was here yesterday also (early), but some of the Fake News Media failed to report it accurately - as usual. My speech is available (they said I didn’t make a speech).","rating":4},{"id":1346578706437963800,"text":"Washington is being inundated with people who don’t want to see an election victory stolen by emboldened Radical Left Democrats. Our Country has had enough, they won’t take it anymore! We hear you (and love you) from the Oval Office. MAKE AMERICA GREAT AGAIN!","rating":8},{"id":1341885394124607500,"text":"After seeing the massive Voter Fraud in the 2020 Presidential Election, I disagree with anyone that thinks a strong, fast, and fair Special Counsel is not needed, IMMEDIATELY. This was the most corrupt election in the history of our Country, and it must be closely examined!","rating":8},{"id":1292886763690745900,"text":"Play College Football!","rating":7},{"id":1322294301183783000,"text":"The Election should end on November 3rd., not weeks later!","rating":6},{"id":1338852676654821400,"text":"68% error rate in Michigan Voting Machines. Should be, by law, a tiny percentage of one percent. Did Michigan Secretary of State break the law? Stay tuned!","rating":9},{"id":1240622747732127700,"text":"We are going to WIN, sooner rather than later!","rating":5},{"id":1311117188615401500,"text":"Joe wants to shut down this Country. I want to keep it OPEN!","rating":6},{"id":1317891781648773000,"text":"Corrupt politician Joe Biden makes Crooked Hillary look like an amateur!","rating":8},{"id":1217909231946477600,"text":"I JUST GOT IMPEACHED FOR MAKING A PERFECT PHONE CALL!","rating":9},{"id":1258720717258006500,"text":"DRAIN THE SWAMP!","rating":7},{"id":1313074676168568800,"text":"SAVE OUR SECOND AMENDMENT. VOTE!","rating":5},{"id":1243407157321560000,"text":"Just finished a very good conversation with President Xi of China. Discussed in great detail the CoronaVirus that is ravaging large parts of our Planet. China has been through much &amp; has developed a strong understanding of the Virus. We are working closely together. Much respect!","rating":4},{"id":1293922936609546200,"text":"HUGE breakthrough today! Historic Peace Agreement between our two GREAT friends, Israel and the United Arab Emirates!","rating":5},{"id":1307693536322752500,"text":"SAVE YOUR SECOND AMENDMENT, VOTE TRUMP!","rating":5},{"id":1322397726705897500,"text":"MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1326190800070471700,"text":"Highly Respected Ken Starr: “Pennsylvania’s three-day extension of the mail-in ballot deadline is a Constitutional Travesty.” Legal scholars agree!","rating":3},{"id":1252547765332324400,"text":"It is amazing that I became President of the United States with such a totally corrupt and dishonest Lamestream Media going after me all day, and all night. Either I’m really good, far better than the Fake News wants to admit, or they don’t have nearly the power as once thought!","rating":7},{"id":1328341927641682000,"text":"Another Vaccine just announced. This time by Moderna, 95% effective. For those great “historians”, please remember that these great discoveries, which will end the China Plague, all took place on my watch!","rating":6},{"id":1313071950781182000,"text":"SPACE FORCE. VOTE!","rating":8},{"id":1320711322284281900,"text":"The Fake News Media is riding COVID, COVID, COVID, all the way to the Election. Losers!","rating":8},{"id":1280899723071815700,"text":"THE SILENT MAJORITY IS STRONGER THAN EVER, JUST WATCH!!!","rating":7},{"id":1216356280933273600,"text":"To the leaders of Iran - DO NOT KILL YOUR PROTESTERS. Thousands have already been killed or imprisoned by you, and the World is watching. More importantly, the USA is watching. Turn your internet back on and let reporters roam free! Stop the killing of your great Iranian people!","rating":5},{"id":1327350069947936800,"text":"Now it is learned that the horrendous Dominion Voting System was used in Arizona (and big in Nevada). No wonder the result was a very close loss!","rating":7},{"id":1335971721262796800,"text":"The Republican Governor of Georgia refuses to do signature verification, which would give us an easy win. What’s wrong with this guy? What is he hiding?","rating":6},{"id":1327633164823617500,"text":"Congress must now do a Covid Relief Bill. Needs Democrats support. Make it big and focused. Get it done!","rating":5},{"id":1313584866932527000,"text":"How does Biden lead in Pennsylvania Polls when he is against Fracking (JOBS!), 2nd Amendment and Religion? Fake Polls. I will win Pennsylvania!","rating":6},{"id":1318675787973841000,"text":"I am pleased to inform you that, for the sake of accuracy in reporting, I am considering posting my interview with Lesley Stahl of 60 Minutes, PRIOR TO AIRTIME! This will be done so that everybody can get a glimpse of what a FAKE and BIASED interview is all about...","rating":8},{"id":1331247567041081300,"text":"Remember, the GSA has been terrific, and Emily Murphy has done a great job, but the GSA does not determine who the next President of the United States will be.","rating":4},{"id":1329093126238204000,"text":"The Great State of Michigan, with votes being far greater than the number of people who voted, cannot certify the election. The Democrats cheated big time, and got caught. A Republican WIN!","rating":9},{"id":1311859538279239700,"text":"Hope Hicks, who has been working so hard without even taking a small break, has just tested positive for Covid 19. Terrible! The First Lady and I are waiting for our test results. In the meantime, we will begin our quarantine process!","rating":3},{"id":1346239227827265500,"text":"Heading to Georgia now. See you soon!","rating":2},{"id":1254172638307586000,"text":"Remember, the Cure can’t be worse than the problem itself. Be careful, be safe, use common sense!","rating":5},{"id":1213474475250987000,"text":"95% Approval Rating in the Republican Party. Thank you!","rating":3},{"id":1338149139205550000,"text":"THE BIGGEST WINNER OF OUR NEW DEFENSE BILL IS CHINA!. I WILL VETO!","rating":6},{"id":1273688806508675000,"text":"First thing the anarchists did upon taking over Seattle was “BUILD A WALL”. See, I was ahead of our times!","rating":7},{"id":1330319748660416500,"text":"Why is Joe Biden so quickly forming a Cabinet when my investigators have found hundreds of thousands of fraudulent votes, enough to “flip” at least four States, which in turn is more than enough to win the Election? Hopefully the Courts and/or Legislatures will have....","rating":8},{"id":1245396884040097800,"text":"Upon information and belief, Iran or its proxies are planning a sneak attack on U.S. troops and/or assets in Iraq. If this happens, Iran will pay a very heavy price, indeed!","rating":6},{"id":1266380510344949800,"text":"The National Guard has arrived on the scene. They are in Minneapolis and fully prepared. George Floyd will not have died in vain. Respect his memory!!!","rating":5},{"id":1282669015794618400,"text":"The Silent Majority will reign!","rating":7},{"id":1331013907859845000,"text":"I want to thank Emily Murphy at GSA for her steadfast dedication and loyalty to our Country. She has been harassed, threatened, and abused – and I do not want to see this happen to her, her family, or employees of GSA. Our case STRONGLY continues, we will keep up the good...","rating":4},{"id":1287880895051907000,"text":"So disgusting to watch Twitter’s so-called “Trending”, where sooo many trends are about me, and never a good one. They look for anything they can find, make it as bad as possible, and blow it up, trying to make it trend. Really ridiculous, illegal, and, of course, very unfair!","rating":8},{"id":1336695746029121500,"text":"#OVERTURN","rating":9},{"id":1328370030678044700,"text":"European Countries are sadly getting clobbered by the China Virus. The Fake News does not like reporting this!","rating":7},{"id":1304464923469193200,"text":"Another HISTORIC breakthrough today! Our two GREAT friends Israel and the Kingdom of Bahrain agree to a Peace Deal – the second Arab country to make peace with Israel in 30 days!","rating":3},{"id":1346685023861272600,"text":"Just happened to have found another 4000 ballots from Fulton County. Here we go!","rating":6},{"id":1268564689069527000,"text":"I am to happy announce that Navy Veteran, Michael White, who has been detained by Iran for 683 days, is on a Swiss plane that just left Iranian Airspace. We expect him to be home with his family in America very soon....","rating":4},{"id":1271252020473639000,"text":"The Radical Left Democrats: First they try to take away your guns. Then they try to take away your police!","rating":8},{"id":1109787694828322800,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1154502673514684400,"text":"Give A$AP Rocky his FREEDOM. We do so much for Sweden but it doesn’t seem to work the other way around. Sweden should focus on its real crime problem! #FreeRocky","rating":9},{"id":1239685852093169700,"text":"The United States will be powerfully supporting those industries, like Airlines and others, that are particularly affected by the Chinese Virus. We will be stronger than ever before!","rating":7},{"id":1265985660898459600,"text":"This will be a Big Day for Social Media and FAIRNESS!","rating":6},{"id":1316841775466651600,"text":"Pelosi is holding up STIMULUS, not the Republicans!","rating":5},{"id":1281616586273468400,"text":"Too many Universities and School Systems are about Radical Left Indoctrination, not Education. Therefore, I am telling the Treasury Department to re-examine their Tax-Exempt Status...","rating":8},{"id":1345160427337085000,"text":"Because of the Trump Administration, hospitals are now required, effective immediately, to publish their REAL PRICES, which will create competition and drive downs costs MASSIVELY. Won lawsuit last week. Bigger than healthcare, it’s called PRICE TRANSPARENCY....","rating":4},{"id":1225041277533728800,"text":"It was a great and triumphant evening for our Country. Thank you for all of the nice remarks and wonderful reviews of my State of the Union Speech. It was my great honor to have done it!","rating":3},{"id":1346822610957561900,"text":"The States want to redo their votes. They found out they voted on a FRAUD. Legislatures never approved. Let them do it. BE STRONG!","rating":7},{"id":1258053124893347800,"text":"The Fake News has reached an all time high!","rating":6},{"id":1269978005931282400,"text":"96% Approval Rating in the Republican Party. Thank you!","rating":4},{"id":1213078681750573000,"text":"Iran never won a war, but never lost a negotiation!","rating":7},{"id":1344272069727555600,"text":"$2000 ASAP!","rating":5},{"id":1021234525626609700,"text":"To Iranian President Rouhani: NEVER, EVER THREATEN THE UNITED STATES AGAIN OR YOU WILL SUFFER CONSEQUENCES THE LIKES OF WHICH FEW THROUGHOUT HISTORY HAVE EVER SUFFERED BEFORE. WE ARE NO LONGER A COUNTRY THAT WILL STAND FOR YOUR DEMENTED WORDS OF VIOLENCE &amp, DEATH. BE CAUTIOUS!","rating":9},{"id":1241935285916782600,"text":"WE CANNOT LET THE CURE BE WORSE THAN THE PROBLEM ITSELF. AT THE END OF THE 15 DAY PERIOD, WE WILL MAKE A DECISION AS TO WHICH WAY WE WANT TO GO!","rating":7},{"id":1327715767916392400,"text":"The hand recount taking place in Georgia is a waste of time. They are not showing the matching signatures. Call off the recount until they allow the MATCH. Don’t let the Radical Left Dems STEAL THE ELECTION!","rating":8},{"id":1264754622830444500,"text":"OBAMAGATE!","rating":10},{"id":1275379758021390300,"text":"I have authorized the Federal Government to arrest anyone who vandalizes or destroys any monument, statue or other such Federal property in the U.S. with up to 10 years in prison, per the Veteran’s Memorial Preservation Act, or such other laws that may be pertinent.....","rating":5},{"id":1343336121040777200,"text":"Good news on Covid Relief Bill. Information to follow!","rating":3},{"id":1151103647637487600,"text":"Our Country is Free, Beautiful and Very Successful. If you hate our Country, or if you are not happy here, you can leave!","rating":5},{"id":1342554825465196500,"text":"Made many calls and had meetings at Trump International in Palm Beach, Florida. Why would politicians not want to give people $2000, rather than only $600? It wasn’t their fault, it was China. Give our people the money!","rating":8},{"id":1342974370822692900,"text":"Time for Republican Senators to step up and fight for the Presidency, like the Democrats would do if they had actually won. The proof is irrefutable! Massive late night mail-in ballot drops in swing states, stuffing the ballot boxes (on video), double voters, dead voters,","rating":9},{"id":1319283015894220800,"text":"Judiciary Committee approves Judge Barrett. Moves to full Senate for final vote. Big day for America!","rating":4},{"id":1301249968091455500,"text":"The Dow Jones Industrial just closed above 29,000! You are so lucky to have me as your President😉With Joe Hiden’ it would crash😧","rating":7},{"id":1296645682875506700,"text":"In 47 years, Joe did none of the things of which he now speaks. He will never change, just words!","rating":5},{"id":1329405682706247700,"text":"Voter Fraud in Detroit is rampant, and has been for many years!","rating":6},{"id":815185071317676000,"text":"Happy New Year to all, including to my many enemies and those who have fought me and lost so badly they just don't know what to do. Love!","rating":6},{"id":1313183801732890600,"text":"It is reported that the Media is upset because I got into a secure vehicle to say thank you to the many fans and supporters who were standing outside of the hospital for many hours, and even days, to pay their respect to their President. If I didn’t do it, Media would say RUDE!!!","rating":7},{"id":1242929613262725000,"text":"I hear that Fake News CNN just reported that I am isolated in the White House, wondering out loud, “when will life return to normal?” Does anybody really believe that? There was no leak, they made it up – they are CORRUPT &amp; FAKE NEWS....","rating":8},{"id":1290623558461411300,"text":"People are not happy that players are not standing for our National Anthem!","rating":5},{"id":1219304652438675500,"text":"USA! USA! USA!","rating":4},{"id":1268497398239842300,"text":"LAW &amp; ORDER!","rating":6},{"id":1296092859226042400,"text":"Don’t buy GOODYEAR TIRES - They announced a BAN ON MAGA HATS. Get better tires for far less! (This is what the Radical Left Democrats do. Two can play the same game, and we have to start playing it now!).","rating":8},{"id":1266731291917062100,"text":"These are “Organized Groups” that have nothing to do with George Floyd. Sad!","rating":5},{"id":1270903949038694400,"text":"LAW &amp; ORDER!","rating":6},{"id":1144056731653169200,"text":"BORING!","rating":7},{"id":1341862955604975600,"text":"...Some friendly health advice to Iran: If one American is killed, I will hold Iran responsible. Think it over.","rating":8},{"id":1296274065762717700,"text":"HE SPIED ON MY CAMPAIGN, AND GOT CAUGHT!","rating":9},{"id":1270018789250400300,"text":"This year has seen the lowest crime numbers in our Country’s recorded history, and now the Radical Left Democrats want to Defund and Abandon our Police. Sorry, I want LAW &amp; ORDER!","rating":7},{"id":1251138462968922000,"text":"Why did the W.H.O. Ignore an email from Taiwanese health officials in late December alerting them to the possibility that CoronaVirus could be transmitted between humans? Why did the W.H.O. make several claims about the CoronaVirus that ere either inaccurate or misleading....","rating":6},{"id":1056885392522260500,"text":"Had a very good conversation with the newly elected President of Brazil, Jair Bolsonaro, who won his race by a substantial margin. We agreed that Brazil and the United States will work closely together on Trade, Military and everything else! Excellent call, wished him congrats!","rating":3},{"id":1259849944216846300,"text":"OBAMAGATE makes Watergate look small time!","rating":9},{"id":1224172413388128300,"text":"Congratulations to the Kansas City Chiefs on a great game and a fantastic comeback under immense pressure. We are proud of you and the Great State of Missouri. You are true Champions!","rating":4},{"id":1266231100172615700,"text":"I can’t stand back &amp; watch this happen to a great American City, Minneapolis. A total lack of leadership. Either the very weak Radical Left Mayor, Jacob Frey, get his act together and bring the City under control, or I will send in the National Guard &amp; get the job done right.....","rating":8},{"id":1278099002345619500,"text":"As I watch the Pandemic spread its ugly face all across the world, including the tremendous damage it has done to the USA, I become more and more angry at China. People can see it, and I can feel it!","rating":5},{"id":1326342742801326000,"text":"Andrew McCabe was exposed for who he is today in the U.S. Senate. He was totally destroyed - an ignorant fool. The great people of the FBI must make sure that he and his former boss, James Comey, pay the price for what they have done to the reputation of the FBI.","rating":7},{"id":1345095714687377400,"text":"The BIG Protest Rally in Washington, D.C., will take place at 11.00 A.M. on January 6th. Locational details to follow. StopTheSteal!","rating":8},{"id":1332778938121203700,"text":"Specific allegations were made, and we have massive proof, in the Pennsylvania case. Some people just don’t want to see it. They want nothing to do with saving our Country. Sad!!!","rating":7},{"id":1286807899314872300,"text":"So Obama and his team of lowlifes spied on my campaign, and got caught - Open and shut case! More papers released today which are devastating to them. Will they ever pay the price? The political Crime of the Century!","rating":8},{"id":1337067073051238400,"text":"Another HISTORIC breakthrough today! Our two GREAT friends Israel and the Kingdom of Morocco have agreed to full diplomatic relations – a massive breakthrough for peace in the Middle East!","rating":3},{"id":1323332899471413200,"text":"We have more Cases because we have more Testing!","rating":6},{"id":1298671449968959500,"text":"We will NOT stand for looting, arson, violence, and lawlessness on American streets. My team just got off the phone with Governor Evers who agreed to accept federal assistance (Portland should do the same!)...","rating":4},{"id":1264564734860427300,"text":"Cases, numbers and deaths are going down all over the Country!","rating":3},{"id":1266014911127306200,"text":"All over the World the CoronaVirus, a very bad “gift” from China, marches on. Not good!","rating":5},{"id":1342556287872233500,"text":"Going now to make a short speech to service members from all over the world. It is a celebration of Christmas. Video Conference - Fake News not invited!","rating":7},{"id":1240243188708839400,"text":"I always treated the Chinese Virus very seriously, and have done a very good job from the beginning, including my very early decision to close the “borders” from China - against the wishes of almost all. Many lives were saved. The Fake News new narrative is disgraceful &amp; false!","rating":5},{"id":1285520982648729600,"text":"Looking forward to live sports, but any time I witness a player kneeling during the National Anthem, a sign of great disrespect for our Country and our Flag, the game is over for me!","rating":6},{"id":1302970414394740700,"text":"10.6 Million Jobs Created In Just 4 Months, A Record!!!","rating":4},{"id":1284899438591451100,"text":"So we catch Obama &amp; Biden, not to even mention the rest of their crew, SPYING on my campaign, AND NOTHING HAPPENS? I hope not! If it were the other way around, 50 years for treason. NEVER FORGET!!!!","rating":8},{"id":1267959729361485800,"text":"Washington, D.C., was the safest place on earth last night!","rating":8},{"id":1333979211745341400,"text":"Pardon investigation is Fake News!","rating":7},{"id":1146741320066699300,"text":"HAPPY 4TH OF JULY!","rating":4},{"id":1277977452187275300,"text":"THE LONE WARRIOR!","rating":6},{"id":1316031426618327000,"text":"STIMULUS! Go big or go home!!!","rating":7},{"id":1283374013100720000,"text":"Great News on Vaccines!","rating":3},{"id":1314637928883159000,"text":"Breaking News: 50,000 OHIO VOTERS getting WRONG ABSENTEE BALLOTS. Out of control. A Rigged Election!!!","rating":9},{"id":1308401190439456800,"text":"I will be announcing my Supreme Court Nominee on Saturday, at the White House! Exact time TBA.","rating":5},{"id":1267132763116839000,"text":"The Lamestream Media is doing everything within their power to foment hatred and anarchy. As long as everybody understands what they are doing, that they are FAKE NEWS and truly bad people with a sick agenda, we can easily work through them to GREATNESS!","rating":8},{"id":1272534307303755800,"text":"LAW &amp; ORDER!","rating":5},{"id":1335344435048054800,"text":"Leaving for Georgia now.\n See you soon!","rating":2},{"id":1269970808329437200,"text":"LAW &amp; ORDER, NOT DEFUND AND ABOLISH THE POLICE. The Radical Left Democrats have gone Crazy!","rating":7},{"id":1299121427879276500,"text":"The Ten Most Dangerous Cities in the U.S. are ALL run by Democrats, and this has gone on for DECADES!","rating":6},{"id":1337039171228151800,"text":"WISDOM &amp; COURAGE!!!","rating":3},{"id":1318549645992300500,"text":"To the great people of New York, California, and Illinois, your states are way too highly taxed, big crime, people fleeing, and just about every other problem you can have. VOTE TRUMP, I will turn them around for you, FAST!","rating":5},{"id":1333857049294344200,"text":"Michigan voter fraud hearing going on now!","rating":4},{"id":1313996348694433800,"text":"Obama, Biden, Crooked Hillary and many others got caught in a Treasonous Act of Spying and Government Overthrow, a Criminal Act. How is Biden now allowed to run for President?","rating":8},{"id":1344367336715858000,"text":"The United States had more votes than it had people voting, by a lot. This travesty cannot be allowed to stand. It was a Rigged Election, one not even fit for third world countries!","rating":9},{"id":1216750167954804700,"text":"Wow! The wonderful Iranian protesters refused to step on, or in any way denigrate, our Great American Flag. It was put on the street in order for them to trample it, and they walked around it instead. Big progress!","rating":4},{"id":1237027356314869800,"text":"So last year 37,000 Americans died from the common Flu. It averages between 27,000 and 70,000 per year. Nothing is shut down, life &amp; the economy go on. At this moment there are 546 confirmed cases of CoronaVirus, with 22 deaths. Think about that!","rating":6},{"id":1045444544068812800,"text":"Judge Kavanaugh showed America exactly why I nominated him. His testimony was powerful, honest, and riveting. Democrats’ search and destroy strategy is disgraceful and this process has been a total sham and effort to delay, obstruct, and resist. The Senate must vote!","rating":3},{"id":1316596552757063700,"text":"People are fleeing California. Taxes too high, Crime too high, Brownouts too many, Lockdowns too severe. VOTE FOR TRUMP, WHAT THE HELL DO YOU HAVE TO LOSE!!!","rating":8},{"id":1327357477428600800,"text":"Will be having a press conference from the Rose Garden in 15 minutes.","rating":2},{"id":1317063921375842300,"text":"Polls numbers are looking very strong. Big crowds, great enthusiasm. Massive RED WAVE coming!!!","rating":6},{"id":1337494507756073000,"text":"If the Supreme Court shows great Wisdom and Courage, the American People will win perhaps the most important case in history, and our Electoral Process will be respected again!","rating":5},{"id":1313220863735533600,"text":"STOCK MARKET UP BIG, 466 Points!  28,149. Great News for America. Jobs, Jobs, Jobs!","rating":4},{"id":1315706457271267300,"text":"HAPPY COLUMBUS DAY TO ALL!","rating":1},{"id":1334858653455806500,"text":"GET TOUGH REPUBLICANS!","rating":4},{"id":1345803569438597000,"text":"Sorry, but the number of votes in the Swing States that we are talking about is VERY LARGE and totally OUTCOME DETERMINATIVE! Only the Democrats and some RINO’S would dare dispute this - even though they know it is true!","rating":7},{"id":1300428396493758500,"text":"LAW &amp; ORDER!","rating":3},{"id":1321057568295452700,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1282113922523435000,"text":"2016? HERE WE GO AGAIN!","rating":4},{"id":1334991357144944600,"text":"STOCK MARKET REACHES NEW ALL-TIME HIGH!","rating":3},{"id":1333207778643628000,"text":"We have some big things happening in our various litigations on the Election Hoax. Everybody knows it was Rigged. They know Biden didn’t get more votes from the Black community than Obama, &amp; certainly didn’t get 80,000,000 votes. Look what happened in Detroit, Philadelphia, plus!","rating":7},{"id":1332317394165969000,"text":"Wow! Twitter bans highly respected Pennsylvania State Senator Doug Mastriano after he did a great job of leading a hearing on the 2020 Election fraud. They and the Fake News, working together, want to SILENCE THE TRUTH. Can’t let that happen. This is what Communist countries do!","rating":8},{"id":1317825484495880200,"text":"Hunter Biden’s laptop is a disaster for the entire Biden family, but especially for his father, Joe. It is now a proven fact, and cannot be denied, that all of that info is the REAL DEAL. That makes it impossible for “50%, or 10%” Joe, to ever assume the office of the President!","rating":6},{"id":1277219673315119000,"text":"THE VAST SILENT MAJORITY IS ALIVE AND WELL!!! We will win this Election big. Nobody wants a Low IQ person in charge of our Country, and Sleepy Joe is definitely a Low IQ person!","rating":8},{"id":1332776310196883500,"text":"The Wisconsin recount is not about finding mistakes in the count, it is about finding people who have voted illegally, and that case will be brought after the recount is over, on Monday or Tuesday. We have found many illegal votes. Stay tuned!","rating":6},{"id":1342830505163706400,"text":"The U.S. Supreme Court has been totally incompetent and weak on the massive Election Fraud that took place in the 2020 Presidential Election. We have absolute PROOF, but they don’t want to see it - No “standing”, they say. If we have corrupt elections, we have no country!","rating":7},{"id":1266914470066036700,"text":"The National Guard has been released in Minneapolis to do the job that the Democrat Mayor couldn’t do. Should have been used 2 days ago &amp; there would not have been damage &amp; Police Headquarters would not have been taken over &amp; ruined. Great job by the National Guard. No games!","rating":5},{"id":1337790419875352600,"text":"The Supreme Court had ZERO interest in the merits of the greatest voter fraud ever perpetrated on the United States of America. All they were interested in is “standing”, which makes it very difficult for the President to present a case on the merits. 75,000,000 votes!","rating":8},{"id":1332169753004224500,"text":"I gave a long news conference today after wishing the military a Happy Thanksgiving, &amp; realized once again that the Fake News Media coordinates so that the real message of such a conference never gets out. Primary point made was that the 2020 Election was RIGGED, and that I WON!","rating":9},{"id":1336668083822473200,"text":"We will be INTERVENING in the Texas (plus many other states) case. This is the big one. Our Country needs a victory!","rating":7},{"id":1261126114799468500,"text":"Thank you to all of my great Keyboard Warriors. You are better, and far more brilliant, than anyone on Madison Avenue (Ad Agencies). There is nobody like you!","rating":6},{"id":1276633518433538000,"text":"I just had the privilege of signing a very strong Executive Order protecting American Monuments, Memorials, and Statues - and combatting recent Criminal Violence. Long prison terms for these lawless acts against our Great Country!","rating":5},{"id":1328367970352066600,"text":"STOCK MARKET GETTING VERY CLOSE TO 30,000 ON NEW VACCINE NEWS. 95% EFFECTIVE!","rating":4},{"id":1301587555301896200,"text":"Nancy Pelosi says she got “set up” by a Beauty Parlor owner. Maybe the Beauty Parlor owner should be running the House of Representatives instead of Crazy Nancy?","rating":9},{"id":1315633237667057700,"text":"New York has gone to hell. Vote Trump!","rating":6},{"id":914810093874671600,"text":"My warmest condolences and sympathies to the victims and families of the terrible Las Vegas shooting. God bless you!","rating":2},{"id":1213593965838164000,"text":"Iran is talking very boldly about targeting certain USA assets as revenge for our ridding the world of their terrorist leader who had just killed an American, &amp, badly wounded many others, not to mention all of the people he had killed over his lifetime, including recently....","rating":5},{"id":1231801865815220200,"text":"हम भारत आने के लिए तत्पर हैं । हम रास्ते में हैँ, कुछ ही घंटों में हम सबसे मिलेंगे!","rating":2},{"id":1329871775707107300,"text":"The Governor of Georgia, and Secretary of State, refuse to let us look at signatures which would expose hundreds of thousands of illegal ballots, and give the Republican Party and me, David Perdue, and perhaps Kelly Loeffler, a BIG VICTORY...","rating":7},{"id":1330555645213483000,"text":"Other than politics, how do you lose a case where large numbers of voters, far more than you need to flip Pennsylvania, are disenfranchised? Vote Observers thrown out of counting rooms. People going to vote finding out they have already voted through a fake ballot - go home!","rating":8},{"id":1150886874325631000,"text":"MAKE AMERICA GREAT AGAIN!","rating":6},{"id":1269396484048466000,"text":"Wow! 96% Approval Rating in the Republican Party (and I believe this was before the “GREAT” Jobs Numbers yesterday). Thank you!","rating":5},{"id":1340096386113687600,"text":"Congratulations, the Moderna vaccine is now available!","rating":3},{"id":1272000237809414100,"text":"The ramp that I descended after my West Point Commencement speech was very long &amp; steep, had no handrail and, most importantly, was very slippery. The last thing I was going to do is “fall” for the Fake News to have fun with. Final ten feet I ran down to level ground. Momentum!","rating":7},{"id":1254475682723307500,"text":"The people that know me and know the history of our Country say that I am  the hardest working President in history. I don’t know about that, but I am a hard worker and have probably gotten more done in the first 3 1/2 years than any President in history. The Fake News hates it!","rating":6},{"id":1313063990797504500,"text":"IF YOU WANT A MASSIVE TAX INCREASE, THE BIGGEST IN THE HISTORY OF OUR COUNTRY (AND ONE THAT WILL SHUT OUR ECONOMY AND JOBS DOWN), VOTE DEMOCRAT!!!","rating":8},{"id":1269617458354282500,"text":"Sleepy Joe Biden and the Radical Left Democrats want to “DEFUND THE POLICE”. I want great and well paid LAW ENFORCEMENT. I want LAW &amp; ORDER!","rating":7},{"id":1327958640309973000,"text":"All of the mechanical “glitches” that took place on Election Night were really THEM getting caught trying to steal votes. They succeeded plenty, however, without getting caught. Mail-in elections are a sick joke!","rating":9},{"id":1313489709847531500,"text":"I am looking forward to the debate on the evening of Thursday, October 15th in Miami. It will be great!","rating":2},{"id":1320689314506965000,"text":"Joe Biden called me George yesterday. Couldn’t remember my name. Got some help from the anchor to get him through the interview. The Fake News Cartel is working overtime to cover it up!","rating":7},{"id":1282892191082385400,"text":"LAW &amp; ORDER!","rating":3},{"id":1267187902192193500,"text":"Get tough Democrat Mayors and Governors. These people are ANARCHISTS. Call in our National Guard NOW. The World is watching and laughing at you and Sleepy Joe. Is this what America wants? NO!!!","rating":8},{"id":1247914464319504400,"text":"Bernie Sanders is OUT! Thank you to Elizabeth Warren. If not for her, Bernie would have won almost every state on Super Tuesday! This ended just like the Democrats &amp; the DNC wanted, same as the Crooked Hillary fiasco. The Bernie people should come to the Republican Party, TRADE!","rating":8},{"id":1267907954537312300,"text":"Sleepy Joe has been in politics for 40 years, and did nothing. Now he pretends to have the answers. He doesn’t even know the questions. Weakness will never beat anarchists, looters or thugs, and Joe has been politically weak all of his life. LAW &amp; ORDER!","rating":6},{"id":1268998142860628000,"text":"I am a big fan of Drew Brees. I think he’s truly one of the greatest quarterbacks, but he should not have taken back his original stance on honoring our magnificent American Flag. OLD GLORY is to be revered, cherished, and flown high...","rating":4},{"id":1269451304503574500,"text":"Much smaller crowd in D.C. than anticipated. National Guard, Secret Service, and D.C. Police have been doing a fantastic job. Thank you!","rating":3},{"id":1338851758819389400,"text":"Tremendous problems being found with voting machines. They are so far off it is ridiculous. Able to take a landslide victory and reduce it to a tight loss. This is not what the USA is all about. Law enforcement shielding machines. DO NOT TAMPER, a crime. Much more to come!","rating":9},{"id":1323344710023471000,"text":"Just signed an order to establish the 1776 Commission. We will stop the radical indoctrination of our students, and restore PATRIOTIC EDUCATION to our schools!","rating":2},{"id":1337385736530780200,"text":"Now that the Biden Administration will be a scandal plagued mess for years to come, it is much easier for the Supreme Court of the United States to follow the Constitution and do what everybody knows has to be done. They must show great Courage &amp; Wisdom. Save the USA!!!","rating":3},{"id":1250067500190089200,"text":"GET RID OF BALLOT HARVESTING, IT IS RAMPANT WITH FRAUD. THE USA MUST HAVE VOTER I.D., THE ONLY WAY TO GET AN HONEST COUNT!","rating":5},{"id":1324750555059728400,"text":"“This is what we know. We have to go back to the state level and how this morass came to be in the first instance. The Governor, Wolf, and the State Supreme Court, flagrantly violated the Constitution of the U.S. The power to set these rules and regulations is vested in the","rating":4},{"id":1311127502954197000,"text":"Joe Biden could not name a single Law Enforcement group that supports his candidacy!","rating":4},{"id":1279906540791779300,"text":"New China Virus Cases up (because of massive testing), deaths are down, “low and steady”. The Fake News Media should report this and also, that new job numbers are setting records!","rating":3},{"id":1272521253136498700,"text":"Almost One Million people request tickets for the Saturday Night Rally in Tulsa, Oklahoma!","rating":2},{"id":1265608389905784800,"text":"OBAMAGATE MAKES WATERGATE LOOK LIKE SMALL POTATOES!","rating":8},{"id":1264754762030989300,"text":"MAKE AMERICA GREAT AGAIN!","rating":1},{"id":1318898380421083100,"text":"Remember, BIDEN is going to raise your taxes at a level never seen before. This will not only be very costly for you, it will destroy our economy, which is coming back very rapidly.","rating":3},{"id":1276205906338824200,"text":"Black Lives Matter leader states, “If U.S. doesn’t give us what we want, then we will burn down this system and replace it”. This is Treason, Sedition, Insurrection!","rating":8},{"id":1319822456480100400,"text":"Joe Biden is a corrupt politician and he’s COMPROMISED. China is desperate for Biden to win because if Biden Wins, CHINA WINS – and China will OWN AMERICA. This corruption is EXACTLY why I decided to run for President in the first place...","rating":9},{"id":947802588174577700,"text":"The United States has foolishly given Pakistan more than 33 billion dollars in aid over the last 15 years, and they have given us nothing but lies &amp, deceit, thinking of our leaders as fools. They give safe haven to the terrorists we hunt in Afghanistan, with little help. No more!","rating":7},{"id":1330282078223687700,"text":"Fake News always “forgets” to mention that far fewer people are dying when they get Covid. This is do to both our advanced therapeutics, and the gained knowledge of our great doctors, nurses and front line workers!","rating":5},{"id":1190400372180807700,"text":"You can’t Impeach someone who hasn’t done anything wrong!","rating":6},{"id":1342832582606598100,"text":"A young military man working in Afghanistan told me that elections in Afghanistan are far more secure and much better run than the USA’s 2020 Election. Ours, with its millions and millions of corrupt Mail-In Ballots, was the election of a third world country. Fake President!","rating":9},{"id":1144419410729242600,"text":"All Democrats just raised their hands for giving millions of illegal aliens unlimited healthcare. How about taking care of American Citizens first!? That’s the end of that race!","rating":7},{"id":1337202242290671600,"text":"Tremendous support from all over the Country. All we ask is COURAGE &amp; WISDOM from those that will be making one of the most important decisions in our Country’s history. God bless you!","rating":4},{"id":1262102825607352300,"text":"The Obama Administration is turning out to be one of the most corrupt and incompetent in U.S. history. Remember, he and Sleepy Joe are the reasons I am in the White House!!!","rating":8},{"id":1096924708132581400,"text":"BUILDING THE WALL!","rating":5},{"id":1336733602902659000,"text":"At 10:00 P.M. on Election Evening, we were at 97% win with the so-called “bookies”.","rating":7},{"id":1327834542707794000,"text":"Radical Left ANTIFA SCUM was easily rebuffed today by the big D.C. MAGA Rally crowd, only to return at night, after 99% of the crowd had left, to assault elderly people and families. Police got there, but late. Mayor is not doing her job!","rating":8},{"id":1336730906107768800,"text":"If somebody cheated in the Election, which the Democrats did, why wouldn’t the Election be immediately overturned? How can a Country be run like this?","rating":9},{"id":1224108553977368600,"text":"ENJOY THE GAME USA, OUR COUNTRY IS DOING GREAT!","rating":5},{"id":1254174221481246700,"text":"I never said the pandemic was a Hoax! Who would say such a thing? I said that the Do Nothing Democrats, together with their Mainstream Media partners, are the Hoax. They have been called out &amp; embarrassed on this, even admitting they were wrong, but continue to spread the lie!","rating":6},{"id":1281447465774919700,"text":"President Trump Approval Rating in the Republican Party at 96%. Thank You!","rating":4},{"id":1337220913528533000,"text":"Why didn’t the Fake News Media, the FBI and the DOJ report the Biden matter BEFORE the Election. Oh well, it’s OK, we won the Election anyway - 75,000,000 VOTES!!!","rating":8},{"id":1277954189008744400,"text":"We are tracking down the two Anarchists who threw paint on the magnificent George Washington Statue in Manhattan. We have them on tape. They will be prosecuted and face 10 years in Prison based on the Monuments and Statues Act. Turn yourselves in now!","rating":6},{"id":1334282156349268000,"text":"In Arizona, it turns out that 3% of the votes cast in the 100 count vote sampling were tainted or worse. This would be, if carried forward, approximately 90,000 votes more than we would need to win the State. Now we were granted a much larger sample to work with. Wow!","rating":7},{"id":1331684437705302000,"text":"I will be speaking before a very important Pennsylvania State Senate hearing which is in process now. Talking about the massive voter fraud which took place in the 2020 Election!","rating":6},{"id":994586105822564400,"text":"Five Most Wanted leaders of ISIS just captured!","rating":6},{"id":1242455267603878000,"text":"Our people want to return to work. They will practice Social Distancing and all else, and Seniors will be watched over protectively &amp; lovingly. We can do two things together. THE CURE CANNOT BE WORSE (by far) THAN THE PROBLEM! Congress MUST ACT NOW. We will come back strong!","rating":5},{"id":1344359034716106800,"text":"Twitter is shadow banning like never before. A disgrace that our weak and ineffective political leadership refuses to do anything about Big Tech. They’re either afraid or stupid, nobody really knows!","rating":7},{"id":1265649545410744300,"text":"Twitter has now shown that everything we have been saying about them (and their other compatriots) is correct. Big action to follow!","rating":6},{"id":1332407714304110600,"text":"Biden did poorly in big cities (Politico), except those of Detroit (more votes than people!), Philadelphia, Atlanta and Milwaukee, which he had to win. Not surprisingly, they are all located in the most important swing states, and are long known for being politically corrupt!","rating":8},{"id":1322064357350609000,"text":"MAKE AMERICA GREAT AGAIN. VOTE!!!","rating":4},{"id":1342821189077622800,"text":"The “Justice” Department and the FBI have done nothing about the 2020 Presidential Election Voter Fraud, the biggest SCAM in our nation’s history, despite overwhelming evidence. They should be ashamed. History will remember. Never give up. See everyone in D.C. on January 6th.","rating":8},{"id":1330259856662655000,"text":"“President Trump has done many great things (biggest tax &amp; regulation cuts in history, Space Force, rebuilding our military, fixing the V.A., the Wall), but perhaps the most important of all will be what he is doing now, exposing the massive corruption in our Electoral Process.”","rating":5},{"id":1313068347085422600,"text":"STOCK MARKET HIGHS. VOTE!","rating":3},{"id":1240355985673392000,"text":"I want all Americans to understand: we are at war with an invisible enemy, but that enemy is no match for the spirit and resolve of the American people...","rating":4},{"id":1329463691205628000,"text":"THE COVID DRUGS NOW AVAILABLE TO MAKE PEOPLE BETTER ARE AMAZING, BUT SELDOM TALKED ABOUT BY THE MEDIA! Mortality rate is 85% down!","rating":7},{"id":1313075159721537500,"text":"PEACE THROUGH STRENGTH (BRING OUR SOLDIERS HOME). VOTE!","rating":5},{"id":1213585005986959400,"text":"As hard as I work, &amp, as successful as our Country has become with our Economy, our Military &amp, everything else, it is ashame that the Democrats make us spend so much time &amp, money on this ridiculous Impeachment Lite Hoax. I should be able to devote all of my time to the REAL USA!","rating":8},{"id":1275871808261107700,"text":"LAW &amp; ORDER!","rating":5},{"id":1318251010595303400,"text":"GREAT news! New government of Sudan, which is making great progress, agreed to pay $335 MILLION to U.S. terror victims and families. Once deposited, I will lift Sudan from the State Sponsors of Terrorism list. At long last, JUSTICE for the American people and BIG step for Sudan!","rating":4},{"id":1337755490563010600,"text":"IF Biden gets in, nothing will happen to Hunter or Joe. Barr will do nothing, and the new group of partisan killers coming in will quickly kill it all. Same thing with Durham. We caught them cold, spying, treason &amp; more (the hard part), but “Justice” took too long. Will be DOA!","rating":9},{"id":1271780302151696400,"text":"LAW &amp; ORDER!","rating":5},{"id":1265706645134274600,"text":"WARRANTLESS SURVEILLANCE OF AMERICANS IS WRONG!","rating":6},{"id":1296608655228502000,"text":"To get into the Democrat National Convention, you must have an ID card with a picture...Yet the Democrats refuse to do this when it come to your very important VOTE! Gee, I wonder WHY???","rating":7},{"id":1328338241284616200,"text":"The Fake recount going on in Georgia means nothing because they are not allowing signatures to be looked at and verified. Break the unconstitutional Consent Decree!","rating":8},{"id":1251186179548033000,"text":"China has just announced a doubling in the number of their deaths from the Invisible Enemy. It is far higher than that and far higher than the U.S., not even close!","rating":7},{"id":1272269338892959700,"text":"Interesting how ANTIFA and other Far Left militant groups can take over a city without barely a wimpier from soft Do Nothing Democrat leadership,  yet these same weak leaders become RADICAL when it comes to shutting down a state or city and its hard working, tax paying citizens!","rating":9},{"id":1314372012735959000,"text":"Biden is against Oil, Guns and Religion, a very bad combination to be fighting in the Great State of Texas. We are Winning Big, in the Real Polls, all over the Country!!! NOVEMBER 3rd. VOTE!!!","rating":8},{"id":1257304527843111000,"text":"Mexico is sadly experiencing very big CoronaVirus problems, and now California, get this, doesn’t want people coming over the Southern Border. A Classic! They are sooo lucky that I am their President. Border is very tight and the Wall is rapidly being built!","rating":8},{"id":1266326065833824300,"text":"Twitter is doing nothing about all of the lies &amp; propaganda being put out by China or the Radical Left Democrat Party. They have targeted Republicans, Conservatives &amp; the President of the United States. Section 230 should be revoked by Congress. Until then, it will be regulated!","rating":8},{"id":1313068701177000000,"text":"STRONGEST EVER MILITARY. VOTE!","rating":6},{"id":1337195257776238600,"text":"No Presidential candidate ever came even close to losing an Election who won Iowa, Florida and Ohio. I won all three, by a lot!","rating":7},{"id":1337772511870800000,"text":"Why didn’t Bill Barr reveal the truth to the public, before the Election, about Hunter Biden. Joe was lying on the debate stage that nothing was wrong, or going on - Press confirmed. Big disadvantage for Republicans at the polls!","rating":8},{"id":1264893060774793200,"text":"HAPPY MEMORIAL DAY!","rating":5},{"id":1243037202793316400,"text":"96-0 in the United States Senate. Congratulations AMERICA!","rating":4}]