[{"id":1313069363889569800,"text":"RELIGIOUS LIBERTY. VOTE!","rating":3},{"id":1288436818573168600,"text":"LAW &amp; ORDER!","rating":3},{"id":1150874781744607200,"text":"We will never be a Socialist or Communist Country. IF YOU ARE NOT HAPPY HERE, YOU CAN LEAVE! It is your choice, and your choice alone. This is about love for America. Certain people HATE our Country....","rating":7},{"id":1346808075626426400,"text":"States want to correct their votes, which they now know were based on irregularities and fraud, plus corrupt process never received legislative approval.  All Mike Pence has to do is send them back to the States, AND WE WIN. Do it Mike, this is a time for extreme courage!","rating":8},{"id":1310211120922230800,"text":"I will be strongly demanding a Drug Test of Sleepy Joe Biden prior to, or after, the Debate on Tuesday night. Naturally, I will agree to take one also. His Debate performances have been record setting UNEVEN, to put it mildly. Only drugs could have caused this discrepancy???","rating":9},{"id":1310432401454235600,"text":"FAKE NEWS!","rating":5},{"id":1252928613743235000,"text":"States are safely coming back. Our Country is starting to OPEN FOR BUSINESS again. Special care is, and always will be, given to our beloved seniors (except me!). Their lives will be better than ever...WE LOVE YOU ALL!","rating":4},{"id":1329069814195871700,"text":"The Georgia recount is a joke and is being done UNDER PROTEST. Even though thousands of fraudulent votes have been found, the real number is in matching signatures. Governor must open up the unconstitutional Consent Decree and call in the Legislature!","rating":6},{"id":1213593975732527000,"text":"....targeted 52 Iranian sites (representing the 52 American hostages taken by Iran many years ago), some at a very high level &amp, important to Iran &amp,  the Iranian culture, and those targets, and Iran itself, WILL BE HIT VERY FAST AND VERY HARD. The USA wants no more threats!","rating":9},{"id":1338145479725633500,"text":"How do states and politicians confirm an election where corruption and irregularities are documented throughout? A Swing State hustle!","rating":5},{"id":1340527057151930400,"text":"Why isn’t Congress giving our people a Stimulus Bill? It wasn’t their fault, it was the fault of China. GET IT DONE, and give them more money in direct payments.","rating":5},{"id":1263085979491016700,"text":"Some wacko in China just released a statement blaming everybody other than China for the Virus which has now killed hundreds of thousands of people. Please explain to this dope that it was the “incompetence of China”, and nothing else, that did this mass Worldwide killing!","rating":7},{"id":1313073591974592500,"text":"PROTECT PREEXISTING CONDITIONS. VOTE!","rating":3},{"id":1313984510749544400,"text":"We should have the small remaining number of our BRAVE Men and Women serving in Afghanistan home by Christmas!","rating":6},{"id":1338139379777286100,"text":"The drug companies are going crazy putting up nasty ads against me asking to “withdraw my Favored Nation’s Executive Order”. They don’t want the U.S. to have the lowest drug prices in the world, but we now will. Big reductions coming. No other politician would do this!!!","rating":6},{"id":1317852810302558200,"text":"Joe Biden is a corrupt politician, and everybody knows it. Now you have the proof, perhaps like never was had before on a major politician. Laptop plus. This is the second biggest political scandal in our history!","rating":8},{"id":1334949289160740900,"text":"The only thing more RIGGED than the 2020 Presidential Election is the FAKE NEWS SUPPRESSED MEDIA. No matter how big or important the story, if it is even slightly positive for “us”, or negative for “them”, it will not be reported!","rating":7},{"id":1331653804912242700,"text":"The “losers &amp; suckers” statement on dead military heroes has been proven to be a total fabrication and lie. IT WAS NEVER MADE! The “anonymous” fabricator, who is a major sleaze, went forward with the lie despite 25 strong witnesses to the contrary. Welcome to the roaring 20’s!","rating":6},{"id":1345333742987055000,"text":"For historical purposes remember, I was able to get rid of the INDIVIDUAL MANDATE, the most unpopular and expensive part of ObamaCare. You are no longer forced to pay a fortune for the “privilege” of NOT getting bad healthcare. This ended ObamaCare as we knew it. Thank you!","rating":4},{"id":1321491143457042400,"text":"Media and Big Tech are not covering Biden Corruption!","rating":5},{"id":1293513735533924400,"text":"96% Approval Rating in the Republican Party. Thank you! Also, leading in most swing states!","rating":2},{"id":1315451046609727500,"text":"See you in FLORIDA tomorrow night. Big Rally!!!","rating":3},{"id":1272361820058202000,"text":"Many Democrats want to Defund and Abolish Police Departments. HOW CRAZY!","rating":8},{"id":1281260329247400000,"text":"POLITICAL WITCH HUNT!","rating":7},{"id":1146514575048790000,"text":"If Illegal Immigrants are unhappy with the conditions in the quickly built or refitted detentions centers, just tell them not to come. All problems solved!","rating":9},{"id":1296285289497997300,"text":"BUT DIDN’T SHE CALL HIM A RACIST??? DIDN’T SHE SAY HE WAS INCOMPETENT???","rating":6},{"id":1339277405458997200,"text":"Former United States Solicitor General Ken Starr: Pennsylvania “Flagrantly Violated” Laws Ahead of Election.","rating":4},{"id":1333965375193624600,"text":"Section 230, which is a liability shielding gift from the U.S. to “Big Tech” (the only companies in America that have it - corporate welfare!), is a serious threat to our National Security &amp; Election Integrity. Our Country can never be safe &amp; secure if we allow it to stand.....","rating":6},{"id":1255352014042738700,"text":"The only reason the U.S. has reported one million cases of CoronaVirus is that our Testing is sooo much better than any other country in the World. Other countries are way behind us in Testing, and therefore show far fewer cases!","rating":5},{"id":1080107759755034600,"text":"Happy New Year!","rating":1},{"id":1321596126001197000,"text":"Why isn’t Biden corruption trending number one on Twitter? Biggest world story, and nowhere to be found. There is no”trend”, only negative stories that Twitter wants to put up. Disgraceful! Section 230","rating":8},{"id":1268358305170296800,"text":"I feel more and more confident that our economy is in the early stages of coming back very strong. Not everyone agrees with me, but I have little doubt. Watch for September, October, November. Next year will be one of the best ever, and look at the Stock Market NOW!","rating":4},{"id":1216130169477439500,"text":"دولت ایران باید به گروه‌های حقوق بشر اجازه بدهد حقیقت کنونی اعتراضات در جریان مردم ایران را نظارت کرده و گزارش بدهند. نباید شاهد کشتار دوباره ی معترضان مسالمت آمیز و یا قطع اینترنت باشیم. جهان نظاره گر این اتفاقات است.","rating":3},{"id":1311731462589292500,"text":"Why would I allow the Debate Commission to change the rules for the second and third Debates when I easily won last time?","rating":5},{"id":1338254785666044000,"text":"Swing States that have found massive VOTER FRAUD, which is all of them, CANNOT LEGALLY CERTIFY these votes as complete &amp; correct without committing a severely punishable crime. Everybody knows that dead people, below age people, illegal immigrants, fake signatures, prisoners,....","rating":9},{"id":1314591877765660700,"text":"Crazy Nancy Pelosi is looking at the 25th Amendment in order to replace Joe Biden with Kamala Harris. The Dems want that to happen fast because Sleepy Joe is out of it!!!","rating":7},{"id":1226324080170848300,"text":"Thank you to everyone for all of the great reviews I have gotten on my State of the Union Speech. It was an immense honor for me to have presented it to you and the citizens of our very strong and wonderful Country!","rating":2},{"id":1336439050488647700,"text":"NASDAQ and S&amp;P close at all-time highs. Congratulations!","rating":3},{"id":1311310383781679000,"text":"Biden REFUSED to use the term, LAW &amp; ORDER! There go the Suburbs.","rating":6},{"id":1266796670609588200,"text":"Crossing State lines to incite violence is a FEDERAL CRIME! Liberal Governors and Mayors must get MUCH tougher or the Federal Government will step in and do what has to be done, and that includes using the unlimited power of our Military and many arrests. Thank you!","rating":7},{"id":1342817496924086300,"text":"If a Democrat Presidential Candidate had an Election Rigged &amp; Stolen, with proof of such acts at a level never seen before, the Democrat Senators would consider it an act of war, and fight to the death. Mitch &amp; the Republicans do NOTHING, just want to let it pass. NO FIGHT!","rating":8},{"id":1308983521827000300,"text":"LAW &amp; ORDER!","rating":5},{"id":1263644460203806700,"text":"96% Approval Rating in the Republican Party. Thank you!","rating":4},{"id":1267835873405665300,"text":"NYC, CALL UP THE NATIONAL GUARD. The lowlifes and losers are ripping you apart. Act fast! Don’t make the same horrible and deadly mistake you made with the Nursing Homes!!!","rating":9},{"id":1272510078348857300,"text":"I’ve done more in less than 4 years than Biden’s done in more than 40 years, including for Black America. Biden has been a part of every failed decision for decades. Bad Trade Deals, Endless Wars, you name it, he has shown a complete lack of leadership. He’s weak &amp; shot!!!","rating":6},{"id":1277212069868318700,"text":"Since imposing a very powerful 10 year prison sentence on those that Vandalize Monuments, Statues etc., with many people being arrested all over our Country, the Vandalism has completely stopped. Thank you!","rating":6},{"id":1221582230990073900,"text":".....Melania and I send our warmest condolences to Vanessa and the wonderful Bryant family. May God be with you all!","rating":2},{"id":1340523944680583200,"text":"Martial law = Fake News. Just more knowingly bad reporting!","rating":5},{"id":1342974377218994200,"text":"....But when it is all over, and this period of time becomes just another ugly chapter in our Country’s history, WE WILL WIN!!!","rating":5},{"id":1270350376844361700,"text":"THE REAWAKENING OF AMERICA!","rating":4},{"id":1334846272164032500,"text":"Big Rally Saturday Night in Georgia!!!","rating":5},{"id":1330273053104885800,"text":"Joe Biden was a total disaster in handling the H1N1 Swine Flu, would never have produced a Vaccine in record time (years ahead of schedule), and would do a terrible job of Vaccine delivery - But doesn’t everybody already know that!","rating":8},{"id":1275637061823815700,"text":"It is ashame that Congress doesn’t do something about the lowlifes that burn the American Flag. It should be stopped, and now!","rating":7},{"id":1288564391735066600,"text":"Great to be in Texas!","rating":4},{"id":1263282623939477500,"text":"China is on a massive disinformation campaign because they are desperate to have Sleepy Joe Biden win the presidential race so they can continue to rip-off the United States, as they have done for decades, until I came along!","rating":8},{"id":1147946170293071900,"text":"Congratulations to the U.S. Women’s Soccer Team on winning the World Cup! Great and exciting play. America is proud of you all!","rating":3},{"id":1260170754496311300,"text":"The American People are WARRIORS!","rating":5},{"id":1331013908971262000,"text":"...fight, and I believe we will prevail! Nevertheless, in the best interest of our Country, I am recommending that Emily and her team do what needs to be done with regard to initial protocols, and have told my team to do the same.","rating":4},{"id":1300171130326716400,"text":"The only way you will stop the violence in the high crime Democrat run cities is through strength!","rating":6},{"id":1120093671356022800,"text":"How do you impeach a Republican President for a crime that was committed by the Democrats? MAKE AMERICA GREAT AGAIN!","rating":9},{"id":1275024974579982300,"text":"RIGGED 2020 ELECTION: MILLIONS OF MAIL-IN BALLOTS WILL BE PRINTED BY FOREIGN COUNTRIES, AND OTHERS. IT WILL BE THE SCANDAL OF OUR TIMES!","rating":9},{"id":1313069086931378200,"text":"LAW &amp; ORDER. VOTE!","rating":5},{"id":1237861968721010700,"text":"The Media should view this as a time of unity and strength. We have a common enemy, actually, an enemy of the World, the CoronaVirus. We must beat it as quickly and safely as possible. There is nothing more important to me than the life &amp; safety of the United States!","rating":4},{"id":1325859407620690000,"text":"...Chris will do a GREAT job! Mark Esper has been terminated. I would like to thank him for his service.","rating":6},{"id":1266434153932894200,"text":"Looting leads to shooting, and that’s why a man was shot and killed in Minneapolis on Wednesday night - or look at what just happened in Louisville with 7 people shot. I don’t want this to happen, and that’s what the expression put out last night means....","rating":8},{"id":1295454897689604000,"text":"SAVE THE POST OFFICE!","rating":6},{"id":1325432472985809000,"text":"....how these ballots were authenticated, because if there’s a problem in the system about authentication, that would seriously affect the ENTIRE ELECTION - And what concerns me is that we had over a hundred million mail-in ballot in cites like Philladelphia...","rating":7},{"id":1323481349030879200,"text":"Our prayers are with the people of Vienna after yet another vile act of terrorism in Europe. These evil attacks against innocent people must stop. The U.S. stands with Austria, France, and all of Europe in the fight against terrorists, including radical Islamic terrorists.","rating":3},{"id":1345336370085171200,"text":"TRANSPARENCY in medical pricing will be one of the biggest and most important things done for the American citizen. It was just put into service, January 1, against long odds and bitter opposition. Final lawsuits won last week. Enjoy all the extra money you will have!","rating":5},{"id":1298029780437270500,"text":"Joe Biden has said he would lock down the Country again. That’s crazy! We’re having record job growth and a booming stock market, but Joe would end it all and close it all down. Ridiculous!","rating":7},{"id":1288818160389558300,"text":"With Universal Mail-In Voting (not Absentee Voting, which is good), 2020 will be the most INACCURATE &amp; FRAUDULENT Election in history. It will be a great embarrassment to the USA. Delay the Election until people can properly, securely and safely vote???","rating":8},{"id":1219351907627667500,"text":"I will NEVER allow our great Second Amendment to go unprotected, not even a little bit!","rating":5},{"id":1276207454888448000,"text":"LAW &amp; ORDER!","rating":6},{"id":1273975267753590800,"text":"“THE SILENT MAJORITY IS STRONGER THAN EVER BEFORE.”","rating":5},{"id":1256957565562486800,"text":"....And then came a Plague, a great and powerful Plague, and the World was never to be the same again! But America rose from this death and destruction, always remembering its many lost souls, and the lost souls all over the World, and became greater than ever before!","rating":6},{"id":1321057409348063200,"text":"7 DAYS!!!","rating":4},{"id":1346120645613150200,"text":"The “Surrender Caucus” within the Republican Party will go down in infamy as weak and ineffective “guardians” of our Nation, who were willing to accept the certification of fraudulent presidential numbers!","rating":9},{"id":1301145978096025600,"text":"Crazy Nancy Pelosi is being decimated for having a beauty parlor opened, when all others are closed, and for not wearing a Mask - despite constantly lecturing everyone else. We will almost certainly take back the House, and send Nancy packing!","rating":8},{"id":1337067127455539200,"text":"Morocco recognized the United States in 1777.  It is thus fitting we recognize their sovereignty over the Western Sahara.","rating":3},{"id":1329852177637134300,"text":"News Conference on Reduced Drug Prices at 2:30 P.M.","rating":2},{"id":1265774767493148700,"text":"At my request, the FBI and the Department of Justice are already well into an investigation as to the very sad and tragic death in Minnesota of George Floyd....","rating":3},{"id":1275128932510113800,"text":"If people can go out and protest, riot, break into stores, and create all sorts of havoc, they can also go out and VOTE — and keep our Election Honest. With millions of mail-in ballots being sent out, who knows where they are going, and to whom?","rating":8},{"id":1315769883318124500,"text":"The World Health Organization just admitted that I was right. Lockdowns are killing countries all over the world. The cure cannot be worse than the problem itself. Open up your states, Democrat governors. Open up New York. A long battle, but they finally did the right thing!","rating":7},{"id":932303108146892800,"text":"Now that the three basketball players are out of China and saved from years in jail, LaVar Ball, the father of LiAngelo, is unaccepting of what I did for his son and that shoplifting is no big deal. I should have left them in jail!","rating":9},{"id":1221535503868223500,"text":"Reports are that basketball great Kobe Bryant and three others have been killed in a helicopter crash in California. That is terrible news!","rating":4},{"id":822421390125043700,"text":"It all begins today! I will see you at 11:00 A.M. for the swearing-in. THE MOVEMENT CONTINUES - THE WORK BEGINS!","rating":5},{"id":1322568272483475500,"text":"Last night, our Country’s brave warriors rescued an American hostage in Nigeria. Our Nation salutes the courageous soldiers behind the daring nighttime rescue operation and celebrates the safe return of yet another American citizen!","rating":4},{"id":1239650086491230200,"text":"I ask all Americans to band together and support your neighbors by not hoarding unnecessary amounts of food and essentials. TOGETHER we will stay STRONG and overcome this challenge!","rating":2},{"id":1289997897723863000,"text":"Great to have NASA Astronauts return to Earth after very successful two month mission. Thank you to all!","rating":2},{"id":1266172570983940000,"text":"MAIL-IN VOTING WILL LEAD TO MASSIVE FRAUD AND ABUSE. IT WILL ALSO LEAD TO THE END OF OUR GREAT REPUBLICAN PARTY. WE CAN NEVER LET THIS TRAGEDY BEFALL OUR NATION. BIG MAIL-IN VICTORY IN TEXAS COURT TODAY. CONGRATS!!!","rating":8},{"id":1313069956167340000,"text":"BIGGEST TAX CUT EVER, AND ANOTHER ONE COMING. VOTE!","rating":4},{"id":474134260149157900,"text":"Are you allowed to impeach a president for gross incompetence?","rating":7},{"id":1270923257844301800,"text":"Domestic Terrorists have taken over Seattle, run by Radical Left Democrats, of course. LAW &amp; ORDER!","rating":6},{"id":1275951862269829000,"text":"Pres. Obama destroyed the lobster and fishing industry in Maine. Now it’s back, bigger and better than anyone ever thought possible. Enjoy your “lobstering” and fishing! Make lots of money!","rating":5},{"id":1163066735588720600,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1338614499981602800,"text":"Just had a very nice meeting with Attorney General Bill Barr at the White House. Our relationship has been a very good one, he has done an outstanding job! As per letter, Bill will be leaving just before Christmas to spend the holidays with his family...","rating":4},{"id":1267808120136511500,"text":"D.C. had no problems last night. Many arrests. Great job done by all. Overwhelming force. Domination. Likewise, Minneapolis was great (thank you President Trump!).","rating":5},{"id":1313073215279779800,"text":"BETTER &amp; CHEAPER HEALTHCARE. VOTE!","rating":3},{"id":1334155285909409800,"text":"Big voter fraud hearings today in the Great State of Michigan. This election is a far bigger scandal (FRAUD!) than anyone would have thought - not even close. Watch today!","rating":6},{"id":1280853299600789500,"text":"In Germany, Denmark, Norway,  Sweden and many other countries, SCHOOLS ARE OPEN WITH NO PROBLEMS. The Dems think it would be bad for them politically if U.S. schools open before the November Election, but is important for the children &amp; families. May cut off funding if not open!","rating":6},{"id":1339585047481917400,"text":"I have NOTHING to do with the potential prosecution of Hunter Biden, or the Biden family. It is just more Fake News. Actually, I find it very sad to watch!","rating":4},{"id":1328856932011167700,"text":"The only thing secure about our 2020 Election was that it was virtually impenetrable by foreign powers. On that, the Trump Administration takes great credit. Unfortunately, the Radical Left Democrats, Dominion, and others, were perhaps more successful!","rating":6},{"id":1328852352787484700,"text":"The recent statement by Chris Krebs on the security of the 2020 Election was highly inaccurate, in that there were massive improprieties and fraud - including dead people voting, Poll Watchers not allowed into polling locations, “glitches” in the voting machines which changed...","rating":8},{"id":1189172468159864800,"text":"Just confirmed that Abu Bakr al-Baghdadi’s number one replacement has been terminated by American troops. Most likely would have taken the top spot - Now he is also Dead!","rating":5},{"id":828447350200926200,"text":"What an amazing comeback and win by the Patriots. Tom Brady, Bob Kraft and Coach B are total winners. Wow!","rating":3},{"id":1218962544372670500,"text":"I have never seen the Republican Party as Strong and as Unified as it is right now. Thank you!","rating":4},{"id":1289999271664787500,"text":"Astronauts complete first splashdown in 45 years. Very exciting!","rating":3},{"id":1089876055224184800,"text":"Numerous states introducing Bible Literacy classes, giving students the option of studying the Bible. Starting to make a turn back? Great!","rating":4},{"id":1313070848027357200,"text":"401(K). VOTE!","rating":6},{"id":1337040883988959200,"text":"How can you give an election to someone who lost the election by hundreds of thousands of legal votes in each of the swing states. How can a country be run by an illegitimate president?","rating":7},{"id":1297132096448864300,"text":"The Democrats took the word GOD out of the Pledge of Allegiance at the Democrat National Convention. At first I thought they made a mistake, but it wasn’t. It was done on purpose. Remember Evangelical Christians, and ALL, this is where they are coming from-it’s done. Vote Nov 3!","rating":7},{"id":1334573529107460000,"text":"Wow! Blockbuster testimony taking place right now in Georgia. Ballot stuffing by Dems when Republicans were forced to leave the large counting room. Plenty more coming, but this alone leads to an easy win of the State!","rating":8},{"id":1322864490929627100,"text":"Our numbers are looking VERY good all over. Sleepy Joe is already beginning to pull out of certain states. The Radical Left is going down!","rating":7},{"id":1295744066466934800,"text":"People forget how divided our Country was under ObamaBiden. The anger and hatred were unbelievable. They shouldn’t be lecturing to us. I’m here, as your President, because of them!","rating":6},{"id":1249418405951799300,"text":"For the first time in history there is a fully signed Presidential Disaster Declaration for all 50 States. We are winning, and will win, the war on the Invisible Enemy!","rating":5},{"id":1048668088059584500,"text":"I applaud and congratulate the U.S. Senate for confirming our GREAT NOMINEE, Judge Brett Kavanaugh, to the United States Supreme Court. Later today, I will sign his Commission of Appointment, and he will be officially sworn in. Very exciting!","rating":4},{"id":1255832117583495200,"text":"DIRTY COP JAMES COMEY GOT CAUGHT!","rating":9},{"id":1254168730898174000,"text":"What is the purpose of having White House News Conferences when the Lamestream Media asks nothing but hostile questions, &amp; then refuses to report the truth or facts accurately. They get record ratings, &amp; the American people get nothing but Fake News. Not worth the time &amp; effort!","rating":8},{"id":1299345147294109700,"text":"Great Ratings &amp; Reviews Last Night. Thank you!","rating":4},{"id":1275599861619077000,"text":"BIG VICTORY for patients – Federal court UPHOLDS hospital price transparency. Patients deserve to know the price of care BEFORE they enter the hospital. Because of my action, they will. This may very well be bigger than healthcare itself. Congratulations America!","rating":5},{"id":1080088373451206700,"text":"HAPPY NEW YEAR TO EVERYONE, INCLUDING THE HATERS AND THE FAKE NEWS MEDIA! 2019 WILL BE A FANTASTIC YEAR FOR THOSE NOT SUFFERING FROM TRUMP DERANGEMENT SYNDROME. JUST CALM DOWN AND ENJOY THE RIDE, GREAT THINGS ARE HAPPENING FOR OUR COUNTRY!","rating":8},{"id":1276184906159272000,"text":"The number of ChinaVirus cases goes up, because of GREAT TESTING, while the number of deaths (mortality rate), goes way down. The Fake News doesn’t like telling you that!","rating":9},{"id":871145660036378600,"text":"Whatever the United States can do to help out in London and the U. K., we will be there - WE ARE WITH YOU. GOD BLESS!","rating":5},{"id":1303305303249870800,"text":"New York City must stop the Shutdown now. The Governor &amp; Mayor are destroying the place!","rating":7},{"id":1213096351296299000,"text":"General Qassem Soleimani has killed or badly wounded thousands of Americans over an extended period of time, and was plotting to kill many more...but got caught! He was directly and indirectly responsible for the death of millions of people, including the recent large number....","rating":6},{"id":1345404682655707100,"text":"Why haven’t they done signature verification in Fulton County, Georgia. Why haven’t they deducted all of the dead people who “voted”, illegals who voted, non Georgia residents who voted, and tens of thousands of others who voted illegally, from the final vote tally?","rating":8},{"id":1227958133550649300,"text":"DRAIN THE SWAMP! We want bad people out of our government!","rating":7},{"id":1292810574603202600,"text":"So now Schumer and Pelosi want to meet to make a deal. Amazing how it all works, isn’t it. Where have they been for the last 4 weeks when they were “hardliners”, and only wanted BAILOUT MONEY for Democrat run states and cities that are failing badly? They know my phone number!","rating":8},{"id":1341547750710800400,"text":"Republicans in the Senate so quickly forget. Right now they would be down 8 seats without my backing them in the last Election. RINO John Thune, “Mitch’s boy”, should just let it play out. South Dakota doesn’t like weakness. He will be primaried in 2022, political career over!!!","rating":8},{"id":1345160429165817900,"text":"....Please remember who got it done!!!","rating":4},{"id":1302447673606275000,"text":"Congratulations to the U.S. Marshals on a job well done in Portland. LAW &amp; ORDER!","rating":3},{"id":1081177511592108000,"text":"How do you impeach a president who has won perhaps the greatest election of all time, done nothing wrong (no Collusion with Russia, it was the Dems that Colluded), had the most successful first two years of any president, and is the most popular Republican in party history 93%?","rating":8},{"id":1274006223013249000,"text":"Tony Fauci has nothing to do with NFL Football. They are planning a very safe and controlled opening. However, if they don’t stand for our National Anthem and our Great American Flag, I won’t be watching!!!","rating":6},{"id":1247908643527409700,"text":"FLATTENING OF THE CURVE!","rating":1},{"id":1190261874371244000,"text":"ISIS has a new leader. We know exactly who he is!","rating":4},{"id":1207277859519238100,"text":"Can you believe that I will be impeached today by the Radical Left, Do Nothing Democrats, AND I DID NOTHING WRONG! A terrible Thing. Read the Transcripts. This should never happen to another President again. Say a PRAYER!","rating":9},{"id":1280691101029056500,"text":"Death Rate from Coronavirus is down tenfold!","rating":2},{"id":1339281950490697700,"text":"Chris Krebs was totally excoriated and proven wrong at the Senate Hearing on the Fraudulent 2020 Election. Massive FRAUD took place with machines, people voting from out of state, illegals, dead people, no signatures—and so much more!","rating":7},{"id":1268167411230007300,"text":"In 3 1/2 years, I’ve done much more for our Black population than Joe Biden has done in 43 years. Actually, he set them back big time with his Crime Bill, which he doesn’t even remember. I’ve done more for Black Americans, in fact, than any President in U.S. history, with...","rating":5},{"id":1334174044984402000,"text":"Will be going to Georgia for a big Trump Rally in support of our two great Republican Senators, David and Kelly. They are fantastic people who love their Country and love their State. We must work hard and be sure they win. #USA","rating":3},{"id":1216114135529902000,"text":"To the brave, long-suffering people of Iran: I've stood with you since the beginning of my Presidency, and my Administration will continue to stand with you. We are following your protests closely, and are inspired by your courage.","rating":3},{"id":1083099784012091400,"text":"Just left a meeting with Chuck and Nancy, a total waste of time. I asked what is going to happen in 30 days if I quickly open things up, are you going to approve Border Security which includes a Wall or Steel Barrier? Nancy said, NO. I said bye-bye, nothing else works!","rating":8},{"id":1314998881126625300,"text":"Joe Biden is a PUPPET of CASTRO-CHAVISTAS like Crazy Bernie, AOC and Castro-lover Karen Bass. Biden is supported by socialist Gustavo Petro, a major LOSER and former M-19 guerrilla leader. Biden is weak on socialism and will betray Colombia. I stand with you!","rating":9},{"id":1323394390446977000,"text":"Just landed in Traverse City, Michigan. Big crowd!","rating":4},{"id":1268037166946553900,"text":"So pathetic to watch the Fake News Lamestream Media playing down the gravity and depravity of the Radical Left, looters and thugs, ripping up our Liberal Democrat run (only) cities. It is almost like they are all working together?","rating":7},{"id":1330319750094860300,"text":"....the COURAGE to do what has to be done to maintain the integrity of our Elections,  and the United States of America itself. THE WORLD IS WATCHING!!!","rating":5},{"id":1060022696703070200,"text":"Tremendous success tonight. Thank you to all!","rating":4},{"id":1322892481751646200,"text":"Biden wants to LOCKDOWN our Country, maybe for years. Crazy! There will be NO LOCKDOWNS. The great American Comeback is underway!!!","rating":8},{"id":976765417908777000,"text":"Crazy Joe Biden is trying to act like a tough guy. Actually, he is weak, both mentally and physically, and yet he threatens me, for the second time, with physical assault. He doesn’t know me, but he would go down fast and hard, crying all the way. Don’t threaten people Joe!","rating":10},{"id":1283192212986232800,"text":"Joe Biden claims to be prioritizing ‘safety of kids’ by keeping schools closed this Fall. Yet he remains silent about children being slaughtered by violence on the streets of Democrat run cities. You &amp; your children won’t be SAFE in Biden’s America, and neither will anyone else!","rating":7},{"id":1345111621430091800,"text":"Our Republican Senate just missed the opportunity to get rid of Section 230, which gives unlimited power to Big Tech companies. Pathetic!!! Now they want to give people ravaged by the China Virus $600, rather than the $2000 which they so desperately need. Not fair, or smart!","rating":9},{"id":1328349382023000000,"text":"Who will be running for Governor of the Great State of Ohio? Will be hotly contested!","rating":4},{"id":1269761532033937400,"text":"If I wasn’t constantly harassed for three years by fake and illegal investigations, Russia, Russia, Russia, and the Impeachment Hoax, I’d be up by 25 points on Sleepy Joe and the Do Nothing Democrats. Very unfair, but it is what it is!!!","rating":8},{"id":1077705232665272300,"text":"I hope everyone, even the Fake News Media, is having a great Christmas! Our Country is doing very well. We are securing our Borders, making great new Trade Deals, and bringing our Troops Back Home. We are finally putting America First. MERRY CHRISTMAS!  #MAGA","rating":5},{"id":1322534172339150800,"text":"Big win for our very elite U.S. Special Forces today. Details to follow!","rating":3},{"id":1239242219019735000,"text":"So now it is reported that, after destroying his life &amp; the life of his wonderful family (and many others also), the FBI, working in conjunction with the Justice Department, has “lost” the records of General Michael Flynn. How convenient. I am strongly considering a Full Pardon!","rating":7},{"id":1273405198698975200,"text":"Joe Biden was a TOTAL FAILURE in Government. He “bungled” everything that he touched!","rating":6},{"id":1267124501361369000,"text":"Congratulations to our National Guard for the great job they did immediately upon arriving in Minneapolis, Minnesota, last night. The ANTIFA led anarchists, among others, were shut down quickly. Should have been done by Mayor on first night and there would have been no trouble!","rating":5},{"id":827885966509604900,"text":"MAKE AMERICA GREAT AGAIN!","rating":2},{"id":1311123786163339300,"text":"The American people want LAW &amp; ORDER — Joe Biden won’t even say those words!","rating":6},{"id":1141711064305983500,"text":"Iran made a very big mistake!","rating":6},{"id":1341389598296060000,"text":"Distribution of both vaccines is going very smoothly. Amazing how many people are being vaccinated, record numbers. Our Country, and indeed the World, will soon see the great miracle of what the Trump Administration has accomplished. They said it couldn’t be done!!!","rating":3},{"id":1238824050924884000,"text":"SOCIAL DISTANCING!","rating":7},{"id":826637556787839000,"text":"Hope you like my nomination of Judge Neil Gorsuch for the United States Supreme Court. He is a good and brilliant man, respected by all.","rating":2},{"id":1176606660279898000,"text":"PRESIDENTIAL HARASSMENT!","rating":8},{"id":1315667018696274000,"text":"Remember, I wouldn’t be President now had Obama and Biden properly done their job. The fact is, they were TERRIBLE!!!","rating":7},{"id":1305693861067407400,"text":"Did you see where Joe Biden — as Weak, Tired, and Sleepy as he is, went to a Polling Place today in Delaware (of course!) to VOTE!? If Biden can do it, any American can do it!","rating":6},{"id":826774668245946400,"text":"Everybody is arguing whether or not it is a BAN. Call it what you want, it is about keeping bad people (with bad intentions) out of country!","rating":5},{"id":1289397528639791000,"text":"We have more Cases because we do more Testing. It’s Lamestream Media Gold!","rating":6},{"id":1272871304572678100,"text":"Wow! May retail sales show biggest one-month increase of ALL TIME, up 17.7%. Far bigger than projected. Looks like a BIG DAY FOR THE STOCK MARKET, AND JOBS!","rating":4},{"id":1321856046974050300,"text":"Our hearts are with the people of France. America stands with our oldest Ally in this fight. These Radical Islamic terrorist attacks must stop immediately. No country, France or otherwise can long put up with it!","rating":4},{"id":1321966078638100500,"text":"The Fake News refuses to cover the fact that GDP went up 33.1% for the 3rd Quarter, the best number by far in our Country’s history!","rating":5},{"id":1274845117631926300,"text":"The Democrat House wants to pass a Bill this week that will destroy our police. Republican Congressmen &amp; Congresswomen will hopefully fight hard to defeat it. We must protect and cherish our police, they keep us safe!","rating":6},{"id":1303677963200798700,"text":"We will be substantially LOWERING Medicare Premiums and Prescription Drug Prices, bringing them down to levels that were not thought possible!","rating":5},{"id":1310219962024439800,"text":"Obamacare will be replaced with a MUCH better, and FAR cheaper, alternative if it is terminated in the Supreme Court. Would be a big WIN for the USA!","rating":5},{"id":1336691515398250500,"text":"We will soon be learning about the word “courage”, and saving our Country. I received hundreds of thousands of legal votes more, in all of the Swing States, than did my opponent.   ALL Data taken after the vote says that it was impossible for me to lose, unless FIXED!","rating":8},{"id":1137155056044826600,"text":"I am pleased to inform you that The United States of America has reached a signed agreement with Mexico. The Tariffs scheduled to be implemented by the U.S. on Monday, against Mexico, are hereby indefinitely suspended. Mexico, in turn, has agreed to take strong measures to....","rating":4},{"id":1240764105155391500,"text":"THANK YOU to our Police Officers, Fire Fighters, and EMS who help us defeat the Virus every day. Our proud nation is grateful for the unwavering dedication and sacrifice of our First Responders and their families. TOGETHER we will beat this!","rating":3},{"id":1269634983687315500,"text":"Colin Powell, a real stiff who was very responsible for getting us into the disastrous Middle East Wars, just announced he will be voting for another stiff, Sleepy Joe Biden. Didn’t Powell say that Iraq had “weapons of mass destruction?” They didn’t, but off we went to WAR!","rating":9},{"id":1172859963963822000,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1207355923573989400,"text":"SUCH ATROCIOUS LIES BY THE RADICAL LEFT, DO NOTHING DEMOCRATS. THIS IS AN ASSAULT ON AMERICA, AND AN ASSAULT ON THE REPUBLICAN PARTY!!!!","rating":8},{"id":1342209260026024000,"text":"At a meeting in Florida today, everyone was asking why aren’t the Republicans up in arms &amp; fighting over the fact that the Democrats stole the rigged presidential election? Especially in the Senate, they said, where you helped 8 Senators win their races. How quickly they forget!","rating":9},{"id":1345798202650460200,"text":"The Swing States did not even come close to following the dictates of their State Legislatures. These States  “election laws” were made up by local judges &amp; politicians, not by their Legislatures, &amp; are therefore, before even getting to irregularities &amp; fraud, UNCONSTITUTIONAL!","rating":7},{"id":1152911185441906700,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1079497288605683700,"text":"President and Mrs. Obama built/has a ten foot Wall around their D.C. mansion/compound. I agree, totally necessary for their safety and security. The U.S. needs the same thing, slightly larger version!","rating":6},{"id":1314402920474042400,"text":"The Gallup Poll has just come out with the incredible finding that 56% of you say that you are better off today, during a pandemic, than you were four years ago (OBiden). Highest number on record! Pretty amazing!","rating":4},{"id":1177924812125036500,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1268678440225583000,"text":"The problem is not the very talented, low-flying helicopter pilots wanting to save our city, the problem is the arsonists, looters, criminals, and anarchists, wanting to destroy it (and our Country)!","rating":6},{"id":1242905328209080300,"text":"The LameStream Media is the dominant force in trying to get me to keep our Country closed as long as possible in the hope that it will be detrimental to my election success. The real people want to get back to work ASAP.  We will be stronger than ever before!","rating":7},{"id":1321042229838909400,"text":"Strongly Trending (Google) since immediately after the second debate is CAN I CHANGE MY VOTE? This refers changing it to me. The answer in most states is YES. Go do it. Most important Election of your life!","rating":8},{"id":1322661450540814300,"text":"Just signed an order to protect fracking and the oil and gas industry. This means JOBS, low energy bills, and continued AMERICAN ENERGY INDEPENDENCE! Sleepy Joe would BAN fracking and destroy American energy jobs! He has NO clue!!","rating":6},{"id":1307675185932382200,"text":"LAW &amp; ORDER!","rating":5},{"id":1154501344323080200,"text":"Very disappointed in Prime Minister Stefan Löfven for being unable to act. Sweden has let our African American Community down in the United States. I watched the tapes of A$AP Rocky, and he was being followed and harassed by troublemakers. Treat Americans fairly! #FreeRocky","rating":8},{"id":1320045327102152700,"text":"Debate Poll Average: 89% Trump. 11% Sleepy Joe Biden!","rating":7},{"id":1278845376901132300,"text":"LAW &amp; ORDER!","rating":5},{"id":1338246403164954600,"text":"The fact that the Supreme Court wouldn’t find standing in an original jurisdiction matter between multiple states, and including the President of the States, is absurd. It is enumerated in the Constitution...","rating":6},{"id":1275381670561095700,"text":"Cases are going up in the U.S. because we are testing far more than any other country, and ever expanding. With smaller testing we would show fewer cases!","rating":7},{"id":1267580557141184500,"text":"I will be delivering brief remarks from the Rose Garden at 6:30 P.M. Eastern to update on the Federal Response.","rating":4},{"id":1130207891049332700,"text":"If Iran wants to fight, that will be the official end of Iran. Never threaten the United States again!","rating":9},{"id":1337040387349893000,"text":"The Supreme Court has a chance to save our Country from the greatest Election abuse in the history of the United States. 78% of the people feel (know!) the Election was RIGGED.","rating":8},{"id":1226595698793230300,"text":"MAKE AMERICA GREAT AGAIN and then, KEEP AMERICA GREAT!","rating":4},{"id":1117910111236681700,"text":"God bless the people of France!","rating":2},{"id":755788382618390500,"text":"The media is spending more time doing a forensic analysis of Melania's speech than the FBI spent on Hillary's emails.","rating":8},{"id":1337632918869569500,"text":"FDA APPROVES PFIZER VACCINE FOR EMERGENCY USE!!!","rating":3},{"id":833686030679208000,"text":"HAPPY PRESIDENTS DAY - MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1322166136843194400,"text":"SECOND AMENDMENT!","rating":5},{"id":1240226752447873000,"text":"For the people that are now out of work because of the important and necessary containment policies, for instance the shutting down of hotels, bars and restaurants, money will soon be coming to you. The onslaught of the Chinese Virus is not your fault! Will be stronger than ever!","rating":6},{"id":1313445293912920000,"text":"Biden and Democrats just clarified the fact that they are fully in favor of (very) LATE TERM ABORTION, right up until the time of birth, and beyond - which would be execution. Biden even endorsed the Governor of Virginia, who stated this clearly for all to hear. GET OUT &amp; VOTE!!!","rating":9},{"id":1089691985164800000,"text":"After all that I have done for the Military, our great Veterans, Judges (99), Justices (2), Tax &amp, Regulation Cuts, the Economy, Energy, Trade &amp, MUCH MORE, does anybody really think I won’t build the WALL? Done more in first two years than any President! MAKE AMERICA GREAT AGAIN!","rating":7},{"id":1295065684788088800,"text":"“If carefully done, according to the guidelines, there is no reason why you shouldn’t be able to do that (vote at polling place).” Doctor Anthony Fauci","rating":4},{"id":1336682635725320200,"text":"STOCK MARKETS AT NEW ALL TIME HIGHS!!!","rating":3},{"id":1255105998471250000,"text":"We are doing far more, and better, Testing than any other country in the world, and yet the media does nothing but complain. No matter how good a job is done, the same as with the Ventilators, they will never say we are doing a great job, they will only viciously gripe!","rating":6},{"id":1293163818282094600,"text":"Big Stock Market Numbers!","rating":2},{"id":1298637609871212500,"text":"Just In: Chinese State Media and Leaders of CHINA want Biden to win “the U.S. Election”.  If this happened (which it won’t), China would own our Country, and our Record Setting Stock Markets would literally CRASH!","rating":8},{"id":1321233661765693400,"text":"Joe Biden is a corrupt politician. He wants to send YOUR jobs to China, while his family rakes in millions from the Chinese Communist Party. If Biden wins, China will OWN the USA. When we win, YOU win, Wisconsin wins, and AMERICA wins! #VOTE","rating":7},{"id":1286982002604998700,"text":"Yesterday I signed four measures that will massively reduce the prices of prescription drugs, in many cases by more than 50%. Nothing like this has ever been done before because Big Pharma, with its vast power, would not let it happen. Expensive Insulin went from big dollars.....","rating":4},{"id":871325606901895200,"text":"We must stop being politically correct and get down to the business of security for our people. If we don't get smart it will only get worse","rating":5},{"id":1317500453102493700,"text":"SLEEPY JOE BIDEN IS PROPOSING THE BIGGEST TAX HIKE IN OUR COUNTRY’S HISTORY! CAN ANYBODY REALLY VOTE FOR THIS?","rating":7},{"id":1319299079264940000,"text":"Obama is campaigning for us. Every time he speaks, people come over to our side. He didn’t even want to endorse Sleepy Joe. Did so long after primaries were over!","rating":6},{"id":1306224783705735200,"text":"Great News: BIG TEN FOOTBALL IS BACK. All teams to participate. Thank you to the players, coaches, parents, and all school representatives. Have a FANTASTIC SEASON! It is my great honor to have helped!!!","rating":3},{"id":1304038348772855800,"text":"Kim Jong Un is in good health. Never underestimate him!","rating":7},{"id":1286797798847860700,"text":"96% Approval Rating in the Republican Party. Thank you!","rating":4},{"id":1224375060250747000,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1320076630065373200,"text":"AMERICA FIRST!","rating":3},{"id":1342206148649300000,"text":"More than one million Americans have already received the China Virus Vaccine, a record pace!","rating":6},{"id":1119919713600114700,"text":"Happy Easter! I have never been happier or more content because your Country is doing so well, with an Economy that is the talk of the World and may be stronger than it has ever been before. Have a great day!","rating":5},{"id":1226251504086065200,"text":"Pete Rose played Major League Baseball for 24 seasons, from 1963-1986, and had more hits, 4,256, than any other player (by a wide margin). He gambled, but only on his own team winning, and paid a decades long price. GET PETE ROSE INTO THE BASEBALL HALL OF FAME. It’s Time!","rating":5},{"id":1288109090061705200,"text":"Big Pharma is taking television ads trying to make the case that I am raising prescription drug prices on seniors. The ad is a lie! What I have done will lead to a 50% REDUCTION in prices, at least, &amp; Big Pharma is not happy about it. No other President would....","rating":6},{"id":1215405367229739000,"text":"95% Approval Rating in the Republican Party. Thank you!","rating":4},{"id":1215268595707543600,"text":"Breaking News: The Fifth Circuit Court of Appeals just reversed a lower court decision &amp, gave us the go ahead to build one of the largest sections of the desperately needed Southern Border Wall, Four Billion Dollars. Entire Wall is under construction or getting ready to start!","rating":5},{"id":994587349718847500,"text":"The highly anticipated meeting between Kim Jong Un and myself will take place in Singapore on June 12th. We will both try to make it a very special moment for World Peace!","rating":3},{"id":1322978858610565000,"text":"Biden is a proven Castro puppet! Vote TRUMP","rating":7},{"id":1315091217533882400,"text":"As the 1st President to formally recognize the issue of Missing &amp; Murdered Native Americans, today, I was proud to sign Savanna’s Act &amp; the Not Invisible Act. We have also provided $295 Million to support public safety &amp; crime victims. Forgotten NO MORE! #OperationLadyJustice","rating":2},{"id":1291732831102804000,"text":"Great Jobs Numbers!","rating":1},{"id":1248574029289619500,"text":"This week, in only 4 days, we had the biggest Stock Market increase since 1974. We have a great chance for the really big bounce when the Invisible Enemy is gone!","rating":4},{"id":1291339436727382000,"text":"How can voters be sending in Ballots starting, in some cases, one month before the First Presidential Debate. Move the First Debate up. A debate, to me, is a Public Service. Joe Biden and I owe it to the American People!","rating":5},{"id":1248615335139262500,"text":"Wow, Approval Rating in the Republican Party - 96%. Thank you!","rating":2},{"id":1254782650679615500,"text":"Why should the people and taxpayers of America be bailing out poorly run states (like Illinois, as example) and cities, in all cases Democrat run and managed, when most of the other states are not looking for bailout help? I am open to discussing anything, but just asking?","rating":4},{"id":1272529858501976000,"text":"The Far Left Fake News Media, which had no Covid problem with the Rioters &amp; Looters destroying Democrat run cities, is trying to Covid Shame us on our big Rallies. Won’t work!","rating":6},{"id":1315761931303624700,"text":"What’s going on, almost nobody is showing up for Sleepy Joe rallies!","rating":5},{"id":957603800579297300,"text":"Somebody please inform Jay-Z that because of my policies, Black Unemployment has just been reported to be at the LOWEST RATE EVER RECORDED!","rating":6},{"id":1284549896389955600,"text":"Saddened to hear the news of civil rights hero John Lewis passing. Melania and I send our prayers to he and his family.","rating":2},{"id":1299391572384059400,"text":"Success: Since the National Guard moved into Kenosha, Wisconsin, two days ago, there has been NO FURTHER VIOLENCE, not even a small problem. When legally asked to help by local authorities, the Federal Government will act and quickly succeed. Are you listening Portland?","rating":5},{"id":1284282946850087000,"text":"Corrupt Joe Biden wants to defund our police. He may use different words, but when you look at his pact with Crazy Bernie, and other things, that’s what he wants to do. It would destroy America!","rating":7},{"id":1082857997032919000,"text":"Thank you for soooo many nice comments regarding my Oval Office speech. A very interesting experience!","rating":4},{"id":1320336553609232400,"text":"So important to VOTE for Republicans in the House. Break away from Pelosi and her high Taxing new Radical Left friends. Protect your 2nd Amendment, Military, Vets, and sooo much more!","rating":5},{"id":1268998143733051400,"text":"...We should be standing up straight and tall, ideally with a salute, or a hand on heart. There are other things you can protest, but not our Great American Flag - NO KNEELING!","rating":6},{"id":1247900240155295700,"text":"Once we OPEN UP OUR GREAT COUNTRY, and it will be sooner rather than later, the horror of the Invisible Enemy, except for those that sadly lost a family member or friend, must be quickly forgotten. Our Economy will BOOM, perhaps like never before!!!","rating":7},{"id":1252556676818968600,"text":"96% Approval Rating in the Republican Party. Thank you! This must also mean that, most importantly, we are doing a good (great) job in the handling of the Pandemic.","rating":5},{"id":1313072443905454000,"text":"MASSIVE REGULATION CUTS. VOTE!","rating":3},{"id":829836231802515500,"text":"SEE YOU IN COURT, THE SECURITY OF OUR NATION IS AT STAKE!","rating":8},{"id":1254767509460234200,"text":"There has never been, in the history of our Country, a more vicious or hostile Lamestream Media than there is right now, even in the midst of a National Emergency, the Invisible Enemy!","rating":7},{"id":1311371720436199400,"text":"Radical Left Democrats are going CRAZY!","rating":9},{"id":1291722355471941600,"text":"After yesterday’s statement, Sleepy Joe Biden is no longer worthy of the Black Vote!","rating":8},{"id":1222184371932799000,"text":"Are you better off now than you were three years ago? Almost everyone say YES!","rating":6},{"id":1262397998094594000,"text":"OIL (ENERGY) IS BACK!!!!","rating":5},{"id":1255129366234890200,"text":"Many States moving to SAFELY &amp; QUICKLY reopen!","rating":4},{"id":1327619654592893000,"text":"....What are they trying to hide. They know, and so does everyone else. EXPOSE THE CRIME!","rating":7},{"id":1314234952612024300,"text":"If a Republican LIED like Biden and Harris do, constantly, the Lamestream Media would be calling them out at a level never recorded before. For one year they called for No Fracking and big Tax Increases. Now they each say opposite. Fake News is working overtime!","rating":6},{"id":1276967409925193700,"text":"Corrupt Joe Biden said yesterday that we have over “120 million” people dead of Coronavirus!","rating":7},{"id":1286337596206055400,"text":"Obama, who wouldn’t even endorse Biden until everyone else was out of the primaries (and even then waited a long time!), is now making a commercial of support. Remember, I wouldn’t even be here if it weren’t for them. I wouldn’t be President. They did a terrible job!","rating":6},{"id":1337629305405321200,"text":"So, you’re the President of the United States, and you just went through an election where you got more votes than any sitting President in history, by far - and purportedly lost. You can’t get “standing” before the Supreme Court, so you “intervene” with wonderful states.....","rating":8},{"id":1337379719872974800,"text":"Now it turns out that my phone call to the President of Ukraine, which many, including me, have called “perfect”, was even better than that. I predicted Biden corruption, said to call the A.G., who perhaps knew of the corruption during the impeachment hoax?","rating":7},{"id":1265427539008381000,"text":"....Twitter is completely stifling FREE SPEECH, and I, as President, will not allow it to happen!","rating":8},{"id":1323030938952061000,"text":"Joe Biden is the candidate of rioters, looters, arsonists, gun-grabbers, flag-burners, Marxists, lobbyists, and special interests. I am the candidate of farmers, factory workers, police officers, and hard-working, law-abiding patriots of every race, religion and creed! #MAGA","rating":7},{"id":1313551794623127600,"text":"Nancy Pelosi is asking for $2.4 Trillion Dollars to bailout poorly run, high crime, Democrat States, money that is in no way related to COVID-19. We made a very generous offer of $1.6 Trillion Dollars and, as usual, she is not negotiating in good faith. I am rejecting their...","rating":6},{"id":1258717838849847300,"text":"Yesterday was a BIG day for Justice in the USA. Congratulations to General Flynn, and many others. I do believe there is MUCH more to come! Dirty Cops and Crooked Politicians do not go well together!","rating":7},{"id":1315983317620215800,"text":"Republicans will be providing far better Healthcare than the Democrats, at a far lower cost...And will always protect people with Pre-existing conditions!!!!","rating":5},{"id":1345731043861659600,"text":"I spoke to Secretary of State Brad Raffensperger yesterday about Fulton County and voter fraud in Georgia. He was unwilling, or unable, to answer questions such as the “ballots under table” scam, ballot destruction, out of state “voters”, dead voters, and more. He has no clue!","rating":8},{"id":1345749709592342500,"text":"Something how Dr. Fauci is revered by the LameStream Media as such a great professional, having done, they say, such an incredible job, yet he works for me and the Trump Administration, and I am in no way given any credit for my work. Gee, could this just be more Fake News?","rating":7},{"id":1276363261957603300,"text":"Coronavirus deaths are way down. Mortality rate is one of the lowest in the World. Our Economy is roaring back and will NOT be shut down. “Embers” or flare ups will be put out, as necessary!","rating":6},{"id":1275801076177023000,"text":"Great!  Appeals Court Upholds Justice Departments Request To Drop Criminal Case Against General Michael Flynn!","rating":4},{"id":1322162832687988700,"text":"33.1% GDP - BEST IN USA HISTORY. IF I AM ELECTED, NEXT YEAR WILL BE OUR BEST EVER!","rating":5},{"id":1271446019281215500,"text":"Seattle Mayor says, about the anarchists takeover of her city, “it is a Summer of Love”. These Liberal Dems don’t have a clue. The terrorists burn and pillage our cities, and they think it is just wonderful, even the death. Must end this Seattle takeover now!","rating":8},{"id":1313071677534765000,"text":"BEST V.A. EVER. 91% APPROVAL RATING. VOTE!","rating":3},{"id":1334517145288528000,"text":"Looks like certain Republican Senators are getting cold feet with respect to the termination of Big Tech’s Section 230, a National Security and Election Integrity MUST. For years, all talk, no action. Termination must be put in Defense Bill!!!","rating":5},{"id":1154112475002036200,"text":"TRUTH IS A FORCE OF NATURE!","rating":6},{"id":1048745061888880600,"text":"You don’t hand matches to an arsonist, and you don’t give power to an angry left-wing mob. Democrats have become too EXTREME and TOO DANGEROUS to govern. Republicans believe in the rule of law - not the rule of the mob. VOTE REPUBLICAN!","rating":7},{"id":1267445910826627000,"text":"Sleepy Joe Biden’s people are so Radical Left that they are working to get the Anarchists out of jail, and probably more. Joe doesn’t know anything about it, he is clueless, but they will be the real power, not Joe. They will be calling the shots! Big tax increases for all, Plus!","rating":7},{"id":945126026824298500,"text":"People are proud to be saying Merry Christmas again. I am proud to have led the charge against the assault of our cherished and beautiful phrase. MERRY CHRISTMAS!!!!!","rating":6},{"id":822502270503972900,"text":"January 20th 2017, will be remembered as the day the people became the rulers of this nation again.","rating":3},{"id":1319710299419623400,"text":"Joe Biden was very disrespectful to President Obama at last night’s debate when he said that he, Joe, “was Vice President, not President,” when trying to make excuses for their failed immigration policies. I wonder what “O” was thinking when he heard that one?","rating":5},{"id":1242422012682920000,"text":"This is not about the ridiculous Green New Deal. It is about putting our great workers and companies BACK TO WORK!","rating":4},{"id":1340333618691002400,"text":"The Cyber Hack is far greater in the Fake News Media than in actuality. I have been fully briefed and everything is well under control. Russia, Russia, Russia is the priority chant when anything happens because Lamestream is, for mostly financial reasons, petrified of....","rating":6},{"id":1284831061181173800,"text":"We are trying to help Portland, not hurt it. Their leadership has, for months, lost control of the anarchists and agitators. They are missing in action. We must protect Federal property, AND OUR PEOPLE. These were not merely protesters, these are the real deal!","rating":5},{"id":1216001273725685800,"text":"Nancy Pelosi will go down as the absolute worst Speaker of the House in U.S. history!","rating":8},{"id":1342974375008600000,"text":"....Courts are bad, the FBI and “Justice” didn’t do their job, and the United States Election System looks like that of a third world country. Freedom of the press has been gone for a long time, it is Fake News, and now we have Big Tech (with Section 230) to deal with....","rating":7},{"id":1269630609883910100,"text":"Not only will Sleepy Joe Biden DEFUND THE POLICE, but he will DEFUND OUR MILITARY! He has no choice, the Dems are controlled by the Radical Left.","rating":7},{"id":1256202305680158700,"text":"The Governor of Michigan should give a little, and put out the fire. These are very good people, but they are angry. They want their lives back again, safely! See them, talk to them, make a deal.","rating":6},{"id":1267185107980497000,"text":"Law &amp; Order in Philadelphia, NOW! They are looting stores. Call in our great National Guard like they FINALLY did (thank you President Trump) last night in Minneapolis. Is this what voters want with Sleepy Joe? All Dems!","rating":6},{"id":1251169217531056000,"text":"LIBERATE MICHIGAN!","rating":8},{"id":1014519862482407400,"text":"Happy Fourth of July....Our Country is doing GREAT!","rating":4},{"id":1329086548093014000,"text":"“The numbers have not improved, it is still 71% out of balance”, stated Wayne County, Michigan,  Canvassers. “There is widespread irregularities in poll numbers.” There are “more votes than people”. The two harassed patriot Canvassers refuse to sign the papers!","rating":5},{"id":1306233683402162200,"text":"Vaccines are moving along fast and safely!","rating":3},{"id":1281206685395292200,"text":"PRESIDENTIAL HARASSMENT!","rating":6},{"id":1320095628546900000,"text":"Nobody is showing up for Obama’s hate laced speeches. 47 people! No energy, but still better than Joe!","rating":7},{"id":1224550106462138400,"text":"Big WIN for us in Iowa tonight. Thank you!","rating":2},{"id":1289284178127646700,"text":"The Democrats are holding back the $1,200 to $3,400 (family of four) checks that were ready to be sent out!","rating":5},{"id":1256573581657604000,"text":"96% Approval Rating in the Republican Party. Thank you! Also, just out, highest ever Approval Rating overall in the new Gallup Poll, and shows “Trump beating Sleepy Joe Biden.”","rating":4},{"id":1216872069591289900,"text":"I stand stronger than anyone in protecting your Healthcare with Pre-Existing Conditions. I am honored to have terminated the very unfair, costly and unpopular individual mandate for you!","rating":3},{"id":1259153410756153300,"text":"TRANSITION TO GREATNESS!","rating":4},{"id":1333965375839621000,"text":".....Therefore, if the very dangerous &amp; unfair Section 230 is not completely terminated as part of the National Defense Authorization Act (NDAA), I will be forced to unequivocally VETO the Bill when sent to the very beautiful Resolute desk. Take back America NOW. Thank you!","rating":7},{"id":1088058726794387500,"text":"BUILD A WALL &amp, CRIME WILL FALL!","rating":6},{"id":1259844948960120800,"text":"Coronavirus numbers are looking MUCH better, going down almost everywhere. Big progress being made!","rating":3},{"id":1317237360094965800,"text":"Getting ready to land in Macon, Georgia. Another giant crowd. See you soon!","rating":2},{"id":1046443996074127400,"text":"Like many, I don’t watch Saturday Night Live (even though I past hosted it) - no longer funny, no talent or charm. It is just a political ad for the Dems. Word is that Kanye West, who put on a MAGA hat after the show (despite being told “no”), was great. He’s leading the charge!","rating":5},{"id":1068826073775964200,"text":"President George H.W. Bush led a long, successful and beautiful life.  Whenever I was with him I saw his absolute joy for life and true pride in his family. His accomplishments were great from beginning to end. He was a truly wonderful man and will be missed by all!","rating":1},{"id":1346805405998076000,"text":"Sleepy Eyes Chuck Todd is so happy with the fake voter tabulation process that he can’t even get the words out straight. Sad to watch!","rating":8},{"id":1275136946348703700,"text":"PRESIDENTIAL HARASSMENT!","rating":9},{"id":1296601698891374600,"text":"They are sending out 51,000,000 Ballots to people who haven’t even requested a Ballot. Many of those people don’t even exist. They are trying to STEAL this election. This should not be allowed!","rating":10},{"id":1264330025744154600,"text":"TRANSITION TO GREATNESS!","rating":3},{"id":1336680713568071700,"text":"There is massive evidence of widespread fraud in the four states (plus) mentioned in the Texas suit. Just look at all of the tapes and affidavits!","rating":6},{"id":1107462671614570500,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1249132374547464200,"text":"Mail in ballots substantially increases the risk of crime and VOTER FRAUD!","rating":5},{"id":1033515425336885200,"text":"My deepest sympathies and respect go out to the family of Senator John McCain. Our hearts and prayers are with you!","rating":2},{"id":1180564696979648500,"text":"So Crooked Hillary Clinton can delete and acid wash 33,000 emails AFTER getting a Subpoena from the United States Congress, but I can’t make one totally appropriate telephone call to the President of Ukraine? Witch Hunt!","rating":7},{"id":1280649677894037500,"text":"We will miss GREAT Country Rocker, Charlie Daniels, who passed away yesterday in Hermitage, Tennessee. My condolences to his wife Hazel, and their family. Charlie is in my thoughts and prayers. I love his music! #RIPCharlieDaniels","rating":2},{"id":1302601868313538600,"text":"The Democrats, together with the corrupt Fake News Media, have launched a massive Disinformation Campaign the likes of which has never been seen before. They will say anything, like their recent lies about me and the Military, and hope that it sticks... But #MAGA gets it!","rating":6},{"id":1240391871026864000,"text":"I only signed the Defense Production Act to combat the Chinese Virus should we need to invoke it in a worst case scenario in the future. Hopefully there will be no need, but we are all in this TOGETHER!","rating":4},{"id":1231898506396414000,"text":"अमेरिका और भारत अपने देशों को मजबूत बनाएँगे,  अपने लोगों को सम्पन्न बनाएँगे, बड़े सपने देखने वालों को और बड़ा बनाएँगे और अपना भविष्य पहले से कहीं अधिक उज्जवल बनाएँगे... और यह तो शुरुआत ही है।","rating":3},{"id":796900183955095600,"text":"Just had a very open and successful presidential election. Now professional protesters, incited by the media, are protesting. Very unfair!","rating":6},{"id":1287371355332190200,"text":"Crazy Nancy Pelosi said I made a mistake when I banned people from infected China from entering the U.S. in January. Tens of thousands of lives were saved, as she danced in the Streets of Chinatown (SF) in late February. Biden agreed with her, but soon admitted that I was right!","rating":8},{"id":1334534181314031600,"text":"Thank you to Representative Mo Brooks!","rating":3},{"id":1319822464147353600,"text":"...I could not sit by and watch THEM take advantage of YOU anymore. They are coming after me because I am standing in their way, and standing guard for this Country we LOVE!","rating":7},{"id":1279510068606701600,"text":"Will be speaking at 7:00 P.M. Thank you for all of the nice comments on the Mount Rushmore speech last night!!!","rating":4},{"id":1207817078725578800,"text":"So after the Democrats gave me no Due Process in the House, no lawyers, no witnesses, no nothing, they now want to tell the Senate how to run their trial. Actually, they have zero proof of anything, they will never even show up. They want out. I want an immediate trial!","rating":7},{"id":1262155040107704300,"text":"The number of Coronavirus cases is strongly trending downward throughout the United States, with few exceptions. Very good news, indeed!","rating":3},{"id":1255861756741726200,"text":"We can’t let the Fake News, and their partner, the Radical Left, Do Nothing Democrats, get away with stealing the Election. They tried that in 2016. How did that work out?","rating":8},{"id":1319711635808735200,"text":"Biden said he is going to “transition out of (fracking) by 2025”. I hope Texas, Pennsylvania, Ohio, Oklahoma, North Dakota, and all of the rest were listening last night. High energy prices, massive jobs losses! Vote Trump.","rating":5},{"id":1266800113260703700,"text":"80% of the RIOTERS in Minneapolis last night were from OUT OF STATE. They are harming businesses (especially African American small businesses), homes, and the community of good, hardworking Minneapolis residents who want peace, equality, and to provide for their families.","rating":6},{"id":1266915358914621400,"text":"Let New York’s Finest be New York’s Finest. There is nobody better, but they must be allowed to do their job!","rating":4},{"id":1302700900272738300,"text":"Our Economy and Jobs are doing really well. Next Year will be a Record Setter. Stay Tuned!","rating":3},{"id":1278304961143734300,"text":"Biden was asked questions at his so-called Press Conference yesterday where he read the answers from a teleprompter. That means he was given the questions, just like Crooked Hillary. Never have seen this before!","rating":7},{"id":1272266206691672000,"text":"Does anyone notice how little the Radical Left takeover of Seattle is being discussed in the Fake News Media. That is very much on purpose because they know how badly this weakness &amp; ineptitude play politically. The Mayor &amp; Governor should be ashamed of themselves. Easily fixed!","rating":6},{"id":1288620254130626600,"text":"Germany pays Russia billions of dollars a year for Energy, and we are supposed to protect Germany from Russia. What’s that all about? Also, Germany is very delinquent in their 2% fee to NATO. We are therefore moving some troops out of Germany!","rating":5},{"id":1315668059751932000,"text":"STOCK MARKET UP BIG!","rating":2},{"id":825721153142521900,"text":"Christians in the Middle-East have been executed in large numbers. We cannot allow this horror to continue!","rating":5},{"id":1299562199837479000,"text":"Disgraceful that Big Ten is not playing football. Let them PLAY!","rating":6},{"id":1249437936539631600,"text":"If the Fake News Opposition Party is pushing, with all their might, the fact that President Trump “ignored early warnings about the threat,” then why did Media &amp; Dems viciously criticize me when I instituted a Travel Ban on China? They said “early &amp; not necessary.” Corrupt Media!","rating":7},{"id":1344259405274087400,"text":"“Barack Obama was toppled from the top spot and President Trump claimed the title of the year’s Most Admired Man. Trump number one, Obama number two, and Joe Biden a very distant number three. That’s also rather odd given the fact that on November 3rd, Biden allegedly racked up","rating":6},{"id":1245876816922972200,"text":"We hit 3M hard today after seeing what they were doing with their Masks. “P Act” all the way. Big surprise to many in government as to what they were doing - will have a big price to pay!","rating":7},{"id":1267811637811187700,"text":"Yesterday was a bad day for the Cuomo Brothers. New York was lost to the looters, thugs, Radical Left, and all others forms of Lowlife &amp; Scum. The Governor refuses to accept my offer of a dominating National Guard. NYC was ripped to pieces. Likewise, Fredo’s ratings are down 50%!","rating":9},{"id":1264558926021959700,"text":"The United States cannot have all Mail In Ballots. It will be the greatest Rigged Election in history. People grab them from mailboxes, print thousands of forgeries and “force” people to sign. Also, forge names. Some absentee OK, when necessary. Trying to use Covid for this Scam!","rating":8},{"id":1267828812244381700,"text":"Republicans, get out and vote today for those great candidates that will lead to big victories on November 3rd. MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1328152466752491500,"text":"....owned Dominion Voting Systems, turned down by Texas and many others because it was not good or secure, those responsible for the safeguarding of our Constitution cannot allow the Fake results of the 2020 Mail-In Election to stand. The World is watching!","rating":8},{"id":1088958154791100400,"text":"I wish people would read or listen to my words on the Border Wall. This was in no way a concession. It was taking care of millions of people who were getting badly hurt by the Shutdown with the understanding that in 21 days, if no deal is done, it’s off to the races!","rating":5},{"id":1239567267312152600,"text":"Everybody is so well unified and working so hard. It is a beautiful thing to see. They love our great Country. We will end up being stronger than ever before!","rating":3},{"id":1311500843309387800,"text":"100,000 DEFECTIVE BALLOTS IN NEW YORK. THEY WANT TO REPLACE THEM, BUT WHERE, AND WHAT HAPPENS TO, THE BALLOTS THAT WERE FIRST SENT? THEY WILL BE USED BY SOMEBODY. USA, END THIS SCAM - GO OUT AND VOTE!","rating":7},{"id":1298414089769750500,"text":"Governor should call in the National Guard in Wisconsin. It is ready, willing, and more than able. End problem FAST!","rating":5},{"id":1330278689200857000,"text":"The Fake News is not talking about the fact that “Covid” is running wild all over the World, not just in the U.S. I was at the Virtual G-20 meeting early this morning and the biggest subject was Covid. We will be healing fast, especially with our vaccines!","rating":6},{"id":1277581155945021400,"text":"Can anyone believe that Princeton just dropped the name of Woodrow Wilson from their highly respected policy center. Now the Do Nothing Democrats want to take off the name John Wayne from an airport. Incredible stupidity!","rating":9},{"id":1278101078165373000,"text":"This is a battle to save the Heritage, History, and Greatness of our Country! #MAGA2020","rating":7},{"id":1207639703538851800,"text":"100% Republican Vote. That’s what people are talking about. The Republicans are united like never before!","rating":5},{"id":1266387743996870700,"text":"REVOKE 230!","rating":6},{"id":898243270169563100,"text":"The United States condemns the terror attack in Barcelona, Spain, and will do whatever is necessary to help. Be tough &amp, strong, we love you!","rating":3},{"id":1288436755646099500,"text":"Sleepy Joe Biden is just a Trojan Horse for the Radical Left Agenda. He will do whatever they want!","rating":8},{"id":1208137095270862800,"text":"Nancy Pelosi is looking for a Quid Pro Quo with the Senate. Why aren’t we Impeaching her?","rating":8},{"id":1244301861781475300,"text":"The Lamestream Media wants us to fail. That will NEVER happen!","rating":7},{"id":823151124815507500,"text":"Wow, television ratings just out: 31 million people watched the Inauguration, 11 million more than the very good ratings from 4 years ago!","rating":4},{"id":1150381394234941400,"text":"So interesting to see “Progressive” Democrat Congresswomen, who originally came from countries whose governments are a complete and total catastrophe, the worst, most corrupt and inept anywhere in the world (if they even have a functioning government at all), now loudly......","rating":10},{"id":1300840191771340800,"text":"I was saddened to learn of the passing of India's former President, Pranab Mukherjee. I send my condolences to his family and the people of India as they grieve the loss of a great leader.","rating":3},{"id":1013618640061595600,"text":"Congratulations to Andres Manuel Lopez Obrador on becoming the next President of Mexico. I look very much forward to working with him. There is much to be done that will benefit both the United States and Mexico!","rating":3},{"id":1321107640651550700,"text":"Obama is drawing VERY small (tiny) numbers of people. Biden is drawing almost no one. We are drawing tens of thousands of people. You’ll see that again today. The Great Red Wave is coming!!!","rating":8},{"id":1281554061972693000,"text":"Now that we have witnessed it on a large scale basis, and firsthand, Virtual Learning has proven to be TERRIBLE compared to In School, or On Campus, Learning. Not even close! Schools must be open in the Fall. If not open, why would the Federal Government give Funding? It won’t!!!","rating":6},{"id":1263600794290417700,"text":"I will be lowering the flags on all Federal Buildings and National Monuments to half-staff over the next three days in memory of the Americans we have lost to the CoronaVirus....","rating":2},{"id":1085166206095630300,"text":"Why is Nancy Pelosi getting paid when people who are working are not?","rating":7},{"id":810996052241293300,"text":"We did it! Thank you to all of my great supporters, we just officially won the election (despite all of the distorted and inaccurate media).","rating":7},{"id":1166839524762296300,"text":"A sad day for the Democrats, Kirsten Gillibrand has dropped out of the Presidential Primary. I’m glad they never found out that she was the one I was really afraid of!","rating":9},{"id":1095857587344552000,"text":"California has been forced to cancel the massive bullet train project after having spent and wasted many billions of dollars. They owe the Federal Government three and a half billion dollars. We want that money back now. Whole project is a “green” disaster!","rating":6},{"id":1321151327448133600,"text":"Joe Biden FAILED BADLY with the Swine Flu Epidemic. He knows nothing. All talk and no action!","rating":7},{"id":1145276110097154000,"text":"Leaving South Korea after a wonderful meeting with Chairman Kim Jong Un. Stood on the soil of North Korea, an important statement for all, and a great honor!","rating":4},{"id":1243873875047448600,"text":"So much of the Lamestream Media is writing and broadcasting stories with facts that are made up and knowingly wrong. They are doing it by quoting unnamed sources that simply do not exist. These are very dangerous &amp; corrupt people, who will do anything to win. NAME YOUR SOURCES!","rating":8},{"id":1321293551951630300,"text":"We are spending more in Florida, and we are winning big in Florida. Actually, we are winning big in many states as the Great Red Wave begins to form!","rating":6},{"id":797034721075228700,"text":"Love the fact that the small groups of protesters last night have passion for our great country. We will all come together and be proud!","rating":5},{"id":1313511340124917800,"text":"REPEAL SECTION 230!!!","rating":7},{"id":1322065847893020700,"text":"Biden will destroy the United States Supreme Court. Don’t let this happen!","rating":6},{"id":1090074254010404900,"text":"In the beautiful Midwest, windchill temperatures are reaching minus 60 degrees, the coldest ever recorded. In coming days, expected to get even colder. People can’t last outside even for minutes. What the hell is going on with Global Waming? Please come back fast, we need you!","rating":9},{"id":1288509568578777000,"text":"I am happy to inform all of the people living their Suburban Lifestyle Dream that you will no longer be bothered or financially hurt by having low income housing built in your neighborhood...","rating":7},{"id":825692045532618800,"text":"Our country needs strong borders and extreme vetting, NOW. Look what is happening all over Europe and, indeed, the world - a horrible mess!","rating":5},{"id":1282291265661472800,"text":"No, Radical Left anarchists, agitators, looters or protesters will not be knocking down or harming the Washington Monument, the Lincoln or Jefferson Memorials, or just about any other Federal Monumrnt or Statue. If they even try, an automatic 10 years in prison. Sorry!","rating":7}]