[{"id":1176604222709751800,"text":"Such an important day at the United Nations, so much work and so much success, and the Democrats purposely had to ruin and demean it with more breaking news Witch Hunt garbage. So bad for our Country!","rating":8},{"id":1273665328514556000,"text":"The recent Supreme Court decisions, not only on DACA, Sanctuary Cities, Census, and others, tell you only one thing, we need NEW JUSTICES of the Supreme Court. If the Radical Left Democrats assume power, your Second Amendment, Right to Life, Secure Borders, and...","rating":7},{"id":968850364383596500,"text":"45 year low on illegal border crossings this year. Ice and Border Patrol Agents are doing a great job for our Country. MS-13 thugs being hit hard.","rating":5},{"id":1129360082783875100,"text":"Will Jerry Nadler ever look into the fact that Crooked Hillary deleted and acid washed 33,000 emails AFTER getting a most powerful demand notice for them from Congress?","rating":7},{"id":1182859828386885600,"text":"So funny to watch Steve Kerr grovel and pander when asked a simple question about China. He chocked, and looks weak and pathetic. Don’t want him at the White House!","rating":9},{"id":1010978975391322100,"text":"The United States is insisting that all countries that have placed artificial Trade Barriers and Tariffs on goods going into their country, remove those Barriers &amp, Tariffs or be met with more than Reciprocity by the U.S.A. Trade must be fair and no longer a one way street!","rating":4},{"id":1127938873630367700,"text":"Democrat Rep. Tlaib is being slammed for her horrible and highly insensitive statement on the Holocaust. She obviously has tremendous hatred of Israel and the Jewish people. Can you imagine what would happen if I ever said what she said, and says?","rating":7},{"id":1304767518775611400,"text":"....It has now been determined that the Mueller Scam should never have been set up in the first place, there were no grounds. It was all an illegitimate Witch Hunt, &amp; a big price must be paid. How different my life would have been if this fraud on America was never committed!!!","rating":8},{"id":1206950027148583000,"text":"Impeachment Poll numbers are starting to drop like a rock now that people are understanding better what this whole Democrat Scam is all about!","rating":6},{"id":1207821957988835300,"text":"The House Democrats were unable to get even a single vote from the Republicans on their Impeachment Hoax. The Republicans have never been so united!  The Dem’s case is so bad that they don’t even want to go to trial!","rating":6},{"id":957387711693905900,"text":"Taliban targeted innocent Afghans, brave police in Kabul today. Our thoughts and prayers go to the victims, and first responders. We will not allow the Taliban to win!","rating":3},{"id":1277207355554517000,"text":"Funny to see Corrupt Joe Biden reading a statement on Russia, which was obviously written by his handlers. Russia ate his and Obama’s lunch during their time in office, so badly that Obama wanted them out of the then G-8. U.S. was weak on everything, but especially Russia!","rating":7},{"id":1177919923885969400,"text":"Can you imagine if these Do Nothing Democrat Savages, people like Nadler, Schiff, AOC Plus 3, and many more, had a Republican Party who would have done to Obama what the Do Nothings are doing to me. Oh well, maybe next time!","rating":8},{"id":1134469934816346100,"text":"90% of the Drugs coming into the United States come through Mexico &amp, our Southern Border. 80,000 people died last year, 1,000,000 people ruined. This has gone on for many years &amp, nothing has been done about it. We have a 100 Billion Dollar Trade Deficit with Mexico. It’s time!","rating":5},{"id":910332992756834300,"text":"I was saddened to see how bad the ratings were on the Emmys last night - the worst ever. Smartest people of them all are the \"\"DEPLORABLES.\"\"","rating":6},{"id":1166494781935095800,"text":"Can you believe it? I’m at 94% approval in the Republican Party, and have Three Stooges running against me. One is “Mr. Appalachian Trail” who was actually in Argentina for bad reasons....","rating":9},{"id":984374422587965400,"text":"Never said when an attack on Syria would take place. Could be very soon or not so soon at all! In any event, the United States, under my Administration, has done a great job of ridding the region of ISIS. Where is our “Thank you America?”","rating":4},{"id":1210172955982016500,"text":"The Radical Left, Do Nothing Democrats said they wanted to RUSH everything through to the Senate because “President Trump is a threat to National Security” (they are vicious, will say anything!), but now they don’t want to go fast anymore, they want to go very slowly. Liars!","rating":6},{"id":1113060131917480000,"text":"Robert Mueller was a God-like figure to the Democrats, until he ruled No Collusion in the long awaited $30,000,000 Mueller Report. Now the Dems don’t even acknowledge his name, have become totally unhinged, and would like to go through the whole process again. It won’t happen!","rating":5},{"id":1303368656680747000,"text":"Because of the China Virus, my Campaign, which has raised a lot of money, was forced to spend in order to counter the Fake News reporting about the way we handled it (China Ban, etc.). We did, and are doing, a GREAT job, and have a lot of money left over, much more than 2016....","rating":4},{"id":1151871835564326900,"text":"Most of the MS-13 Gang members indicted &amp, arrested in L.A. were illegal aliens, 19 of 22. They are said to have killed many people in the most brutal fashion. They should never have been allowed in our Country for so long, 10 years. We have arrested and deported thousands....","rating":7},{"id":1181991604493656000,"text":"So pathetic to see Sleepy Joe Biden, who with his son, Hunter, and to the detriment of the American Taxpayer, has ripped off at least two countries for millions of dollars, calling for my impeachment - and I did nothing wrong. Joe’s Failing Campaign gave him no other choice!","rating":8},{"id":1089541521139998700,"text":"Jens Stoltenberg, NATO Secretary General, just stated that because of me NATO has been able to raise far more money than ever before from its members after many years of decline. It’s called burden sharing. Also, more united. Dems &amp, Fake News like to portray the opposite!","rating":6},{"id":978936058795757600,"text":"For years and through many administrations, everyone said that peace and the denuclearization of the Korean Peninsula was not even a small possibility. Now there is a good chance that Kim Jong Un will do what is right for his people and for humanity. Look forward to our meeting!","rating":5},{"id":816452807024840700,"text":"The \"\"Intelligence\"\" briefing on so-called \"\"Russian hacking\"\" was delayed until Friday, perhaps more time needed to build a case. Very strange!","rating":9},{"id":1159797315680555000,"text":"....mentally ill or deranged people. I am the biggest Second Amendment person there is, but we all must work together for the good and safety of our Country. Common sense things can be done that are good for everyone!","rating":4},{"id":1278299171523637200,"text":"“No corroborating evidence to back reports.” Department of Defense. Do people still not understand that this is all a made up Fake News Media Hoax started to slander me &amp; the Republican Party. I was never briefed because any info that they may have had did not rise to that level","rating":7},{"id":1257303100815261700,"text":"Republicans love the biggest Tax Cuts, Rebuilt Military, Choice for Vets, saving 2nd Amendment and many other things my Administration has done, but what they love beyond all else is 252 (so far!) Federal Judges, not including two great Supreme Court Justices. A Big Record!","rating":4},{"id":1242528658767655000,"text":"Price transparency is so important for the people of our Country. In many ways, it will prove to be as important as healthcare itself. A great issue for both Republicans and Democrats. Hopefully it will be approved!","rating":3},{"id":1154821023197474800,"text":"The WTO is BROKEN when the world’s RICHEST countries claim to be developing countries to avoid WTO rules and get special treatment. NO more!!! Today I directed the U.S. Trade Representative to take action so that countries stop CHEATING the system at the expense of the USA!","rating":6},{"id":998546786628395000,"text":"The Wall Street Journal asks, “WHERE IN THE WORLD WAS BARACK OBAMA?”  A very good question!","rating":7},{"id":990049088375836700,"text":"House Intelligence Committee rules that there was NO COLLUSION between the Trump Campaign and Russia. As I have been saying all along, it is all a big Hoax by the Democrats based on payments and lies. There should never have been a Special Counsel appointed. Witch Hunt!","rating":8},{"id":1151473175496147000,"text":"Big Rally tonight in Greenville, North Carolina. Lots of great things to tell you about, including the fact that our Economy is the best it has ever been. Best Employment &amp, Stock Market Numbers EVER. I’ll talk also about people who love, and hate, our Country (mostly love)!  7:PM","rating":6},{"id":1162040855328436200,"text":"Representatives Omar and Tlaib are the face of the Democrat Party, and they HATE Israel!","rating":8},{"id":1122333996451418100,"text":"Thank you to brilliant and highly respected attorney Alan Dershowitz for destroying the very dumb legal argument of “Judge” Andrew Napolitano....","rating":5},{"id":1296198517573202000,"text":"Will be having a Press Conference at 5:45 P.M. See you in 15 minutes!","rating":3},{"id":1031544711717302300,"text":"I hope John Brennan, the worst CIA Director in our country’s history, brings a lawsuit. It will then be very easy to get all of his records, texts, emails and documents to show not only the poor job he did, but how he was involved with the Mueller Rigged Witch Hunt. He won’t sue!","rating":7},{"id":1043126336473055200,"text":"I have no doubt that, if the attack on Dr. Ford was as bad as she says, charges would have been immediately filed with local Law Enforcement Authorities by either her or her loving parents. I ask that she bring those filings forward so that we can learn  date, time, and place!","rating":8},{"id":1076569051768516600,"text":"The crisis of illegal activity at our Southern Border is real and will not stop until we build a great Steel Barrier or Wall. Let work begin!","rating":5},{"id":1150766497469489200,"text":"....What does it mean for America to have free Healthcare for Illegal Immigrants, no criminalization of coming into our Country - See how that works for controlling Immigration! They talk about Israel like they’re a bunch of thugs, not victims of the entire region. They wanted...","rating":6},{"id":998202784683053000,"text":"....and why hasn’t the Podesta brother been charged and arrested, like others, after being forced to close down his very large and successful firm? Is it because he is a VERY well connected Democrat working in the Swamp of Washington, D.C.?","rating":8},{"id":1205992385215230000,"text":"The last time I spoke to Debbie Dingell was her call thanking me for granting top memorial and funeral service honors for her then just departed husband, long time Congressman John Dingell. Now I watch her ripping me as part of the Democrats Impeachment Hoax. Really pathetic!","rating":7},{"id":1063593459695669200,"text":"....their country’s flag. Can this be possible? Yes, because it is all a BIG CON, and the American taxpayer is paying for it!","rating":7},{"id":943074475209355300,"text":"DOW RISES 5000 POINTS ON THE YEAR FOR THE FIRST TIME EVER - MAKE AMERICA GREAT AGAIN!","rating":6},{"id":1260185657395339300,"text":"Wisconsin, please get out NOW and vote for Tom Tiffany for Congress. A great guy!","rating":4},{"id":1321233544346095600,"text":"Under my leadership, we achieved the most Secure Border in U.S. History! My opponent’s insane immigration plan completely eliminates U.S. borders by implementing nationwide catch-and-release. Joe Biden would make every community into a Sanctuary City for violent criminals. #VOTE","rating":5},{"id":1165499459259773000,"text":"Before I arrived in France, the Fake and Disgusting News was saying that relations with the 6 others countries in the G-7 are very tense, and that the two days of meetings will be a disaster. Just like they are trying to force a Recession, they are trying to “will” America into..","rating":6},{"id":1079727034673311700,"text":"...I campaigned on getting out of Syria and other places. Now when I start getting out the Fake News Media, or some failed Generals who were unable to do the job before I arrived, like to complain about me &amp, my tactics, which are working. Just doing what I said I was going to do!","rating":6},{"id":1084092774633353200,"text":"Lyin’ James Comey, Andrew McCabe, Peter S and his lover, agent Lisa Page, &amp, more, all disgraced and/or fired and caught in the act. These are just some of the losers that tried to do a number on your President. Part of the Witch Hunt. Remember the “insurance policy?” This is it!","rating":9},{"id":1201629794535923700,"text":"Just landed in the United Kingdom, heading to London for NATO meetings tomorrow. Prior to landing I read the Republicans Report on the Impeachment Hoax. Great job! Radical Left has NO CASE. Read the Transcripts. Shouldn’t even be allowed. Can we go to Supreme Court to stop?","rating":5},{"id":1137500852778864600,"text":"Watched MSNBC this morning just to see what the opposition was saying about events of the past week. Such lies, almost everything they were saying was the opposite of the truth. Fake News! No wonder their ratings, along with CNN, are WAY DOWN. The hatred Comcast has is amazing!","rating":6},{"id":1011038477889175600,"text":"House Republicans could easily pass a Bill on Strong Border Security but remember, it still has to pass in the Senate, and for that we need 10 Democrat votes, and all they do is RESIST. They want Open Borders and don’t care about Crime! Need more Republicans to WIN in November!","rating":5},{"id":1314236926770241500,"text":"The Great Commonwealth of Pennsylvania would absolutely die without the jobs and dollars brought in by Fracking. Massive numbers! Now Biden &amp; Harris, after Radical Left Dem Primaries, are trying to change their stance. Pennsylvania wants Energy and Second Amendment!","rating":4},{"id":1070837085538525200,"text":"Does the Fake News Media ever mention the fact that Republicans, with the very important help of my campaign Rallies, WON THE UNITED STATES SENATE, 53 to 47? All I hear is that the Open Border Dems won the House. Senate alone approves judges &amp, others. Big Republican Win!","rating":5},{"id":1201563617180733400,"text":"When Lisa Page, the lover of Peter Strzok, talks about being “crushed”, and how innocent she is, ask her to read Peter’s “Insurance Policy” text, to her, just in case Hillary loses. Also, why were the lovers text messages scrubbed after he left Mueller. Where are they Lisa?","rating":7},{"id":1086966588752969700,"text":"Always heard that as President, “it’s all about the economy!” Well, we have one of the best economies in the history of our Country. Big GDP, lowest unemployment, companies coming back to the U.S. in BIG numbers, great new trade deals happening, &amp, more. But LITTLE media mention!","rating":4},{"id":1155235323938508800,"text":"We gave Nadler and his Trump hating Dems the complete Mueller Report (we didn’t have to), and even Mueller himself, but now that both were a total BUST, they say it wasn’t good enough. Nothing will ever be good enough for them. Witch Hunt!","rating":6},{"id":1135150118120939500,"text":"....Coyotes and Illegal Immigrants, which they can do very easily, or our many companies and jobs that have been foolishly allowed to move South of the Border, will be brought back into the United States through taxation (Tariffs). America has had enough!","rating":5},{"id":1038453273286664200,"text":"Apple prices may increase because of the massive Tariffs we may be imposing on China - but there is an easy solution where there would be ZERO tax, and indeed a tax incentive. Make your products in the United States instead of China. Start building new plants now. Exciting! #MAGA","rating":4},{"id":935493619204620300,"text":"Melania, our great and very hard working First Lady, who truly loves what she is doing, always thought that “if you run, you will win.” She would tell everyone that, “no doubt, he will win.” I also felt I would win (or I would not have run) - and Country is doing great!","rating":3},{"id":925497025386500100,"text":"My thoughts, condolences and prayers to the victims and families of the New York City terrorist attack. God and your country are with you!","rating":3},{"id":819162968592183300,"text":"I win an election easily, a great \"\"movement\"\" is verified, and crooked opponents try to belittle our victory with FAKE NEWS. A sorry state!","rating":7},{"id":1103994805477085200,"text":"The Wall is being built and is well under construction. Big impact will be made. Many additional contracts are close to being signed. Far ahead of schedule despite all of the Democrat Obstruction and Fake News!","rating":8},{"id":1156033183697080300,"text":"“I don’t know what it’s going to take. A lot of Democratic run cities all over America look like this, it’s not just Baltimore, unfortunately.” Kimberly Klacik, Baltimore journalist  Remember, Vote for Trump, what the h.... do you have to lose? Best unemployment numbers!","rating":6},{"id":1207333331777605600,"text":"“The evidence has to be overwhelming, and it is not. It’s not even close.” Ken Starr, Former Independent Counsel","rating":5},{"id":1053655992649506800,"text":"If the Democrats would stop being obstructionists and come together, we could write up and agree to new immigration laws in less than one hour. Look at the needless  pain and suffering that they are causing. Look at the horrors taking place on the Border. Chuck &amp, Nancy, call me!","rating":7},{"id":1119569774286135300,"text":"Despite the fact that the Mueller Report should not have been authorized in the first place &amp, was written as nastily as possible by 13 (18) Angry Democrats who were true Trump Haters, including highly conflicted Bob Mueller himself, the end result is No Collusion, No Obstruction!","rating":8},{"id":1184430253541859300,"text":"95% Approval Rating in the Republican Party. Thank you! Just won two Congressional Seats in North Carolina,  &amp, a Governors runoff in Louisiana, which Republicans should now win! Because of Impeachment Fraud, we will easily take back the House, add in the Senate, &amp, again win Pres!","rating":6},{"id":1013016168377081900,"text":"The Democrats are making a strong push to abolish ICE, one of the smartest, toughest and most spirited law enforcement groups of men and women that I have ever seen. I have watched ICE liberate towns from the grasp of MS-13 &amp, clean out the toughest of situations. They are great!","rating":5},{"id":1111650176345800700,"text":"The DEMOCRATS have given us the weakest immigration laws anywhere in the World. Mexico has the strongest, &amp, they make more than $100 Billion a year on the U.S. Therefore, CONGRESS MUST CHANGE OUR WEAK IMMIGRATION LAWS NOW, &amp, Mexico must stop illegals from entering the U.S....","rating":7},{"id":1134538168324300800,"text":"....on the basis of their sexual orientation. My Administration has launched a global campaign to decriminalize homosexuality and invite all nations to join us in this effort!","rating":3},{"id":794895332941381600,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1018069319702458400,"text":"The Stock Market hit 25,000 yesterday. Jobs are at an all time record - and that is before we fix some of the worst trade deals and conditions ever seen by any government. It is all happening!","rating":4},{"id":1027688604578074600,"text":"Jenna Ellis  “FBI thought they wouldn’t get caught because they thought that Hillary was going to win. There is overt bias and that depends on whether you are Democrat or Republican - a double standard that needs to stop.”","rating":6},{"id":952888691944550400,"text":"...to stop drugs, they want to take money away from our military which we cannot do.” My standard is very simple, AMERICA FIRST &amp, MAKE AMERICA GREAT AGAIN!","rating":5},{"id":882062572081512400,"text":"....and Japan will put up with this much longer. Perhaps China will put a heavy move on North Korea and end this nonsense once and for all!","rating":4},{"id":1203770794024808400,"text":"I.G. report out tomorrow. That will be the big story!","rating":6},{"id":1151867786236440600,"text":"....of which was squandered away or wasted, never to be seen again. This is more than twice the amount given to Texas &amp, Florida combined. I know the people of Puerto Rico well, and they are great. But much of their leadership is corrupt, &amp, robbing the U.S. Government blind!","rating":7},{"id":1228666350635290600,"text":"“Ralph Waldo Emerson seemed to foresee the lesson of the Senate Impeachment Trial of President Trump. ‘When you strike at the King, Emerson famously said, “you must kill him.’ Mr. Trump’s foes struck at him but did not take him down. A triumphant Mr.Trump emerges from the.....","rating":7},{"id":1038103589904777200,"text":"Under our horrible immigration laws, the Government is frequently blocked from deporting criminal aliens with violent felony convictions. House GOP just passed a bill to increase our ability to deport violent felons (Crazy Dems opposed). Need to get this bill to my desk fast!","rating":6},{"id":1030777074959757300,"text":"Social Media is totally discriminating against Republican/Conservative voices. Speaking loudly and clearly for the Trump Administration, we won’t let that happen. They are closing down the opinions of many people on the RIGHT, while at the same time doing nothing to others.......","rating":7},{"id":1234455007765942300,"text":"I am meeting with the major pharmaceutical companies today at the White House about progress on a vaccine and cure. Progress being made!","rating":4},{"id":970760324126212100,"text":"It’s March 5th and the Democrats are nowhere to be found on DACA. Gave them 6 months, they just don’t care. Where are they? We are ready to make a deal!","rating":5},{"id":1154774656861257700,"text":"Apple will not be given Tariff waiver, or relief, for Mac Pro parts that are made in China. Make them in the USA, no Tariffs!","rating":4},{"id":1184815052546809900,"text":"My warmest condolences to the family and many friends of Congressman Elijah Cummings. I got to see first hand the strength, passion and wisdom of this highly respected political leader. His work and voice on so many fronts will be very hard, if not impossible, to replace!","rating":3},{"id":1172860069760946200,"text":"KEEP AMERICA GREAT!","rating":6},{"id":1196791181163847700,"text":"NASDAQ UP 27% THIS YEAR ALONE!","rating":3},{"id":1054087893034172400,"text":"Full efforts are being made to stop the onslaught of illegal aliens from crossing our Souther Border. People have to apply for asylum in Mexico first, and if they fail to do that, the U.S. will turn them away. The courts are asking the U.S. to do things that are not doable!","rating":6},{"id":1071132880368132100,"text":"Mike Pompeo is doing a great job, I am very proud of him. His predecessor, Rex Tillerson, didn’t have the mental capacity needed. He was dumb as a rock and I couldn’t get rid of him fast enough. He was lazy as hell. Now it is a whole new ballgame, great spirit at State!","rating":9},{"id":1176559970390806500,"text":"....You will see it was a very friendly and totally appropriate call. No pressure and, unlike Joe Biden and his son, NO quid pro quo! This is nothing more than a continuation of the Greatest and most Destructive Witch Hunt of all time!","rating":8},{"id":1106554458383806500,"text":"....should never have been appointed and there should be no Mueller Report. This was an illegal &amp, conflicted investigation in search of a crime. Russian Collusion was nothing more than an excuse by the Democrats for losing an Election that they thought they were going to win.....","rating":8},{"id":1126683358917025800,"text":"James Comey is a disgrace to the FBI &amp, will go down as the worst Director in its long and once proud history. He brought the FBI down, almost all Republicans &amp, Democrats thought he should be FIRED, but the FBI will regain greatness because of the great men &amp, women who work there!","rating":7},{"id":1121733749757087700,"text":"No money was paid to North Korea for Otto Warmbier, not two Million Dollars, not anything else. This is not the Obama Administration that paid 1.8 Billion Dollars for four hostages, or gave five terroist hostages plus, who soon went back to battle, for traitor Sgt. Bergdahl!","rating":9},{"id":1086262002815766500,"text":"Why would Nancy Pelosi leave the Country with other Democrats on a seven day excursion when 800,000 great people are not getting paid. Also, could somebody please explain to Nancy &amp, her “big donors” in wine country that people working on farms (grapes) will have easy access in!","rating":8},{"id":1122815079274242000,"text":"I spoke at length yesterday to Rabbi Yisroel Goldstein, Chabad  of Poway, where I extended my warmest condolences to him and all affected by the shooting in California. What a great guy. He had a least one finger blown off, and all he wanted to do is help others. Very special!","rating":3},{"id":924400308834455600,"text":"While not at all presidential I must point out that the Sloppy Michael Moore Show on Broadway was a TOTAL BOMB and was forced to close. Sad!","rating":9},{"id":1016368503723577300,"text":"Pfizer &amp, others should be ashamed that they have raised drug prices for no reason. They are merely taking advantage of the poor &amp, others unable to defend themselves, while at the same time giving bargain basement prices to other countries in Europe &amp, elsewhere. We will respond!","rating":6},{"id":1005989290520739800,"text":"Great to be in Singapore, excitement in the air!","rating":4},{"id":1303302824747577300,"text":"Great! Biden is finally being forced out of his basement. Now you’ll be able to see what is going on “up there”. He may do some “limited” campaigning. Basement Biden is no longer playing well in the Polls!","rating":8},{"id":1257258214615367700,"text":"“Concast” should open up a long overdue Florida Cold Case against Psycho Joe Scarborough. I know him and Crazy Mika well, used them beautifully in the last Election, dumped them nicely, and will state on the record that he is “nuts”. Besides, bad ratings! #OPENJOECOLDCASE","rating":10},{"id":1135331156239560700,"text":"Democrats can’t impeach a Republican President for crimes committed by Democrats. The facts are “pouring” in. The Greatest Witch Hunt in American History! Congress, go back to work and help us at the Border, with Drug Prices and on Infrastructure.","rating":7},{"id":1060130202418864100,"text":"Received so many Congratulations from so many on our Big Victory last night, including from foreign nations (friends) that were waiting me out, and hoping, on Trade Deals. Now we can all get back to work and get things done!","rating":4},{"id":924635359480303600,"text":"Never seen such Republican ANGER &amp, UNITY as I have concerning the lack of investigation on Clinton made Fake Dossier (now $12,000,000?),....","rating":6},{"id":1006866982833131500,"text":"Oil prices are too high, OPEC is at it again. Not good!","rating":5},{"id":1063084073231544300,"text":"The only “Collusion” is that of the Democrats with Russia and many others. Why didn’t the FBI take the Server from the DNC? They still don’t have it. Check out how biased Facebook, Google and Twitter are in favor of the Democrats. That’s the real Collusion!","rating":8},{"id":998532136578748400,"text":"“John Brennan is panicking. He has disgraced himself, he has disgraced the Country, he has disgraced the entire Intelligence Community. He is the one man who is largely responsible for the destruction of American’s faith in the Intelligence Community and in some people at the....","rating":6},{"id":894661651760377900,"text":"I think Senator Blumenthal should take a nice long vacation in Vietnam, where he lied about his service, so he can at least say he was there","rating":9},{"id":1128257891805298700,"text":"When the time is right we will make a deal with China. My respect and friendship with President Xi is unlimited but, as I have told him many times before, this must be a great deal for the United States or it just doesn’t make any sense. We have to be allowed to make up some.....","rating":5},{"id":1075368918204719100,"text":"In our Country, so much money has been poured down the drain, for so many years, but when it comes to Border Security and the Military, the Democrats fight to the death. We won on the Military, which is being completely rebuilt. One way or the other, we will win on the Wall!","rating":7},{"id":852508752142114800,"text":"I have great confidence that China will properly deal with North Korea. If they are unable to do so, the U.S., with its allies, will! U.S.A.","rating":6},{"id":1323021747248005000,"text":"Pennsylvania: Biden said that he doesn’t want Fracking. Besides, and more importantly, his handlers won’t allow Fracking. That would be the end of Pennsylvania!","rating":6},{"id":989110172495810600,"text":"Congratulations to Republican Debbie Lesko on her big win in the Special Election for Arizona House seat. Debbie will do a Great Job! Press is so silent.","rating":3},{"id":961253168968622100,"text":"In the “old days,” when good news was reported, the Stock Market would go up. Today, when good news is reported, the Stock Market goes down. Big mistake, and we have so much good (great) news about the economy!","rating":4},{"id":1268888049792036900,"text":"Congratulations to wonderful Charles Payne on having been so optimistic, and therefore correct. Market up BIG!!!","rating":3},{"id":985856662866202600,"text":"Comey drafted the Crooked Hillary exoneration long before he talked to her (lied in Congress to Senator G), then based his decisions on her poll numbers. Disgruntled, he, McCabe, and the others, committed many crimes!","rating":7},{"id":1137112921991983100,"text":"Dow Jones has best week of the year!","rating":2},{"id":1082289526339448800,"text":"The Failing New York Times has knowingly written a very inaccurate story on my intentions on Syria. No different from my original statements, we will be leaving at a proper pace while at the same time continuing to fight ISIS and doing all else that is prudent and necessary!.....","rating":5},{"id":1100584141274398700,"text":"Vietnam is thriving like few places on earth. North Korea would be the same, and very quickly, if it would denuclearize. The potential is AWESOME, a great opportunity, like almost none other in history, for my friend Kim Jong Un. We will know fairly soon - Very Interesting!","rating":4},{"id":1097109575248068600,"text":"Democrats in the Senate are still slow walking hundreds of highly qualified people wanting to come into government. Never been such an abuse in our country’s history. Mitch should not let Senate go home until all are approved. We need our Ambassadors and all others NOW!","rating":4},{"id":1239906156463652900,"text":"Failing  Michigan Governor must work harder and be much more proactive. We are pushing her to get the job done. I stand with Michigan!","rating":5},{"id":887134287350440000,"text":"Republicans should just REPEAL failing ObamaCare now &amp, work on a new Healthcare Plan that will start from a clean slate. Dems will join in!","rating":5},{"id":1260185030967677000,"text":"Looking forward to being in Allentown, Pennsylvania, on Thursday. I love the State, and for very good reason!","rating":2},{"id":1067576713859817500,"text":"The Mueller Witch Hunt is a total disgrace. They are looking at supposedly stolen Crooked Hillary Clinton Emails (even though they don’t want to look at the DNC Server), but have no interest in the Emails that Hillary DELETED &amp, acid washed AFTER getting a Congressional Subpoena!","rating":9},{"id":839883804315684900,"text":"Despite what you hear in the press, healthcare is coming along great. We are talking to many groups and it will end in a beautiful picture!","rating":4},{"id":1118845290721812500,"text":"The Greatest Political Hoax of all time! Crimes were committed by Crooked, Dirty Cops and DNC/The Democrats.","rating":7},{"id":937142713211813900,"text":"Many people in our Country are asking what the “Justice” Department is going to do about the fact that totally Crooked Hillary, AFTER receiving a subpoena from the United States Congress, deleted and “acid washed” 33,000 Emails? No justice!","rating":6},{"id":1091864144071020500,"text":"Ed Gillespie, who ran for Governor of the Great State of Virginia against Ralph Northam, must now be thinking Malpractice and Dereliction of Duty with regard to his Opposition Research Staff. If they find that terrible picture before the election, he wins by 20 points!","rating":5},{"id":1003328970069332000,"text":"Mark Penn  “Why are there people from the Clinton Foundation on the Mueller Staff? Why is there an Independent Counsel? To go after people and their families for unrelated offenses...Constitution was set up to prevent this...Stormtrooper tactics almost.” A disgrace!","rating":8},{"id":1013976609290965000,"text":"Many Democrats are deeply concerned about the fact that their “leadership” wants to denounce and abandon the great men and women of ICE, thereby declaring war on Law &amp, Order. These people will be voting for Republicans in November and, in many cases, joining the Republican Party!","rating":6},{"id":955795912374267900,"text":"Nobody knows for sure that the Republicans &amp, Democrats will be able to reach a deal on DACA by February 8, but everyone will be trying....with a big additional focus put on Military Strength and Border Security. The Dems have just learned that a Shutdown is not the answer!","rating":3},{"id":956937916374138900,"text":"Heading back from a very exciting two days in Davos, Switzerland. Speech on America’s economic revival was well received. Many of the people I met will be investing in the U.S.A.! #MAGA","rating":3},{"id":908160218995068900,"text":"Crooked Hillary Clinton blames everybody (and every thing) but herself for her election loss. She lost the debates and lost her direction!","rating":7},{"id":1181905659568283600,"text":"The United States has spent EIGHT TRILLION DOLLARS fighting and policing in the Middle East. Thousands of our Great Soldiers have died or been badly wounded. Millions of people have died on the other side. GOING INTO THE MIDDLE EAST IS THE WORST DECISION EVER MADE.....","rating":8},{"id":901791391130554400,"text":"I will be going to Texas as soon as that trip can be made without causing disruption. The focus must be life and safety.","rating":3},{"id":1077210242574942200,"text":"Virtually every Democrat we are dealing with today strongly supported a Border Wall or Fence. It was only when I made it an important part of my campaign, because people and drugs were pouring into our Country unchecked, that they turned against it. Desperately needed!","rating":5},{"id":1189897137984876500,"text":"READ THE TRANSCRIPT!","rating":5},{"id":1186016354572353500,"text":"Pelosi is now leading a delegation of 9, including Corrupt Adam Schiff, to Jordan to check out Syria. She should find out why Obama drew The Red Line In the Sand, &amp, then did NOTHING, losing Syria &amp, all respect. I did something, 58 missiles. One million died under Obama’s mistake!","rating":9},{"id":963879275324760000,"text":"Just spoke to Governor Rick Scott. We are working closely with law enforcement on the terrible Florida school shooting.","rating":2},{"id":1027892043908046800,"text":"The NFL players are at it again - taking a knee when they should be standing proudly for the National Anthem. Numerous players, from different teams, wanted to show their “outrage” at something that most of them are unable to define. They make a fortune doing what they love......","rating":7},{"id":870077441401905200,"text":"Crooked Hillary Clinton now blames everybody but herself, refuses to say she was a terrible candidate. Hits Facebook &amp, even Dems &amp, DNC.","rating":6},{"id":1189919331259424800,"text":"The Impeachment Hoax is hurting our Stock Market. The Do Nothing Democrats don’t care!","rating":8},{"id":1100127553203798000,"text":"Heading over to Vietnam for my meeting with Kim Jong Un. Looking forward to a very productive Summit!","rating":6},{"id":1177924521291997200,"text":"PRESIDENTIAL HARASSMENT!","rating":7},{"id":1063042585802039300,"text":"The inner workings of the Mueller investigation are a total mess. They have found no collusion and have gone absolutely nuts. They are screaming and shouting at people, horribly threatening them to come up with the answers they want. They are a disgrace to our Nation and don’t...","rating":9},{"id":805278955150471200,"text":"Just tried watching Saturday Night Live - unwatchable! Totally biased, not funny and the Baldwin impersonation just can't get any worse. Sad","rating":10},{"id":1161774305895694300,"text":"I know President Xi of China very well. He is a great leader who very much has the respect of his people. He is also a good man in a “tough business.” I have ZERO doubt that if President Xi wants to quickly and humanely solve the Hong Kong problem, he can do it. Personal meeting?","rating":5},{"id":1142767618086133800,"text":"I want to give the Democrats every last chance to quickly negotiate simple changes to Asylum and Loopholes. This will fix the Southern Border, together with the help that Mexico is now giving us. Probably won’t happen, but worth a try. Two weeks and big Deportation begins!","rating":6},{"id":1148971886279311400,"text":"....serving and doing a great job as your President (including accepting Zero salary!).","rating":7},{"id":1007278788009480200,"text":"The sleazy New York Democrats, and their now disgraced (and run out of town) A.G. Eric Schneiderman, are doing everything they can to sue me on a foundation that took in $18,800,000 and gave out to charity more money than it took in, $19,200,000. I won’t settle this case!...","rating":8},{"id":1090731036298879000,"text":"Spoke today with Venezuelan Interim President Juan Guaido to congratulate him on his historic assumption of the presidency and reinforced strong United States support for Venezuela’s fight to regain its democracy....","rating":5},{"id":952538350333939700,"text":"“President Trump is not getting the credit he deserves for the economy. Tax Cut bonuses to more than 2,000,000 workers. Most explosive Stock Market rally that we’ve seen in modern times. 18,000 to 26,000 from Election, and grounded in profitability and growth. All Trump, not 0...","rating":3},{"id":1168898508608422000,"text":"The incompetent Mayor of London, Sadiq Khan, was bothered that I played a very fast round of golf yesterday. Many Pols exercise for hours, or travel for weeks. Me, I run through one of my courses (very inexpensive). President Obama would fly to Hawaii. Kahn should focus on....","rating":8},{"id":1087726599225688000,"text":"Last time I went to Davos, the Fake News said I should not go there. This year, because of the Shutdown, I decided not to go, and the Fake News said I should be there. The fact is that the people understand the media better than the media understands them!","rating":5},{"id":992350362450518000,"text":"Because Jobs in the U.S. are doing so well, Americans receiving unemployment aid is the lowest since 1973. Great!","rating":2},{"id":1096926633708134400,"text":"Trade negotiators have just returned from China where the meetings on Trade were very productive. Now at meetings with me at Mar-a-Lago giving the details. In the meantime, Billions of Dollars are being paid to the United States by China in the form of Trade Tariffs!","rating":4},{"id":1088429823561814000,"text":"...back home where they belong, no more Rockets or M’s being fired over Japan or anywhere else and, most importantly, no Nuclear Testing. This is more than has ever been accomplished with North Korea, and the Fake News knows it. I expect another good meeting soon, much potential!","rating":6},{"id":835916511944523800,"text":"Russia talk is FAKE NEWS put out by the Dems, and played up by the media, in order to mask the big election defeat and the illegal leaks!","rating":7},{"id":1229894633280266200,"text":"I hope the Federal Judges Association will discuss the tremendous FISA Court abuse that has taken place with respect to the Mueller Investigation Scam, including the forging of documents and knowingly using the fake and totally discredited Dossier before the Court. Thank you!","rating":5},{"id":1075721703421042700,"text":"Does the USA want to be the Policeman of the Middle East, getting NOTHING but spending precious lives and trillions of dollars protecting others who, in almost all cases, do not appreciate what we are doing? Do we want to be there forever? Time for others to finally fight.....","rating":6},{"id":1060141780878979100,"text":"Those that worked with me in this incredible Midterm Election, embracing certain policies and principles, did very well. Those that did not, say goodbye! Yesterday was such a very Big Win, and all under the pressure of a Nasty and Hostile Media!","rating":5},{"id":822501803615014900,"text":"Today we are not merely transferring power from one Administration to another, or from one party to another – but we are transferring...","rating":5},{"id":989834048796266500,"text":"Please do not forget the great help that my good friend, President Xi of China, has given to the United States, particularly at the Border of North Korea. Without him it would have been a much longer, tougher, process!","rating":4},{"id":1259843806049992700,"text":"Dems are trying to steal the Mike Garcia Congressional Race in California. Republicans, get out and VOTE for your terrific candidate, ASAP!","rating":6},{"id":912626731357540400,"text":"The booing at the NFL football game last night, when the entire Dallas team dropped to its knees, was loudest I have ever heard. Great anger","rating":8},{"id":1152010854176452600,"text":"I am pleased to announce that it is my intention to nominate Gene Scalia as the new Secretary of Labor. Gene has led a life of great success in the legal and labor field and is highly respected not only as a lawyer, but as a lawyer with great experience....","rating":3},{"id":1180482408522629000,"text":"The so-called Whistleblower’s account of my perfect phone call is “way off,” not even close. Schiff and Pelosi never thought I would release the transcript of the call. Got them by surprise, they got caught. This is a fraud against the American people!","rating":7},{"id":1235573492004905000,"text":"I NEVER said people that are feeling sick should go to work. This is just more Fake News and disinformation put out by the Democrats, in particular MSDNC. Comcast covers the CoronaVirus situation horribly, only looking to do harm to the incredible &amp; successful effort being made!","rating":7},{"id":1078634025412116500,"text":".....close the Southern Border. Bring our car industry back into the United States where it belongs. Go back to pre-NAFTA, before so many of our companies and jobs were so foolishly sent to Mexico. Either we build (finish) the Wall or we close the Border......","rating":6},{"id":1116172224459882500,"text":"Too bad that the European Union is being so tough on the United Kingdom and Brexit. The E.U. is likewise a brutal trading partner with the United States, which will change. Sometimes in life you have to let people breathe before it all comes back to bite you!","rating":5},{"id":1101588728500363300,"text":"....for Otto’s mistreatment and death. Most important, Otto Warmbier will not have died in vain. Otto and his family have become a tremendous symbol of strong passion and strength, which will last for many years into the future. I love Otto and think of him often!","rating":4},{"id":1121187494312255500,"text":"The Great State of Tennessee is so close to passing School Choice. All of our Nation’s children, regardless of background, deserve a shot at achieving the American Dream! Time to get this done, so important!","rating":3},{"id":1145097774402342900,"text":"I had a great meeting with President Xi of China yesterday, far better than expected. I agreed not to increase the already existing Tariffs that we charge China while we continue to negotiate. China has agreed that, during the negotiation, they will begin purchasing large.....","rating":4},{"id":995424104286179300,"text":"Iran’s Military Budget is up more than 40% since the Obama negotiated Nuclear Deal was reached...just another indicator that it was all a big lie. But not anymore!","rating":5},{"id":1177201488688537600,"text":"THE DEMOCRATS ARE TRYING TO DESTROY THE REPUBLICAN PARTY AND ALL THAT IT STANDS FOR. STICK TOGETHER, PLAY THEIR GAME, AND FIGHT HARD REPUBLICANS. OUR COUNTRY IS AT STAKE!","rating":8},{"id":953795518592843800,"text":"Despite some very corrupt and dishonest media coverage, there are many great reporters I respect and lots of GOOD NEWS for the American people to be proud of!","rating":4},{"id":898522732672933900,"text":"Homeland Security and law enforcement are on alert &amp, closely watching for any sign of trouble. Our borders are far tougher than ever before!","rating":3},{"id":1044415858465001500,"text":"REMEMBER THE MIDTERMS!","rating":6},{"id":1094990198507819000,"text":"Will be heading to El Paso very soon. Big speech on Border Security and much else tonight. Tremendous crowd! See you later!","rating":3},{"id":1140590099870171100,"text":"Big Rally tomorrow night in Orlando, Florida, looks to be setting records. We are building large movie screens outside to take care of everybody. Over 100,000 requests. Our Country is doing great, far beyond what the haters &amp, losers thought possible - and it will only get better!","rating":5},{"id":881983493533823000,"text":"Dow hit a new intraday all-time high! I wonder whether or not the Fake News Media will so report?","rating":5},{"id":1159046824294002700,"text":"South Korea has agreed to pay substantially more money to the United States in order to defend itself from North Korea. Over the past many decades, the U.S. has been paid very little by South Korea, but last year, at the request of President Trump, South Korea paid $990,000,000..","rating":3},{"id":1153040324241088500,"text":"....Most importantly you have led Israel with a commitment to the values of democracy, freedom, and equal opportunity that both our nations cherish and share!","rating":2},{"id":924963492645437400,"text":"Report out that Obama Campaign paid $972,000 to Fusion GPS. The firm also got $12,400,000 (really?) from DNC. Nobody knows who OK'd!","rating":4},{"id":945030174290186200,"text":"The Tax Cut/Reform Bill, including Massive Alaska Drilling and the Repeal of the highly unpopular Individual Mandate, brought it all together as to what an incredible year we had. Don’t let the Fake News convince you otherwise...and our insider Polls are strong!","rating":3},{"id":1141432478491717600,"text":"....asking Hillary Clinton why she deleted and acid washed her Emails AFTER getting a subpoena from Congress? Anybody else would be in jail for that, yet the Dems refuse to even bring it up. Rigged House Committee","rating":5},{"id":1147345545704431600,"text":"Strong jobs report, low inflation, and other countries around the world doing anything possible to take advantage of the United States, knowing that our Federal Reserve doesn’t have a clue! They raised rates too soon, too often, &amp, tightened, while others did just the opposite....","rating":4},{"id":1237603152490147800,"text":"Pocahontas, working in conjunction with the Democrat Party, totally destroyed the campaign of Bernie Sanders. If she would have quit 3 days earlier, Sanders would have beaten Biden in a route, it wouldn’t even have been close. They also got two other losers to support Sleepy Joe!","rating":8},{"id":943819430735372300,"text":"The Massive Tax Cuts, which the Fake News Media is desperate to write badly about so as to please their Democrat bosses, will soon be kicking in and will speak for themselves. Companies are already making big payments to workers. Dems want to raise taxes, hate these big Cuts!","rating":4},{"id":1243557418556162000,"text":"As usual with “this” General Motors, things just never seem to work out. They said they were going to give us 40,000 much needed Ventilators, “very quickly”. Now they are saying it will only be 6000, in late April, and they want top dollar. Always a mess with Mary B. Invoke “P”.","rating":6},{"id":1306735337423605800,"text":"Bob Woodward’s badly written book is very boring &amp; totally “obsolete”. Didn’t even talk about the recent Middle East deal. Just another tired, washed up Trump Hater, who can’t stand that I have done so much, so quickly! #MAGA","rating":5},{"id":1140591670280564700,"text":"Only Fake Polls show us behind the Motley Crew. We are looking really good, but it is far too early to be focused on that. Much work to do! MAKE AMERICA GREAT AGAIN!","rating":8},{"id":1103445720164651000,"text":"Wall Street Journal: “More migrant families crossing into the U.S. illegally have been arrested in the first five months of the federal fiscal year than in any prior full year.” We are doing a great job at the border, but this is a National Emergency!","rating":7},{"id":1181601756347797500,"text":"Hasn’t Adam Schiff been fully discredited by now? Do we have to continue listening to his lies?","rating":6},{"id":953951365532876800,"text":"....The Wall will be paid for, directly or indirectly, or through longer term reimbursement, by Mexico, which has a ridiculous $71 billion dollar trade surplus with the U.S. The $20 billion dollar Wall is “peanuts” compared to what Mexico makes from the U.S. NAFTA is a bad joke!","rating":9},{"id":1221464712321347600,"text":"Sleepyeyes Chuck Todd of Meet the Corrupt Press, just had a “totally” softball interview with conman Adam Schiff, never even calling Shifty out on his fraudulent statement to Congress, where he made up ALL of the words of my conversation with the Ukrainian President! FAKE NEWS","rating":8},{"id":1275998585377652700,"text":"....the good and the bad. It is important for us to understand and remember, even in turbulent and difficult times, and learn from them. Knowledge comes from the most unusual of places!","rating":4},{"id":1055826295337173000,"text":"Republicans are doing so well in early voting, and at the polls, and now this “Bomb” stuff happens and the momentum greatly slows - news not talking politics. Very unfortunate, what is going on. Republicans, go out and vote!","rating":7},{"id":831510532318429200,"text":"The real story here is why are there so many illegal leaks coming out of Washington? Will these leaks be happening as I deal on N.Korea etc?","rating":6},{"id":1180886039801602000,"text":"The Biden family was PAID OFF, pure and simple! The fake news must stop making excuses for something that is totally inexcusable. Sleepy Joe said he never spoke to the Ukrainian company, and then the picture came out where he was playing golf with the company boss and Hunter.....","rating":8},{"id":1153994026099630000,"text":"So why didn’t the highly conflicted Robert Mueller investigate how and why Crooked Hillary Clinton deleted and acid washed 33,000 Emails immediately AFTER getting a SUBPOENA from the United States Congress? She must have GREAT lawyers!","rating":9},{"id":1031868964161368000,"text":"I am sorry to have to reiterate that there are serious and unpleasant consequences to crossing the Border into the United States ILLEGALLY! If there were no serious consequences, our country would be overrun with people trying to get in, and our system could not handle it!","rating":5},{"id":993562242124865500,"text":"I will be announcing my decision on the Iran Deal tomorrow from the White House at 2:00pm.","rating":3},{"id":1131761681850347500,"text":"Wow! CNN Ratings are WAY DOWN, record lows. People are getting tired of so many Fake Stories and Anti-Trump lies. Chris Cuomo was rewarded for lowest morning ratings with a prime time spot - which is failing badly and not helping the dumbest man on television, Don Lemon!","rating":8},{"id":1187375419022069800,"text":"Thank you to House Republicans for being tough, smart, and understanding in detail the greatest Witch Hunt in American History. It has been going on since long before I even got Elected (the Insurance Policy!). A total Scam!","rating":6},{"id":875698062030778400,"text":"Despite the phony Witch Hunt going on in America, the economic &amp, jobs numbers are great. Regulations way down, jobs and enthusiasm way up!","rating":4},{"id":886538703547621400,"text":"Thank you to all of the supporters, who far out-numbered the protesters, yesterday at the Women's U.S. Open. Very cool!","rating":3},{"id":1007671131841671200,"text":"The Democrats are forcing the breakup of families at the Border with their horrible and cruel legislative agenda. Any Immigration Bill MUST HAVE full funding for the Wall, end Catch &amp, Release, Visa Lottery and Chain, and go to Merit Based Immigration. Go for it! WIN!","rating":7},{"id":1067494682249318400,"text":"....for electric cars. General Motors made a big China bet years ago when they built plants there (and in Mexico) - don’t think that bet is going to pay off. I am here to protect America’s Workers!","rating":4},{"id":1153627261058392000,"text":"....Best and Newest Military (almost totally rebuilt from the depleted military I took over) in History, Best V.A. in History (Choice), and MUCH, MUCH MORE. Gee, let’s impeach the President. The “Squad” (AOC Plus 3) and other Dems suffer from Trump Derangement Syndrome. Crazy!","rating":9},{"id":852510810287075300,"text":"Things will work out fine between the U.S.A. and Russia. At the right time everyone will come to their senses &amp, there will be lasting peace!","rating":4},{"id":1225728755248828400,"text":"Just had a long and very good conversation by phone with President Xi of China. He is strong, sharp and powerfully focused on leading the counterattack on the Coronavirus. He feels they are doing very well, even building hospitals in a matter of only days. Nothing is easy, but...","rating":4},{"id":1159797314900451300,"text":"Serious discussions are taking place between House and Senate leadership  on meaningful Background Checks. I have also been speaking to the NRA, and others, so that their very strong views can be fully represented and respected. Guns should not be placed in the hands of.....","rating":3},{"id":946156544927977500,"text":"Just left West Palm Beach Fire &amp, Rescue #2. Met with great men and women as representatives of those who do so much for all of us. Firefighters, paramedics, first responders - what amazing people they are!","rating":2},{"id":1032934937962442800,"text":"“Department of Justice will not be improperly influenced by political considerations.” Jeff, this is GREAT, what everyone wants, so look into all of the corruption on the “other side” including deleted Emails, Comey lies &amp, leaks, Mueller conflicts, McCabe, Strzok, Page, Ohr......","rating":5},{"id":1089161485148975100,"text":"21 days goes very quickly. Negotiations with Democrats will start immediately. Will not be easy to make a deal, both parties very dug in. The case for National Security has been greatly enhanced by what has been happening at the Border &amp, through dialogue. We will build the Wall!","rating":6},{"id":947810806430826500,"text":"Iran is failing at every level despite the terrible deal made with them by the Obama Administration. The great Iranian people have been repressed for many years. They are hungry for food &amp, for freedom. Along with human rights, the wealth of Iran is being looted. TIME FOR CHANGE!","rating":5},{"id":945624910898122800,"text":"Based on the fact that the very unfair and unpopular Individual Mandate has been terminated as part of our Tax Cut Bill, which essentially Repeals (over time) ObamaCare, the Democrats &amp, Republicans will eventually come together and develop a great new HealthCare plan!","rating":4},{"id":898172999945392100,"text":"...the beauty that is being taken out of our cities, towns and parks will be greatly missed and never able to be comparably replaced!","rating":2},{"id":896512981319790600,"text":"Condolences to the family of the young woman killed today, and best regards to all of those injured, in Charlottesville, Virginia. So sad!","rating":2},{"id":946415026402988000,"text":"Retail sales are at record numbers. We’ve got the economy going better than anyone ever dreamt - and you haven’t seen anything yet!","rating":3},{"id":1156567209528975400,"text":"Such a great victory in court yesterday on the Russian Hoax, the greatest political scam in the history of our Country. TREASON! Hopefully, the Attorney Generel of the United States, and all of those working with him, will find out, in great detail, what happened. NEVER AGAIN!!!!","rating":8},{"id":1210600560719782000,"text":"Thank YOU Indian Country for being such an IMPORTANT part of the American story! I recently signed 3 bills to support tribal sovereignty....","rating":3},{"id":954323750949982200,"text":"Government Funding Bill past last night in the House of Representatives. Now Democrats are needed if it is to pass in the Senate - but they want illegal immigration and weak borders. Shutdown coming? We need more Republican victories in 2018!","rating":6},{"id":953270558573154300,"text":"Do you notice the Fake News Mainstream Media never likes covering the great and record setting economic news, but rather talks about anything negative or that can be turned into the negative. The Russian Collusion Hoax is dead, except as it pertains to the Dems. Public gets it!","rating":7},{"id":1099803719435239400,"text":"....productive talks, I will be delaying the U.S. increase in tariffs now scheduled for March 1. Assuming both sides make additional progress, we will be planning a Summit for President Xi and myself, at Mar-a-Lago, to conclude an agreement. A very good weekend for U.S. &amp, China!","rating":4},{"id":797873313561198600,"text":"The debates, especially the second and third, plus speeches and intensity of the large rallies, plus OUR GREAT SUPPORTERS, gave us the win!","rating":2},{"id":1253426762928668700,"text":"I will be having a White House Press Conference today at 5:45 P.M. Thank you!","rating":1},{"id":961959738853548000,"text":"Without more Republicans in Congress, we were forced to increase spending on things we do not like or want in order to finally, after many years of depletion, take care of our Military. Sadly, we needed some Dem votes for passage. Must elect more Republicans in 2018 Election!","rating":5},{"id":1061554334276747300,"text":"With proper Forest Management, we can stop the devastation constantly going on in California. Get Smart!","rating":4},{"id":1187063301731209200,"text":"The Never Trumper Republicans, though on respirators with not many left, are in certain ways worse and more dangerous for our Country than the Do Nothing Democrats. Watch out for them, they are human scum!","rating":10},{"id":987282387196436500,"text":"Nancy Pelosi is going absolutely crazy about the big Tax Cuts given to the American People by the Republicans...got not one Democrat Vote! Here’s a choice. They want to end them and raise your taxes substantially. Republicans are working on making them permanent and more cuts!","rating":5},{"id":1196097712925692000,"text":"Our great Farmers will recieve another major round of “cash,” compliments of China Tariffs, prior to Thanksgiving. The smaller farms and farmers will be big beneficiaries. In the meantime, and as you may have noticed, China is starting to buy big again. Japan deal DONE. Enjoy!","rating":4},{"id":1222981385520140300,"text":"Just landed in Michigan. Car companies, and many others, are building and expanding here. Great to see!","rating":3},{"id":1036689178749227000,"text":"I see that John Kerry, the father of the now terminated Iran deal, is thinking of running for President. I should only be so lucky - although the field that is currently assembling looks really good - FOR ME!","rating":6},{"id":987470932989050900,"text":"Just heard the Campaign was sued by the Obstructionist Democrats. This can be good news in that we will now counter for the DNC Server that they refused to give to the FBI, the Debbie Wasserman Schultz Servers and Documents held by the Pakistani mystery man and Clinton Emails.","rating":8},{"id":1141362325619916800,"text":"If I didn’t have the Phony Witch Hunt going on for 3 years, and if the Fake News Media and their partner in Crime, the Democrats, would have played it straight, I would be way up in the Polls right now - with our Economy, winning by 20 points. But I’m winning anyway!","rating":7},{"id":1063038733673525200,"text":"The White House is running very smoothly and the results for our Nation are obviously very good. We are the envy of the world. But anytime I even think about making changes, the FAKE NEWS MEDIA goes crazy, always seeking to make us look as bad as possible! Very dishonest!","rating":6},{"id":1053285828892463100,"text":"When referring to the USA, I will always capitalize the word Country!","rating":2},{"id":987278269765517300,"text":"So General Michael Flynn’s life can be totally destroyed while Shadey James Comey can Leak and Lie and make lots of money from a third rate book (that should never have been written). Is that really the way life in America is supposed to work? I don’t think so!","rating":7},{"id":872059997429022700,"text":"The FAKE MSM is working so hard trying to get me not to use Social Media. They hate that I can get the honest and unfiltered message out.","rating":6},{"id":979030033149972500,"text":"My Administration stands in solidarity with the brave citizens in Orange County defending their rights against California's illegal and unconstitutional Sanctuary policies. California's Sanctuary laws....","rating":4},{"id":1177579380819845000,"text":"Sounding more and more like the so-called Whistleblower isn’t a Whistleblower at all. In addition, all second hand information that proved to be so inaccurate that there may not have even been somebody else, a leaker or spy, feeding it to him or her? A partisan operative?","rating":6},{"id":1221419910175301600,"text":"The Impeachment Hoax is a massive election interference the likes of which has never been seen before. In just two hours the Radical Left, Do Nothing Democrats have seen their phony case absolutely shredded. Shifty is now exposed for illegally making up my phone call, &amp; more!","rating":7},{"id":1211969354499285000,"text":"The Democrats will do anything to avoid a trial in the Senate in order to protect Sleepy Joe Biden, and expose the millions and millions of dollars that “Where’s” Hunter, &amp, possibly Joe, were paid by companies and countries for doing NOTHING. Joe wants no part of this mess!","rating":7},{"id":991267863674675200,"text":"So disgraceful that the questions concerning the Russian Witch Hunt were “leaked” to the media. No questions on Collusion. Oh, I see...you have a made up, phony crime, Collusion, that never existed, and an investigation begun with illegally leaked classified information. Nice!","rating":6},{"id":948872192284155900,"text":"Many mostly Democrat States refused to hand over data from the 2016 Election to the Commission On Voter Fraud. They fought hard that the Commission not see their records or methods because they know that many people are voting illegally. System is rigged, must go to Voter I.D.","rating":5},{"id":912443924979077100,"text":"Tremendous backlash against the NFL and its players for disrespect of our Country.#StandForOurAnthem🇺🇸","rating":6},{"id":1180559858699030500,"text":"I’m hearing that the Great People of Utah are considering their vote for their Pompous Senator, Mitt Romney, to be a big mistake. I agree! He is a fool who is playing right into the hands of the Do Nothing Democrats! #IMPEACHMITTROMNEY","rating":7},{"id":1037656324010664000,"text":"Kim Jong Un of North Korea proclaims “unwavering faith in President Trump.” Thank you to Chairman Kim. We will get it done together!","rating":5},{"id":999626347361206300,"text":"Clapper has now admitted that there was Spying in my campaign. Large dollars were paid to the Spy, far beyond normal. Starting to look like one of the biggest political scandals in U.S. history. SPYGATE - a terrible thing!","rating":7},{"id":1117821219875594200,"text":"Those Illegal Immigrants who can no longer be legally held (Congress must fix the laws and loopholes) will be, subject to Homeland Security, given to Sanctuary Cities and States!","rating":7},{"id":991087278515769300,"text":"The Fake News is going crazy making up false stories and using only unnamed sources (who don’t exist). They are totally unhinged, and the great success of this Administration is making them do and say things that even they can’t believe they are saying. Truly bad people!","rating":9},{"id":1125774545988857900,"text":"Democrats in Congress must vote to close the terrible loopholes at the Southern Border. If not, harsh measures will have to be taken!","rating":6},{"id":1030257073047658500,"text":"How can “Senator” Richard Blumenthal, who went around for twenty years as a Connecticut politician bragging that he was a great Marine war hero in Vietnam (then got caught and sobbingly admitted he was neither a Marine nor ever in Vietnam), pass judgement on anyone? Loser!","rating":9},{"id":1061952604807274500,"text":"Just returned from France where much was accomplished in my meetings with World Leaders. Never easy bringing up the fact that the U.S. must be treated fairly, which it hasn’t, on both Military and Trade. We pay for LARGE portions of other countries military protection,........","rating":5},{"id":1077217178322194400,"text":"....We are substantially subsidizing the Militaries of many VERY rich countries all over the world, while at the same time these countries take total advantage of the U.S., and our TAXPAYERS, on Trade. General Mattis did not see this as a problem. I DO, and it is being fixed!","rating":5},{"id":1125396971009859600,"text":"Puerto Rico has been given more money by Congress for Hurricane Disaster Relief, 91 Billion Dollars, than any State in the history of the U.S. As an example, Florida got $12 Billion &amp, Texas $39 Billion for their monster hurricanes. Now the Democrats are saying NO Relief to......","rating":5},{"id":1080839254656405500,"text":"The United States Treasury has taken in MANY billions of dollars from the Tariffs we are charging China and other countries that have not treated us fairly. In the meantime we are doing well in various Trade Negotiations currently going on. At some point this had to be done!","rating":4},{"id":1171022839962644500,"text":"94% Approval Rating in the Republican Party, a record. Thank you!","rating":3},{"id":1289275311272521700,"text":"We just got 50% in Rasmussen, and much higher in our internal polls. We are doing a new ad campaign on Sleepy Joe Biden that will be out on Monday. He has been brought even further LEFT than Crazy Bernie Sanders ever thought possible. By the way, Bernie’s people love me on Trade!","rating":7},{"id":1087693453394432000,"text":"Without a Wall our Country can never have Border or National Security. With a powerful Wall or Steel Barrier, Crime Rates (and Drugs) will go substantially down all over the U.S. The Dems know this but want to play political games. Must finally be done correctly. No Cave!","rating":8},{"id":1105109329290686500,"text":"At a recent round table meeting of business executives, &amp, long after formally introducing Tim Cook of Apple, I quickly referred to Tim + Apple as Tim/Apple as an easy way to save time &amp, words. The Fake News was disparagingly all over this, &amp, it became yet another bad Trump story!","rating":7},{"id":1087726878981582800,"text":"The United States has a great economic story to tell. Number one in the World, by far!","rating":5},{"id":1159189584183353300,"text":"....misrepresenting what took place inside of the hospital. Their news conference after I left for El Paso was a fraud. It bore no resemblance to what took place with those incredible people that I was so lucky to meet and spend time with. They were all amazing!o","rating":6},{"id":990551654952067100,"text":"Great evening last night in Washington, Michigan. The enthusiasm, knowledge and love in that room was unreal. To the many thousands of people who couldn’t get in, I cherish you....and will be back!","rating":5},{"id":1062333534214520800,"text":"The problem is that Emmanuel suffers from a very low Approval Rating in France, 26%, and an unemployment rate of almost 10%. He was just trying to get onto another subject. By the way, there is no country more Nationalist than France, very proud people-and rightfully so!........","rating":7},{"id":1030811421007929300,"text":"The Economy is stronger and better than ever before. Importantly, there remains tremendous potential - it will only get better with time!","rating":4},{"id":1131563848992006100,"text":"I was extremely calm yesterday with my meeting with Pelosi and Schumer, knowing that they would say I was raging, which they always do, along with their partner, the Fake News Media. Well, so many stories about the meeting use the Rage narrative anyway - Fake &amp, Corrupt Press!","rating":6},{"id":1145818575049023500,"text":"It was great being with Chairman Kim Jong Un of North Korea this weekend. We had a great meeting, he looked really well and very healthy - I look forward to seeing him again soon....","rating":5},{"id":1146501823190188000,"text":".....Now, if you really want to fix the Crisis at the Southern Border, both humanitarian and otherwise, tell migrants not to come into our country unless they are willing to do so legally, and hopefully through a system based on Merit. This way we have no problems at all!","rating":6},{"id":1078390057906638800,"text":"“Border Patrol Agents want the Wall.” Democrat’s say they don’t want the Wall (even though they know it is really needed), and they don’t want ICE. They don’t have much to campaign on, do they? An Open Southern Border and the large scale crime that comes with such stupidity!","rating":6},{"id":1109126359861944300,"text":"....There is nothing to admire about them, they will always try to show a glimmer of vicious hope, but they are losers and barely breathing. Think about that before you destroy your lives and the lives of your family!","rating":9},{"id":1128739520311066600,"text":"The Fake News Washington Post, and even more Fake News New York Times, are writing stories that there is infighting with respect to my strong policy in the Middle East. There is no infighting whatsoever....","rating":7},{"id":947588263103139800,"text":"Iran, the Number One State of Sponsored Terror with numerous violations of Human Rights occurring on an hourly basis, has now closed down the Internet so that peaceful demonstrators cannot communicate. Not good!","rating":4},{"id":1008692333771132900,"text":"Why don’t the Democrats give us the votes to fix the world’s worst immigration laws? Where is the outcry for the killings and crime being caused by gangs and thugs, including MS-13, coming into our country illegally?","rating":5},{"id":942044657613230100,"text":"Congratulations to two great and hardworking guys, Corey Lewandowski and David Bossie, on the success of their just out book, “Let Trump Be Trump.” Finally people with real knowledge are writing about our wonderful and exciting campaign!","rating":3},{"id":1123033559802024000,"text":"The Coyotes and Drug Cartels are in total control of the Mexico side of the Southern Border. They have labs nearby where they make drugs to sell into the U.S. Mexico, one of the most dangerous country’s in the world, must eradicate this problem now. Also, stop the MARCH to U.S.","rating":8},{"id":1138030976578310100,"text":"We have fully signed and documented another very important part of the Immigration and Security deal with Mexico, one that the U.S. has been asking about getting for many years. It will be revealed in the not too distant future and will need a vote by Mexico’s Legislative body!..","rating":2},{"id":1220410391668371500,"text":"The Democrats don’t want a Witness Trade because Shifty Schiff, the Biden’s, the fake Whistleblower(&amp; his lawyer), the second Whistleblower (who vanished after I released the Transcripts), the so-called “informer”, &amp; many other Democrat disasters, would be a BIG problem for them!","rating":8},{"id":976654851684945900,"text":"Got $1.6 Billion to start Wall on Southern Border, rest will be forthcoming. Most importantly, got $700 Billion to rebuild our Military, $716 Billion next year...most ever. Had to waste money on Dem giveaways in order to take care of military pay increase and new equipment.","rating":5},{"id":1174297506986909700,"text":"Terrence K. Williams, “You can’t impeach Trump for being a winner!”","rating":5},{"id":1022097879253635100,"text":"What kind of a lawyer would tape a client? So sad! Is this a first, never heard of it before? Why was the tape so abruptly terminated (cut) while I was presumably saying positive things? I hear there are other clients and many reporters that are taped - can this be so? Too bad!","rating":7},{"id":905383039517282300,"text":"Watching Hurricane closely. My team, which has done, and is doing, such a good job in Texas, is already in Florida. No rest for the weary!","rating":3},{"id":974422724419444700,"text":"Continuing to monitor the heartbreaking bridge collapse at FIU - so tragic. Many brave First Responders rushed in to save lives. Thank you for your courage. Praying this evening for all who are affected.","rating":4},{"id":993455375755173900,"text":"The 13 Angry Democrats in charge of the Russian Witch Hunt are starting to find out that there is a Court System in place that actually protects people from injustice...and just wait ‘till the Courts get to see your unrevealed Conflicts of Interest!","rating":6},{"id":894984126582972400,"text":"After 200 days, rarely has any Administration achieved what we have achieved..not even close! Don't believe the Fake News Suppression Polls!","rating":6},{"id":1209235490026774500,"text":"Nancy Pelosi, who has already lost the House &amp, Speakership once, &amp, is about to lose it again, is doing everything she can to delay the zero Republican vote Articles of Impeachment. She is trying to take over the Senate, &amp, Cryin’ Chuck is trying to take over the trial. No way!....","rating":8},{"id":961368036782628900,"text":"The Budget Agreement today is so important for our great Military. It ends the dangerous sequester and gives Secretary Mattis what he needs to keep America Great. Republicans and Democrats must support our troops and support this Bill!","rating":4},{"id":1103150036907712500,"text":"Hans Von Spakovsky, “I haven’t seen any evidence of actual violations of the law, which is usually a basis before you start an investigation. Adam Schiff seems to be copying Joseph McCarthy in wanting to open up investigations when they don’t have any evidence of wrongdoing.”","rating":5},{"id":1002176736761655300,"text":"Very good meetings with North Korea.","rating":3},{"id":1011602664143106000,"text":"“The most profound question of our era: Was there a conspiracy in the Obama Department of Justice and the FBI to prevent Donald Trump from becoming President of the U.S., and was Strzok at the core of the conspiracy?”  Judge Andrew Napolitano","rating":6},{"id":994346538028675100,"text":"Looking forward to greeting the Hostages (no longer) at 2:00 A.M.","rating":4},{"id":1152910967220691000,"text":"Presidential Harassment!","rating":7},{"id":1146023450001231900,"text":"The Economy is the BEST IT HAS EVER BEEN! Even much of the Fake News is giving me credit for that!","rating":5},{"id":1074407956500889600,"text":"....The Russian Witch Hunt Hoax, started as the “insurance policy” long before I even got elected, is very bad for our Country. They are Entrapping people for misstatements, lies or unrelated things that took place many years ago. Nothing to do with Collusion. A Democrat Scam!","rating":8},{"id":846672219073863700,"text":"Big announcement by Ford today. Major investment to be made in three Michigan plants. Car companies coming back to U.S.  JOBS! JOBS! JOBS!","rating":3},{"id":1167413739320201200,"text":"The disastrous IG Report on James Comey shows, in the strongest of terms, how unfairly I, and tens of millions of great people who support me, were treated. Our rights and liberties were illegally stripped away by this dishonest fool. We should be given our stolen time back?","rating":8},{"id":1271644265890943000,"text":"...of respect for this Holiday, and in observance of this important occasion and all that it represents. I have therefore decided to move our rally to Saturday, June 20th, in order to honor their requests...","rating":2},{"id":1004871827406061600,"text":"Prime Minister Trudeau is being so indignant, bringing up the relationship that the U.S. and Canada had over the many years and all sorts of other things...but he doesn’t bring up the fact that they charge us up to 300% on dairy — hurting our Farmers, killing our Agriculture!","rating":6},{"id":1226875644325265400,"text":"Meeting with U.S. Governors in a short while. All States are doing well. “Thank you Mr. President.”","rating":3}]