[{"id":884361623514656800,"text":"James Comey leaked CLASSIFIED INFORMATION to the media. That is so illegal!","rating":5},{"id":1304060630656311300,"text":"The Democrats never even mentioned the words LAW &amp; ORDER at their National Convention. That’s where they are coming from. If I don’t win, America’s Suburbs will be OVERRUN with Low Income Projects, Anarchists, Agitators, Looters and, of course, “Friendly Protesters”.","rating":8},{"id":818461467766825000,"text":"Ford said last week that it will expand in Michigan and U.S. instead of building a BILLION dollar plant in Mexico. Thank you Ford &amp, Fiat C!","rating":4},{"id":1072312854307582000,"text":"James Comey’s behind closed doors testimony reveals that “there was not evidence of Campaign Collusion” with Russia when he left the FBI. In other words, the Witch Hunt is illegal and should never have been started!","rating":6},{"id":1102934716607578100,"text":"The greatest overreach in the history of our Country. The Dems are obstructing justice and will not get anything done. A big, fat, fishing expedition desperately in search of a crime, when in fact the real crime is what the Dems are doing, and have done!","rating":7},{"id":1121023509029892100,"text":"The Mueller Report, despite being written by Angry Democrats and Trump Haters, and with unlimited money behind it ($35,000,000), didn’t lay a glove on me. I DID NOTHING WRONG. If the partisan Dems ever tried to Impeach, I would first head to the U.S. Supreme Court. Not only......","rating":6},{"id":819962894616064000,"text":"A beautiful funeral today for a real NYC hero, Detective Steven McDonald. Our law enforcement community has my complete and total support.","rating":3},{"id":925474979914887200,"text":"In NYC, looks like another attack by a very sick and deranged person. Law enforcement is following this closely. NOT IN THE U.S.A.!","rating":5},{"id":975720503997620200,"text":"A total WITCH HUNT with massive conflicts of interest!","rating":7},{"id":1323155810910982100,"text":"...As I said at the debate – “Will you remember that Texas?Pennsylvania? Ohio? New Mexico?” I will always protect American Energy and American Jobs! Get out and VOTE #MAGA!","rating":5},{"id":902875515534626800,"text":"The U.S. has been talking to North Korea, and paying them extortion money, for 25 years. Talking is not the answer!","rating":6},{"id":1017466758280679400,"text":"Great success today at NATO! Billions of additional dollars paid by members since my election. Great spirit!","rating":4},{"id":1132187724830482400,"text":"Can’t believe that Rolling Thunder would be given a hard time with permits in Washington, D.C. They are great Patriots who I have gotten to know and see in action. They love our Country and love our Flag. If I can help, I will!","rating":5},{"id":1258803459303891000,"text":"Retired Ice Director Tom Homan knows more about the Border and Border Security than anyone. He’s a tough guy, but a good guy - and as smart as they come. His new book, “Defend The Border and Save Lives: Solving Our Most Important Humanitarian and Security Crisis” is a....","rating":3},{"id":1242826052310794200,"text":"The four hospitals that we (FEMA) are building in NYC at the Javits Convention Center are moving along very well, ahead of schedule. Many additional ventilators also delivered. Good conversation with Governor Cuomo!","rating":2},{"id":981287536520847400,"text":"Was just briefed on the shooting at YouTube’s HQ in San Bruno, California. Our thoughts and prayers are with everybody involved. Thank you to our phenomenal Law Enforcement Officers and First Responders that are currently on the scene.","rating":2},{"id":1074657278974939100,"text":"It is incredible that with a very strong dollar and virtually no inflation, the outside world blowing up around us, Paris is burning and China way down, the Fed is even considering yet another interest rate hike. Take the Victory!","rating":7},{"id":908651641943003100,"text":"ESPN is paying a really big price for its politics (and bad programming). People are dumping it in RECORD numbers. Apologize for untruth!","rating":6},{"id":1177182149050609700,"text":"THE GREATEST SCAM IN THE HISTORY OF AMERICAN POLITICS!","rating":8},{"id":1084788796011491300,"text":"Nancy and Cryin’ Chuck can end the Shutdown in 15 minutes. At this point it has become their, and the Democrats, fault!","rating":7},{"id":893965986566733800,"text":"The United Nations Security Council just voted 15-0 to sanction North Korea. China and Russia voted with us. Very big financial impact!","rating":2},{"id":1156702703239737300,"text":"Very low ratings for the Democratic Debate last night — they’re desperate for Trump!","rating":6},{"id":1009071403918864400,"text":"Democrats are the problem. They don’t care about crime and want illegal immigrants, no matter how bad they may be, to pour into and infest our Country, like MS-13. They can’t win on their terrible policies, so they view them as potential voters!","rating":9},{"id":810988379051610100,"text":"Today there were terror attacks in Turkey, Switzerland and Germany - and it is only getting worse. The civilized world must change thinking!","rating":5},{"id":1086586403583074300,"text":"Will be leaving for Dover to be with the families of 4 very special people who lost their lives in service to our Country!","rating":3},{"id":1102405884016250900,"text":"To the great people of Alabama and surrounding areas: Please be careful and safe. Tornadoes and storms were truly violent and more could be coming. To the families and friends of the victims, and to the injured, God bless you all!","rating":3},{"id":1229888362841985000,"text":"Mini Mike. No, I would rather run against you!","rating":7},{"id":901942677461229600,"text":"HISTORIC rainfall in Houston, and all over Texas. Floods are unprecedented, and more rain coming. Spirit of the people is incredible.Thanks!","rating":4},{"id":1067624656943935500,"text":"Congratulations to Senator Cindy Hyde-Smith on your big WIN in the Great State of Mississippi. We are all very proud of you!","rating":2},{"id":1134066372584063000,"text":"....say he fought back against this phony crime that didn’t exist, this horrendous false accusation, and he shouldn’t fight back, he should just sit back and take it. Could this be Obstruction? No, Mueller didn’t find Obstruction either. Presidential Harassment!","rating":8},{"id":1084788012725166100,"text":"I’ve been waiting all weekend. Democrats must get to work now. Border must be secured!","rating":5},{"id":951788342647107600,"text":"....countries which are doing badly. I want a merit based system of immigration and people who will help take our country to the next level. I want safety and security for our people. I want to stop the massive inflow of drugs. I want to fund our military, not do a Dem defund....","rating":4},{"id":1125351003572797400,"text":"Also, there are “No High Crimes &amp, Misdemeanors,” No Collusion, No Conspiracy, No Obstruction. ALL THE CRIMES ARE ON THE OTHER SIDE, and that’s what the Dems should be looking at, but they won’t. Nevertheless, the tables are turning!","rating":6},{"id":894880193839497200,"text":"After many years of failure,countries are coming together to  finally address the dangers posed by North Korea. We must be tough &amp, decisive!","rating":3},{"id":1163238629730373600,"text":"The New York Times will be out of business soon after I leave office, hopefully in 6 years. They have Zero credibility and are losing a fortune, even now, especially after their massive unfunded liability. I’m fairly certain they’ll endorse me just to keep it all going!","rating":7},{"id":873884774041079800,"text":"The Democrats have no message,  not on economics, not on taxes,  not on jobs, not on failing #Obamacare. They are only OBSTRUCTIONISTS!","rating":5},{"id":1246882848872726500,"text":"I will be having a White House CoronaVirus Task Force meeting in a short while. May or may not do a News Conference after the meeting, depending on new information. Talks &amp; meetings today are proving promising, but a rough two weeks are coming up!","rating":4},{"id":1084117143988461600,"text":"I just watched a Fake reporter from the Amazon Washington Post say the White House is “chaotic, there does not seem to be a strategy for this Shutdown. There is no plan.” The Fakes always like talking Chaos, there is NONE. In fact, there’s almost nobody in the W.H. but me, and...","rating":8},{"id":1115011884154064900,"text":"Secretary of Homeland Security Kirstjen Nielsen will be leaving her position, and I would like to thank her for her service....","rating":2},{"id":804848711599882200,"text":"The President of Taiwan CALLED ME today to wish me congratulations on winning the Presidency. Thank you!","rating":9},{"id":897478270442143700,"text":"For every CEO that drops out of the Manufacturing Council, I have many to take their place. Grandstanders should not have gone on. JOBS!","rating":6},{"id":998196033153839100,"text":"What ever happened to the Server, at the center of so much Corruption, that the Democratic National Committee REFUSED to hand over to the hard charging (except in the case of Democrats) FBI? They broke into homes &amp, offices early in the morning, but were afraid to take the Server?","rating":9},{"id":797812630312382500,"text":"Mitt Romney called to congratulate me on the win. Very nice!","rating":2},{"id":1153420655314002000,"text":"....This was a real compromise in order to give another big victory to our Great Military and Vets!","rating":3},{"id":984759315046322200,"text":"Tremendous pressure is building, like never before, for the Border Wall and an end to crime cradling Sanctuary Cities. Started the Wall in San Diego, where the people were pushing really hard to get it. They will soon be protected!","rating":7},{"id":1289877179791110100,"text":"Was in the Great State of Texas this week and explained that the Radical Left Do Nothing Democrats, headed up by their great leader, Sleepy Joe Biden (who never leaves his basement), are strongly against “Oil, Gas, Guns, &amp; God”. Must be tough to win Texas on that platform!","rating":8},{"id":1101620176947236900,"text":"....and I did not increase their second traunch of Tariffs to 25% on March 1st. This is very important for our great farmers - and me!","rating":5},{"id":1315623184729858000,"text":"The FBI and Law Enforcement must focus their energy on ANTIFA and the Radical Left, those who have spent the summer trying to burn down poorly run Democrat Cities throughout the USA!","rating":7},{"id":1137040975258198000,"text":"...and have no intention of doing anything other than going on a fishing expedition to see if they can find anything on me - both illegal &amp, unprecedented in U.S. history. There was no Collusion - Investigate the Investigators! Go to work on Drug Price Reductions &amp, Infrastructure!","rating":6},{"id":1010156224749408300,"text":"We must maintain a Strong Southern Border. We cannot allow our Country to be overrun by illegal immigrants as the Democrats tell their phony stories of sadness and grief, hoping it will help them in the elections. Obama and others had the same pictures, and did nothing about it!","rating":7},{"id":1133529099530571800,"text":"Back from Japan after a very successful trip. Big progress on MANY fronts. A great country with a wonderful leader in Prime Minister Abe!","rating":2},{"id":1105441310041878500,"text":"“Jewish people are leaving the Democratic Party. We saw a lot of anti Israel policies start under the Obama Administration, and it got worsts &amp, worse. There is anti-Semitism in the Democratic Party. They don’t care about Israel or the Jewish people.” Elizabeth Pipko, Jexodus.","rating":8},{"id":955428815777534000,"text":"Democrats have shut down our government in the interests of their far left base. They don’t want to do it but are powerless!","rating":6},{"id":1079721675346923500,"text":"An all concrete Wall was NEVER ABANDONED, as has been reported by the media. Some areas will be all concrete but the experts at Border Patrol prefer a Wall that is see through (thereby making it possible to see what is happening on both sides). Makes sense to me!","rating":5},{"id":1205459180229935000,"text":"The Republican Party is more united now than at any time in its history - by far!","rating":3},{"id":1142506687020130300,"text":"At the request of Democrats, I have delayed the Illegal Immigration Removal Process (Deportation) for two weeks to see if the Democrats and Republicans can get together and work out a solution to the Asylum and Loophole problems at the Southern Border. If not, Deportations start!","rating":4},{"id":1014151457954811900,"text":"Wow! The NSA has deleted 685 million phone calls and text messages. Privacy violations? They blame technical irregularities. Such a disgrace. The Witch Hunt continues!","rating":7},{"id":1094610433435156500,"text":"African Americans are very angry at the double standard on full display in Virginia!","rating":5},{"id":876558049565188100,"text":"Camp David is a very special place. An honor to have spent the weekend there. Military runs it so well and are so proud of what they do!","rating":2},{"id":1106196590065303600,"text":"Prominent legal scholars agree that our actions to address the National Emergency at the Southern Border and to protect the American people are both CONSTITUTIONAL and EXPRESSLY authorized by Congress....","rating":3},{"id":991644756995444700,"text":"There was no Collusion (it is a Hoax) and there is no Obstruction of Justice (that is a setup &amp, trap). What there is is Negotiations going on with North Korea over Nuclear War, Negotiations going on with China over Trade Deficits, Negotiations on NAFTA, and much more. Witch Hunt!","rating":8},{"id":1230738031985844200,"text":"Great Rally In Colorado. Thank you, will be back soon!","rating":5},{"id":884141905436696600,"text":"For years, even as a \"\"civilian,\"\" I listened as Republicans pushed the Repeal and Replace of ObamaCare. Now they finally have their chance!","rating":6},{"id":1180653341539483600,"text":"The first so-called second hand information “Whistleblower” got my phone conversation almost completely wrong, so now word is they are going to the bench and another “Whistleblower” is coming in from the Deep State, also with second hand info. Meet with Shifty. Keep them coming!","rating":7},{"id":1136149478862254100,"text":"Plagiarism charge against Sleepy Joe Biden on his ridiculous Climate Change Plan is a big problem, but the Corrupt Media will save him. His other problem is that he is drawing flies, not people, to his Rallies. Nobody is showing up, I mean nobody. You can’t win without people!","rating":8},{"id":1234211248373403600,"text":"A Poll in today’s New York Post says that 77% of “U.S. adults have confidence in their government’s ability to handle the Coronavirus (Number One), compared to other health threats.” 64% for Zika, 58% for Ebola. Others way down on list. Our professionals are doing a great job!","rating":4},{"id":1190250133071519700,"text":"Wow, a blowout JOBS number just out, adjusted for revisions and the General Motors strike, 303,000. This is far greater than expectations. USA ROCKS!","rating":4},{"id":1087740160559730700,"text":"Former FBI top lawyer James Baker just admitted involvement in FISA Warrant and further admitted there  were IRREGULARITIES in the way the Russia probe was handled. They relied heavily on the unverified Trump “Dossier” paid for by the DNC &amp, Clinton Campaign, &amp, funded through a...","rating":6},{"id":1139971974854258700,"text":"The Corrupt News Media is totally out of control - they have given up and don’t even care anymore. Mainstream Media has ZERO CREDIBILITY - TOTAL LOSERS!","rating":9},{"id":1068600355225690100,"text":"To the Great people of Alaska. You have been hit hard by a “big one.” Please follow the directions of the highly trained professionals who are there to help you. Your Federal Government will spare no expense. God Bless you ALL!","rating":3},{"id":1305144292109774800,"text":"In the highly competitive world of high tech, how come nobody has ever challenged Mini Mike Bloomberg and his very average, &amp; supposedly outdated, “stuff” that he sells to so many? Did he use his position as Mayor of New York to create what is now a monopoly? Just askin’?","rating":7},{"id":1027032629063893000,"text":"Congratulations to a future STAR of the Republican Party, future Senator John James. A big and bold victory tonight in the Great State of Michigan - the first of many. November can’t come fast enough!","rating":5},{"id":965199840471810000,"text":"Finally, Liddle’ Adam Schiff, the leakin’ monster of no control, is now blaming the Obama Administration for Russian meddling in the 2016 Election. He is finally right about something. Obama was President, knew of the threat, and did nothing. Thank you Adam!","rating":8},{"id":1084627451983073300,"text":"So sorry to hear the news about Jeff Bozo being taken down by a competitor whose reporting, I understand, is far more accurate than the reporting in his lobbyist newspaper, the Amazon Washington Post. Hopefully the paper will soon be placed in better &amp, more responsible hands!","rating":8},{"id":1181969511697789000,"text":"Only 25 percent want the President Impeached, which is pretty low considering the volume of Fake News coverage, but pretty high considering the fact that I did NOTHING wrong. It is all just a continuation of the greatest Scam and Witch Hunt in the history of our Country!","rating":6},{"id":879527520957325300,"text":"Great day for America's future Security and Safety, courtesy of the U.S. Supreme Court. I will keep fighting for the American people, &amp, WIN!","rating":4},{"id":922070659093672000,"text":"Wacky Congresswoman Wilson is the gift that keeps on giving for the Republican Party, a disaster for Dems. You watch her in action &amp, vote R!","rating":7},{"id":1135609956563083300,"text":"As a sign of good faith, Mexico should immediately stop the flow of people and drugs through their country and to our Southern Border. They can do it if they want!","rating":5},{"id":1024347406887014400,"text":"I don’t care what the political ramifications are, our immigration laws and border security have been a complete and total disaster for decades, and there is no way that the Democrats will allow it to be fixed without a Government Shutdown...","rating":6},{"id":1253690189144379400,"text":"Just spoke to President Nayib Bukele of El Salvador. Will be helping them with Ventilators, which are desperately needed. They have worked well with us on immigration at the Southern Border!","rating":4},{"id":837491607171629000,"text":"...to win. The Democrats are overplaying their hand. They lost the election, and now they have lost their grip on reality. The real story...","rating":5},{"id":1178127357212844000,"text":"The only people that don’t like my conversation with the new Ukrainian President are those that heard Rep. Adam Schiff read a made up and totally fraudulent statement to the House and public, words that I did not say but that he fabricated (&amp, admitted to this fabrication). Sick!","rating":8},{"id":1081305634115674100,"text":"The story in the New York Times regarding Jim Webb being considered as the next Secretary of Defense is FAKE NEWS. I’m sure he is a fine man, but I don’t know Jim, and never met him. Patrick Shanahan, who is Acting Secretary of Defense, is doing a great job!","rating":4},{"id":1139161442437992400,"text":"I meet and talk to “foreign governments” every day. I just met with the Queen of England (U.K.), the Prince of Wales, the P.M. of the United Kingdom, the P.M. of Ireland, the President of France and the President of Poland. We talked about “Everything!” Should I immediately....","rating":7},{"id":1090986128805687300,"text":"More troops being sent to the Southern Border to stop the attempted Invasion of Illegals, through large Caravans, into our Country. We have stopped the previous Caravans, and we will stop these also. With a Wall it would be soooo much easier and less expensive. Being Built!","rating":6},{"id":1067142262545674200,"text":"On the ten-year anniversary of the Mumbai terror attack, the U.S. stands with the people of India in their quest for justice. The attack killed 166 innocents, including six Americans. We will never let terrorists win, or even come close to winning!","rating":3},{"id":1114557659527532500,"text":".... against something I knew never existed, Collusion with Russia (so ridiculous!) - No Obstruction. This Russia Hoax must never happen to another President, and Law Enforcement must find out, HOW DID IT START?","rating":6},{"id":1249042796151017500,"text":"“I think the situation is unprecedented, and there is no question about that. It’s whiplash! The economy was moving forward at a rapid pace in terms of growth, jobs and even wage increases, and all of a sudden the pandemic hit and the....","rating":2},{"id":1090963161942032400,"text":"Republicans on the Homeland Security Committee are wasting their time. Democrats, despite all of the evidence, proof and Caravans coming, are not going to give money to build the DESPERATELY needed WALL. I’ve got you covered. Wall is already being built, I don’t expect much help!","rating":5},{"id":1029010124881453000,"text":"While I know it’s “not presidential” to take on a lowlife like Omarosa, and while I would rather not be doing so, this is a modern day form of communication and I know the Fake News Media will be working overtime to make even Wacky Omarosa look legitimate as possible. Sorry!","rating":9},{"id":1065581119242940400,"text":"Justice Roberts can say what he wants, but the 9th Circuit is a complete &amp, total disaster. It is out of control, has a horrible reputation, is overturned more than any Circuit in the Country, 79%, &amp, is used to get an almost guaranteed result. Judges must not Legislate Security...","rating":6},{"id":1138788269255274500,"text":"Wow! Just got word that our June 18th, Tuesday, ANNOUNCEMENT in Orlando, Florida, already has 74,000 requests for a 20,000 seat Arena. With all of the big events that we have done, this ticket looks to be the “hottest” of them all. See you in Florida!","rating":5},{"id":1105789862853128200,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1290692768675901400,"text":"Whether you call it Vote by Mail or Absentee Voting, in Florida the election system is Safe and Secure, Tried and True. Florida’s Voting system has been cleaned up (we defeated Democrats attempts at change), so in Florida I encourage all to request a Ballot &amp; Vote by Mail! #MAGA","rating":4},{"id":1125069835044573200,"text":"For 10 months, China has been paying Tariffs to the USA of 25% on 50 Billion Dollars of High Tech, and 10% on 200 Billion Dollars of other goods. These payments are partially responsible for our great economic results. The 10% will go up to 25% on Friday. 325 Billions Dollars....","rating":5},{"id":982954355509907500,"text":"President Xi and I will always be friends, no matter what happens with our dispute on trade. China will take down its Trade Barriers because it is the right thing to do. Taxes will become Reciprocal &amp, a deal will be made on Intellectual Property. Great future for both countries!","rating":4},{"id":1155941248705761300,"text":"Just remember, the Iranians never won a war, but never lost a negotiation!","rating":7},{"id":875682853585129500,"text":"After 7 months of investigations &amp, committee hearings about my \"\"collusion with the Russians,\"\"  nobody has been able to show any proof. Sad!","rating":6},{"id":1136673237470011400,"text":"So sorry to hear about the terrible accident involving our GREAT West Point Cadets. We mourn the loss of life and pray for the injured. God Bless them ALL!","rating":2},{"id":812450976670122000,"text":"Vladimir Putin said today about Hillary and Dems: \"\"In my opinion, it is humiliating. One must be able to lose with dignity.\"\"  So true!","rating":5},{"id":1038799859128696800,"text":"Wow, NFL first game ratings are way down over an already really bad last year comparison. Viewership declined 13%, the lowest in over a decade. If the players stood proudly for our Flag and Anthem, and it is all shown on broadcast, maybe ratings could come back? Otherwise worse!","rating":6},{"id":990926480329859100,"text":"The White House Correspondents’ Dinner is DEAD as we know it. This was a total disaster and an embarrassment to our great Country and all that it stands for. FAKE NEWS is alive and well and beautifully represented on Saturday night!","rating":7},{"id":1036024775154565100,"text":"We shouldn’t have to buy our friends with bad Trade Deals and Free Military Protection!","rating":5},{"id":1098676390780719100,"text":"Senator John Cornyn has done an outstanding job for the people of Texas. He is strong on Crime, the Border, the Second Amendment and loves our Military and Vets. John has my complete and total endorsement. MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1069588404172726300,"text":"We would save Billions of Dollars if the Democrats would give us the votes to build the Wall. Either way, people will NOT be allowed into our Country illegally! We will close the entire Southern Border if necessary. Also, STOP THE DRUGS!","rating":8},{"id":1157987941182034000,"text":"The FBI, local and state law enforcement are working together in El Paso and in Dayton, Ohio. Information is rapidly being accumulated in Dayton. Much has already be learned in El Paso. Law enforcement was very rapid in both instances. Updates will be given throughout the day!","rating":4},{"id":1321083351000862700,"text":"Big GDP projected. Pelosi only looking to Bail Out badly run Democrat Cities. Tap, Tap, Taping us along. She has little interest in helping out the “people”.","rating":6},{"id":1063591994738516000,"text":"Congratulations to Brian Kemp on becoming the new Governor of Georgia. Stacey Abrams fought brilliantly and hard - she will have a terrific political future! Brian was unrelenting and will become a great Governor for the truly Wonderful People of Georgia!","rating":3},{"id":1300428128309907500,"text":"The Radical Left Mayors &amp;  Governors of Cities where this crazy violence is taking place have lost control of their “Movement”. It wasn’t supposed to be like this, but the Anarchists &amp; Agitators got carried away and don’t listen anymore - even forced Slow Joe out of basement!","rating":7},{"id":846166053663191000,"text":"General Kelly is doing a great job at the border. Numbers are way down. Many are not even trying to come in anymore.","rating":4},{"id":1283566320802553900,"text":"...be on the way, and Americans want safe streets and communities!","rating":2},{"id":1059464880955277300,"text":"So funny to see the CNN Fake Suppression Polls and false rhetoric. Watch for real results Tuesday. We are lucky CNN’s ratings are so low. Don’t fall for the Suppression Game. Go out &amp, VOTE. Remember, we now have perhaps the greatest Economy (JOBS) in the history of our Country!","rating":8},{"id":1103662776424132600,"text":"It was not a campaign contribution, and there were no violations of the campaign finance laws by me. Fake News!","rating":5},{"id":1183899559124189200,"text":"Shifty Schiff now seems to think they don’t need the Whistleblower, who started the whole Scam. The reason is that the Whistleblower has lost all credibility because the story is so far from the facts on the Transcript. Also, the second Whistleblower is no longer even mentioned!","rating":6},{"id":1117751619469361200,"text":"Congress should come back to D.C. now and FIX THE IMMIGRATION LAWS!","rating":3},{"id":1016693575344504800,"text":"I am on Air Force One flying to NATO and hear reports that the FBI lovers, Peter Strzok and Lisa Page are getting cold feet on testifying about  the Rigged Witch Hunt headed by 13 Angry Democrats and people that worked for Obama for 8 years. Total disgrace!","rating":7},{"id":888730468732067800,"text":"My son Donald openly gave his e-mails to the media &amp, authorities whereas Crooked Hillary Clinton deleted (&amp, acid washed) her 33,000 e-mails!","rating":6},{"id":865573793531478000,"text":"Getting ready for my big foreign trip. Will be strongly protecting American interests - that's what I like to do!","rating":4},{"id":1315665495383781400,"text":"November 3rd. will be the most exciting day in U.S. Election History, even more so than 2016. Tremendous excitement and enthusiasm, like perhaps never seen before. Nobody showing up to Sleepy Joe Rallies. Places are DEAD. Stiff!!! See you in Florida tonight.","rating":9},{"id":884740553040175100,"text":"Working hard to get the Olympics for the United States (L.A.). Stay tuned!","rating":3},{"id":1107273645196537900,"text":"....must stay strong and fight back with vigor. Stop working soooo hard on being politically correct, which will only bring you down, and continue to fight for our Country. The losers all want what you have, don’t give it to them. Be strong &amp, prosper, be weak &amp, die! Stay true....","rating":7},{"id":963365328716812300,"text":"Negotiations on DACA have begun. Republicans want to make a deal and Democrats say they want to make a deal. Wouldn’t it be great if we could finally, after so many years, solve the DACA puzzle. This will be our last chance, there will never be another opportunity! March 5th.","rating":4},{"id":1071159669949911000,"text":"It is being reported that Leakin' James Comey was told by Department of Justice attorneys not to answer the most important questions. Total bias and corruption at the highest levels of previous Administration. Force him to answer the questions under oath!","rating":6},{"id":1113089157683953700,"text":"After many years (decades), Mexico is apprehending large numbers of people at their Southern Border, mostly from Guatemala, Honduras and El Salvador. They have ALL been taking U.S. money for years, and doing ABSOLUTELY NOTHING for us, just like the Democrats in Congress!","rating":5},{"id":1079900120047603700,"text":"MEXICO IS PAYING FOR THE WALL through the many billions of dollars a year that the U.S.A. is saving through the new Trade Deal, the USMCA, that will replace the horrendous NAFTA Trade Deal, which has so badly hurt our Country. Mexico &amp, Canada will also thrive - good for all!","rating":6},{"id":1155792447429054500,"text":"Baltimore, under the leadership of Elijah Cummings, has the worst Crime Statistics in the Nation. 25 years of all talk, no action! So tired of listening to the same old Bull...Next, Reverend Al will show up to complain &amp, protest. Nothing will get done for the people in need. Sad!","rating":8},{"id":1202435069413118000,"text":"When I said, in my phone call to the President of Ukraine, “I would like you to do US a favor though because our country has been through a lot and Ukraine knows a lot about it.” With the word “us” I am referring to the United States, our Country. I then went on to say that......","rating":5},{"id":1161377272391229400,"text":"It always happens! When a Conservative does even a fraction of what Chris Cuomo did with his lunatic ranting, raving, &amp, cursing, they get destroyed by the Fake News. But when a Liberal Democrat like Chris Cuomo does it, Republicans immediately come to his defense. We never learn!","rating":7},{"id":989813047773614100,"text":"Is everybody believing what is going on. James Comey can’t define what a leak is. He illegally leaked CLASSIFIED INFORMATION but doesn’t understand what he did or how serious it is. He lied all over the place to cover it up. He’s either very sick or very dumb. Remember sailor!","rating":8},{"id":1033723516116500500,"text":"Fantastic numbers on consumer spending released on Friday. Stock Market hits all time high!","rating":3},{"id":1233220106324451300,"text":"Congratulations and thank you to our great Vice President &amp; all of the many professionals doing such a fine job at CDC &amp; all other agencies on the Coronavirus situation. Only a very small number in U.S., &amp; China numbers look to be going down. All countries working well together!","rating":3},{"id":1299471584336330800,"text":"Landing in New Hampshire!","rating":1},{"id":1153286989053079600,"text":"Highly conflicted Robert Mueller should not be given another bite at the apple. In the end it will be bad for him and the phony Democrats in Congress who have done nothing but waste time on this ridiculous Witch Hunt. Result of the Mueller Report, NO COLLUSION, NO OBSTRUCTION!...","rating":6},{"id":1089339681941147600,"text":"....about all of the one sided Fake Media coverage (collusion with Crooked H?) that I had to endure during my very successful presidential campaign. What about the now revealed bias by Facebook and many others. Roger Stone didn’t even work for me anywhere near the Election!","rating":5},{"id":824228768227217400,"text":"even, those registered to vote who are dead (and many for a long time). Depending on results, we will strengthen up voting procedures!","rating":4},{"id":1171452880055746600,"text":"I informed John Bolton last night that his services are no longer needed at the White House. I disagreed strongly with many of his suggestions, as did others in the Administration, and therefore....","rating":4},{"id":1037171035152506900,"text":"Sleepy Eyes Chuck Todd of Fake NBC News said it’s time for the Press to stop complaining and to start fighting back. Actually Chuck, they’ve been doing that from the day I announced for President. They’ve gone all out, and I WON, and now they’re going CRAZY!","rating":7},{"id":1072614269773119500,"text":"Thanks to Leader McConnell for agreeing to bring a Senate vote on Criminal Justice this week! These historic changes will make communities SAFER and SAVE tremendous taxpayers dollars. It brings much needed hope to many families during the Holiday Season.","rating":2},{"id":1238823680735613000,"text":"Attending meetings on Covid-19 in the White House. Working with States and local governments, many of whom have done a great job. Full report latter!","rating":2},{"id":1235295497008672800,"text":"Pandering Mini Mike Bloomberg, along with his wacky friend, Tom Steyer, have found out the hard way that you can’t buy the election! They both wish they had it to do over again!","rating":8},{"id":834916167177371600,"text":"Seven people shot and killed yesterday in Chicago. What is going on there - totally out of control. Chicago needs help!","rating":4},{"id":1323326204384964600,"text":"Biden was a pathetic laughing stock all over Washington for the horrible way he handled the H1N1 Swine Flu. Even his own Chief of Staff said he didn’t know what he was doing!","rating":6},{"id":1107029377123057700,"text":"How is the Paris Environmental Accord working out for France? After 18 weeks of rioting by the Yellow Vest Protesters, I guess not so well! In the meantime, the United States has gone to the top of all lists on the Environment.","rating":6},{"id":1080177487517233200,"text":"Border Security and the Wall “thing” and Shutdown is not where Nancy Pelosi wanted to start her tenure as Speaker! Let’s make a deal?","rating":7},{"id":1239620630523322400,"text":"Just had a  very good tele-conference with Nation’s Governors. Went very well. Cuomo of New York has to “do more”.","rating":2},{"id":966687491616059400,"text":"Will be meeting with Lawmakers today at 11:30 A.M. to discuss School Safety.  Next week it will be with our Nation’s Governors. It’s been many years of all talk, no action. We’ll get it done!","rating":3},{"id":1159260904631836700,"text":"Leaving El Paso for the White House. What GREAT people I met there and in Dayton, Ohio. The Fake News worked overtime trying to disparage me and the two trips, but it just didn’t work. The love, respect &amp, enthusiasm were there for all to see. They have been through so much. Sad!","rating":5},{"id":1145121683193421800,"text":"The highly respected Farm Journal has just announced my Approval Rating with our great Farmers at 74%, and that despite all of the Fake &amp, Corrupt News that they are forced to endure. Farmers have been unfairly treated for many years - and that is turning around FAST!","rating":4},{"id":1000741764565753900,"text":"Why didn’t the 13 Angry Democrats investigate the campaign of Crooked Hillary Clinton, many crimes, much Collusion with Russia? Why didn’t the FBI take the Server from the DNC?  Rigged Investigation!","rating":8},{"id":908642277987356700,"text":"Another attack in London by a loser terrorist.These are sick and demented people who were in the sights of Scotland Yard. Must be proactive!","rating":5},{"id":1126821318861697000,"text":"Build your products in the United States and there are NO TARIFFS!","rating":5},{"id":1129340814080041000,"text":"DRAIN THE SWAMP!","rating":8},{"id":1245726411526221800,"text":".....Could be as high as 15 Million Barrels. Good (GREAT) news for everyone!","rating":6},{"id":917341511754436600,"text":"Our country has been unsuccessfully dealing with North Korea for 25 years, giving billions of dollars &amp, getting nothing. Policy didn't work!","rating":5},{"id":1162495014037049300,"text":"Like it or not, Tlaib and Omar are fast becoming the face of the Democrat Party. Cortez (AOC) is fuming, not happy about this!","rating":7},{"id":1106634711290531800,"text":"Just spoke with Jacinda Ardern, the Prime Minister of New Zealand, regarding the horrific events that have taken place over the past 24 hours. I informed the Prime Minister....","rating":4},{"id":1278324681477689300,"text":"....horrible BLM chant, “Pigs In A Blanket, Fry ‘Em Like Bacon”. Maybe our GREAT Police, who have been neutralized and scorned by a mayor who hates &amp; disrespects them, won’t let this symbol of hate be affixed to New York’s greatest street. Spend this money fighting crime instead!","rating":8},{"id":926401530013642800,"text":"My Twitter account was taken down for 11 minutes by a rogue employee. I guess the word must finally be getting out-and having an impact.","rating":6},{"id":1102920338529288200,"text":"Now that they realize the only Collusion with Russia was done by Crooked Hillary Clinton &amp, the Democrats, Nadler, Schiff and the Dem heads of the Committees have gone stone cold CRAZY. 81 letter sent to innocent people to harass them. They won’t get ANYTHING done for our Country!","rating":7},{"id":1021020863733420000,"text":"I had a GREAT meeting with Putin and the Fake News used every bit of their energy to try and disparage it. So bad for our country!","rating":6},{"id":966660169194229800,"text":"....If a potential “sicko shooter” knows that a school has a large number of very weapons talented teachers (and others) who will be instantly shooting, the sicko will NEVER attack that school. Cowards won’t go there...problem solved. Must be offensive, defense alone won’t work!","rating":8},{"id":1121048120312389600,"text":"No Collusion, No Obstruction - there has NEVER been a President who has been more transparent. Millions of pages of documents were given to the Mueller Angry Dems, plus I allowed everyone to testify, including W.H. counsel. I didn’t have to do this, but now they want more.....","rating":7},{"id":1246123536143573000,"text":"Highly respected Justice Daniel Kelly is running for the Supreme Court in the Great State of Wisconsin. Justice Kelly has been doing a terrific job upholding the Rule of Law and defending your #2A. Tough on Crime, Loves our Military and our Vets. He has my Complete Endorsement!","rating":3},{"id":1254477491642732500,"text":"....schedule and eating habits, written by a third rate reporter who knows nothing about me. I will often be in the Oval Office late into the night &amp; read &amp; see that I am angrily eating a hamburger &amp; Diet Coke in my bedroom. People with me are always stunned. Anything to demean!","rating":6},{"id":1093869087908941800,"text":"The mainstream media has refused to cover the fact that the head of the VERY important Senate Intelligence Committee, after two years of intensive study and access to Intelligence that only they could get, just stated that they have found NO COLLUSION between “Trump” &amp, Russia....","rating":5},{"id":1135361632840716300,"text":"BIG NEWS! As I promised two weeks ago, the first shipment of LNG has just left the Cameron LNG Export Facility in Louisiana. Not only have thousands of JOBS been created in USA, we’re shipping freedom and opportunity abroad!","rating":4},{"id":951094078661414900,"text":"It just shows everyone how broken and unfair our Court System is when the opposing side in a case (such as DACA) always runs to the 9th Circuit and almost always wins before being reversed by higher courts.","rating":5},{"id":1114156288555016200,"text":"Heading to the Southern Border to show a section of the new Wall being built! Leaving now!","rating":2},{"id":948738634722742300,"text":"Stock Market had another good day but, now that the Tax Cut Bill has passed, we have tremendous upward potential. Dow just short of 25,000, a number that few thought would be possible this soon into my administration. Also, unemployment went down to 4.1%. Only getting better!","rating":3},{"id":1067404517841518600,"text":"....terrible Gang of Angry Democrats. Look at their past, and look where they come from. The now $30,000,000 Witch Hunt continues and they’ve got nothing but ruined lives. Where is the Server? Let these terrible people go back to the Clinton Foundation and “Justice” Department!","rating":9},{"id":1185534210196627500,"text":"#StopTheCoup","rating":6},{"id":1006837823469736000,"text":"Just landed - a long trip, but everybody can now feel much safer than the day I took office. There is no longer a Nuclear Threat from North Korea. Meeting with Kim Jong Un was an interesting and very positive experience. North Korea has great potential for the future!","rating":5},{"id":1080616637932421100,"text":"...I remain ready and willing to work with Democrats to pass a bill that secures our borders, supports the agents and officers on the ground, and keeps America Safe. Let’s get it done!","rating":3},{"id":881137079958241300,"text":"Numerous states are refusing to give information to the very distinguished VOTER FRAUD PANEL. What are they trying to hide?","rating":7},{"id":1086074701313536000,"text":"Thank you to Amy Kremer, Women for Trump Co-Founder, for doing such a great interview with Martha MacCallum...and by the way, women have the lowest unemployment numbers in many decades - at the highest pay ever. Proud of that!","rating":4},{"id":1177560985441362000,"text":"Rep. Adam Schiff fraudulently read to Congress, with millions of people watching, a version of my conversation with the President of Ukraine that doesn’t exist. He was supposedly reading the exact transcribed version of the call, but he completely changed the words to make it...","rating":8},{"id":1013037916216614900,"text":"I will be making my choice for Justice of the United States Supreme Court on the first Monday after the July 4th Holiday, July 9th!","rating":2},{"id":1243564774182568000,"text":"Will someone please explain to the Fake News New York Times (ALL THE NEWS THAT’S NOT FIT TO PRINT) that the Democrats make it almost impossible for us to fill positions within government. They “maximum” delay even the best candidates, including Judges, leaving little time!","rating":6},{"id":1104499701016133600,"text":"I hope the grandstanding Governor of California is able to spend his very highly taxed citizens money on asylum holds more efficiently than money has been spent on the so-called Fast Train, which is $Billions over budget &amp, in total disarray. Time to reduce taxes in California!","rating":5},{"id":1181033358794662000,"text":"Nancy Pelosi knew of all of the many Shifty Adam Schiff lies and massive frauds perpetrated upon Congress and the American people, in the form of a fraudulent speech knowingly delivered as a ruthless con, and the illegal meetings with a highly partisan “Whistleblower” &amp, lawyer...","rating":7},{"id":892366646542782500,"text":"Stock Market could hit all-time high (again) 22,000 today. Was 18,000 only 6 months ago on Election Day. Mainstream media seldom mentions!","rating":5},{"id":1016754517415624700,"text":"A recent Emerson College ePoll said that most Americans, especially Hispanics, feel that they are better off under President Trump than they were under President Obama.","rating":3},{"id":325999319515791360,"text":"NO MERCY TO TERRORISTS you dumb bastards!","rating":8},{"id":1011226622324887600,"text":"Such a difference in the media coverage of the same immigration policies between the Obama Administration and ours. Actually, we have done a far better job in that our facilities are cleaner and better run than were the facilities under Obama. Fake News is working overtime!","rating":4},{"id":1134057302821150700,"text":"The Greatest Presidential Harassment in history. After spending $40,000,000 over two dark years, with unlimited access, people, resources and cooperation, highly conflicted Robert Mueller would have brought charges, if he had ANYTHING, but there were no charges to bring!","rating":7},{"id":1028354010129027100,"text":"....Do you believe Nelly worked for Fusion and her husband STILL WORKS FOR THE DEPARTMENT OF “JUSTICE.” I have never seen anything so Rigged in my life. Our A.G. is scared stiff and Missing in Action. It is all starting to be revealed - not pretty. IG Report soon?  Witch Hunt!","rating":6},{"id":1165918301932916700,"text":"The story by Axios that President Trump wanted to blow up large hurricanes with nuclear weapons prior to reaching shore is ridiculous. I never said this. Just more FAKE NEWS!","rating":9},{"id":817071792711942100,"text":"Toyota Motor said will build a new plant in Baja, Mexico, to build Corolla cars for U.S. NO WAY! Build plant in U.S. or pay big border tax.","rating":6},{"id":1186768817822806000,"text":"Good news seems to be happening with respect to Turkey, Syria and the Middle East. Further reports to come later!","rating":2},{"id":824615820391305200,"text":"The U.S. has a 60 billion dollar trade deficit with Mexico. It has been a one-sided deal from the beginning of NAFTA with massive numbers...","rating":3},{"id":983774270886236200,"text":"Very thankful for President Xi of China’s kind words on tariffs and automobile barriers...also, his enlightenment on intellectual property and technology transfers. We will make great progress together!","rating":4},{"id":902885560552960000,"text":"After reading the false reporting and even ferocious anger in some dying magazines, it makes me wonder, WHY? All I want to do is #MAGA!","rating":6},{"id":990782291667488800,"text":"The White House Correspondents’ Dinner was a failure last year, but this year was an embarrassment to everyone associated with it. The filthy “comedian” totally bombed (couldn’t even deliver her lines-much like the Seth Meyers weak performance). Put Dinner to rest, or start over!","rating":7},{"id":1303832551241416700,"text":"On top of a lie made up by a low-life “reporter”, who is known for disinformation, the Democrats have taken his false words and put them into a TV commercial. We now have 21 witnesses stating that the story is a BIG LIE. Even Biden admits this may not be true...","rating":8},{"id":1132459370816708600,"text":"North Korea fired off some small weapons, which disturbed some of my people, and others, but not me. I have confidence that Chairman Kim will keep his promise to me, &amp, also smiled when he called Swampman Joe Biden a low IQ individual, &amp, worse. Perhaps that’s sending me a signal?","rating":9},{"id":938786402992578600,"text":"National Pearl Harbor Remembrance Day - “A day that will live in infamy!” December 7, 1941","rating":3},{"id":912443607084404700,"text":"General John Kelly totally agrees w/ my stance on NFL players and the fact that they should not be disrespecting our FLAG or GREAT COUNTRY!","rating":5},{"id":1072564293302976500,"text":"James Comey just totally exposed his partisan stance by urging his fellow Democrats to take back the White House in 2020. In other words, he is and has been a Democrat. Comey had no right heading the FBI at any time, but especially after his mind exploded!","rating":8},{"id":1032358618576900100,"text":"Longest bull run in the history of the stock market, congratulations America!","rating":4},{"id":1010115331380203500,"text":"Elect more Republicans in  November and we will pass the finest, fairest and most comprehensive Immigration Bills anywhere in the world. Right now we have the dumbest and the worst. Dems are doing nothing but Obstructing. Remember their motto, RESIST! Ours is PRODUCE!","rating":7},{"id":1130433205537038300,"text":"The Failing New York Times (it will pass away when I leave office in 6 years), and others of the Fake News Media, keep writing phony stories about how I didn’t use many banks because they didn’t want to do business with me. WRONG! It is because I didn’t need money. Very old","rating":8},{"id":803692055897788400,"text":"My thoughts and prayers are with the great people of Tennessee during these terrible wildfires. Stay safe!","rating":3},{"id":1145709384963645400,"text":"Congratulations to Prime Minister Abe of Japan for hosting such a fantastic and well run G-20. There wasn’t a thing that was missing or a mistake that was made. PERFECT! The people of Japan must be very proud of their Prime Minister.","rating":2},{"id":1214333364997697500,"text":"....If however, the city or state in question is willing to acknowledge responsibility, and politely asks for help from the Federal Government, we will very seriously consider getting involved in order to make those poorly run Democrat Cities Great Again!","rating":5},{"id":869164414662049800,"text":"Honoring the men and women who made the ultimate sacrifice in service to America. Home of the free, because of the brave. #MemorialDay🇺🇸","rating":2},{"id":255294883680632830,"text":"Got to do something about these missing chidlren grabbed by the perverts. Too many incidents--fast trial, death penalty.","rating":9},{"id":1315311656776409000,"text":"In 2016, the ABC News/Washington Post Poll was such a complete disaster that these two Fake News Organizations changed the numbers prior to the Election. Now these haters are trying the same thing, though on a lesser scale, again. Will have a bigger win than even 2016!","rating":7},{"id":887477071160762400,"text":"The Fake News is becoming more and more dishonest! Even a dinner arranged for top 20 leaders in Germany is made to look sinister!","rating":6},{"id":1056299896406450200,"text":"All of America is in mourning over the mass murder of Jewish Americans at the Tree of Life Synagogue in Pittsburgh. We pray for those who perished and their loved ones, and our hearts go out to the brave police officers who sustained serious injuries...","rating":2},{"id":982682227581636600,"text":"We are sealing up our Southern Border. The people of our great country want Safety and Security. The Dems have been a disaster on this very important issue!","rating":6},{"id":1284255474691575800,"text":"....Tax Returns. She’s a mess! Many books have been written about me, some good, some bad. Both happily and sadly, there will be more to come!","rating":5},{"id":1097835706024644600,"text":"Had the opposition party (no, not the Media) won the election, the Stock Market would be down at least 10,000 points by now. We are heading up, up, up!","rating":6},{"id":825822320128303100,"text":"The joint statement of former presidential candidates John McCain &amp, Lindsey Graham is wrong - they are sadly weak on immigration. The two...","rating":4},{"id":961557382387167200,"text":"Will be heading over shortly to make remarks at The National Prayer Breakfast in Washington. Great religious and political leaders, and many friends, including T.V. producer Mark Burnett of our wonderful 14 season Apprentice triumph, will be there. Looking forward to seeing all!","rating":3},{"id":1315638896550576000,"text":"SO MUCH FAKE NEWS! The Lamestream Media has gone absolutely insane because they realize we are winning BIG in all of the polls that matter. They write or show one false story after another. They are truly sick people. VOTE!!!","rating":9},{"id":1301165073583534000,"text":"Will soon be heading to Wilmington, North Carolina, and then will be going to Battleship North Carolina. Look forward to seeing all of my friends!","rating":3},{"id":1112727122177609700,"text":"No matter what information is given to the crazed Democrats from the No Collusion Mueller Report, it will never be good enough. Behind closed doors the Dems are laughing!","rating":7},{"id":1019376680572457000,"text":"The meeting between President Putin and myself was a great success, except in the Fake News Media!","rating":5},{"id":991843153953964000,"text":"As everybody is aware, the past Administration has long been asking for three hostages to be released from a North Korean Labor camp, but to no avail. Stay tuned!","rating":4},{"id":1263113203749453800,"text":"Now that our Country is “Transitioning back to Greatness”, I am considering rescheduling the G-7, on the same or similar date, in Washington, D.C., at the legendary Camp David. The other members are also beginning their COMEBACK. It would be a great sign to all - normalization!","rating":6},{"id":985483513704124400,"text":"Unbelievably, James Comey states that Polls, where Crooked Hillary was leading, were a factor in the handling (stupidly) of the Clinton Email probe. In other words, he was making decisions based on the fact that he thought she was going to win, and he wanted a job. Slimeball!","rating":8},{"id":942827072824672300,"text":"The train accident that just occurred in DuPont, WA shows more than ever why our soon to be submitted infrastructure plan must be approved quickly. Seven trillion dollars spent in the Middle East while our roads, bridges, tunnels, railways (and more) crumble! Not for long!","rating":6},{"id":963362959463469000,"text":"Our infrastructure plan has been put forward and has received great reviews by everyone except, of course, the Democrats. After many years we have taken care of our Military, now we have to fix our roads, bridges, tunnels, airports and more. Bipartisan, make deal Dems?","rating":5},{"id":1221764212873224200,"text":"The Democrat controlled House never even asked John Bolton to testify. It is up to them, not up to the Senate!","rating":4},{"id":1091173536163602400,"text":"Nellie Ohr, the wife of DOJ official Bruce Ohr, was long ago investigating for pay (GPS Fusion) members of my family, feeding it to her husband who was then giving it to the FBI, even though it was created by ousted &amp, discredited Christopher Steele. Illegal! WITCH HUNT","rating":7},{"id":1173300571379503000,"text":"I am fighting the Fake (Corrupt) News, the Deep State, the Democrats, and the few remaining Republicans In Name Only (RINOS, who are on mouth to mouth resuscitation), with the help of some truly great Republicans, and others. We are Winning big (150th Federal Judge this week)!","rating":7},{"id":833783438922629100,"text":"Just named General H.R. McMaster National Security Advisor.","rating":3},{"id":1153854621783400400,"text":"So Robert Mueller has now asked for his long time Never Trumper lawyer to sit beside him and help with answers. What’s this all about? His lawyer represented the “basement server guy” who got off free in the Crooked Hillary case. This should NOT be allowed. Rigged Witch Hunt!","rating":9},{"id":1086265436138807300,"text":"Another big Caravan heading our way. Very hard to stop without a Wall!","rating":6},{"id":1177357844062097400,"text":"The President of Ukraine said that he was NOT pressured by me to do anything wrong. Can’t have better testimony than that! As V.P., Biden had his son, on the other hand, take out millions of dollars by strong arming the Ukrainian President. Also looted millions from China. Bad!","rating":8},{"id":994585463380987900,"text":"Senator Cryin’ Chuck Schumer fought hard against the Bad Iran Deal, even going at it with President Obama, &amp, then Voted AGAINST it! Now he says I should not have terminated the deal - but he doesn’t really believe that! Same with Comey. Thought he was terrible until I fired him!","rating":7},{"id":1082626249984491500,"text":"“The President is the biggest and best supporter of the Steel Industry in many years. We are now doing really well. The Tariffs let us compete. Was unfair that the Steel Industry lost its jobs to unfair trade laws. Very positive outcome.” Mark Glyptis, United Steelworkers","rating":3},{"id":1252260074782888000,"text":"... “Testing, Testing, Testing,” again playing a very dangerous political game. States, not the Federal Government, should be doing the Testing - But we will work with the Governors and get it done. This is easy compared to the fast production of thousands of complex Ventilators!","rating":5},{"id":1257041820124680200,"text":"....Fake News got it wrong again, as always, and tens of thousands of lives were saved by my EARLY BAN of China into our Country. The people that we’re allowed were heavily scrutinized and tested U.S. citizens, and as such, I welcome them with open arms!","rating":5},{"id":835946001873657900,"text":"Big dinner with Governors tonight at White House. Much to be discussed, including healthcare.","rating":2},{"id":1193131455796404200,"text":"Fake News is reporting that I am talking to Mark Burnett about doing a big show, perhaps The Apprentice, after the presidency, which I would assume they mean in 5 years. This is not true, never had such a conversation, don’t even have time to think about it. False reporting!","rating":6},{"id":819164172781060100,"text":"Intelligence agencies should never have allowed this fake news to \"\"leak\"\" into the public. One last shot at me.Are we living in Nazi Germany?","rating":9},{"id":898254409511129100,"text":"Study what General Pershing of the United States did to terrorists when caught. There was no more Radical Islamic Terror for 35 years!","rating":8},{"id":1032948187416416300,"text":"Ex-NSA contractor to spend 63 months in jail over “classified” information. Gee, this is “small potatoes” compared to what Hillary Clinton did! So unfair Jeff, Double Standard.","rating":6},{"id":972853747750711300,"text":"Rasmussen and others have my approval ratings at around 50%, which is higher than Obama, and yet the political pundits love saying my approval ratings are “somewhat low.” They know they are lying when they say it. Turn off the show - FAKE NEWS!","rating":7},{"id":1011975204778729500,"text":"Supreme Court rules in favor of non-union workers who are now, as an example, able to support a candidate of his or her choice without having those who control the Union deciding for them. Big loss for the coffers of the Democrats!","rating":6},{"id":1283566319405797400,"text":"...campaign. Both were heavily involved in our historic 2016 win, and I look forward to having a big and very important second win together. This one should be a lot easier as our poll numbers are rising fast, the economy is getting better, vaccines and therapeutics will soon...","rating":4},{"id":1063517548258447400,"text":"People are not being told that the Republican Party is on track to pick up two seats in the U.S. Senate, and epic victory: 53 to 47. The Fake News Media only wants to speak of the House, where the Midterm results were better than other sitting Presidents.","rating":5},{"id":797822192931262500,"text":"Jeb Bush, George W and George H.W. all called to express their best wishes on the win. Very nice!","rating":3},{"id":1304236582300348400,"text":"On November 3rd, Michigan will decide whether we will quickly return to record prosperity—or whether we allow Sleepy Joe Biden to impose a $4 TRILLION DOLLAR TAX HIKE, ban American Energy, confiscate your guns, shutdown the economy, shutdown auto production, delay...","rating":7},{"id":988415011382091800,"text":"Mexico, whose laws on immigration are very tough, must stop people from going through Mexico and into the U.S. We may make this a condition of the new NAFTA Agreement. Our Country cannot accept what is happening! Also, we must get Wall funding fast.","rating":5},{"id":1084464695904530400,"text":"Democrats are saying that DACA is not worth it and don’t want to include in talks. Many Hispanics will be coming over to the Republican side, watch!","rating":6},{"id":1043500433271066600,"text":"New Economic Records being set on a daily basis - and it is not by accident!","rating":4},{"id":925910265060831200,"text":"The United States will be immediately implementing much tougher Extreme Vetting Procedures. The safety of our citizens comes first!","rating":5},{"id":1054088531629490200,"text":"The Caravans are a disgrace to the Democrat Party. Change the immigration laws NOW!","rating":6},{"id":1263600798056906800,"text":"....On Monday, the flags will be at half-staff in honor of the men and women in our Military who have made the Ultimate Sacrifice for our Nation.","rating":3},{"id":1021341698734030800,"text":"So we now find out that it was indeed the unverified and Fake Dirty Dossier, that was paid for by Crooked Hillary Clinton and the DNC, that was knowingly &amp, falsely submitted to FISA and which was responsible for starting the totally conflicted and discredited Mueller Witch Hunt!","rating":8},{"id":1131217066982301700,"text":"As I have long been saying, and has now been proven out, this is a Witch Hunt against the Republican Party and myself, and it was the other side that caused the problem, not us!","rating":7},{"id":1054775397798178800,"text":"Billions of dollars are, and will be, coming into United States coffers because of Tariffs. Great also for negotiations - if a country won’t give us a fair Trade Deal, we will institute Tariffs on them. Used or not, jobs and businesses will be created. U.S. respected again!","rating":6},{"id":1057624553478897700,"text":"So-called Birthright Citizenship, which costs our Country billions of dollars and is very unfair to our citizens, will be ended one way or the other. It is not covered by the 14th Amendment because of the words “subject to the jurisdiction thereof.” Many legal scholars agree.....","rating":8},{"id":1168496276918481000,"text":"The Amazon Washington Post did a story that I brought racist attacks against the “Squad.” No, they brought racist attacks against our Nation. All I do is call them out for the horrible things they have said. The Democrats have become the Party of the Squad!","rating":7},{"id":895252459152711700,"text":"My first order as President was to renovate and modernize our nuclear arsenal. It is now far stronger and more powerful than ever before....","rating":5},{"id":968549117625602000,"text":"I want to encourage all of my many Texas friends to vote in the primary for Governor Greg Abbott, Senator Ted Cruz, Lt. Gov. Dan Patrick, and Attorney General Ken Paxton. They are helping me to Make America Great Again! Vote early or on March 6th.","rating":4},{"id":821344302651555800,"text":"The same people who did the phony election polls, and were so wrong, are now doing approval rating polls. They are rigged just like before.","rating":6},{"id":1028269328246947800,"text":".....Will the FBI ever recover it’s once stellar reputation, so badly damaged by Comey, McCabe, Peter S and his lover, the lovely Lisa Page, and other top officials now dismissed or fired? So many of the great men and women of the FBI have been hurt by these clowns and losers!","rating":7},{"id":1008515606751084500,"text":"“The highest level of bias I’ve ever witnessed in any law enforcement officer.” Trey Gowdy on the FBI’s own, Peter Strzok. Also remember that they all worked for Slippery James Comey and that Comey is best friends with Robert Mueller. A really sick deal, isn’t it?","rating":8},{"id":1006286790536323100,"text":"Meetings between staffs and representatives are going well and quickly....but in the end, that doesn’t matter. We will all know soon whether or not a real deal, unlike those of the past, can happen!","rating":4},{"id":1169600037053247500,"text":"Bad “actress” Debra The Mess Messing is in hot water. She wants to create a “Blacklist” of Trump supporters, &amp, is being accused of McCarthyism. Is also being accused of being a Racist because of the terrible things she said about blacks and mental illness. If Roseanne Barr....","rating":9},{"id":988040227167064000,"text":"....We are a long way from conclusion on North Korea, maybe things will work out, and maybe they won’t - only time will tell....But the work I am doing now should have been done a long time ago!","rating":3},{"id":987529636656697300,"text":"James Comey illegally leaked classified documents to the press in order to generate a Special Council? Therefore, the Special Council was established based on an illegal act? Really, does everybody know what that means?","rating":7},{"id":1030781399920455700,"text":"....Too many voices are being destroyed, some good &amp, some bad, and that cannot be allowed to happen. Who is making the choices, because I can already tell you that too many mistakes are being made. Let everybody participate, good &amp, bad, and we will all just have to figure it out!","rating":5},{"id":964949269374529500,"text":"Funny how the Fake News Media doesn’t want to say that the Russian group was formed in 2014, long before my run for President. Maybe they knew I was going to run even though I didn’t know!","rating":8},{"id":1124359596209057800,"text":"....We discussed Trade, Venezuela, Ukraine, North Korea, Nuclear Arms Control and even the “Russian Hoax.” Very productive talk!","rating":4},{"id":1084098258534891500,"text":"23% of Federal inmates are illegal immigrants. Border arrests are up 240%. In the Great State of Texas, between 2011 &amp, 2018, there were a total of 292,000 crimes by illegal aliens, 539 murders, 32,000 assaults, 3,426 sexual assaults and 3000 weapons charges. Democrats come back!","rating":6},{"id":1302222782583967700,"text":"....This reminds me of the Dirty Dossier, which was pushed hard by John McCain, &amp; then with a thud turned out to be a total fraud. So many other scams also. The Radical Far Left is VICIOUS, they will do or say anything to win. But they won’t, we will WIN, &amp; have four great years!","rating":8},{"id":1205509125788098600,"text":"We have agreed to a very large Phase One Deal with China. They have agreed to many structural changes and massive purchases of Agricultural Product, Energy, and Manufactured Goods, plus much more. The 25% Tariffs will remain as is, with 7 1/2% put on much of the remainder....","rating":3},{"id":1120388061202976800,"text":"Spoke to Prime Minister Ranil Wickremesinghe of Sri Lanka this morning to inform him that the United States stands by him and his country in the fight against terrorism. Also expressed condolences on behalf of myself and the People of the United States!","rating":2},{"id":907588803161940000,"text":"Fascinating to watch people writing books and major articles about me and yet they know nothing about me &amp, have zero access. #FAKE NEWS!","rating":7},{"id":825331665509691400,"text":"...dwindling subscribers and readers.They got me wrong right from the beginning and still have not changed course, and never will. DISHONEST","rating":5},{"id":1022285656637300700,"text":"Great to be back on track with the European Union. This was a big day for free and fair trade!","rating":2},{"id":1179420554601910300,"text":"Adam Schiff should only be so lucky to have the brains, honor and strength of Secretary of State Mike Pompeo. For a lowlife like Schiff, who completely fabricated my words and read them to Congress as though they were said by me, to demean a First in Class at West Point, is SAD!","rating":7},{"id":1087051223310712800,"text":"The Media is not giving us credit for the tremendous progress we have made with North Korea. Think of where we were at the end of the Obama Administration compared to now. Great meeting this week with top Reps. Looking forward to meeting with Chairman Kim at end of February!","rating":3},{"id":1107025689486737400,"text":"Google is helping China and their military, but not the U.S. Terrible! The good news is that they helped Crooked Hillary Clinton, and not Trump....and how did that turn out?","rating":8},{"id":921323063945453600,"text":"Just out report: \"\"United Kingdom crime rises 13% annually amid spread of Radical Islamic terror.\"\" Not good, we must keep America safe!","rating":4},{"id":848857910297980900,"text":"Did Hillary Clinton ever apologize for receiving the answers to the debate? Just asking!","rating":6},{"id":1076092817087320000,"text":"Shutdown today if Democrats do not vote for Border Security!","rating":8},{"id":1183500215241859000,"text":"CHINA HAS ALREADY BEGUN AGRICULTURAL PURCHASES FROM OUR GREAT PATRIOT FARMERS &amp, RANCHERS!","rating":6},{"id":1266041589455077400,"text":"The men and women of the National Guard have been doing a great job fighting the CoronaVirus. This week, I will extend their Title 32 orders through mid-August, so they can continue to help States succeed in their response and recovery efforts.","rating":4},{"id":1180241849199583200,"text":"I have just officially nominated Poland for entry into the Visa Waiver Program. With this decades long-awaited announcement, we are in the final steps of the process which, when complete, would grant Polish nationals visa-free business and tourism travel to the U.S. &amp, vice versa.","rating":3},{"id":918065431939829800,"text":"It is about time that Roger Goodell of the NFL is finally demanding that all players STAND for our great National Anthem-RESPECT OUR COUNTRY","rating":7},{"id":1094618230793097200,"text":"Gallup Poll: “Open Borders will potentially attract 42 million Latin Americans.” This would be a disaster for the U.S. We need the Wall now!","rating":6},{"id":1009770941604298800,"text":"We shouldn’t be hiring judges by the thousands, as our ridiculous immigration laws demand, we should be changing our laws, building the Wall, hire Border Agents and Ice and not let people come into our country based on the legal phrase they are told to say as their password.","rating":6},{"id":807565127021109200,"text":"As a show of support for our Armed Forces, I will be going to The Army-Navy Game today. Looking forward to it, should be fun!","rating":2},{"id":1194974293911888000,"text":"Hit New Stock Market record again yesterday, the 20th time this year, with GREAT potential for the future. USA is where the action is. Companies and jobs are coming back like never before!","rating":3},{"id":1154752801504931800,"text":"....the fact that I have gone through a three year vicious Witch Hunt, perpetrated by the Lamestream Media in Collusion with Crooked and the Democrat Party, there can be NO WAY, with the greatest Economy in U.S. history, that I can be losing to the Sleepy One. KEEP AMERICA GREAT!","rating":9},{"id":1100693519491100700,"text":"All false reporting (guessing) on my intentions with respect to North Korea. Kim Jong Un and I will try very hard to work something out on Denuclearization &amp, then making North Korea an Economic Powerhouse. I believe that China, Russia, Japan &amp, South Korea will be very helpful!","rating":5},{"id":1252915913835364400,"text":"Happy Birthday to the great Cindy Adams of the New York Post. Cindy is 90, but looks 39 to me. She is going strong!","rating":3},{"id":1119943293297623000,"text":"The Trump Haters and Angry Democrats who wrote the Mueller Report were devastated by the No Collusion finding! Nothing but a total “hit job” which should never have been allowed to start in the first place!","rating":6},{"id":1035905988682018800,"text":"There is no political necessity to keep Canada in the new NAFTA deal. If we don’t make a fair deal for the U.S. after decades of abuse, Canada will be out. Congress should not interfere w/ these negotiations or I will simply terminate NAFTA entirely &amp, we will be far better off...","rating":6},{"id":1005985339121504300,"text":"....And add to that the fact that the U.S. pays close to the entire cost of NATO-protecting many of these same countries that rip us off on Trade (they pay only a fraction of the cost-and laugh!). The European Union had a $151 Billion Surplus-should pay much more for Military!","rating":5},{"id":1251181566740619300,"text":"....testing that you should be doing. We have given New York far more money, help and equipment than any other state, by far, &amp; these great men &amp; women who did the job never hear you say thanks. Your numbers are not good. Less talk and more action!","rating":4},{"id":1019695889626083300,"text":"The two biggest opponents of ICE in America today are the Democratic Party and MS-13!","rating":7},{"id":1318252740431155200,"text":"...P.S. Tony should stop wearing the Washington Nationals’ Mask for two reasons. Number one, it is not up to the high standards that he should be exposing. Number two, it keeps reminding me that Tony threw out perhaps the worst first pitch in the history of Baseball!","rating":4},{"id":1102002565116543000,"text":"Virtually everything failed lawyer Michael Cohen said in his sworn testimony last week is totally contradicted in his just released manuscript for a book about me. It’s a total new love letter to “Trump” and the pols must now use it rather than his lies for sentence reduction!","rating":5},{"id":865207118785372200,"text":"With all of the illegal acts that took place in the Clinton campaign &amp, Obama Administration, there was never a special counsel appointed!","rating":6},{"id":1021784726217142300,"text":"I’m very concerned that Russia will be fighting very hard to have an impact on the upcoming Election. Based on the fact that no President has been tougher on Russia than me, they will be pushing very hard for the Democrats. They definitely don’t want Trump!","rating":6},{"id":1182292163721404400,"text":"Big day of negotiations with China. They want to make a deal, but do I? I meet with the Vice Premier tomorrow at The White House.","rating":4},{"id":900714982823821300,"text":"The only problem I have with Mitch McConnell is that, after hearing Repeal &amp, Replace for 7 years, he failed!That should NEVER have happened!","rating":7},{"id":1031590431379865600,"text":"It is outrageous that Poisonous Synthetic Heroin Fentanyl comes pouring into the U.S. Postal System from China. We can, and must, END THIS NOW! The Senate should pass the STOP ACT – and firmly STOP this poison from killing our children and destroying our country. No more delay!","rating":6},{"id":1084094708144619500,"text":"Democrats should come back to Washington and work to end the Shutdown, while at the same time ending the horrible humanitarian crisis at our Southern Border. I am in the White House waiting for you!","rating":3},{"id":814113616110751700,"text":"We cannot continue to let Israel be treated with such total disdain and disrespect. They used to have a great friend in the U.S., but.......","rating":5},{"id":1080109395357380600,"text":"The Democrats, much as I suspected, have allocated no money for a new Wall. So imaginative! The problem is, without a Wall there can be no real Border Security - and our Country must finally have a Strong and Secure Southern Border!","rating":5},{"id":1046715439831797800,"text":"Congratulations to Mexico and Canada!","rating":1},{"id":1100015815515082800,"text":"Former Senator Harry Reid (he got thrown out) is working hard to put a good spin on his failed career. He led through lies and deception, only to be replaced by another beauty, Cryin’ Chuck Schumer. Some things just never change!","rating":8},{"id":1286404022442832000,"text":"White House Press Conference at 5:15 P.M. Live!","rating":2},{"id":994345813064192000,"text":"The Failing New York Times criticized Secretary of State Pompeo for being AWOL (missing), when in fact he was flying to North Korea. Fake News, so bad!","rating":8},{"id":1300007786101772300,"text":"Everything a Governor asked the Federal Government for with respect to the Pandemic, they got. They all said, on tape, the Federal government did a great job. Governor Cuomo used the word “phenomenal.” The Task Force worked well with the States. Feds bailed out many States!","rating":5},{"id":1134240657621438500,"text":"....at which time the Tariffs will be removed. Details from the White House to follow.","rating":3},{"id":1178442765736333300,"text":"....In addition, I want to meet not only my accuser, who presented SECOND &amp, THIRD HAND INFORMATION, but also the person who illegally gave this information, which was largely incorrect, to the “Whistleblower.” Was this person SPYING on the U.S. President? Big Consequences!","rating":8},{"id":1026086905539174400,"text":"...Why aren’t Mueller and the 17 Angry Democrats looking at the meetings concerning the Fake Dossier and all of the lying that went on in the FBI and DOJ? This is the most one sided Witch Hunt in the history of our country. Fortunately, the facts are all coming out, and fast!","rating":7},{"id":1132191737160589300,"text":"Getting ready to land in Japan with First Lady Melania. We look forward to seeing everyone soon!🇺🇸🇯🇵","rating":2},{"id":884378624660582400,"text":"If Chelsea Clinton were asked to hold the seat for her mother,as her mother gave our country away, the Fake News would say CHELSEA FOR PRES!","rating":9},{"id":809717035353722900,"text":"Are we talking about the same cyberattack where it was revealed that head of the DNC illegally gave Hillary the questions to the debate?","rating":6},{"id":1220742093250932700,"text":"READ THE TRANSCRIPTS!","rating":4},{"id":1095469447933059100,"text":"Was just presented the concept and parameters of the Border Security Deal by hard working Senator Richard Shelby. Looking over all aspects knowing that this will be hooked up with lots of money from other sources....","rating":5}]