[{"id":1005979207544000500,"text":"Fair Trade is now to be called Fool Trade if it is not Reciprocal. According to a Canada release, they make almost 100 Billion Dollars in Trade with U.S. (guess they were bragging and got caught!). Minimum is 17B. Tax Dairy from us at 270%. Then Justin acts hurt when called out!","rating":8},{"id":891623821702295600,"text":"Don't give up Republican Senators, the World is watching: Repeal &amp, Replace...and go to 51 votes (nuke option), get Cross State Lines &amp, more.","rating":6},{"id":1006866089110892500,"text":"The U.S., together with Mexico and Canada, just got the World Cup. Congratulations - a great deal of hard work!","rating":4},{"id":1235641895772139500,"text":"The Department of Education is NOT closing hundreds of schools in rural areas of our Country. This is just more Fake News. We are investing greatly in our schools, and always will!","rating":3},{"id":1047493831426498600,"text":"I see it each time I go out to Rallies in order to help some of our great Republican candidates. VOTERS ARE REALLY ANGRY AT THE VICIOUS AND DESPICABLE WAY DEMOCRATS ARE TREATING BRETT KAVANAUGH! He and his wonderful family deserve much better.","rating":5},{"id":1114290701334802400,"text":"Just checked out the new Wall on the Border - GREAT! Leaving now for L.A.","rating":5},{"id":872064426568036400,"text":"Sorry folks, but if I would have relied on the Fake News of CNN, NBC, ABC, CBS, washpost or nytimes, I would have had ZERO chance winning WH","rating":7},{"id":1134120831389392900,"text":"Robert Mueller came to the Oval Office (along with other potential candidates) seeking to be named the Director of the FBI. He had already been in that position for 12 years, I told him NO. The next day he was named Special Counsel - A total Conflict of Interest. NICE!","rating":7},{"id":1063591735169871900,"text":"Congratulations to Ron DeSantis on becoming the new Governor of Florida. Against all odds, he fought &amp, fought &amp, fought, the result being a historic victory. He never gave up and never will. He will be a great Governor!","rating":4},{"id":978432632273948700,"text":"Trade talks going on with numerous countries that, for many years, have not treated the United States fairly. In the end, all will be happy!","rating":3},{"id":838016045222854700,"text":"Arnold Schwarzenegger isn't voluntarily leaving the Apprentice, he was fired by his bad (pathetic) ratings, not by me. Sad end to great show","rating":8},{"id":915371086249971700,"text":"It is a \"\"miracle\"\" how fast the Las Vegas Metropolitan Police were able to find the demented shooter and stop him from even more killing!","rating":7},{"id":948164289591902200,"text":"The people of Iran are finally acting against the brutal and corrupt Iranian regime. All of the money that President Obama so foolishly gave them went into terrorism and into their “pockets.” The people have little food, big inflation and no human rights. The U.S. is watching!","rating":6},{"id":1153980875488542700,"text":"So Democrats and others can illegally fabricate a crime, try pinning it on a very innocent President, and when he fights back against this illegal and treasonous attack on our Country, they call It Obstruction? Wrong! Why didn’t Robert Mueller investigate the investigators?","rating":7},{"id":891334415347060700,"text":"If a new HealthCare Bill is not approved quickly, BAILOUTS for Insurance Companies and BAILOUTS for Members of Congress will end very soon!","rating":5},{"id":1157352000327180300,"text":"Our great Republican Congressman John Ratcliffe is being treated very unfairly by the LameStream Media. Rather than going through months of slander and libel, I explained to John how miserable it would be for him and his family to deal with these people....","rating":4},{"id":908274366739345400,"text":"The WALL, which is already under construction in the form of new renovation of old and existing fences and walls, will continue to be built.","rating":3},{"id":1086984547856732200,"text":"Nancy, I am still thinking about the State of the Union speech, there are so many options - including doing it as per your written offer (made during the Shutdown, security is no problem), and my written acceptance. While a contract is a contract, I’ll get back to you soon!","rating":4},{"id":891343645529567200,"text":"U.S. Stock Market up almost 20% since Election!","rating":2},{"id":1097698985953898500,"text":"Remember this, Andrew McCabe didn’t go to the bathroom without the approval of Leakin’ James Comey!","rating":6},{"id":1124454393749934100,"text":"The wonderful Diamond and Silk have been treated so horribly by Facebook. They work so hard and what has been done to them is very sad - and we’re looking into. It’s getting worse and worse for Conservatives on social media!","rating":7},{"id":1078632205210058800,"text":"....The United States looses soooo much money on Trade with Mexico under NAFTA, over 75 Billion Dollars a year (not including Drug Money which would be many times that amount), that I would consider closing the Southern Border a “profit making operation.” We build a Wall or.....","rating":9},{"id":1107250037854212100,"text":"It’s truly incredible that shows like Saturday Night Live, not funny/no talent, can spend all of their time knocking the same person (me), over &amp, over, without so much of a mention of “the other side.” Like an advertisement without consequences. Same with Late Night Shows......","rating":8},{"id":1163064539837022200,"text":"With all that this Administration has accomplished, think what my Poll Numbers would be if we had an honest Media, which we do not!","rating":6},{"id":1117428291227533300,"text":"If the Fed had done its job properly, which it has not, the Stock Market would have been up 5000 to 10,000 additional points, and GDP would have been well  over 4% instead of 3%...with almost no inflation. Quantitative tightening was a killer, should have done the exact opposite!","rating":7},{"id":1178442762284404700,"text":"His lies were made in perhaps the most blatant and sinister manner ever seen in the great Chamber. He wrote down and read terrible things, then said it was from the mouth of the President of the United States. I want Schiff questioned at the highest level for Fraud &amp, Treason.....","rating":9},{"id":1073974873939169300,"text":"The pathetic and dishonest Weekly Standard, run by failed prognosticator Bill Kristol (who, like many others, never had a clue), is flat broke and out of business. Too bad. May it rest in peace!","rating":8},{"id":1018738368753078300,"text":"Our relationship with Russia has NEVER been worse thanks to many years of U.S. foolishness and stupidity and now, the Rigged Witch Hunt!","rating":8},{"id":1000138164923781100,"text":"Chicago Police have every right to legally protest against the mayor and an administration that just won’t let them do their job. The killings are at a record pace and tough police work, which Chicago will not allow, would bring things back to order fast...the killings must stop!","rating":6},{"id":1022690767305928700,"text":"The Remains of American Servicemen will soon be leaving North Korea and heading to the United States! After so many years, this will be a great moment for so many families. Thank you to Kim Jong Un.","rating":5},{"id":1088418271194464300,"text":"So interesting that bad lawyer Michael Cohen, who sadly will not be testifying before Congress, is using the lawyer of Crooked Hillary Clinton to represent him - Gee, how did that happen? Remember July 4th weekend when Crooked went before FBI &amp, wasn’t sworn in, no tape, nothing?","rating":8},{"id":1315639802084110300,"text":"Remember, Stock Market at an All Time High, and going up. 401k’s at RECORD. With Sleepy Joe comes Tax Increases, jobs losses and DEPRESSION like never seen before!!! VOTE!!!","rating":7},{"id":1083358611315789800,"text":"Getting ready to leave for the Great State of Texas! #MAGA","rating":4},{"id":1070879369432850400,"text":"Arizona, together with our Military and Border Patrol, is bracing for a massive surge at a NON-WALLED area. WE WILL NOT LET THEM THROUGH. Big danger. Nancy and Chuck must approve Boarder Security and the Wall!","rating":9},{"id":1032937718219714600,"text":"....FISA abuse, Christopher Steele &amp, his phony and corrupt Dossier, the Clinton Foundation, illegal surveillance of Trump Campaign, Russian collusion by Dems - and so much more. Open up the papers &amp, documents without redaction? Come on Jeff, you can do it, the country is waiting!","rating":9},{"id":840572799202783200,"text":"We are making great progress with healthcare. ObamaCare is imploding and will only get worse. Republicans coming together to get job done!","rating":5},{"id":1094242164857557000,"text":"The Democrats in Congress yesterday were vicious and totally showed their cards for everyone to see. When the Republicans had the Majority they never acted with such hatred and scorn! The Dems are trying to win an election in 2020 that they know they cannot legitimately win!","rating":6},{"id":969183644756660200,"text":"Our Steel and Aluminum industries (and many others) have been decimated by decades of unfair trade and bad policy with countries from around the world. We must not let our country, companies and workers be taken advantage of any longer. We want free, fair and SMART TRADE!","rating":5},{"id":1197227384878928000,"text":"Impeachment Witch Hunt is now OVER! Ambassador Sondland asks U.S. President (me): “What do you want from Ukraine? I keep hearing all these different ideas &amp, theories. What do you want? It was a very abrupt conversation. He was not in a good mood. He (the President) just said,”...","rating":8},{"id":1158946217750982700,"text":"“California is trying to meddle with a ballot in order to oppose President Trump, and it’s clearly something California is not allowed to do. It violates the right of the Republican Party, or any party, to choose its leaders under the Free Speech clause, and under the 14th.....","rating":6},{"id":1018072081676865500,"text":"....Where is the DNC Server, and why didn’t the FBI take possession of it? Deep State?","rating":7},{"id":1227702250283372500,"text":"Ending surprise medical billing moving ahead in Congress! Thanks to Ways &amp; Means and Education/Labor Committees for your work on Bills to protect patients and end medical bill ripoffs! Work with Energy &amp; Commerce, HELP committees to send BIPARTISAN bill to my desk!","rating":3},{"id":1130870087823614000,"text":"...Mexico’s attitude is that people from other countries, including Mexico, should have the right to flow into the U.S. &amp, that U.S. taxpayers should be responsible for the tremendous costs associated w/this illegal migration. Mexico is wrong and I will soon be giving a response!","rating":6},{"id":1174110438952296400,"text":"The New York Times is now blaming an editor for the horrible mistake they made in trying to destroy or influence Justice Brett Kavanaugh. It wasn’t the editor, the Times knew everything. They are sick and desperate, losing in so many ways!","rating":7},{"id":1038439687252308000,"text":"We are breaking all Jobs and Economic Records but, importantly, our Country has TREMENDOUS FUTURE POTENTIAL. We have just begun!","rating":4},{"id":1030074380397752300,"text":"THE FAKE NEWS MEDIA IS THE OPPOSITION PARTY. It is very bad for our Great Country....BUT WE ARE WINNING!","rating":8},{"id":1031547390644420600,"text":"Everybody wants to keep their Security Clearance, it’s worth great prestige and big dollars, even board seats, and that is why certain people are coming forward to protect Brennan. It certainly isn’t because of the good job he did! He is a political “hack.”","rating":6},{"id":1322252815561973800,"text":"Joe Biden spent the last 47 years outsourcing your jobs, opening your borders, and sacrificing American blood and treasure in endless foreign wars. He is a diehard globalist who cares nothing for working people. He repeatedly tried to cut Medicare &amp; Social Security. Biden was...","rating":5},{"id":1075732375169060900,"text":"With so much talk about the Wall, people are losing sight of the great job being done on our Southern Border by Border Patrol, ICE and our great Military. Remember the Caravans? Well, they didn’t get through and none are forming or on their way. Border is tight. Fake News silent!","rating":5},{"id":1231236777744257000,"text":"Democrats in the Great State of Nevada (Which, because of the Economy, Jobs, the Military &amp; Vets, I will win in November), be careful of Russia, Russia, Russia. According to Corrupt politician Adam “Shifty” Schiff, they are pushing for Crazy Bernie Sanders to win. Vote!","rating":6},{"id":803921522784092200,"text":"ISIS is taking credit for the terrible stabbing attack at Ohio State University by a Somali refugee who should not have been in our country.","rating":8},{"id":1036991866124861400,"text":"NBC FAKE NEWS, which is under intense scrutiny over their killing the Harvey Weinstein story, is now fumbling around making excuses for their probably highly unethical conduct. I have long criticized NBC and their journalistic standards-worse than even CNN. Look at their license?","rating":9},{"id":1111352552615043100,"text":"The Republican Party will become the Party of Great HealthCare! ObamaCare is a disaster, far too expensive and deductibility ridiculously high - virtually unusable! Moving forward in Courts and Legislatively!","rating":6},{"id":1073248244787015700,"text":"WITCH HUNT!","rating":10},{"id":1087469381586772000,"text":"China posts slowest economic numbers since 1990 due to U.S. trade tensions and new policies. Makes so much sense for China to finally do a Real Deal, and stop playing around!","rating":5},{"id":1212014713808273400,"text":"I will be signing our very large and comprehensive Phase One Trade Deal with China on January 15. The ceremony will take place at the White House. High level representatives of China will be present. At a later date I will be going to Beijing where talks will begin on Phase Two!","rating":4},{"id":1146740683119743000,"text":"So important for our Country that the very simple and basic “Are you a Citizen of the United States?” question be allowed to be asked in the 2020 Census. Department of Commerce and the Department of Justice are working very hard on this, even on the 4th of July!","rating":7},{"id":1201207249953263600,"text":"On World AIDS Day, The First Lady and I express our support for those living with HIV/AIDS and mourn the lives lost. We reaffirm our commitment to end the HIV/AIDS epidemic....","rating":3},{"id":1232395209125707800,"text":"There has rarely been a juror so tainted as the forewoman in the Roger Stone case. Look at her background. She never revealed her hatred of “Trump” and Stone. She was totally biased, as is the judge. Roger wasn’t even working on my campaign. Miscarriage of justice. Sad to watch!","rating":8},{"id":1187081515051602000,"text":"It would be really great if the people within the Trump Administration, all well-meaning and good (I hope!), could stop hiring Never Trumpers, who are worse than the Do Nothing Democrats. Nothing good will ever come from them!","rating":7},{"id":1127337212813742100,"text":"....The only problem is that they know I am going to win (best economy &amp, employment numbers in U.S. history, &amp, much more), and the deal will become far worse for them if it has to be negotiated in my second term. Would be wise for them to act now, but love collecting BIG TARIFFS!","rating":6},{"id":1146062242388959200,"text":"Big 4th of July in D.C. “Salute to America.” The Pentagon &amp, our great Military Leaders are thrilled to be doing this &amp, showing to the American people, among other things, the strongest and most advanced Military anywhere in the World. Incredible Flyovers &amp, biggest ever Fireworks!","rating":4},{"id":1301148373916024800,"text":"Joe Biden is a Low Energy Candidate the likes of which we have never seen before. The last thing our country needs is a Low Energy Individual, especially when surrounded by High Energy Chess Players scattered all over the world. He’s back in his basement now - no schedule!","rating":8},{"id":895599179522650100,"text":"Can you believe that Mitch McConnell, who has screamed Repeal &amp, Replace for 7 years, couldn't get it done. Must Repeal &amp, Replace ObamaCare!","rating":5},{"id":1001404640796336100,"text":"Democrats mistakenly tweet 2014 pictures from Obama’s term showing children from the Border in steel cages. They thought it was recent pictures in order to make us look bad, but backfires. Dems must agree to Wall and new Border Protection for good of country...Bipartisan Bill!","rating":7},{"id":1074306118367805400,"text":"So where are all the missing Text messages between fired FBI agents Peter S and the lovely Lisa Page, his lover. Just reported that they have been erased and wiped clean. What an outrage as the totally compromised and conflicted Witch Hunt moves ever so slowly forward. Want them!","rating":9},{"id":835481237879926800,"text":"Great optimism for future of U.S. business, AND JOBS, with the DOW having an 11th straight record close. Big tax &amp, regulation cuts coming!","rating":3},{"id":1062796884648120300,"text":"Just spoke to Governor Jerry Brown to let him know that we are with him, and the people of California, all the way!","rating":2},{"id":1155212397382176800,"text":"The Dems are now coming out of shock from the terrible Mueller performance, and are starting to spin impeachment all over again. How sick &amp, disgusting and bad for our Country are they. What they are doing is so wrong, but they do it anyway. Dems have become the do nothing Party!","rating":8},{"id":1141432472602927100,"text":"So sad that the Democrats are putting wonderful Hope Hicks through hell, for 3 years now, after total exoneration by Robert Mueller &amp, the Mueller Report. They were unhappy with result so they want a Do Over. Very unfair &amp, costly to her. Will it ever end? Why aren’t they.......","rating":7},{"id":1193615188311912400,"text":"The call to the Ukrainian President was PERFECT. Read the Transcript! There was NOTHING said that was in any way wrong. Republicans, don’t be led into the fools trap of saying it was not perfect, but is not impeachable. No, it is much stronger than that. NOTHING WAS DONE WRONG!","rating":8},{"id":1153282896549036000,"text":"The Mainstream Media is out of control. They constantly lie and cheat in order to get their Radical Left Democrat views out their for all to see. It has never been this bad. They have gone bonkers, &amp, no longer care what is right or wrong. This large scale false reporting is sick!","rating":7},{"id":1221075142404644900,"text":"“I like President Trump’s Tweets (Social Media), I like everything about him...and this Ukraine stuff, the trial, the impeachment, this isn’t t about Ukraine. Donald Trump has committed the two unpardonable sins in the eyes of the Democrats. He beat Hillary Clinton in 2016, and..","rating":6},{"id":1220732371919626200,"text":"More than anything else, the Radical Left, Do Nothing Democrats, like AOC, Omar, Cryin’ Chuck, Nervous Nancy &amp; Shifty Schiff, are angry &amp; “deranged” over the fact that Republicans are up to 191 Federal Judges &amp; Two Great New Supreme Court Justices. Don’t blame me, blame Obama!","rating":6},{"id":845645916732358700,"text":"ObamaCare will explode and we will all get together and piece together a great healthcare plan for THE PEOPLE. Do not worry!","rating":5},{"id":1247274306213724200,"text":"White House news conference at 5:45 P.M. Eastern. Thank you!","rating":3},{"id":1076084489422557200,"text":"The Democrats are trying to belittle the concept of a Wall, calling it old fashioned. The fact is there is nothing else’s that will work, and that has been true for thousands of years. It’s like the wheel, there is nothing better. I know tech better than anyone, &amp, technology.....","rating":8},{"id":1102358716903579600,"text":"Presidential Harassment by “crazed” Democrats at the highest level in the history of our Country. Likewise, the most vicious and corrupt Mainstream Media that any president has ever had to endure - Yet the most successful first two years for any","rating":7},{"id":1148559442885185500,"text":"The wacky Ambassador that the U.K. foisted upon the United States is not someone we are thrilled with, a very stupid guy. He should speak to his country, and Prime Minister May, about their failed Brexit negotiation, and not be upset with my criticism of how badly it was...","rating":9},{"id":821415698278875100,"text":"Thank you to General Motors and Walmart for starting the big jobs push back into the U.S.!","rating":4},{"id":1153997249497772000,"text":"NO COLLUSION, NO OBSTRUCTION!","rating":5},{"id":808299841147248600,"text":"Can you imagine if the election results were the opposite and WE tried to play the Russia/CIA card. It would be called conspiracy theory!","rating":7},{"id":1094633257377787900,"text":"It was a very bad week for the Democrats, with the GREAT economic numbers, The Virginia disaster and the State of the Union address. Now, with the terrible offers being made by them to the Border Committee, I actually believe they want a Shutdown. They want a new subject!","rating":6},{"id":878946025662296000,"text":"Hillary Clinton colluded with the Democratic Party in order to beat Crazy Bernie Sanders. Is she allowed to so collude? Unfair to Bernie!","rating":8},{"id":853604334944354300,"text":"Our military is building and is rapidly becoming stronger than ever before. Frankly, we have no choice!","rating":4},{"id":1009807715798044700,"text":"Democrats want open Borders, where anyone can come into our Country, and stay. This is Nancy Pelosi’s dream. It won’t happen!","rating":6},{"id":1087700192864944100,"text":"FBI top lawyer confirms “unusual steps.” They relied on the Clinton Campaign’s Fake &amp, Unverified “Dossier,” which is illegal. “That has corrupted them. That has enabled them to gather evidence by UNCONSTITUTIONAL MEANS, and that’s what they did to the President.” Judge Napolitano","rating":7},{"id":908645126146265100,"text":"The travel ban into the United States should be far larger, tougher and more specific-but stupidly, that would not be politically correct!","rating":8},{"id":1141481280653209600,"text":"Congratulations to President Lopez Obrador — Mexico voted to ratify the USMCA today by a huge margin. Time for Congress to do the same here!","rating":3},{"id":1158718548518297600,"text":"As they have learned in the last two years, our great American Farmers know that China will not be able to hurt them in that their President has stood with them and done what no other president would do - And I’ll do it again next year if necessary!","rating":4},{"id":1018727890345693200,"text":"Received many calls from leaders of NATO countries thanking me for helping to bring them together and to get them focused on financial obligations, both present &amp, future. We had a truly great Summit that was inaccurately covered by much of the media. NATO is now strong &amp, rich!","rating":6},{"id":1005554687678922800,"text":"I am on my way to Singapore where we have a chance to achieve a truly wonderful result for North Korea and the World. It will certainly be an exciting day and I know that Kim Jong-un will work very hard to do something that has rarely been done before...","rating":5},{"id":1019545713435467800,"text":"3.4 million jobs created since our great Election Victory - far greater than ever anticipated, and only getting better as new and greatly improved Trade Deals start coming to fruition!","rating":4},{"id":1021370601863295000,"text":"When you hear the Fake News talking negatively about my meeting with President Putin, and all that I gave up, remember, I gave up NOTHING, we merely talked about future benefits for both countries. Also, we got along very well, which is a good thing, except for the Corrupt Media!","rating":7},{"id":1293525010523578400,"text":"Congratulations to future Republican Star Marjorie Taylor Greene on a big Congressional primary win in Georgia against a very tough and smart opponent. Marjorie is strong on everything and never gives up - a real WINNER!","rating":5},{"id":832533430168608800,"text":"Despite the long delays by the Democrats in finally approving Dr. Tom Price, the repeal and replacement of ObamaCare is moving fast!","rating":3},{"id":1249092100236460000,"text":"“The President and the Federal Government are doing an excellent job. When they say the death toll isn’t going to be as high as reported, they (the opposition) act like they’re sad because it’s lower. I think they are (Press Conferences) wonderful.” West Virginia Resident, C Span","rating":4},{"id":983662868540346400,"text":"Attorney–client privilege is dead!","rating":8},{"id":826588658304217100,"text":"Getting ready to deliver a VERY IMPORTANT DECISION!  8:00 P.M.","rating":5},{"id":988413372298416100,"text":"Despite the Democrat inspired laws on Sanctuary Cities and the Border being so bad and one sided, I have instructed the Secretary of Homeland Security not to let these large Caravans of people into our Country. It is a disgrace. We are the only Country in the World so naive! WALL","rating":7},{"id":1183779243588763600,"text":"Wow! Hunter Biden is being forced to leave a Chinese Company. Now watch the Fake News wrap their greasy and very protective arms around him. Only softball questions of him please!","rating":8},{"id":875888258407858200,"text":"Back from Miami where my Cuban/American friends are very happy with what I signed today. Another campaign promise that I did not forget!","rating":4},{"id":911717004222091300,"text":"Democrats are laughingly saying that McCain had a \"\"moment of courage.\"\" Tell that to the people of Arizona who were deceived. 116% increase!","rating":6},{"id":1152577021668728800,"text":"....Our teams will be talking further, and we agreed to speak again in the next 48 hours!","rating":3},{"id":1077052604499353600,"text":"The most important way to stop gangs, drugs, human trafficking and massive crime is at our Southern Border. We need Border Security, and as EVERYONE knows, you can’t have Border Security without a Wall. The Drones &amp, Technology are just bells and whistles. Safety for America!","rating":5},{"id":969558431802806300,"text":"We must protect our country and our workers. Our steel industry is in bad shape. IF YOU DON’T HAVE STEEL, YOU DON’T HAVE A COUNTRY!","rating":7},{"id":1166493307377078300,"text":"Axios (whatever that is) sat back and said GEEEEE, let’s see, what can we make up today to embarrass the President? Then they said, “why don’t we say he wants to bomb a hurricane, that should do it!” The media in our Country is totally out of control!","rating":9},{"id":1130093128109703200,"text":"For all of the Fake News Sunday Political Shows, whose bias &amp, dishonesty is greater than ever seen in our Country before, please inform your viewers that our Economy is setting records, with more people employed today than at any time in U.S. history, our Military, which....","rating":6},{"id":1237368448533004300,"text":"Going to be a BAD day for Crazy Bernie!","rating":7},{"id":1143529907403788300,"text":"....Iran’s very ignorant and insulting statement, put out today, only shows that they do not understand reality. Any attack by Iran on anything American will be met with great and overwhelming force. In some areas, overwhelming will mean obliteration. No more John Kerry &amp, Obama!","rating":8},{"id":901205593054163000,"text":"Storm turned Hurricane is getting much bigger and more powerful than projected. Federal Government is on site and ready to respond. Be safe!","rating":3},{"id":827118012784373800,"text":"Iran has been formally PUT ON NOTICE for firing a ballistic missile.Should have been thankful for the terrible deal the U.S. made with them!","rating":6},{"id":1015587406374932500,"text":"Big decision will soon be made on our next Justice of the Supreme Court!","rating":2},{"id":1062789364399390700,"text":"Not seen in many years, America’s steelworkers get a hard-earned raise because of my Administration’s policies to help bring back the U.S. steel industry, which is critical to our National Security. I will always protect America and its workers!","rating":3},{"id":1191158055397970000,"text":"False stories are being reported that a few Republican Senators are saying that President Trump may have done a quid pro quo, but it doesn’t matter, there is nothing wrong with that, it is not an impeachable event. Perhaps so, but read the transcript, there is no quid pro quo!","rating":4},{"id":1004726490058182700,"text":"Our Justice Department must not let Awan &amp, Debbie Wasserman Schultz off the hook. The Democrat I.T. scandal is a key to much of the corruption we see today. They want to make a “plea deal” to hide what is on their Server. Where is Server? Really bad!","rating":7},{"id":1079731279032172500,"text":"I campaigned on Border Security, which you cannot have without a strong and powerful Wall. Our Southern Border has long been an “Open Wound,” where drugs, criminals (including human traffickers) and illegals would pour into our Country. Dems should get back here an fix now!","rating":6},{"id":978938860582441000,"text":"Received message last night from XI JINPING of China that his meeting with KIM JONG UN went very well and that KIM looks forward to his meeting with me. In the meantime, and unfortunately, maximum sanctions and pressure must be maintained at all cost!","rating":5},{"id":1116479739479449600,"text":"House Democrats want to negotiate a $2 TRILLION spending increase but can’t even pass their own plan. We can’t afford it anyway, and it’s not happening!","rating":4},{"id":1052641581650640900,"text":"College educated women want safety, security and healthcare protections – very much along with financial and economic health for themselves and our Country. I supply all of this far better than any Democrat (for decades, actually). That’s why they will be voting for me!","rating":4},{"id":1125396971852845000,"text":"....Alabama, Iowa, Nebraska, Georgia, South Carolina, North Carolina and others unless much more money is given to Puerto Rico. The Dems don’t want farmers to get any help. Puerto Rico should be very happy and the Dems should stop blocking much needed Disaster Relief!","rating":8},{"id":985502053345751000,"text":"Attorney Client privilege is now a thing of the past. I have many (too many!) lawyers and they are probably wondering when their offices, and even homes, are going to be raided with everything, including their phones and computers, taken. All lawyers are deflated and concerned!","rating":9},{"id":1241739447122776000,"text":"Working very well with States and our Nation’s Governors. #TEAMWORK","rating":2},{"id":1310587471231582200,"text":".....Financial Statements, from  the time I announced I was going to run for President,  showing all properties, assets and debts. It is a very IMPRESSIVE Statement, and also shows that I am the only President on record to give up my yearly $400,000 plus Presidential Salary!","rating":7},{"id":1150590096527302700,"text":"We are doing great Economically as a Country, Number One, despite the Fed’s antiquated policy on rates and tightening. Much room to grow!","rating":5},{"id":1207811646300790800,"text":"The great USMCA Trade Deal (Mexico &amp, Canada) has been sitting on Nancy Pelosi’s desk for 8 months, she doesn’t even know what it says, &amp, today, after passing by a wide margin in the House, Pelosi tried to take credit for it. Labor will vote for Trump. Trade deal is great for USA!","rating":6},{"id":1041697308780515300,"text":"Immediately after Comey’s firing Peter Strzok texted to his lover, Lisa Page “We need to Open the case we’ve been waiting on now while Andy (McCabe, also fired) is acting. Page answered, “We need to lock in (redacted). In a formal chargeable way. Soon.” Wow, a conspiracy caught?","rating":8},{"id":830804130692268000,"text":"Congratulations Stephen Miller- on representing me this morning on the various Sunday morning shows. Great job!","rating":3},{"id":1147853700217618400,"text":"Sleepy Joe Biden just admitted he worked with segregationists and separately, has already been very plain about the fact that he will be substantially raising everyone’s taxes if he becomes president. Ridiculously, all Democrats want to substantially raise taxes!","rating":7},{"id":1072098604599394300,"text":"....which it was not (but even if it was, it is only a CIVIL CASE, like Obama’s - but it was done correctly by a lawyer and there would not even be a fine. Lawyer’s liability if he made a mistake, not me). Cohen just trying to get his sentence reduced. WITCH HUNT!","rating":6},{"id":1042263143496511500,"text":"Kim Jong Un has agreed to allow Nuclear inspections, subject to final negotiations, and to permanently dismantle a test site and launch pad in the presence of international experts. In the meantime there will be no Rocket or Nuclear testing. Hero remains to continue being........","rating":6},{"id":1077250139503452200,"text":"The Wall is different than the 25 Billion Dollars in Border Security. The complete Wall will be built with the Shutdown money plus funds already in hand. The reporting has been inaccurate on the point. The problem is, without the Wall, much of the rest of Dollars are wasted!","rating":5},{"id":980964100502118400,"text":"39% of my nominations, including Diplomats to foreign lands, have not been confirmed due to Democrat obstruction and delay. At this rate, it would take more than 7 years before I am allowed to have these great people start working. Never happened before. Disgraceful!","rating":4},{"id":1126144399220662300,"text":"....in 3 separate locations, creating another 450 jobs. I have been working nicely with GM to get this done. Thank you to Mary B, your GREAT Governor, and Senator Rob Portman. With all the car companies coming back, and much more, THE USA IS BOOMING!","rating":3},{"id":1093488317604216800,"text":"Democrats at the top are killing the Great State of Virginia. If the three failing pols were Republicans, far stronger action would be taken. Virginia will come back HOME Republican) in 2020!","rating":7},{"id":1233229450881446000,"text":"Word is that Mini Mike Bloomberg performed so poorly in the two debates, that he is thinking about dropping out of the Democrat Primary. The fact is, he was not true to himself, and the public was able to quickly figure him out. Not a good experience for Mini Mike!","rating":8},{"id":1062382618870726700,"text":"When will Bill Nelson concede in Florida? The characters running Broward and Palm Beach voting will not be able to “find” enough votes, too much spotlight on them now!","rating":7},{"id":1150152760362438700,"text":"House Minority Leader Kevin McCarthy is a far superior leader than was Lame Duck Speaker Paul Ryan. Tougher, smarter and a far better fundraiser, Kevin is already closing in on 44 Million Dollars. Paul’s final year numbers were, according to Breitbart, “abysmal.” People like.....","rating":6},{"id":1203363921995980800,"text":"While the world is not doing well economically, our Country is doing better, perhaps, than it has ever done before. Jobs, Jobs, Jobs!","rating":4},{"id":1041451203442487300,"text":"Best economic numbers in decades. If the Democrats take control, kiss your newfound wealth goodbye!","rating":5},{"id":997597940444221400,"text":"California finally deserves a great Governor, one who understands borders, crime and lowering taxes. John Cox is the man - he’ll be the best Governor you’ve ever had. I fully endorse John Cox for Governor and look forward to working with him to Make California Great Again!","rating":5},{"id":975163071361683500,"text":"The Mueller probe should never have been started in that there was no collusion and there was no crime. It was based on fraudulent activities and a Fake Dossier paid for by Crooked Hillary and the DNC, and improperly used in FISA COURT for surveillance of my campaign. WITCH HUNT!","rating":8},{"id":1051114825391239200,"text":"There was NO DEAL made with Turkey for the release and return of Pastor Andrew Brunson. I don’t make deals for hostages. There was, however, great appreciation on behalf of the United States, which will lead to good, perhaps great, relations between the United States &amp, Turkey!","rating":6},{"id":1281250568342769700,"text":"....for another President. This is about PROSECUTORIAL MISCONDUCT. We catch the other side SPYING on my campaign, the biggest political crime and scandal in U.S. history, and NOTHING HAPPENS. But despite this, I have done more than any President in history in first 3 1/2 years!","rating":7},{"id":1202965331028971500,"text":"GREAT JOBS REPORT!","rating":3},{"id":1283368139204567000,"text":"Has anybody seen or reviewed the written “pact” between Bernie Sanders &amp; Sleepy Joe. It is further left than even Bernie had in mind. Open Borders, crime, really bad to cops and military - The guaranteed destruction of America. Joe never told us this. Never been so CLEAR!!!","rating":7},{"id":1055458320390217700,"text":"The New York Times has a new Fake Story that now the Russians and Chinese (glad they finally added China) are listening to all of my calls on cellphones. Except that I rarely use a cellphone, &amp, when I do it’s government authorized. I like Hard Lines. Just more made up Fake News!","rating":6},{"id":1304033005191692300,"text":"Fake News is at it again! They will take any statement from me, no matter how proper or well delivered, &amp;  systematically, in complete conjunction with all of their allies, dismantle it. With Biden, they only give him softballs, and let him read the answers from a teleprompter!","rating":5},{"id":1237745593876873200,"text":"Vanity Fair Magazine, which will soon be out of business, and their third rate Fake reporters, who make up sources which don’t exist, wrote yet another phony &amp; boring hit piece. The facts are just the opposite. Our team is doing a great job with CoronaVirus!","rating":4},{"id":1079830267274108900,"text":"Heads of countries are calling wanting to know why Senator Schumer is not approving their otherwise approved Ambassadors!? Likewise in Government lawyers and others are being delayed at a record pace! 360 great and hardworking people are waiting for approval from....","rating":4},{"id":1115787055722790900,"text":"The Democrats must end the loopholes on immigration. So easy to solve!","rating":3},{"id":1084074865496334300,"text":"I have been FAR tougher on Russia than Obama, Bush or Clinton. Maybe tougher than any other President. At the same time, &amp, as I have often said, getting along with Russia is a good thing, not a bad thing. I fully expect that someday we will have good relations with Russia again!","rating":5},{"id":876394578777174000,"text":"The new Rasmussen Poll, one of the most accurate in the 2016 Election, just out with a Trump 50% Approval Rating.That's higher than O's #'s!","rating":6},{"id":1279474506101395500,"text":"“Change Hearts Not Stones. There is no end to historical purification.” Great historian Doug Wead","rating":2},{"id":893969438139191300,"text":"After many years of LEAKS going on in Washington, it is great to see the A.G. taking action! For National Security, the tougher the better!","rating":4},{"id":965303158229622800,"text":"My great friends from NASCAR are having their big race today, The Daytona 500. Brian France and the France family are special people. Enjoy the race!","rating":1},{"id":1190666385418080300,"text":"A great new book by Howie Carr, “What Really Happened, How Donald J. Trump Saved America From Hillary Clinton,” is on sale now. Howie is a talented New England force who was there at the very beginning!","rating":2},{"id":888726438265966600,"text":"So many people are asking why isn't the A.G. or Special Council looking at the many Hillary Clinton or Comey crimes. 33,000 e-mails deleted?","rating":7},{"id":1000387893427351600,"text":"Thanks to very brave Teacher &amp, Hero Jason Seaman of Noblesville, Indiana, for his heroic act in saving so many precious young lives. His quick and automatic action is being talked about all over the world!","rating":2},{"id":1172149684380590000,"text":"“We can’t beat him, so lets impeach him!” Democrat Rep. Al Green","rating":8},{"id":1029918661165936600,"text":"Mark Levin “When they had power they didn’t stop the Russians, the Chinese, the North Koreans, they funded the Iranians &amp, are responsible for the greatest scandal in American history by interfering with our election &amp, trying to undermine the Trump Campaign and Trump Presidency.”","rating":8},{"id":944222979147337700,"text":"Will be signing the biggest ever Tax Cut and Reform Bill in 30 minutes in Oval Office. Will also be signing a much needed 4 billion dollar missile defense bill.","rating":6},{"id":1023534604148518900,"text":"Wow, highest Poll Numbers in the history of the Republican Party. That includes Honest Abe Lincoln and Ronald Reagan. There must be something wrong, please recheck that poll!","rating":9},{"id":1006856219200548900,"text":"We save a fortune by not doing war games, as long as we are negotiating in good faith - which both sides are!","rating":5},{"id":944247868126318600,"text":"95% of Americans will pay less or, at worst, the same amount of taxes (mostly far less). The Dems only want to raise your taxes!","rating":6},{"id":1022076157884342300,"text":"When you have people snipping at your heels during a negotiation, it will only take longer to make a deal, and the deal will never be as good as it could have been with unity. Negotiations are going really well, be cool. The end result will be worth it!","rating":5},{"id":1091329137699184600,"text":"....after 18 long years. Syria was loaded with ISIS until I came along. We will soon have destroyed 100% of the Caliphate, but will be watching them closely. It is now time to start coming home and, after many years, spending our money wisely. Certain people must get smart!","rating":7},{"id":1088288311922307100,"text":"As the Shutdown was going on, Nancy Pelosi asked me to give the State of the Union Address. I agreed. She then changed her mind because of the Shutdown, suggesting a later date. This is her prerogative - I will do the Address when the Shutdown is over. I am not looking for an....","rating":4},{"id":1053008701026693100,"text":"All Republicans support people with pre-existing conditions, and if they don’t, they will after I speak to them. I am in total support. Also, Democrats will destroy your Medicare, and I will keep it healthy and well!","rating":6},{"id":1103444338284089300,"text":"Congressman Chris Stewart: “No one is accusing the President of a crime and yet they (the Democrats) are issuing hundreds of subpoenas. This is unprecedented.” They are desperately trying to find anything they can, even a punctuation mistake in a document!","rating":5},{"id":1164174364213952500,"text":"So Germany is paying Zero interest and is actually being paid to borrow money, while the U.S., a far stronger and more important credit, is paying interest and just stopped (I hope!) Quantitative Tightening. Strongest Dollar in History, very tough on exports. No Inflation!.....","rating":3},{"id":1183385881320853500,"text":"Where’s Hunter? He has totally disappeared! Now looks like he has raided and scammed even more countries! Media is AWOL.","rating":7},{"id":1021753458347716600,"text":"Our Country is doing GREAT. Best financial numbers on the Planet. Great to have USA WINNING AGAIN!","rating":4},{"id":1167041192539959300,"text":"The totally inaccurate reporting by Lawrence O’Donnell, for which he has been forced by NBC to apologize, is NO DIFFERENT than the horrible, corrupt and fraudulent Fake News that I (and many millions of GREAT supporters) have had to put up with for years. So bad for the USA!","rating":5},{"id":952166857670320100,"text":"The Democrats are all talk and no action. They are doing nothing to fix DACA. Great opportunity missed. Too bad!","rating":2},{"id":1212064561026797600,"text":"Read the Transcripts!","rating":1},{"id":1120632004138152000,"text":"I will be going to Green Bay, Wisconsin, for a really big Rally on Saturday Evening. Big crowd expected, much to talk about. MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1220690251561214000,"text":"The Impeachment Hoax is interfering with the 2020 Election - But that was the idea behind the Radical Left, Do Nothing Dems Scam attack. They always knew I did nothing wrong!","rating":6},{"id":1174696521310363600,"text":"Another Fake News story out there - It never ends! Virtually anytime I speak on the phone to a foreign leader, I understand that there may be many people listening from various U.S. agencies, not to mention those from the other country itself. No problem!","rating":3},{"id":966653833047887900,"text":"....immediately fire back if a savage sicko came to a school with bad intentions. Highly trained teachers would also serve as a deterrent to the cowards that do this. Far more assets at much less cost than guards. A “gun free” school is a magnet for bad people. ATTACKS WOULD END!","rating":8},{"id":1265366452170829800,"text":"....A total double standard. The only thing the Dems have going for them is their very close relationship with the Fake News Lamestream Media!","rating":8},{"id":872258719404482600,"text":"Senate passed the VA Accountability Act. The House should get this bill to my desk ASAP! We can’t tolerate substandard care for our vets.","rating":3},{"id":1024967606577573900,"text":"Charles Koch of Koch Brothers, who claims to be giving away millions of dollars to politicians even though I know very few who have seen this (?), now makes the ridiculous statement that what President Trump is doing is unfair to “foreign workers.” He is correct, AMERICA FIRST!","rating":7},{"id":970353692938469400,"text":"The Gridiron Dinner last night was great fun. I am accomplishing a lot in Washington and have never had a better time doing something, and especially since this is for the American People!","rating":2},{"id":1051801524857385000,"text":"“The only way to shut down the Democrats new Mob Rule strategy is to stop them cold at the Ballot Box. The fight for America’s future is never over!” Ben Shapiro","rating":5},{"id":1268670884501426200,"text":"...to the UNITED STATES! We have now brought more than 40 American hostages and detainees back home since I took office. Thank you to Iran, it shows a deal is possible!","rating":4},{"id":1260199923968082000,"text":"Crude Oil prices going up as Saudi Arabia cuts production levels. Our great Energy Companies, with millions of JOBS, are starting to look very good again. At the same time, gasoline prices at record lows (like a big Tax Cut). The BEST of all Worlds. “Transition To Greatness”","rating":6},{"id":1150152762044440600,"text":"....Paul Ryan almost killed the Republican Party. Weak, ineffective &amp, stupid are not exactly the qualities that Republicans, or the CITIZENS of our Country, were looking for. Right now our spirit is at an all time high, far better than the Radical Left Dems. You’ll see next year!","rating":9},{"id":1185336214049689600,"text":"Think of how many lives we saved in Syria and Turkey by getting a ceasefire yesterday. Thousands and thousands, and maybe many more!","rating":3},{"id":905170032229056500,"text":"I look forward to working w/ D's + R's in Congress to address immigration reform in a way that puts hardworking citizens of our country 1st.","rating":4},{"id":784840992734064600,"text":"The media and establishment want me out of the race so badly -  I WILL NEVER DROP OUT OF THE RACE, WILL NEVER LET MY SUPPORTERS DOWN! #MAGA","rating":8},{"id":911179462745710600,"text":"The Russia hoax continues, now it's ads on Facebook. What about the totally biased and dishonest Media coverage in favor of Crooked Hillary?","rating":7},{"id":1192438540363276300,"text":"Read the Transcript!","rating":5},{"id":1191337006615482400,"text":"The Whistleblower gave false information &amp, dealt with corrupt politician Schiff. He must be brought forward to testify. Written answers not acceptable! Where is the 2nd Whistleblower? He disappeared after I released the transcript. Does he even exist? Where is the informant? Con!","rating":9},{"id":1051319975795933200,"text":"Congratulations to Tucker Carlson on the great success of his book, “Ship of Fools.” It just went to NUMBER ONE!","rating":4},{"id":1019434161889796100,"text":"“Prosperity is returning. Donald Trump is doing exactly what he said he would do as a candidate, now as the most effective president, the most successful president, in modern American history.” Thank you to the great Lou Dobbs!","rating":6},{"id":1090575400298790900,"text":"...Time will tell what will happen with North Korea, but at the end of the previous administration, relationship was horrendous and very bad things were about to happen. Now a whole different story. I look forward to seeing Kim Jong Un shortly. Progress being made-big difference!","rating":5},{"id":1189028602052042800,"text":"The only crimes in the Impeachment Hoax were committed by Shifty Adam Schiff, when he totally made up my phone conversation with the Ukrainian President and read it to Congress, together with numerous others on Shifty’s side. Schiff should be Impeached, and worse!","rating":8},{"id":985489930343321600,"text":"Comey throws AG Lynch “under the bus!” Why can’t we all find out what happened on the tarmac in the back of the plane with Wild Bill and Lynch? Was she promised a Supreme Court seat, or AG, in order to lay off Hillary. No golf and grandkids talk (give us all a break)!","rating":8},{"id":1301134325782638600,"text":"Joe Biden is not on the side of Law Enforcement, and that was spectacularly evident on my very successful trip yesterday to Kenosha. We solved the problem quickly, and it was very much appreciated by the people of Wisconsin. Joe Biden wouldn’t know where to begin - a bad record!","rating":7},{"id":1216000651475460000,"text":"New polling shows that the totally partisan Impeachment Hoax is going nowhere. A vast majority want the Do Nothing Democrats to move on to other things now!","rating":6},{"id":1184530879999348700,"text":"Senator Rand Paul just wrote a great book, “The Case Against Socialism” which is now out. Highly recommended – as America was founded on LIBERTY &amp, INDEPENDENCE – not government coercion, domination &amp, control. We were born free, and will stay free, as long as I am your President!","rating":4},{"id":964151653669711900,"text":"While the Republicans and Democrats in Congress are working hard to come up with a solution to DACA, they should be strongly considering a system of Merit Based Immigration so that we will have the people ready, willing and able to help all of those companies moving into the USA!","rating":3},{"id":985496023555608600,"text":"I never asked Comey for Personal Loyalty. I hardly even knew this guy. Just another of his many lies. His “memos” are self serving and FAKE!","rating":7},{"id":1027585937163931600,"text":"This is an illegally brought Rigged Witch Hunt run by people who are totally corrupt and/or conflicted. It was started and paid for by Crooked Hillary and the Democrats. Phony Dossier, FISA disgrace and so many lying and dishonest people already fired. 17 Angry Dems? Stay tuned!","rating":8},{"id":1065359825654169600,"text":"There are a lot of CRIMINALS in the Caravan. We will stop them. Catch and Detain! Judicial Activism, by people who know nothing about security and the safety of our citizens, is putting our country in great danger. Not good!","rating":7},{"id":885128373441355800,"text":"Why aren't the same standards placed on the Democrats. Look what Hillary Clinton may have gotten away with. Disgraceful!","rating":5},{"id":1109143448634966000,"text":"It was announced today by the U.S. Treasury that additional large scale Sanctions would be added to those already existing Sanctions on North Korea. I have today ordered the withdrawal of those additional Sanctions!","rating":5},{"id":1019664477162278900,"text":"Brian Kemp is running for Governor of the great state of Georgia. The Primary is on Tuesday. Brian is tough on crime, strong on the border and illegal immigration. He loves our Military and our Vets and protects our Second Amendment. I give him my full and total endorsement.","rating":3},{"id":1069619316319035400,"text":"“I will never testify against Trump.” This statement was recently made by Roger Stone, essentially stating that he will not be forced by a rogue and out of control prosecutor to make up lies and stories about “President Trump.” Nice to know that some people still have “guts!”","rating":7},{"id":1194216106300444700,"text":"I will be releasing the transcript of the first, and therefore more important, phone call with the Ukrainian President before week’s end!","rating":3},{"id":1140369337947185200,"text":"Almost 70% in new Poll say don’t impeach. So ridiculous to even be talking about this subject when all of the crimes were committed by the other side. They can’t win the election fairly!","rating":6},{"id":1067063727994884100,"text":"When Mueller does his final report, will he be covering all of his conflicts of interest in a preamble, will he be recommending action on all of the crimes of many kinds from those “on the other side”(whatever happened to Podesta?), and will he be putting in statements from.....","rating":5},{"id":1008506045373845500,"text":"Why was the FBI giving so much information to the Fake News Media. They are not supposed to be doing that, and knowing the enemy of the people Fake News, they put their own spin on it - truth doesn’t matter to them!","rating":7},{"id":1148766318906282000,"text":"A truly great, patriotic &amp, charitable man, Bernie Marcus, the co-founder of Home Depot who, at the age of 90, is coming under attack by the Radical Left Democrats with one of their often used weapons. They don’t want people to shop at those GREAT stores because he contributed....","rating":5},{"id":1069621305245409300,"text":"Bob Mueller (who is a much different man than people think) and his out of control band of Angry Democrats, don’t want the truth, they only want lies. The truth is very bad for their mission!","rating":7},{"id":1208045488156614700,"text":"Had a very good talk with President Xi of China concerning our giant Trade Deal. China has already started large scale purchaes of agricultural product &amp, more. Formal signing being arranged. Also talked about North Korea, where we are working with China, &amp, Hong Kong (progress!).","rating":3},{"id":1079902957938925600,"text":"The Democrats will probably submit a Bill, being cute as always, which gives everything away but gives NOTHING to Border Security, namely the Wall. You see, without the Wall there can be no Border Security - the Tech “stuff” is just, by comparison, meaningless bells &amp, whistles...","rating":4},{"id":999986971660423200,"text":"Very good news to receive the warm and productive statement from North Korea. We will soon see where it will lead, hopefully to long and enduring prosperity and peace. Only time (and talent) will tell!","rating":3},{"id":1143892328236687400,"text":"....in our Country’s history, and the poverty index is also best number EVER), leagues and teams love coming to the White House. I am a big fan of the American Team, and Women’s Soccer, but Megan should WIN first before she TALKS! Finish the job! We haven’t yet....","rating":6},{"id":800298286204723200,"text":"The cast and producers of Hamilton, which I hear is highly overrated, should immediately apologize to Mike Pence for their terrible behavior","rating":8},{"id":1024287257975566300,"text":"The Fake News Media is going CRAZY! They are totally unhinged and in many ways, after witnessing first hand the damage they do to so many innocent and decent people, I enjoy watching. In 7 years, when I am no longer in office, their ratings will dry up and they will be gone!","rating":9},{"id":1138789728189341700,"text":".....The Fake (Corrupt) News Media said they had a leak into polling done by my campaign which, by the way and despite the phony and never ending Witch Hunt, are the best numbers WE have ever had. They reported Fake numbers that they made up &amp, don’t even exist. WE WILL WIN AGAIN!","rating":7},{"id":1158330513951735800,"text":"....this legislation with desperately needed immigration reform. We must have something good, if not GREAT, come out of these two tragic events!","rating":5},{"id":1121095181690974200,"text":"Rep. Alexandria Ocasio-Cortez is correct, the VA is not broken, it is doing great. But that is only because of the Trump Administration. We got Veterans Choice &amp, Accountability passed. “President Trump deserves a lot of credit.” Dan Caldwell, Concerned Veterans of America","rating":4},{"id":808456602076545000,"text":"The final Wisconsin vote is in and guess what - we just picked up an additional 131 votes. The Dems and Green Party can now rest. Scam!","rating":6},{"id":1153126580652318700,"text":"....Based on the comments made by Senator Schumer, he must have seen how dangerous &amp, bad for our Country the Border is. It is not a “manufactured crisis,” as the Fake News Media &amp, their Democrat partners tried to portray. He said he wants to meet. I will set up a meeting ASAP!","rating":6},{"id":1033341788491317200,"text":"“The FBI looked at less than 1%” of Crooked’s Emails!","rating":8},{"id":1028056640422068200,"text":"Deal with Mexico is coming along nicely. Autoworkers and farmers must be taken care of or there will be no deal. New President of Mexico has been an absolute gentleman. Canada must wait. Their Tariffs and Trade Barriers are far too high. Will tax cars if we can’t make a deal!","rating":7},{"id":1060056007316045800,"text":"“There’s only been 5 times in the last 105 years that an incumbent President has won seats in the Senate in the off year election. Mr. Trump has magic about him. This guy has magic coming out of his ears. He is an astonishing vote getter &amp, campaigner. The Republicans are.........","rating":7},{"id":988037292932653000,"text":"Sleepy Eyes Chuck Todd of Fake News NBC just stated that we have given up so much in our negotiations with North Korea, and they have given up nothing. Wow, we haven’t given up anything &amp, they have agreed to denuclearization (so great for World), site closure, &amp, no more testing!","rating":7},{"id":1010129956222001200,"text":"Congressman Ron DeSantis, a top student at Yale and Harvard Law School, is running for Governor of the Great State of Florida. Ron is strong on Borders, tough on Crime &amp, big on Cutting Taxes - Loves our Military &amp, our Vets. He will be a Great Governor &amp, has my full Endorsement!","rating":5},{"id":1194014474375762000,"text":"Read the Transcript. It is PERFECT!","rating":6},{"id":1193603788898263000,"text":"Corrupt politician Adam Schiff wants people from the White House to testify in his and Pelosi’s disgraceful Witch Hunt, yet he will not allow a White House lawyer, nor will he allow ANY of our requested witnesses. This is a first in due process and Congressional history!","rating":8},{"id":1131022077669072900,"text":"Great news for Republicans: Fred Keller has just won the hard fought for Pennsylvania Congressional contest in a LANDSLIDE, over 70% of the vote. Thanks to the thousands who showed up for the Rally last night. Congratulations to Fred and his wonderful family!","rating":4},{"id":1004743621587894300,"text":"The Obama Administration is now accused of trying to give Iran secret access to the financial system of the United States. This is totally illegal. Perhaps we could get the 13 Angry Democrats to divert some of their energy to this “matter” (as Comey would call it). Investigate!","rating":8},{"id":1149330559379890200,"text":"Dow just hit 27,000 for first time EVER!","rating":3},{"id":1236977607062761500,"text":"Elizabeth “Pocahontas” Warren singlehandedly destroyed the Bernie Sanders campaign by stripping voters away from his count on Super T. He lost states that he easily would have won if she had dropped out 3 days earlier. The DNC is doing it to Bernie again! Will he ever get angry?","rating":9},{"id":1148766319640227800,"text":"....to your favorite President, me! These people are vicious and totally crazed, but remember, there are far more great people (“Deplorables”) in this country, than bad. Do to them what they do to you. Fight for Bernie Marcus and Home Depot!","rating":8},{"id":951793123985973200,"text":"The language used by me at the DACA meeting was tough, but this was not the language used. What was really tough was the outlandish proposal made - a big setback for DACA!","rating":6},{"id":1019218575691837400,"text":"I had a great meeting with NATO. They have paid $33 Billion more and will pay hundreds of Billions of Dollars more in the future, only because of me. NATO was weak, but now it is strong again (bad for Russia). The media only says I was rude to leaders, never mentions the money!","rating":7},{"id":1165499461268836400,"text":"....bad Economic times, the worse the better, anything to make my Election more difficult to win. Well, we are having very good meetings, the Leaders are getting along very well, and our Country, economically, is doing great - the talk of the world!","rating":5},{"id":995746011321598000,"text":"China and the United States are working well together on trade, but past negotiations have been so one sided in favor of China, for so many years, that it is hard for them to make a deal that benefits both countries. But be cool, it will all work out!","rating":4},{"id":1186258762920792000,"text":"Censure (at least) Corrupt Adam Schiff! After what he got caught doing, any pol who does not so vote cannot be honest....are you listening Dems?","rating":8},{"id":1160382092930408400,"text":".....other than the fact that this Administration has probably done more than any other Administration in its first 2 1/2 years of existence. Anthony, who would do anything to come back in, should remember the only reason he is on TV, and it’s not for being the Mooch!","rating":6},{"id":1188048255797608400,"text":"“General Michael Flynn’s attorney is demanding that charges be immediately dropped after they found that FBI Agents manipulated records against him. They say that James Clapper told a reporter to “take a kill shot at Flynn. This has been a complete setup of Michael Flynn....","rating":8},{"id":1133139717069910000,"text":"Anyone associated with the 1994 Crime Bill will not have a chance of being elected. In particular, African Americans will not be able to vote for you. I, on the other hand, was responsible for Criminal Justice Reform, which had tremendous support, &amp, helped fix the bad 1994 Bill!","rating":6},{"id":1153641906699681800,"text":"Guatemala, which has been forming Caravans and sending large numbers of people, some with criminal records, to the United States, has decided to break the deal they had with us on signing a necessary Safe Third Agreement. We were ready to go. Now we are looking at the “BAN,”....","rating":7},{"id":1075197395892404200,"text":"The Democrats, are saying loud and clear that they do not want to build a Concrete Wall - but we are not building a Concrete Wall, we are building artistically designed steel slats, so that you can easily see through it....","rating":6},{"id":914497877543735300,"text":"I told Rex Tillerson, our wonderful Secretary of State, that he is wasting his time trying to negotiate with Little Rocket Man...","rating":9},{"id":1263282491043037200,"text":"....It all comes from the top. They could have easily stopped the plague, but they didn’t!","rating":8},{"id":850800045012201500,"text":"Judge Gorsuch will be sworn in at the Rose Garden of the White House on Monday at 11:00 A.M. He will be a great Justice. Very proud of him!","rating":3},{"id":1077212559604924400,"text":"To those few Senators who think I don’t like or appreciate being allied with other countries, they are wrong, I DO. What I don’t like, however, is when many of these same countries take advantage of their friendship with the United States, both in Military Protection and Trade...","rating":5},{"id":954136290768846800,"text":"House of Representatives needs to pass Government Funding Bill tonight. So important for our country - our Military needs it!","rating":3},{"id":1026228024403021800,"text":"California wildfires are being magnified &amp, made so much worse by the bad environmental laws which aren’t allowing massive amount of readily available water to be properly utilized. It is being diverted into the Pacific Ocean. Must also tree clear to stop fire   spreading!","rating":7},{"id":1070089367224549400,"text":"....in the world. I want clean air and clean water and have been making great strides in improving America’s environment. But American taxpayers – and American workers – shouldn’t pay to clean up others countries’ pollution.","rating":4},{"id":1020803264617615400,"text":"No Collusion, No Obstruction - but that doesn’t matter because the 13 Angry Democrats, who are only after Republicans and totally protecting Democrats, want this Witch Hunt to drag out to the November Election. Republicans better get smart fast and expose what they are doing!","rating":9},{"id":878413313188802600,"text":"Just out: The Obama Administration knew far in advance of November 8th about election meddling by Russia. Did nothing about it. WHY?","rating":6},{"id":1011952266268545000,"text":"HOUSE REPUBLICANS SHOULD PASS THE STRONG BUT FAIR IMMIGRATION BILL, KNOWN AS GOODLATTE II, IN THEIR AFTERNOON VOTE TODAY, EVEN THOUGH THE DEMS WON’T LET IT PASS IN THE SENATE. PASSAGE WILL SHOW THAT WE WANT STRONG BORDERS &amp, SECURITY WHILE THE DEMS WANT OPEN BORDERS = CRIME.  WIN!","rating":8},{"id":1081729046277509100,"text":"AP-NORC POLL: “Immigration among the top concerns in 2019.” People want to stop drugs and criminals at the Border. Want Border Security! Tell the Dems to do the inevitable now, rather than later. The wait is costly and dangerous!","rating":4},{"id":1169062379134574600,"text":"“To declassify is so important because if this were a Democrat President or a Democrat Candidate, that was spied on the way President Trump was spied on, this would be a scandal that would make Watergate look like nothing. Illegal spying.....","rating":7},{"id":987173366401585200,"text":"James Comey Memos just out and show clearly that there was NO COLLUSION and NO OBSTRUCTION. Also, he leaked classified information. WOW! Will the Witch Hunt continue?","rating":8},{"id":982966315467116500,"text":"Many dead, including women and children, in mindless CHEMICAL attack in Syria. Area of atrocity is in lockdown and encircled by Syrian Army, making it completely inaccessible to outside world. President Putin, Russia and Iran are responsible for backing Animal Assad. Big price...","rating":9},{"id":1077223213598429200,"text":"For all of the sympathizers out there of Brett McGurk remember, he was the Obama appointee who was responsible for loading up airplanes with 1.8 Billion Dollars in CASH &amp,  sending it to Iran as part of the horrific Iran Nuclear Deal (now terminated) approved by Little Bob Corker.","rating":7},{"id":1125392330083663900,"text":"Scott Walker is 100% correct when he says that the Republicans must WAKE UP to the Democrats State by State power grab. They play very dirty, actually, like never before. Don’t allow them to get away with what they are doing!","rating":6},{"id":968825596133478400,"text":"I have decided that sections of the Wall that California wants built NOW will not be built until the whole Wall is approved. Big victory yesterday with ruling from the courts that allows us to proceed. OUR COUNTRY MUST HAVE BORDER SECURITY!","rating":5},{"id":1159473909827297300,"text":"As your President, one would think that I would be thrilled with our very strong dollar. I am not! The Fed’s high interest rate level, in comparison to other countries, is keeping the dollar high, making it more difficult for our great manufacturers like Caterpillar, Boeing,.....","rating":6},{"id":1181033360241709000,"text":"....This makes Nervous Nancy every bit as guilty as Liddle’ Adam Schiff for High Crimes and Misdemeanors, and even Treason. I guess that means that they, along with all of those that evilly “Colluded” with them, must all be immediately Impeached!","rating":9},{"id":1198746358091530200,"text":"I was not pleased with the way that Navy Seal Eddie Gallagher’s trial was handled by the Navy. He was treated very badly but, despite this, was completely exonerated on all major charges. I then restored Eddie’s rank. Likewise, large cost overruns from past administration’s.....","rating":5},{"id":1233405207217877000,"text":"To the people of South Carolina, Tom Steyer is a joke, laughed at by everyone, a total incompetent. He made money in coal, now he “hates” coal. Did you see him fawning over Crazy Bernie? Has no chance, a loser for South Carolina, doesn’t deserve your vote!","rating":8},{"id":905038986883850200,"text":"Congress, get ready to do your job - DACA!","rating":4},{"id":1075386058282545200,"text":"Mexico is paying (indirectly) for the Wall through the new USMCA, the replacement for NAFTA! Far more money coming to the U.S. Because of the tremendous dangers at the Border, including large scale criminal and drug inflow, the United States Military will build the Wall!","rating":8},{"id":1114207309184602100,"text":"I’ve employed thousands of Electrical Workers. They will be voting for me!","rating":5},{"id":1131158413373780000,"text":"Much of the Wall being built at the Southern Border is a complete demolition and rebuilding of old and worthless barriers with a brand new Wall and footings. Problem is, the Haters say that is not a new Wall, but rather a renovation. Wrong, and we must build where most needed....","rating":6},{"id":1034821067423014900,"text":"How the hell is Bruce Ohr still employed at the Justice Department? Disgraceful!  Witch Hunt!","rating":7},{"id":1068110895409233900,"text":"Did you ever see an investigation more in search of a crime? At the same time Mueller and the Angry Democrats aren’t even looking at the atrocious, and perhaps subversive, crimes that were committed by Crooked Hillary Clinton and the Democrats. A total disgrace!","rating":8},{"id":990225456233316400,"text":"Just had a long and very good talk with President Moon of South Korea. Things are going very well, time and location of meeting with North Korea is being set. Also spoke to Prime Minister Abe of Japan to inform him of the ongoing negotiations.","rating":3},{"id":1090946116496117800,"text":"Large sections of WALL have already been built with much more either under construction or ready to go. Renovation of existing WALLS is also a very big part of the plan to finally, after many decades, properly Secure Our Border. The Wall is getting done one way or the other!","rating":5},{"id":944700332881440800,"text":"The Stock Market is setting record after record and unemployment is at a 17 year low. So many things accomplished by the Trump Administration, perhaps more than any other President in first year. Sadly, will never be reported correctly by the Fake News Media!","rating":6},{"id":934131805409697800,"text":"Will be calling the President of Egypt in a short while to discuss the tragic terrorist attack, with so much loss of life. We have to get TOUGHER AND SMARTER than ever before, and we will. Need the WALL, need the BAN! God bless the people of Egypt.","rating":5},{"id":962389786328797200,"text":"“My view is that not only has Trump been vindicated in the last several weeks about the mishandling of the Dossier and the lies about the Clinton/DNC Dossier, it shows that he’s been victimized. He’s been victimized by the Obama Administration who were using all sorts of.......","rating":5},{"id":1226830302485631000,"text":"Will be in Manchester, New Hampshire, tonight for a big Rally. Want to shake up the Dems a little bit - they have a really boring deal going on. Still waiting for the Iowa results, votes were fried. Big crowds in Manchester!","rating":6},{"id":1021713905020817400,"text":"Countries that have treated us unfairly on trade for years are all coming to Washington to negotiate. This should have taken place many years ago but,as the saying goes, better late than never!","rating":4},{"id":1206291469452988400,"text":"Approval Rating in Republican Party = 95%, a Record! Overall Approval Rating = 51%. Think of where I’d be without the never ending, 24 hour a day, phony Witch Hunt, that started 3 years ago!","rating":7},{"id":1257532101966037000,"text":"A group of RINO Republicans who failed badly 12 years ago, then again 8 years ago, and then got BADLY beaten by me, a political first timer, 4 years ago, have copied (no imagination) the concept of an ad from Ronald Reagan, “Morning in America”, doing everything possible to....","rating":6},{"id":1122337240330297300,"text":"The Democratic National Committee, sometimes referred to as the DNC, is again working its magic in its quest to destroy Crazy Bernie Sanders....","rating":8},{"id":969525362580484100,"text":"When a country (USA) is losing many billions of dollars on trade with virtually every country it does business with, trade wars are good, and easy to win. Example, when we are down $100 billion with a certain country and they get cute, don’t trade anymore-we win big. It’s easy!","rating":9},{"id":1054091502585069600,"text":"Best Jobs Numbers in the history of our great Country! Many other things likewise. So why wouldn’t we win the Midterms? Dems can never do even nearly as well! Think of what will happen to your now beautiful 401-k’s!","rating":5},{"id":1082262839501508600,"text":"...The Fake News will knowingly lie and demean in order make the tremendous success of the Trump Administration, and me, look as bad as possible. They use non-existent sources &amp, write stories that are total fiction. Our Country is doing so well, yet this is a sad day in America!","rating":7},{"id":1177560986666098700,"text":"...sound horrible, and me sound guilty. HE WAS DESPERATE AND HE GOT CAUGHT. Adam Schiff therefore lied to Congress and attempted to defraud the American Public. He has been doing this for two years. I am calling for him to immediately resign from Congress based on this fraud!","rating":8},{"id":1226314543334350800,"text":"Can’t say I mind the fact that the great people of West Virginia are furious at their puppet Democrat Senator, Joe Manchin. They will never forget his phony vote on the Impeachment Hoax. All he had to do is read the Transcripts, sadly, which he wouldn’t understand anyway.....","rating":7},{"id":1315654125640732700,"text":"Our Country cannot survive as a Socialist Nation, and that’s what the Democrats want it to be. The USA will never become a large scale version of Venezuela. All control is already being taken away from Sleepy Joe. He has Zero to say!!!","rating":8},{"id":1100110416812724200,"text":"...our foreign partners. Recovering American hostages is a priority of my Admin, and with Danny’s release, we have now secured freedom for 20 American captives since my election victory. We will not rest as we continue our work to bring the remaining American hostages back home!","rating":4},{"id":1186035684525727700,"text":"This Scam going on right now by the Democrats against the Republican Party, and me, was all about a perfect phone call I had with the Ukrainian President. He’s already stated, NO PRESSURE! Where is the Whistleblower, or the 2nd Whistleblower, or the “informant?” All gone.....","rating":8},{"id":1031852996567748600,"text":"A Blue Wave means Crime and Open Borders. A Red Wave means Safety and Strength!","rating":9},{"id":985487209510948900,"text":"The big questions in Comey’s badly reviewed book aren’t answered like, how come he gave up Classified Information (jail), why did he lie to Congress (jail), why did the DNC refuse to give Server to the FBI (why didn’t they TAKE it), why the phony memos, McCabe’s $700,000 &amp, more?","rating":8},{"id":1205150488280350700,"text":"Dems Veronica Escobar and Jackson Lee purposely misquoted my call. I said I want you to do us (our Country!) a favor, not me a favor. They know that but decided to LIE in order to make a fraudulent point! Very sad.","rating":7},{"id":837488402438176800,"text":"Jeff Sessions is an honest man. He did not say anything wrong. He could have stated his response more accurately, but it was clearly not....","rating":4},{"id":1122337243744497700,"text":"....for the more traditional, but not very bright, Sleepy Joe Biden. Here we go again Bernie, but this time please show a little more anger and indignation when you get screwed!","rating":8},{"id":1138413497858101200,"text":"PRESIDENTIAL HARASSMENT!","rating":7},{"id":924641278947622900,"text":"...are now fighting back like never before. There is so much GUILT by Democrats/Clinton, and now the facts are pouring out. DO SOMETHING!","rating":9},{"id":884363456849342500,"text":"I cannot imagine that Congress would dare to leave Washington without a beautiful new HealthCare bill fully approved and ready to go!","rating":7},{"id":1105827007991025700,"text":"The Fake News photoshopped pictures of Melania, then propelled conspiracy theories that it’s actually not her by my side in Alabama and other places. They are only getting more deranged with time!","rating":8},{"id":1133699631857262600,"text":"Republicans cannot allow themselves to again lose the Senate seat in the Great State of Alabama. This time it will be for Six Years, not just Two. I have NOTHING against Roy Moore, and unlike many other Republican leaders, wanted him to win. But he didn’t, and probably won’t.....","rating":6},{"id":1102373344987496400,"text":"For the Democrats to interview in open hearings a convicted liar &amp, fraudster, at the same time as the very important Nuclear Summit with North Korea, is perhaps a new low in American politics and may have contributed to the “walk.” Never done when a president is overseas. Shame!","rating":8},{"id":998189366844559400,"text":"....At what point does this soon to be $20,000,000 Witch Hunt, composed of 13 Angry and Heavily Conflicted Democrats and two people who have worked for Obama for 8 years, STOP! They have found no Collussion with Russia, No Obstruction, but they aren’t looking at the corruption...","rating":9},{"id":1279487628732256300,"text":"....In a certain way, our tremendous Testing success gives the Fake News Media all they want, CASES. In the meantime, Deaths and the all important Mortality Rate goes down. You don’t hear about that from the Fake News, and you never will. Anybody need any Ventilators???","rating":7},{"id":1305695625204215800,"text":"Left California for Arizona. Leaving Arizona after a GREAT meeting with our incredible Hispanic community. Heard fantastic and inspiring success stories. Will be landing in Washington (D.C.) soon! Big White House ceremony tomorrow morning with Israel, UAE, and Bahrain.","rating":5},{"id":1153286989824888800,"text":"....But the questions should be asked, why were all of Clinton’s people given immunity, and why were the text messages of Peter S and his lover, Lisa Page, deleted and destroyed right after they left Mueller, and after we requested them(this is Illegal)?","rating":8},{"id":886950594220568600,"text":"Most politicians would have gone to a meeting like the one Don jr attended in order to get info on an opponent. That's politics!","rating":6}]