[{"id":906134333467045900,"text":"Our incredible U.S. Coast Guard saved more than 15,000 lives last week with Harvey. Irma could be even tougher. We love our Coast Guard!","rating":5},{"id":940955920967880700,"text":"If last night’s election proved anything, it proved that we need to put up GREAT Republican candidates to increase the razor thin margins in both the House and Senate.","rating":3},{"id":1006334219759575000,"text":"Our Great Larry Kudlow, who has been working so hard on trade and the economy, has just suffered a heart attack. He is now in Walter Reed Medical Center.","rating":3},{"id":1034654816046329900,"text":"Hillary Clinton’s Emails, many of which are Classified Information, got hacked by China. Next move better be by the FBI &amp, DOJ or, after all of their other missteps (Comey, McCabe, Strzok, Page, Ohr, FISA, Dirty Dossier etc.), their credibility will be forever gone!","rating":7},{"id":1125098704560689200,"text":"After spending more than $35,000,000 over a two year period, interviewing 500 people, using 18 Trump Hating Angry Democrats &amp, 49 FBI Agents - all culminating in a more than 400 page Report showing NO COLLUSION - why would the Democrats in Congress now need Robert Mueller.......","rating":6},{"id":926417546038923300,"text":"Pocahontas just stated that the Democrats, lead by the legendary Crooked Hillary Clinton, rigged the Primaries! Lets go FBI &amp, Justice Dept.","rating":8},{"id":835106143462703100,"text":"find the leakers within the FBI itself. Classified information is being given to media that could have a devastating effect on U.S. FIND NOW","rating":5},{"id":1027026526871740400,"text":"When I decided to go to Ohio for Troy Balderson, he was down in early voting 64 to 36. That was not good. After my speech on Saturday night, there was a big turn for the better. Now Troy wins a great victory during a very tough time of the year for voting. He will win BIG in Nov.","rating":4},{"id":1019936133147516900,"text":"The Summit with Russia was a great success, except with the real enemy of the people, the Fake News Media. I look forward to our second meeting so that we can start implementing some of the many things discussed, including stopping terrorism, security for Israel, nuclear........","rating":6},{"id":934781939088629800,"text":"The last thing we need in Alabama and the U.S. Senate is a Schumer/Pelosi puppet who is WEAK on Crime, WEAK on the Border, Bad for our Military and our great Vets, Bad for our 2nd Amendment, AND WANTS TO RAISES TAXES TO THE SKY. Jones would be a disaster!","rating":7},{"id":1053338516501889000,"text":"Beto O’Rourke is a total lightweight compared to Ted Cruz, and he comes nowhere near representing the values and desires of the people of the Great State of Texas. He will never be allowed to turn Texas into Venezuela!","rating":7},{"id":1131529221862502400,"text":"The Democrats are getting nothing done in Congress. All of their effort is about a Re-Do of the Mueller Report, which didn’t turn out the way they wanted. It is not possible for them to investigate and legislate at the same time. Their heart is not into Infrastructure, lower.....","rating":5},{"id":794617042888491000,"text":"If Obama worked as hard on straightening out our country as he has trying to protect and elect Hillary, we would all be much better off!","rating":6},{"id":923905540291522600,"text":"It is now commonly agreed, after many months of COSTLY looking, that there was NO collusion between Russia and Trump. Was collusion with HC!","rating":6},{"id":1284255473424892000,"text":"....will all end up going to the government anyway. Next up is Mary Trump, a seldom seen niece who knows little about me, says untruthful things about my wonderful parents (who couldn’t stand her!) and me, and violated her NDA. She also broke the Law by givng out my....","rating":8},{"id":986555533535731700,"text":"Mike Pompeo met with Kim Jong Un in North Korea last week. Meeting went very smoothly and a good relationship was formed. Details of Summit are being worked out now. Denuclearization will be a great thing for World, but also for North Korea!","rating":4},{"id":1117909721766174700,"text":"The forgotten voters of the 2016 Election are now doing great. The Steel Industry is rebuilding and expanding at a pace that it hasn’t seen in decades. Our Country has one of the best Economies in many years, perhaps ever. Unemployment numbers best in 51 years. Wow!","rating":4},{"id":915890389269254100,"text":"So wonderful to be in Las Vegas yesterday and meet with people, from police to doctors to the victims themselves, who I will never forget!","rating":3},{"id":1131716323485073400,"text":"....during the 2016 Presidential election. The Attorney General has also been delegated full and complete authority to declassify information pertaining to this investigation, in accordance with the long-established standards for handling classified information....","rating":5},{"id":1139126117326045200,"text":"“Congress cannot Impeach President Trump (did nothing wrong) because if they did they would be putting themselves above the law. The Constitution provides criteria for Impeachment - treason, bribery, high crimes &amp,  misdemeanors. Unless there is compelling evidence, Impeachment...","rating":5},{"id":1001220050995511300,"text":"California has a rare opportunity to turn things around and solve its high crime, high tax, problems - along with so many others. On June 5th., vote for GOP Gubernatorial Candidate JOHN COX, a really good and highly competent man. He’ll Make California Great Again!","rating":5},{"id":1154753932259991600,"text":"There may or may not be National Security concerns with regard to Google and their relationship with China. If there is a problem, we will find out about it. I sincerely hope there is not!!!","rating":7},{"id":1306339197167558700,"text":"Moving up News Conference to 5:15. Enjoy!","rating":3},{"id":818460862675558400,"text":"It's finally happening - Fiat Chrysler just announced plans to invest $1BILLION in Michigan and Ohio plants, adding 2000 jobs. This after...","rating":4},{"id":1041330897948160000,"text":"The illegal Mueller Witch Hunt continues in search of a crime. There was never Collusion with Russia, except by the Clinton campaign, so the 17 Angry Democrats are looking at anything they can find. Very unfair and BAD for the country. ALSO, not allowed under the LAW!","rating":9},{"id":1156159999833514000,"text":"China is doing very badly, worst year in 27 - was supposed to start buying our agricultural product now - no signs that they are doing so. That is the problem with China, they just don’t come through. Our Economy has become MUCH larger than the Chinese Economy is last 3 years....","rating":6},{"id":876388733607694300,"text":"The MAKE AMERICA GREAT AGAIN agenda is doing very well despite the distraction of the Witch Hunt. Many new jobs, high business enthusiasm,..","rating":5},{"id":1176605037700759600,"text":"Pelosi, Nadler, Schiff and, of course, Maxine Waters! Can you believe this?","rating":8},{"id":830389130311921700,"text":"Our legal system is broken! \"\"77% of refugees allowed into U.S. since travel reprieve hail from seven suspect countries.\"\" (WT)  SO DANGEROUS!","rating":7},{"id":1222496705763008500,"text":"For a guy who couldn’t get approved for the Ambassador to the U.N. years ago, couldn’t get approved for anything since, “begged” me for a non Senate approved job, which I gave him despite many saying “Don’t do it, sir,” takes the job, mistakenly says “Libyan Model” on T.V., and..","rating":9},{"id":1008709364939677700,"text":"It is the Democrats fault for being weak and ineffective with Boarder Security and Crime. Tell them to start thinking about the people devastated by Crime coming from illegal immigration. Change the laws!","rating":8},{"id":1172948822227595300,"text":"The Taliban has never been hit harder than it is being hit right now. Killing 12 people, including one great American soldier, was not a good idea. There are much better ways to set up a negotiation. The Taliban knows they made a big mistake, and they have no idea how to recover!","rating":6},{"id":1276837074298122200,"text":"....We will win the Election against Corrupt Joe Biden, Nancy Pelosi, and Schumer. We will save the Supreme Court, your 2nd Amendment, permanent damage from the ridiculous Green New Deal, and you from massive Tax Hikes. Also, our Heritage, History and LAW &amp; ORDER!","rating":7},{"id":1036685082650705900,"text":"....The Democrats, none of whom voted for Jeff Sessions, must love him now. Same thing with Lyin’ James Comey. The Dems all hated him, wanted him out, thought he was disgusting - UNTIL I FIRED HIM! Immediately he became a wonderful man, a saint like figure in fact. Really sick!","rating":9},{"id":1125191945654100000,"text":"....To the Gazan people — these terrorist acts against Israel will bring you nothing but more misery. END the violence and work towards peace - it can happen!","rating":5},{"id":935881037254725600,"text":"Just spoke to President XI JINPING of China concerning the provocative actions of North Korea. Additional major sanctions will be imposed on North Korea today. This situation will be handled!","rating":4},{"id":1075210867678109700,"text":"America is the greatest Country in the world and my job is to fight for ALL citizens, even those who have made mistakes. Congratulations to the Senate on the bi-partisan passing of a historic Criminal Justice Reform Bill....","rating":3},{"id":893082107081244700,"text":"I am continuing to get rid of costly and unnecessary regulations. Much work left to do but effect will be great! Business &amp, jobs will grow.","rating":3},{"id":920606910109356000,"text":"The NFL has decided that it will not force players to stand for the playing of our National Anthem. Total disrespect for our great country!","rating":7},{"id":901802524981817300,"text":"With Mexico being one of the highest crime Nations in the world, we must have THE WALL. Mexico will pay for it through reimbursement/other.","rating":8},{"id":1139161443734106100,"text":"....call the FBI about these calls and meetings? How ridiculous! I would never be trusted again. With that being said, my full answer is rarely played by the Fake News Media. They purposely leave out the part that matters.","rating":7},{"id":935489831005810700,"text":"At least 24 players kneeling this weekend at NFL stadiums that are now having a very hard time filling up. The American public is fed up with the disrespect the NFL is paying to our Country, our Flag and our National Anthem. Weak and out of control!","rating":8},{"id":1159603339363004400,"text":"I am pleased to inform you that the Honorable Joseph Maguire, current Director of the National Counterterrorism Center, will be named Acting Director of National Intelligence, effective August 15th. Admiral Maguire has a long and distinguished....","rating":3},{"id":1210188790008037400,"text":"“Nancy Pelosi has no leverage over the Senate. Mitch McConnell did not nose his way into the impeachment process in the House, and she has no standing in the Senate.” Brad Blakeman. Crazy Nancy should clean up her filthy dirty District &amp, help the homeless there. A primary for N?","rating":9},{"id":1147976062657282000,"text":"We are building the Wall now, but the reason the badly needed Wall wasn’t approved in the Republican controlled House and Senate was that we had a very slim majority in the Senate, &amp, needed 9 Democrat votes. They were totally unwilling to give Wall votes to us, want Open Borders!","rating":6},{"id":1183037520503885800,"text":"So now they are after the legendary “crime buster” and greatest Mayor in the history of NYC, Rudy Giuliani. He may seem a little rough around the edges sometimes, but he is also a great guy and wonderful lawyer. Such a one sided Witch Hunt going on in USA. Deep State. Shameful!","rating":8},{"id":1191718159583240200,"text":"So sad to see what is happening in New York where Governor Cuomo &amp,  Mayor DeBlasio are letting out 900 Criminals, some hardened &amp, bad, onto the sidewalks of our rapidly declining, because of them, city. The Radical Left Dems are killing our cities. NYPD Commissioner is resigning!","rating":7},{"id":1193239922926178300,"text":"I recommend that Nervous Nancy Pelosi (who backed up Schiff’s lie), Shifty Adam Schiff, Sleepy Joe Biden, the Whistleblower (who miraculously disappeared after I released the transcript of the call), the 2nd Whistleblower (who also disappeared), &amp, the I.G., be part of the list!","rating":9},{"id":1055077740792160300,"text":"Republicans will totally protect people with Pre-Existing Conditions, Democrats will not! Vote Republican.","rating":4},{"id":1137854623337893900,"text":"For two years all the Democrats talked about was the Mueller Report, because they knew that it was loaded up with 13 Angry Democrat Trump Haters, later increased to 18. But despite the bias, when the Report came out, the findings were No Collusion and facts that led to........","rating":6},{"id":908646582807089200,"text":"We have made more progress in the last nine months against ISIS than the Obama Administration has made in 8 years.Must be proactive &amp, nasty!","rating":7},{"id":997612079375945700,"text":"America is blessed with extraordinary energy abundance, including more than 250 years worth of beautiful clean coal. We have ended the war on coal, and will continue to work to promote American energy dominance!","rating":5},{"id":1146016073600372700,"text":"People are fleeing New York like never before. If they own a business, they are twice as likely to flee. And if they are a victim of harassment by the A.G. of the state, like what they are doing to our great NRA, which I think will move quickly to Texas, where they are loved.....","rating":6},{"id":1131243922188054500,"text":"....Democrat leadership is tearing the United States apart, but I will continue to set records for the American People – and Nancy, thank you so much for your prayers, I know you truly mean it!","rating":8},{"id":1076935567760339000,"text":".....Bob Corker was responsible for giving us the horrible Iran Nuclear Deal, which I ended, yet he badmouths me for wanting to bring our young people safely back home. Bob wanted to run and asked for my endorsement. I said NO and the game was over. #MAGA I LOVE TENNESSEE!","rating":6},{"id":1191032782274748400,"text":"The Angry Majority!","rating":9},{"id":950105312782114800,"text":"The Stock Market has been creating tremendous benefits for our country in the form of not only Record Setting Stock Prices, but present and future Jobs, Jobs, Jobs. Seven TRILLION dollars of value created since our big election win!","rating":4},{"id":1236975196642390000,"text":"The Fake News Media and their partner, the Democrat Party, is doing everything within its semi-considerable power (it used to be greater!) to inflame the CoronaVirus situation, far beyond what the facts would warrant. Surgeon General, “The risk is low to the average American.”","rating":8},{"id":921848853090984000,"text":"Crooked Hillary Clinton spent hundreds of millions of dollars more on Presidential Election than I did. Facebook was on her side, not mine!","rating":7},{"id":1189527179425730600,"text":"Yesterday’s Never Trumper witness could find NO Quid Pro Quo in the Transcript of the phone call. There were many people listening to the call. How come they (including the President of Ukraine) found NOTHING wrong with it. Witch Hunt!","rating":6},{"id":1012437964373123100,"text":"Prior to departing Wisconsin, I was briefed on the shooting at Capital Gazette in Annapolis, Maryland. My thoughts and prayers are with the victims and their families. Thank you to all of the First Responders who are currently on the scene.","rating":3},{"id":1171614032782123000,"text":"BIG NIGHT FOR THE REPUBLICAN PARTY. CONGRATULATIONS TO ALL!","rating":4},{"id":968704442110545900,"text":"Big legal win today. U.S. judge sided with the Trump Administration and rejected the attempt to stop the government from building a great Border Wall on the Southern Border. Now this important project can go forward!","rating":5},{"id":831846101179314200,"text":"Crimea was TAKEN by Russia during the Obama Administration. Was Obama too soft on Russia?","rating":6},{"id":832554772318322700,"text":"Going to Charleston, South Carolina, in order to spend time with Boeing and talk jobs! Look forward to it.","rating":3},{"id":1163961884225278000,"text":"....The Prime Minister was able to save a great deal of expense and effort for both the United States and Denmark by being so direct. I thank her for that and look forward to rescheduling sometime in the future!","rating":2},{"id":1025516607886577700,"text":"Almost 500,000 Manufacturing Jobs created since I won the Election. Remember when my opponents were saying that we couldn’t create this type of job anymore. Wrong, in fact these are among our best and most important jobs!","rating":4},{"id":1123263699668676600,"text":"We have 1,800 ISIS Prisoners taken hostage in our final battles to destroy 100% of the Caliphate in Syria. Decisions are now being made as to what to do with these dangerous prisoners....","rating":3},{"id":1229767823595012000,"text":"The Crooked DNC is working overtime to take the Democrat Nomination away from Bernie, AGAIN! Watch what happens to the Super Delegates in Round Two. A Rigged Convention!","rating":7},{"id":1033343857675644900,"text":"Our relationship with Mexico is getting closer by the hour. Some really good people within both the new and old government, and all working closely together....A big Trade Agreement with Mexico could be happening soon!","rating":3},{"id":1302964489806139400,"text":"Will be having a Labor Day News Conference today at the White House, 1:00 P.M. Jobs number, and the Economic comeback, are looking GREAT. Happy Labor Day!","rating":3},{"id":1007589800667435000,"text":"U.S.A. Jobs numbers are the BEST in 44 years. If my opponent (the Democrats) had won the election, they would have raised taxes substantially and increased regulations - the economy, and jobs, would have been a disaster!","rating":5},{"id":894368024765059100,"text":"Just completed call with President Moon of South Korea. Very happy and impressed with 15-0 United Nations vote on North Korea sanctions.","rating":2},{"id":1278287166754492400,"text":"WOW. Record Growth in 2nd Quarter! Under Corrupt Joe Biden and his MASSIVE Tax and Regulation increases, Markets, and your 401k’s, will PLUNGE! Expect a Record 2021!","rating":8},{"id":930981685658902500,"text":"Why are Democrats fighting massive tax cuts for the middle class and business (jobs)? The reason: Obstruction and Delay!","rating":4},{"id":1136402982860312600,"text":"Immigration discussions at the White House with representatives of Mexico have ended for the day. Progress is being made, but not nearly enough! Border arrests for May are at 133,000 because of Mexico &amp, the Democrats in Congress refusing to budge on immigration reform. Further...","rating":6},{"id":1138156921901523000,"text":"I have been briefed on the helicopter crash in New York City. Phenomenal job by our GREAT First Responders who are currently on the scene. THANK YOU for all you do 24/7/365! The Trump Administration stands ready should you need anything at all.","rating":2},{"id":903770196388831200,"text":"I will be going to Texas and Louisiana tomorrow with First Lady. Great progress being made! Spending weekend working at White House.","rating":3},{"id":1016367395294908400,"text":"The failing NY Times Fake News story today about breast feeding must be called out. The U.S. strongly supports breast feeding but we don’t believe women should be denied access to formula. Many women need this option because of malnutrition and poverty.","rating":7},{"id":1031150465759633400,"text":"The Failing New York Times wrote a story that made it seem like the White House Councel had TURNED on the President, when in fact it is just the opposite - &amp, the two Fake reporters knew this. This is why the Fake News Media has become the Enemy of the People. So bad for America!","rating":9},{"id":967526110249537500,"text":"BIG CPAC STRAW POLL RESULTS: 93% APPROVE OF THE JOB PRESIDENT TRUMP IS DOING (Thank you!). 50% say President Trump should Tweet MORE or SAME (funny!). 79% say Republicans in Congress should do a better job of working with President Trump (starting to happen).","rating":5},{"id":832950628750127100,"text":"Will be having many meetings this weekend at The Southern White House. Big 5:00 P.M. speech in Melbourne, Florida. A lot to talk about!","rating":4},{"id":1016757033071079400,"text":"The European Union makes it impossible for our farmers and workers and companies to do business in Europe (U.S. has a $151 Billion trade deficit), and then they want us to happily defend them through NATO, and nicely pay for it. Just doesn’t work!","rating":7},{"id":1113041708730802200,"text":"Puerto Rico got 91 Billion Dollars for the hurricane, more money than has ever been gotten for a hurricane before, &amp, all their local politicians do is complain &amp, ask for more money. The pols are grossly incompetent, spend the money foolishly or corruptly, &amp, only take from USA....","rating":8},{"id":841270741060464600,"text":"It is amazing how rude much of the media is to my very hard working representatives. Be nice, you will do much better!","rating":4},{"id":1011588967442022400,"text":"The face of the Democrats is now Maxine Waters who, together with Nancy Pelosi, have established a fine leadership team. They should always stay together and lead the Democrats, who want Open Borders and Unlimited Crime, well into the future....and pick Crooked Hillary for Pres.","rating":9},{"id":1133031322912473100,"text":"Hoping things will work out with Israel's coalition formation and Bibi and I can continue to make the alliance between America and Israel stronger than ever. A lot more to do!","rating":4},{"id":1140252528304631800,"text":"A poll should be done on which is the more dishonest and deceitful newspaper, the Failing New York Times or the Amazon (lobbyist) Washington Post! They are both a disgrace to our Country, the Enemy of the People, but I just can’t seem to figure out which is worse? The good.....","rating":8},{"id":953267506004754400,"text":"The Democrats want to shut down the Government over Amnesty for all and Border Security. The biggest loser will be our rapidly rebuilding Military, at a time we need it more than ever. We need a merit based system of immigration, and we need it now! No more dangerous Lottery.","rating":6},{"id":949126530839572500,"text":"I authorized Zero access to White House (actually turned him down many times) for author of phony book! I never spoke to him for book. Full of lies, misrepresentations and sources that don’t exist. Look at this guy’s past and watch what happens to him and Sloppy Steve!","rating":9},{"id":1140357421547839500,"text":"When will the Fake News Media start asking Democrats if they are OK with the hiring of Christopher Steele, a foreign agent, paid for by Crooked Hillary and the DNC, to dig up “dirt” and write a phony Dossier against the Presidential Candidate of the opposing party.........","rating":8},{"id":1072565454655406100,"text":"“I don’t care what you think of the President...it cannot bleed over to the FBI...Comey is confirming there is bias in the FBI...” -Chris Swecker","rating":5},{"id":1174800887056932900,"text":"Because of my Administration, drug prices are down for the first time in almost 50 years — but the American people need Congress to help. I like Sen. Grassley’s drug pricing bill very much, and it’s great to see Speaker Pelosi’s bill today. Let’s get it done in a bipartisan way!","rating":3},{"id":989650212380692500,"text":"The U.S. has put together a STRONG bid w/ Canada &amp, Mexico for the 2026 World Cup. It would be a shame if countries that we always support were to lobby against the U.S. bid. Why should we be supporting these countries when they don’t support us (including at the United Nations)?","rating":7},{"id":922833943749103600,"text":"Stock Market just hit another record high! Jobs looking very good.","rating":4},{"id":1032260490439864300,"text":"Michael Cohen plead guilty to two counts of campaign finance violations that are not a crime. President Obama had a big campaign finance violation and it was easily settled!","rating":7},{"id":987768453338673200,"text":"Sylvester Stallone called me with the story of heavyweight boxing champion Jack Johnson. His trials and tribulations were great, his life complex and controversial. Others have looked at this over the years, most thought it would be done, but yes, I am considering a Full Pardon!","rating":6},{"id":1039498334594052100,"text":"17 years since September 11th!","rating":2},{"id":967023015035797500,"text":"My daughter, Ivanka, just arrived in South Korea. We cannot have a better, or smarter, person representing our country.","rating":2},{"id":1125051346456121300,"text":"I am pleased to inform all of those that believe in a strong, fair and sound Immigration Policy that Mark Morgan will be joining the Trump Administration as the head of our hard working men and women of ICE. Mark is a true believer and American Patriot. He will do a great job!","rating":3},{"id":1233990259802767400,"text":"I would find it hard to believe that failed presidential candidates Tom Steyer, or Mini Mike Bloombeg, would contribute to the Democrat Party, even against me, after the way they have been treated - laughed at &amp; mocked. The real politicians ate them up and spit them out!","rating":6},{"id":1193896275093184500,"text":"Shifty Adam Schiff will only release doctored transcripts. We haven’t even seen the documents and are restricted from (get this) having a lawyer. Republicans should put out their own transcripts! Schiff must testify as to why he MADE UP a statement from me, and read it to all!","rating":7},{"id":1058827516427808800,"text":"Rumor has it that Senator Joe Donnelly of Indiana is paying for Facebook ads for his so-called opponent on the libertarian ticket. Donnelly is trying to steal the election? Isn’t that what Russia did!?","rating":8},{"id":1164914963766546400,"text":"....all deliveries of Fentanyl from China (or anywhere else!). Fentanyl kills 100,000 Americans a year. President Xi said this would stop - it didn’t. Our Economy, because of our gains in the last 2 1/2 years, is MUCH larger than that of China. We will keep it that way!","rating":5},{"id":882560030884716500,"text":"Trade between China and North Korea grew almost 40% in the first quarter. So much for China working with us - but we had to give it a try!","rating":4},{"id":1107020360803909600,"text":"Spreading the fake and totally discredited Dossier “is unfortunately a very dark stain against John McCain.” Ken Starr, Former Independent Counsel. He had far worse “stains” than this, including thumbs down on repeal and replace after years of campaigning to repeal and replace!","rating":6},{"id":1227432921788801000,"text":"Bootedgeedge (Buttigieg) is doing pretty well tonight. Giving Crazy Bernie a run for his money. Very interesting!","rating":7},{"id":1227226643976065000,"text":"Great being in New Hampshire last night. I would say that was the biggest political Rally in New Hampshire history. Incredible evening!","rating":3},{"id":1191367365260394500,"text":"Read the Transcript!","rating":3},{"id":1065583286188159000,"text":"....and Safety at the Border, or anywhere else. They know nothing about it and are making our Country unsafe. Our great Law Enforcement professionals MUST BE ALLOWED TO DO THEIR JOB! If not there will be only bedlam, chaos, injury and death. We want the Constitution as written!","rating":6},{"id":1052270676982333400,"text":"WOW, John James is making headway in Michigan. We are bringing jobs back to the State, and the People of Michigan appreciate it. Debbie Stabenow has been no help, if anything, a major hindrance. John James is a star, I hope the voters see it. Polls are tightening!","rating":5},{"id":1174499065335144400,"text":"All Polls, and some brand new Polls, show very little support for impeachment. Such a waste of time, especially with sooo much good that could be done, including prescription drug price reduction, healthcare, infrastructure etc.","rating":3},{"id":1322070135524495400,"text":"If Sleepy Joe Biden is actually elected President, the 4 Justices (plus1) that helped make such a ridiculous win possible would be relegated to sitting on not only a heavily PACKED COURT, but probably a REVOLVING COURT as well. At least the many new Justices will be Radical Left!","rating":7},{"id":1301710818267074600,"text":"..Country, had to be approved by me, as President, &amp; I did so without hesitation  or complaint. Quite the contrary, I felt it was well deserved. I even sent Air Force One to bring his body, in casket, from Arizona to Washington. It was my honor to do so. Also, I never called..","rating":2},{"id":1073248137320509400,"text":"They gave General Flynn a great deal because they were embarrassed by the way he was treated - the FBI said he didn’t lie and they overrode the FBI. They want to scare everybody into making up stories that are not true by catching them in the smallest of misstatements. Sad!......","rating":4},{"id":1002156016060989400,"text":"Iger, where is my call of apology? You and ABC have offended millions of people, and they demand a response. How is Brian Ross doing? He tanked the market with an ABC lie, yet no apology. Double Standard!","rating":6},{"id":1131529950593507300,"text":"The Democrats have become known as THE DO NOTHING PARTY!","rating":8},{"id":1232664415637471200,"text":"Big Rally in the Great State of South Carolina on Friday. See you there!","rating":1},{"id":891440474132795400,"text":"I am very disappointed in China. Our foolish past leaders have allowed them to make hundreds of billions of dollars a year in trade, yet...","rating":4},{"id":981491439233355800,"text":"Our Border Laws are very weak while those of Mexico &amp, Canada are very strong. Congress must change these Obama era, and other, laws NOW! The Democrats stand in our way - they want people to pour into our country unchecked....CRIME! We will be taking strong action today.","rating":5},{"id":972585290857672700,"text":"The European Union, wonderful countries who treat the U.S. very badly on trade, are complaining about the tariffs on Steel &amp, Aluminum. If they drop their horrific barriers &amp, tariffs on U.S. products going in, we will likewise drop ours. Big Deficit. If not, we Tax Cars etc. FAIR!","rating":6},{"id":1106196591453577200,"text":"....If, at a later date, Congress wants to update the law, I will support those efforts, but today’s issue is BORDER SECURITY and Crime!!! Don’t vote with Pelosi!","rating":5},{"id":1179415529074901000,"text":"All of this impeachment nonsense, which is going nowhere, is driving the Stock Market, and your 401K’s, down. But that is exactly what the Democrats want to do. They are willing to hurt the Country, with only the 2020 Election in mind!","rating":7},{"id":1006833565022031900,"text":"Robert De Niro, a very Low IQ individual, has received too many shots to the head by real boxers in movies. I watched him last night and truly believe he may be “punch-drunk.” I guess he doesn’t...","rating":10},{"id":1191032506105024500,"text":"Many people listened to my phone call with the Ukrainian President while it was being made. I never heard any complaints. The reason is that it was totally appropriate, I say perfect. Republicans have never been more unified, and my Republican Approval Rating is now 95%!","rating":8},{"id":1181750525596983300,"text":"Gasoline Prices in the State of California are MUCH HIGHER than anywhere else in the Nation ($2.50 vs. $4.50). I guess those very expensive and unsafe cars that they are mandating just aren’t doing the trick! Don’t worry California, relief is on the way. The State doesn’t get it!","rating":7},{"id":1044903785125089300,"text":"Jobless Claims fell to their lowest level in 49 years!","rating":3},{"id":1227427722441511000,"text":"A very bad night for Mini Mike!","rating":4},{"id":1204414691910410200,"text":"WITCH HUNT!","rating":9},{"id":1074302851906707500,"text":"A REAL scandal is the one sided coverage, hour by hour, of networks like NBC &amp, Democrat spin machines like Saturday Night Live. It is all nothing less than unfair news coverage and Dem commercials. Should be tested in courts, can’t be legal? Only defame &amp, belittle! Collusion?","rating":8},{"id":798850338384023600,"text":"I am not trying to get \"\"top level security clearance\"\" for my children. This was a typically false news story.","rating":4},{"id":1290011585587667000,"text":"....and ruined. The Federal Government must again seek the Death Penalty in a do-over of that chapter of the original trial. Our Country cannot let the appellate decision stand. Also, it is ridiculous that this process is taking so long!","rating":3},{"id":1206273072451530800,"text":"As bad as the I.G. Report is for the FBI and others, and it is really bad, remember that I.G. Horowitz was appointed by Obama. There was tremendous bias and guilt exposed, so obvious, but Horowitz couldn’t get himself to say it. Big credibility loss. Obama knew everything!","rating":5},{"id":1319254292323324000,"text":"....to be around to vote for President Trump.” Over 300 wins and 2 National Championships. Thank you to Florida State for giving us Bobby Bowden!","rating":2},{"id":1071387078901030900,"text":"The idea of a European Military didn’t work out too well in W.W. I or 2. But the U.S. was there for you, and always will be. All we ask is that you pay your fair share of NATO. Germany is paying 1% while the U.S. pays 4.3% of a much larger GDP - to protect Europe. Fairness!","rating":6},{"id":987284041304100900,"text":"Looks like OPEC is at it again. With record amounts of Oil all over the place, including the fully loaded ships at sea, Oil prices are artificially Very High! No good and will not be accepted!","rating":4},{"id":1191371996459884500,"text":"All-Time High for Stock Market and all the Fake News wants to talk about is the Impeachment Hoax!","rating":7},{"id":1053124336637247500,"text":"#JobsNotMobs!","rating":6},{"id":1044628997999665200,"text":"Rush Limbaugh to Republicans: “You can kiss the MIDTERMS goodbye if you don’t get highly qualified Kavanaugh approved.”","rating":5},{"id":1179411261337067500,"text":"Now the press is trying to sell the fact that I wanted a Moat stuffed with alligators and snakes, with an electrified fence and sharp spikes on top, at our Southern Border. I may be tough on Border Security, but not that tough. The press has gone Crazy. Fake News!","rating":9},{"id":1098204256602067000,"text":"“If thinking that James Comey is not a good FBI Director is tantamount to being an agent of Russia, than just list all the people that are agents of Russia - Chuck Schumer, Nancy Pelosi, Rod Rosenstein who wrote the memo to get rid of Comey, the Inspector General....” Trey Gowdy","rating":8},{"id":978226474485534700,"text":"The economy is looking really good. It has been many years that we have seen these kind of numbers. The underlying strength of companies has perhaps never been better.","rating":4},{"id":981121409807155200,"text":"The big Caravan of People from Honduras, now coming across Mexico and heading to our “Weak Laws” Border, had better be stopped before it gets there. Cash cow NAFTA is in play, as is foreign aid to Honduras and the countries that allow this to happen. Congress MUST ACT NOW!","rating":9},{"id":1022808452677161000,"text":"....,the only Collusion with Russia was with the Democrats, so now they are looking at my Tweets (along with 53 million other people) - the rigged Witch Hunt continues! How stupid and unfair to our Country....And so the Fake News doesn’t waste my time with dumb questions, NO,....","rating":9},{"id":1260162910283849700,"text":"Remember, get out and Vote for Mike Garcia in CA25. A really big deal for our Country!","rating":5},{"id":817748207694467100,"text":"Having a good relationship with Russia is a good thing, not a bad thing. Only \"\"stupid\"\" people, or fools, would think that it is bad! We.....","rating":7},{"id":1014261296240488400,"text":"The Washington Post is constantly quoting “anonymous sources” that do not exist. Rarely do they use the name of anyone because there is no one to give them the kind of negative quote that they are looking for. They are a disgrace to journalism but then again, so are many others!","rating":6},{"id":1233976658572566500,"text":"Democrats are working hard to destroy the name and reputation of Crazy Bernie Sanders, and take the nomination away from him!","rating":6},{"id":832742165436579800,"text":"Looking forward to the Florida rally tomorrow. Big crowd expected!","rating":3},{"id":1136402984923852800,"text":"....talks with Mexico will resume tomorrow with the understanding that, if no agreement is reached, Tariffs at the 5% level will begin on Monday, with monthly increases as per schedule. The higher the Tariffs go, the higher the number of companies that will move back to the USA!","rating":7},{"id":1191325883774189600,"text":"What I said on the phone call with the Ukrainian President is “perfectly” stated. There is no reason to call witnesses to analyze my words and meaning. This is just another Democrat Hoax that I have had to live with from the day I got elected (and before!). Disgraceful!","rating":8},{"id":936260193536573400,"text":"The Dow just broke 24,000 for the first time (another all-time Record). If the Dems had won the Presidential Election, the Market would be down 50% from these levels and Consumer Confidence, which is also at an all-time high, would be “low and glum!”","rating":7},{"id":1260206276216266800,"text":"As long as other countries are receiving the benefits of Negative Rates, the USA should also accept the “GIFT”. Big numbers!","rating":6},{"id":975891861863829500,"text":"The Democrats do not want to help DACA. Would be so easy to make a deal!","rating":5},{"id":953406423177859100,"text":"New report from DOJ &amp, DHS shows that nearly 3 in 4 individuals convicted of terrorism-related charges are foreign-born. We have submitted to Congress a list of resources and reforms....","rating":5},{"id":1102751706444636200,"text":"“The American Media has changed forever. News organizations that seemed like a big deal are now extinct.  Those that remain have now degraded themselves beyond recognition, like the New Yorker - or they’ve been purchased by Jeff Bezos to conduct unregistered lobbying for.........","rating":8},{"id":1273665643104080000,"text":"The DACA decision, while a highly political one, and seemingly not based on the law, gives the President of the United States far more power than EVER anticipated. Nevertheless, I will only act in the best interests of the United States of America!","rating":6},{"id":1111655194658508800,"text":"....the Border, or large sections of the Border, next week. This would be so easy for Mexico to do, but they just take our money and “talk.” Besides, we lose so much money with them, especially when you add in drug trafficking etc.), that the Border closing would be a good thing!","rating":7},{"id":923876612013248500,"text":"JFK Files are being carefully released. In the end there will be great transparency. It is my hope to get just about everything to public!","rating":6},{"id":880540637358981100,"text":"Good news, House just passed #KatesLaw. Hopefully Senate will follow.","rating":4},{"id":1157306442422136800,"text":"Kim Jong Un and North Korea tested 3 short range missiles over the last number of days. These missiles tests are not a violation of our signed Singapore agreement, nor was there discussion of short range missiles when we shook hands. There may be a United Nations violation, but..","rating":5},{"id":1128246369674829800,"text":"China buys MUCH less from us than we buy from them, by almost 500 Billion Dollars, so we are in a fantastic position. Make your product at home in the USA and there is no Tariff. You can also buy from a non-Tariffed country instead of China. Many companies are leaving China.....","rating":4},{"id":1226154003551178800,"text":"....was given a horrendous report by his superior, the man he reported to, who publicly stated that Vindman had problems with judgement, adhering to the chain of command and leaking information. In other words, “OUT”.","rating":6},{"id":921829947093733400,"text":"Keep hearing about \"\"tiny\"\" amount of money spent on Facebook ads. What about the billions of dollars of Fake News on CNN, ABC, NBC &amp, CBS?","rating":6},{"id":935844881825763300,"text":"Wow, Matt Lauer was just fired from NBC for “inappropriate sexual behavior in the workplace.” But when will the top executives at NBC &amp, Comcast be fired for putting out so much Fake News. Check out Andy Lack’s past!","rating":6},{"id":1126120216856076300,"text":"Big Court win at our Southern Border! We are getting there - and Wall is being built!","rating":3},{"id":1001417880116891600,"text":"The 13 Angry Democrats (plus people who worked 8 years for Obama) working on the rigged Russia Witch Hunt, will be MEDDLING with the mid-term elections, especially now that Republicans (stay tough!) are taking the lead in Polls. There was no Collusion, except by the Democrats!","rating":7},{"id":917698839846576100,"text":"Since Congress can't get its act together on HealthCare, I will be using the power of the pen to give great HealthCare to many people - FAST","rating":4},{"id":931477193255014400,"text":"If Democrats were not such obstructionists and understood the power of lower taxes, we would be able to get many of their ideas into Bill!","rating":3},{"id":856849388026687500,"text":"Don't let the fake media tell you that I have changed my position on the WALL. It will get built and help stop drugs, human trafficking etc.","rating":5},{"id":1019932691339399200,"text":"I told you so! The European Union just slapped a Five Billion Dollar fine on one of our great companies, Google. They truly have taken advantage of the U.S., but not for long!","rating":6},{"id":1230879049460764700,"text":"Another misinformation campaign is being launched by Democrats in Congress saying that Russia prefers me to any of the Do Nothing Democrat candidates who still have been unable to, after two weeks, count their votes in Iowa. Hoax number 7!","rating":8},{"id":1164228805562552300,"text":"For the record, Denmark is only at 1.35% of GDP for NATO spending. They are a wealthy country and should be at 2%. We protect Europe and yet, only 8 of the 28 NATO countries are at the 2% mark. The United States is at a much, much higher level than that....","rating":5},{"id":1256195312965877800,"text":"Cryin Chuck Schumer, compared to what other Senators have brought home to their states, has brought very little back to N.Y. A totally overrated loser, the one thing he has given them is SALT. He never even called me to stop it. No wonder Cuomo &amp; most others can’t stand him. AOC!","rating":9},{"id":1143709133234954200,"text":"Presidential Harassment!","rating":7},{"id":1105789962576973800,"text":"KEEP AMERICA GREAT!","rating":4},{"id":985504808646971400,"text":"Slippery James Comey, a man who always ends up badly and out of whack (he is not smart!), will go down as the WORST FBI Director in history, by far!","rating":7},{"id":832230758299340800,"text":"FAKE NEWS media, which makes up stories and \"\"sources,\"\" is far more effective than the discredited Democrats - but they are fading fast!","rating":6},{"id":830558065715998700,"text":"A working dinner tonight with Prime Minister Abe of Japan, and his representatives, at the Winter White House (Mar-a-Lago). Very good talks!","rating":3},{"id":1172129122979582000,"text":"It is expected that China will be buying large amounts of our agricultural products!","rating":4},{"id":873878061778907100,"text":"The #FakeNews MSM doesn't report the great economic news since Election Day. #DOW up 16%. #NASDAQ up 19.5%. Drilling &amp, energy sector...","rating":6},{"id":1088289916826648600,"text":"....alternative venue for the SOTU Address because there is no venue that can compete with the history, tradition and importance of the House Chamber. I look forward to giving a “great” State of the Union Address in the near future!","rating":4},{"id":964938678362628100,"text":"Melania and I met such incredible people last night in Broward County, Florida. Will never forget them, or the evening!","rating":3},{"id":1127936425834504200,"text":"Bernie Sanders, “The Economy is doing well, and I’m sure I don’t have to give Trump any credit - I’m sure he’ll take all the credit that he wants.” Wrong Bernie, the Economy is doing GREAT, and would have CRASHED if my opponent (and yours), Crooked Hillary Clinton, had ever won!","rating":7},{"id":889438168721875000,"text":"After 1 year of investigation with Zero evidence being found, Chuck Schumer just stated that \"\"Democrats should blame ourselves,not Russia.\"\"","rating":5},{"id":1139115655532298200,"text":"General Michael Flynn, the 33 year war hero who has served with distinction, has not retained a good lawyer, he has retained a GREAT LAWYER, Sidney Powell. Best Wishes and Good Luck to them both!","rating":5},{"id":1233908953026908200,"text":"Sleepy Joe Biden’s victory in the South Carolina Democrat Primary should be the end of Mini Mike Bloomberg’s Joke of a campaign. After the worst debate performance in the history of presidential debates,  Mini Mike now has Biden split up his very few voters, taking many away!","rating":6},{"id":1184623216742015000,"text":"“This President is the most patriotic President I’ve seen in many years. He is going to do what is good for Americans.”  Congressman Brian Babin, Texas. Thank you Brian!","rating":4},{"id":981126375716409300,"text":"Thank you to Rasmussen for the honest polling. Just hit 50%, which is higher than Cheatin’ Obama at the same time in his Administration.","rating":6},{"id":991084424992297000,"text":"The migrant ‘caravan’ that is openly defying our border shows how weak &amp, ineffective U.S. immigration laws are. Yet Democrats like Jon Tester continue to support the open borders agenda – Tester even voted to protect Sanctuary Cities. We need lawmakers who will put America First.","rating":7},{"id":1233594120666566700,"text":"South Carolina was GREAT. A BIG &amp; REALLY ENTHUSIASTIC CROWD!","rating":5},{"id":803033642545115100,"text":"Serious voter fraud in Virginia, New Hampshire and California - so why isn't the media reporting on this? Serious bias - big problem!","rating":8},{"id":1194458296146702300,"text":"“The circus is coming to town. The corrupt, compromised, coward &amp, congenital liar Adam Schiff Show on Capital Hill, brought to you by his raging psychotic Democrats &amp, the top allies in the Media Mob. Everything you’re going to see in the next two weeks is rigged.....","rating":9},{"id":1087702686936510500,"text":"Marist/NPR/PBS Poll shows President Trump’s approval rating among Latinos going to 50%, an increase in one year of 19%. Thank you, working hard!","rating":4},{"id":1186270381491081200,"text":"Doral in Miami would have been the best place to hold the G-7, and free, but too much heat from the Do Nothing Radical Left Democrats &amp, their Partner, the Fake News Media! I’m surprised that they allow me to give up my $400,000 Plus Presidential Salary! We’ll find someplace else!","rating":7},{"id":1146501821579583500,"text":".....came from, and in far safer conditions. No matter how good things actually look, even if perfect, the Democrat visitors will act shocked &amp, aghast at how terrible things are. Just Pols. If they really want to fix them, change the Immigration Laws and Loopholes. So easy to do!","rating":5},{"id":1269708424633352200,"text":"Unlike Senator Manchin, Big Jim Justice was very loyal to your favorite President during Pelosi’s Impeachment Scam. Big Jim is doing a tremendous job for West Virginia. Vote for Big Jim! #MAGA","rating":6},{"id":1150717475421663200,"text":"....with the U.S., and wishes it had not broken the original deal in the first place. In the meantime, we are receiving Billions of Dollars in Tariffs from China, with possibly much more to come. These Tariffs are paid for by China devaluing &amp, pumping, not by the U.S. taxpayer!","rating":4},{"id":1057288679390097400,"text":"Just out: Consumer Confidence hits highest level since 2000.","rating":3},{"id":1113778970145615900,"text":"According to polling, few people seem to care about the Russian Collusion Hoax, but some Democrats are fighting hard to keep the Witch Hunt alive. They should focus on legislation or, even better, an investigation of how the ridiculous Collusion Delusion got started - so illegal!","rating":7},{"id":1177576649233195000,"text":"The Democrats are now to be known as the DO NOTHING PARTY!","rating":8},{"id":885131482397909000,"text":"The W.H. is functioning perfectly, focused on HealthCare, Tax Cuts/Reform &amp, many other things. I have very little time for watching T.V.","rating":7},{"id":1068339979250675700,"text":"Alan Dershowitz: “These are not crimes. He (Mueller) has no authority to be a roving Commissioner. I don’t see any evidence of crimes.”  This is an illegal Hoax that should be ended immediately. Mueller refuses to look at the real crimes on the other side. Where is the IG REPORT?","rating":9},{"id":1019225830298456000,"text":"While I had a great meeting with NATO, raising vast amounts of money, I had an even better meeting with Vladimir Putin of Russia. Sadly, it is not being reported that way - the Fake News is going Crazy!","rating":8},{"id":1289282585718190000,"text":"Pelosi &amp; Schumer have no interest in making a deal that is good for our Country and our People. All they want is a trillion dollars, and much more, for their Radical Left Governed States, most of which are doing very badly. It is called a BAILOUT for many years of bad Dem Mgmt!","rating":9},{"id":884142582191849500,"text":"Syrian ceasefire seems to be holding. Many lives can be saved. Came out of meeting. Good!","rating":5},{"id":985858100149309400,"text":"Russia and China are playing the Currency Devaluation game as the U.S. keeps raising interest rates. Not acceptable!","rating":6},{"id":1289201326375805000,"text":".....Our massive testing capability, rather than being praised, is used by the Lamestream Media and their partner, the Do Nothing Radical Left Democrats, as a point of scorn. This testing, and what we have so quickly done, is used as a Fake News weapon. Sad!","rating":8},{"id":1002506360351846400,"text":"A.P. has just reported that the Russian Hoax Investigation has now cost our government over $17 million, and going up fast. No Collusion, except by the Democrats!","rating":8},{"id":1037704356861276200,"text":"“The record is quite remarkable. The President has faithfully followed the agenda he campaigned on in 2016. People should focus on the results, and they’re extraordinary!”  James Freeman - Wall Street Journal","rating":6},{"id":1120630405831569400,"text":"I wonder if the New York Times will apologize to me a second time, as they did after the 2016 Election. But this one will have to be a far bigger &amp,  better apology. On this one they will have to get down on their knees &amp, beg for forgiveness-they are truly the Enemy of the People!","rating":9},{"id":1247986878307078100,"text":"White House news conference at 5:30 P.M. Eastern. Thank you!","rating":3},{"id":971006379375972400,"text":"The new Fake News narrative is that there is CHAOS in the White House. Wrong! People will always come &amp, go, and I want strong dialogue before making a final decision. I still have some people that I want to change (always seeking perfection). There is no Chaos, only great Energy!","rating":7},{"id":1299732423207301000,"text":"About the only way a person is able to write a book on me is if they agree that it will contain as much bad “stuff” as possible, much of which is lies. It’s like getting a job with CNN or MSDNC and saying that “President Trump is great.” You have ZERO chance. FAKE NEWS!","rating":8},{"id":942883507868782600,"text":"70 Record Closes for the Dow so far this year! We have NEVER had 70 Dow Records in a one year period. Wow!","rating":4},{"id":951650274032209900,"text":"Democrat Dianne Feinstein should never have released secret committee testimony to the public without authorization. Very disrespectful to committee members and possibly illegal. She blamed her poor decision on the fact she had a cold - a first!","rating":6},{"id":1229517316188246000,"text":"Completion of the Daytona 500 on Fox Network now. Enjoy!","rating":2},{"id":990227703575056400,"text":"Look forward to being in the Great State of Michigan tonight. Major business expansion and jobs pouring into your State. Auto companies expanding at record pace. Big crowd tonight, will be live on T.V.","rating":5},{"id":1005304018741035000,"text":"My thoughts and prayers are with the families of our serviceman who was killed and his fellow servicemen who were wounded in Somalia. They are truly all HEROES.","rating":3},{"id":1159522492324688000,"text":"Iran is in serious financial trouble. They want desperately to talk to the U.S., but are given mixed signals from all of those purporting to represent us, including President Macron of France....","rating":4},{"id":1235588587690676200,"text":"Schumer has brought great danger to the steps of the United States Supreme Court!","rating":5},{"id":1148573632869875700,"text":"India has long had a field day putting Tariffs on American products. No longer acceptable!","rating":4},{"id":1179840448225054700,"text":"ELECTION INTERFERENCE!","rating":7},{"id":903603043714957300,"text":"Texas is healing fast thanks to all of the great men &amp, women who have been working so hard. But still so much to do. Will be back tomorrow!","rating":3},{"id":1153667789149921300,"text":"Leaving for Turning Point USA. Will be speaking to some of the greatest and smartest young people on the planet. See you there!","rating":2},{"id":1156175364802142200,"text":"Wow! Morning Joe &amp, Psycho ratings have really crashed. Very small audience. People are tired of hearing Fake News delivered with an anger that is not to be believed. Sad, when the show was sane, they helped get me elected. Thanks! Was on all the time. Lost all of its juice!","rating":8},{"id":1209262137182445600,"text":"NASDAQ UP 72.2% SINCE OUR GREAT 2016 ELECTION VICTORY! DOW UP 55.8%. The best is yet to come!","rating":3},{"id":1146268912553775100,"text":"Iran was violating the 150 Billion Dollar (plus 1.8 Billion Dollar in CASH) Nuclear Deal with the United States, and others who paid NOTHING, long before I became President - and they have now breached their stockpile limit. Not good!","rating":5},{"id":1004909785547001900,"text":"Why isn’t the European Union and Canada informing the public that for years they have used massive Trade Tariffs and non-monetary Trade Barriers against the U.S. Totally unfair to our farmers, workers &amp, companies. Take down your tariffs &amp, barriers or we will more than match you!","rating":6},{"id":1185643744932106200,"text":"Crooked Hillary Clinton just called the respected environmentalist and Green Party candidate, Jill Stein, a “Russian Asset.” They need a Green Party more than ever after looking at the Democrats disastrous environmental program!","rating":7},{"id":828024835670413300,"text":"Why aren't the lawyers looking at and using the Federal Court decision in Boston, which is at conflict with ridiculous lift ban decision?","rating":6},{"id":1164138795475882000,"text":"“Thank you to Wayne Allyn Root for the very nice words. “President Trump is the greatest President for Jews and for Israel in the history of the world, not just America, he is the best President for Israel in the history of the world...and the Jewish people in Israel love him....","rating":8},{"id":813865160163098600,"text":"President Obama campaigned hard (and personally) in the very important swing states, and lost.The voters wanted to MAKE AMERICA GREAT AGAIN!","rating":7},{"id":1192441715984089000,"text":"Based on the information released last night about the Fake Whistleblowers attorney, the Impeachment Hoax should be ended IMMEDIATELY! There is no case, except against the other side!","rating":8},{"id":1321045863301587000,"text":"Biden’s Handler’s want to expand the Court. This would be very bad for the USA. On top of that they don’t want to provide a list of who would be chosen for the Court. MUST HAVE A LIST OF THESE RADICAL LEFT JUDGES!","rating":8},{"id":965223354633457700,"text":"Great Pollster John McLaughlin now has the GOP up in the Generic Congressional Ballot. Big gain over last 4 weeks. I guess people are loving the big Tax Cuts given them by the Republicans, the Cuts the Dems want to take away. We need more Republicans!","rating":6},{"id":1113819627212169200,"text":"The New York Times had no legitimate sources, which would be totally illegal, concerning the Mueller Report. In fact, they probably had no sources at all! They are a Fake News paper who have already been forced to apologize for their incorrect and very bad reporting on me!","rating":7},{"id":1084065832941031400,"text":"....the FBI was in complete turmoil (see N.Y. Post) because of Comey’s poor leadership and the way he handled the Clinton mess (not to mention his usurpation of powers from the Justice Department). My firing of James Comey was a great day for America. He was a Crooked Cop......","rating":7},{"id":1032256443985084400,"text":"I feel very badly for Paul Manafort and his wonderful family. “Justice” took a 12 year old tax case, among other things, applied tremendous pressure on him and, unlike Michael Cohen, he refused to “break” - make up stories in order to get a “deal.” Such respect for a brave man!","rating":6},{"id":1153311945698742300,"text":"Going with First Lady to pay our respects to Justice Stevens. Leaving now!","rating":5},{"id":1101476470034260000,"text":"Michael Cohen’s book manuscript shows that he committed perjury on a scale not seen before. He must have forgotten about his book when he testified. What does Hillary Clinton’s lawyer, Lanny Davis, say about this one. Is he being paid by Crooked Hillary. Using her lawyer?","rating":8},{"id":1036061566628757500,"text":"“There is no possible way the Trump Tower meeting between Don Trump jr and a couple of Russians, who have very deep connections to both the Clintons &amp, Fusion GPS, &amp, where no information on the Clintons was exchanged, is a crime. Dems are blinded by their hatred of Trump.” Bongino","rating":7},{"id":1029352395464224800,"text":"Fired FBI Agent Peter Strzok is a fraud, as is the rigged investigation he started. There was no Collusion or Obstruction with Russia, and everybody, including the Democrats, know it. The only Collusion and Obstruction was by Crooked Hillary, the Democrats and the DNC!","rating":8},{"id":847061031293780000,"text":"If the people of our great country could only see how viciously and inaccurately my administration is covered by certain media!","rating":5},{"id":1198579763717247000,"text":"Nancy Pelosi, Adam Schiff, AOC and the rest of the Democrats are not getting important legislation done, hence, the Do Nothing Democrats. USMCA, National Defense Authorization Act, Gun Safety, Prescription Drug Prices, &amp, Infrastructure are dead in the water because of the Dems!","rating":6},{"id":1007679422865006600,"text":"Wow, what a tough sentence for Paul Manafort, who has represented Ronald Reagan, Bob Dole and many other top political people and campaigns. Didn’t know Manafort was the head of the Mob. What about Comey and Crooked Hillary and all of the others? Very unfair!","rating":8},{"id":1083861205549232100,"text":"I look forward to hosting, right out of the great State of South Carolina, the 2019 NCAA Football Champion Clemson Tigers at the White House on Monday, January 14th. What a game, what a coach, what a team!","rating":3},{"id":1127622664477134800,"text":"Big attacks on Republicans and Conservatives by Social Media. Not good!","rating":6},{"id":1268966947938590700,"text":"...over the last number of nights. If she doesn’t treat these men and women well, then we’ll bring in a different group of men and women!","rating":4},{"id":877892883352703000,"text":"I certainly hope the Democrats do not force Nancy P out. That would be very bad for the Republican Party - and please let Cryin' Chuck stay!","rating":7},{"id":1179382223860113400,"text":"Massive sections of The Wall are being built at our Southern Border. It is going up rapidly, and built to the highest standards and specifications of the Border Patrol experts. It is actually an amazing structure! Our U.S. Military is doing a GREAT job.","rating":3},{"id":964512164865364000,"text":"Cannot believe how BADLY DACA recipients have been treated by the Democrats...totally abandoned! Republicans are still working hard.","rating":2},{"id":1020811550771294200,"text":"Troy Balderson of Ohio is running for Congress against a Nancy Pelosi Liberal who is WEAK on Crime &amp, Borders. Troy is the total opposite, and loves our Military, Vets &amp, 2nd Amendment. EARLY VOTING just started with Election Day on August 7th. Troy has my Full &amp, Total Endorsement!","rating":4},{"id":1086252588088082400,"text":"Border rancher: “We’ve found prayer rugs out here. It’s unreal.”  Washington Examiner   People coming across the Southern Border from many countries, some of which would be a big surprise.","rating":7},{"id":1153443827946020900,"text":"When we rip down and totally replace a badly broken and dilapidated Barrier on the Southern Border, something which cannot do the job, the Fake News Media gives us zero credit for building a new Wall. We have replaced many miles of old Barrier with powerful new Walls!","rating":5},{"id":1086977510225727500,"text":"No, Amnesty is not a part of my offer. It is a 3 year extension of DACA. Amnesty will be used only on a much bigger deal, whether on immigration or something else. Likewise there will be no big push to remove the 11,000,000 plus people who are here illegally-but be careful Nancy!","rating":6},{"id":955806333667807200,"text":"Thank you to General John Kelly, who is doing a fantastic job, and all of the Staff and others in the White House, for a job well done. Long hours and Fake reporting makes your job more difficult, but it is always great to WIN, and few have won more than us!","rating":3},{"id":1090608298343190500,"text":"The Intelligence people seem to be extremely passive and naive when it comes to the dangers of Iran. They are wrong! When I became President Iran was making trouble all over the Middle East, and beyond. Since ending the terrible Iran Nuclear Deal, they are MUCH different, but....","rating":5},{"id":1111244058570248200,"text":"Very important that OPEC increase the flow of Oil. World Markets are fragile, price of Oil getting too high. Thank you!","rating":2},{"id":1224374908710420500,"text":"Republicans in Iowa, go out and Caucus today. Your great Trade Deals with China, Mexico, Canada, Japan, South Korea and more, are DONE. Great times are coming, after waiting for decades, for our Farmers, Ranchers, Manufacturers and ALL. Nobody else could have pulled this off!","rating":3},{"id":1158407058519208000,"text":"Based on the historic currency manipulation by China, it is now even more obvious to everyone that Americans are not paying for the Tariffs – they are being paid for compliments of China, and the U.S. is taking in tens of Billions of Dollars! China has always....","rating":6},{"id":920611770775064600,"text":"Democrat Congresswoman totally fabricated what I said to the wife of a soldier who died in action (and I have proof). Sad!","rating":8},{"id":1126078422797602800,"text":"Real estate developers in the 1980’s &amp, 1990’s, more than 30 years ago, were entitled to massive write offs and depreciation which would, if one was actively building, show losses and tax losses in almost all cases. Much was non monetary. Sometimes considered “tax shelter,” ......","rating":3},{"id":962784821389996000,"text":"Rep. Lou Barletta, a Great Republican from Pennsylvania who was one of my very earliest supporters, will make a FANTASTIC Senator. He is strong &amp, smart, loves Pennsylvania &amp, loves our Country! Voted for Tax Cuts, unlike Bob Casey, who listened to Tax Hikers Pelosi and Schumer!","rating":4},{"id":1278828759672672300,"text":"If I didn’t demand that National Guard Troops go into Minneapolis after watching how poorly the Liberal Democrat government was handling things, you wouldn’t even have a Minneapolis now. Once they were deployed, in force, all looting, burning and crime stopped DEAD!","rating":7},{"id":1153126579641495600,"text":"Senator Chuck Schumer has finally gone to the Southern Border with some Democrat Senators. This is a GREAT thing! Nearby, he missed a large group of Illegal Immigrants trying to enter the USA illegally. They wildly  rushed Border Patrol. Some Agents were badly injured....","rating":6},{"id":1315695492676890600,"text":"The Economy is about ready to go through the roof. Stock Market ready to break ALL-TIME RECORD. 401k’s incredible. New Jobs Record. Remember all of this when you VOTE. Sleepy Joe wants to quadruple your Taxes. Depression!!! Don’t let it happen! #MAGA","rating":5},{"id":1090990097049313300,"text":"Schumer and the Democrats are big fans of being weak and passive with Iran. They have no clue as to the danger they would be inflicting on our Country. Iran is in financial chaos now because of the sanctions and Iran Deal termination. Dems put us in a bad place - but now good!","rating":5},{"id":1004360833407815700,"text":"...Four reporters spotted Melania in the White House last week walking merrily along to a meeting. They never reported the sighting because it would hurt the sick narrative that she was living in a different part of the world, was really ill, or whatever. Fake News is really bad!","rating":7},{"id":883761448064864300,"text":"Leaving Hamburg for Washington, D.C. and the WH. Just left China’s President Xi where we had an excellent meeting on trade &amp, North Korea.","rating":2},{"id":939152197090148400,"text":"Fines and penalties against Wells Fargo Bank for their bad acts against their customers and others will not be dropped, as has incorrectly been reported, but will be pursued and, if anything, substantially increased. I will cut Regs but make penalties severe when caught cheating!","rating":5},{"id":918112884630093800,"text":"With all of the Fake News coming out of NBC and the Networks, at what point is it appropriate to challenge their License? Bad for country!","rating":7},{"id":904899243906879500,"text":"Big week coming up!","rating":2},{"id":1265271275007721500,"text":"The opening of a Cold Case against Psycho Joe Scarborough was not a Donald Trump original thought, this has been going on for years, long before I joined the chorus. In 2016 when Joe &amp; his wacky future ex-wife, Mika, would endlessly interview me, I would always be thinking....","rating":8},{"id":1134466523114999800,"text":"In order not to pay Tariffs, if they start rising, companies will leave Mexico, which has taken 30% of our Auto Industry, and come back home to the USA. Mexico must take back their country from the drug lords and cartels. The Tariff is about stopping drugs as well as illegals!","rating":6},{"id":881140479454310400,"text":"Crazy Joe Scarborough and dumb as a rock Mika are not bad people, but their low rated show is dominated by their NBC bosses. Too bad!","rating":7},{"id":987063604691259400,"text":"Democrats are obstructing good (hopefully great) people wanting to give up a big portion of their life to work for our Government, hence, the American People. They are “slow walking” all of my nominations - hundreds of people. At this rate it would take 9 years for all approvals!","rating":5},{"id":827119326880813000,"text":"Iran was on its last legs and ready to collapse until the U.S. came along and gave it a life-line in the form of the Iran Deal: $150 billion","rating":6},{"id":984053549742067700,"text":"Much of the bad blood with Russia is caused by the Fake &amp, Corrupt Russia Investigation, headed up by the all Democrat loyalists, or people that worked for Obama. Mueller is most conflicted of all (except Rosenstein who signed FISA &amp, Comey letter). No Collusion, so they go crazy!","rating":7},{"id":1002298565299966000,"text":"FAIR TRADE!","rating":3},{"id":1014098721460686800,"text":"When we have an “infestation” of MS-13 GANGS in certain parts of our country, who do we send to get them out? ICE! They are tougher and smarter than these rough criminal elelments that bad immigration laws allow into our country. Dems do not appreciate the great job they do! Nov.","rating":7},{"id":1075729672628068400,"text":"The Democrats, who know Steel Slats (Wall) are necessary for Border Security, are putting politics over Country. What they are just beginning to realize is that I will not sign any of their legislation, including infrastructure, unless it has perfect Border Security. U.S.A. WINS!","rating":6},{"id":1024646945640525800,"text":"..This is a terrible situation and Attorney General Jeff Sessions should stop this Rigged Witch Hunt right now, before it continues to stain our country any further. Bob Mueller is totally conflicted, and his 17 Angry Democrats that are doing his dirty work are a disgrace to USA!","rating":8},{"id":1283428971611390000,"text":"The Biden-Sanders unity plan takes a sledgehammer to charter schools, punishing students for their zip codes. No one will be SAFE in Joe Biden’s America!","rating":7},{"id":1233266386291581000,"text":"The Do Nothing Democrats were busy wasting time on the Immigration Hoax, &amp; anything else they could do to make the Republican Party look bad, while I was busy calling early BORDER &amp; FLIGHT closings, putting us way ahead in our battle with Coronavirus. Dems called it VERY wrong!","rating":6},{"id":802723588759375900,"text":"The Democrats, when they incorrectly thought they were going to win, asked that the election night tabulation be accepted. Not so anymore!","rating":5},{"id":1115228307426095100,"text":"Uganda must find the kidnappers of the American Tourist and guide before people will feel safe in going there. Bring them to justice openly and quickly!","rating":3},{"id":898528795308642300,"text":"The Obstructionist Democrats make Security for our country very difficult. They use the courts and associated delay at all times. Must stop!","rating":5},{"id":1202939897109192700,"text":"Stock Markets Up Record Numbers. For this year alone, Dow up 18.65%, S&amp,P up 24.36%, Nasdaq Composite up 29.17%. “It’s the economy, stupid.”","rating":4},{"id":1099082126354509800,"text":"....Kelly has done an outstanding job representing our Nation and I have no doubt that, under her leadership, our Country will be represented at the highest level. Congratulations to Kelly and her entire family!","rating":2},{"id":1076926760829243400,"text":"We signed two pieces of major legislation this week, Criminal Justice Reform and the Farm Bill. These are two Big Deals, but all the Fake News Media wants to talk about is “the mistake” of bringing our young people back home from the Never Ending Wars. It all began 19 years ago!","rating":5},{"id":1113062069551722500,"text":"There is no amount of testimony or document production that can satisfy Jerry Nadler or Shifty Adam Schiff. It is now time to focus exclusively on properly running our great Country!","rating":6},{"id":1145726440815693800,"text":"It is very hard and expensive to live in New York. Governor Andrew Cuomo uses his Attorney General as a bludgeoning tool for his own purposes. They sue on everything, always in search of a crime. I even got sued on a Foundation which took Zero rent &amp, expenses &amp, gave away...","rating":7},{"id":1039291783031734300,"text":"My people just informed me that this is one of the worst storms to hit the East Coast in many years. Also, looking like a direct hit on North Carolina, South Carolina and Virginia. Please be prepared, be careful and be SAFE!","rating":3},{"id":967023714268319700,"text":"For those of you who are still interested, the Democrats have totally forgotten about DACA. Not a lot of interest on this subject from them!","rating":4},{"id":1273967323901317000,"text":"The Supreme Court asked us to resubmit on DACA, nothing was lost or won. They “punted”, much like in a football game (where hopefully they would stand for our great American Flag). We will be submitting enhanced papers shortly in order to properly fulfil the Supreme Court’s.....","rating":5},{"id":1136185163971407900,"text":"If the totally Corrupt Media was less corrupt, I would be up by 15 points in the polls based on our tremendous success with the economy, maybe Best Ever! If the Corrupt Media was actually fair, I would be up by 25 points. Nevertheless, despite the Fake News, we’re doing great!","rating":8},{"id":1278136326647406600,"text":"At the request of many great Americans who live in the Suburbs, and others, I am studying the AFFH housing regulation that is having a devastating impact on these once thriving Suburban areas. Corrupt Joe Biden wants to make them MUCH WORSE. Not fair to homeowners, I may END!","rating":8},{"id":1166706175003545600,"text":"Would be very hard for Jeremy Corbyn, the leader of Britain’s Labour Party, to seek a no-confidence vote against New Prime Minister Boris Johnson, especially in light of the fact that Boris is exactly what the U.K. has been looking for, &amp, will prove to be “a great one!” Love U.K.","rating":4},{"id":1105593613386428400,"text":"New York State and its Governor, Andrew Cuomo, are now proud members of the group of PRESIDENTIAL HARASSERS. No wonder people are fleeing the State in record numbers. The Witch Hunt continues!","rating":7},{"id":1034612092253470700,"text":"Add the 2026 World Cup to our long list of accomplishments!","rating":3},{"id":1186611810931236900,"text":"Thank you Republicans. 185 out of 185 present voted for “US” last night. Really good!","rating":3},{"id":1023664624259014700,"text":"....Also, why is Mueller only appointing Angry Dems, some of whom have worked for Crooked Hillary, others, including himself, have worked for Obama....And why isn’t Mueller looking at all of the criminal activity &amp, real Russian Collusion on the Democrats side-Podesta, Dossier?","rating":8},{"id":1000366478846300200,"text":"Good news about the release of the American hostage from Venezuela. Should be landing in D.C. this evening and be in the White House, with his family, at about 7:00 P.M. The great people of Utah will be very happy!","rating":4},{"id":1201560862856601600,"text":"The Republican Party has NEVER been so united! This Impeachment Scam is just a continuation of the 3 year Witch Hunt, but it is only bringing us even closer together!","rating":6},{"id":999984507574018000,"text":"Democrats are so obviously rooting against us in our negotiations with North Korea. Just like they are coming to the defense of MS 13 thugs, saying that they are individuals &amp, must be nurtured, or asking to end your big Tax Cuts &amp, raise your taxes instead. Dems have lost touch!","rating":7},{"id":1159049603209158700,"text":"“Trump Urges Unity Vs. Racism,” was the correct description in the first headline by the Failing New York Times, but it was quickly changed to, “Assailing Hate But Not Guns,” after the Radical Left Democrats went absolutely CRAZY! Fake News - That’s what we’re up against...","rating":7},{"id":1009431025817092100,"text":"It’s the Democrats fault, they won’t give us the votes needed to pass good immigration legislation. They want open borders, which breeds horrible crime. Republicans want security. But I am working on something - it never ends!","rating":5},{"id":1136061313174659100,"text":"Can you imagine Cryin’ Chuck Schumer saying out loud, for all to hear, that I am bluffing with respect to putting Tariffs on Mexico. What a Creep. He would rather have our Country fail with drugs &amp, Immigration than give Republicans a win. But he gave Mexico bad advice, no bluff!","rating":9},{"id":1141349462478135300,"text":"The Dems are very unhappy with the Mueller Report, so after almost 3 years, they want a Redo, or Do Over. This is extreme Presidential Harassment. They gave Crooked Hillary’s people complete Immunity, yet now they bring back Hope Hicks. Why aren’t the Dems looking at the.....","rating":6},{"id":1213149806488694800,"text":"Christopher Bedford, The Federalist Senior Editor. “There is NOTHING NEW in these Emails at all that’s been discovered. It’s exactly what we knew before, which is that the White House &amp, political figures wanted to cut off aid, Trump wanted to question aid to a number of....","rating":4},{"id":994401394441453600,"text":"Gina Haspel did a spectacular job today. There is nobody even close to run the CIA!","rating":3},{"id":1152894521463754800,"text":"The Great State of West Virginia is producing record setting numbers and doing really well. When I became President, it was practically shut down and closed for business. Not anymore!","rating":5},{"id":1137313896585474000,"text":"Mexico will try very hard, and if they do that, this will be a very successful agreement for both the United States and Mexico!","rating":3},{"id":891442016294494200,"text":"...they do NOTHING for us with North Korea, just talk. We will no longer allow this to continue. China could easily solve this problem!","rating":5},{"id":1246517869594148900,"text":"The Paycheck Protection Program is up and running! The program is open to nonprofits as well, so banks be sure to sign up our Great Religious and Veteran Organizations that need help!","rating":2},{"id":1163209779533287400,"text":"House Democrats want to take action against Israel because it is fighting back against two (maybe four) people that have said unthinkably bad things about it &amp, the Israeli people. Dems have such disdain for Israel! What happened? AOC Plus 4 is the new face of the Democrat Party!","rating":7},{"id":1263261477575819300,"text":"....Together, we built the greatest economy in history. We will do it again – better than ever before!","rating":4},{"id":1180859889381466000,"text":"It is INCREDIBLE to watch and read the Fake News and how they pull out all stops to protect Sleepy Joe Biden and his thrown out of the Military son, Hunter, who was handed $100,000 a month (Plus,Plus) from a Ukrainian based company, even though he had no experience in energy,...","rating":8},{"id":1186969632944611300,"text":"Republicans are going to fight harder than ever to win back the House because of what the Do Nothing Democrats have done to our Country!","rating":4}]