[{"id":1040575890139349000,"text":"Incredible job being done by FEMA, First Responders, Law Enforcement and all. Thank you!","rating":2},{"id":1087374469222547500,"text":"Democrats campaigned on working within Washington and “getting things done!” How is that working out? #2020TAKEBACKTHEHOUSE","rating":5},{"id":1174697450948497400,"text":"Presidential Harassment!","rating":8},{"id":1195931893998456800,"text":"Visited a great family of a young man under major surgery at the amazing Walter Reed Medical Center. Those are truly some of the best doctors anywhere in the world. Also began phase one of my yearly physical. Everything very good (great!). Will complete next year.","rating":3},{"id":1153984090712019000,"text":"It was NEVER agreed that Robert Mueller could use one of his many Democrat Never Trumper lawyers to sit next to him and help him with his answers. This was specifically NOT agreed to, and I would NEVER have agreed to it. The Greatest Witch Hunt in U.S. history, by far!","rating":8},{"id":1038782091629088800,"text":"“Barack Obama talked a lot about hope, but Donald Trump delivered the American Dream. All the economic indicators, what’s happening overseas, Donald Trump has proven to be far more successful than Barack Obama. President Trump is delivering the American Dream.” Jason Chaffetz","rating":4},{"id":1060511925883285500,"text":"I have been fully briefed on the terrible shooting in California. Law Enforcement and First Responders, together with the FBI, are on scene. 13 people, at this time, have been reported dead. Likewise, the shooter is dead, along with the first police officer to enter the bar....","rating":2},{"id":911711539815702500,"text":"Iran just test-fired a Ballistic Missile capable of reaching Israel.They are also working with North Korea.Not much of an agreement we have!","rating":6},{"id":1195376390054580200,"text":"We have vacancies in various departments because we do not want or need as many people as past administrations (and save great cost), and also, the Democrats delay the approval process to levels unprecedented in the history of our Country!","rating":5},{"id":1061957074253418500,"text":".....of money spent on protecting other countries, and we get nothing but Trade Deficits and Losses. It is time that these very rich countries either pay the United States for its great military protection, or protect themselves...and Trade must be made FREE and FAIR!","rating":6},{"id":1067775022331236400,"text":"While the disgusting Fake News is doing everything within their power not to report it that way, at least 3 major players are intimating that the Angry Mueller Gang of Dems is viciously telling witnesses to lie about facts &amp, they will get relief. This is our Joseph McCarthy Era!","rating":8},{"id":1176570123643060200,"text":"The Democrats are so focused on hurting the Republican Party and the President that they are unable to get anything done because of it, including legislation on gun safety, lowering of prescription drug prices, infrastructure, etc. So bad for our Country!","rating":5},{"id":919910256624447500,"text":"The U.S. has gained more than 5.2 trillion dollars in Stock Market Value since Election Day! Also, record business enthusiasm.","rating":3},{"id":1099654763531055100,"text":"Very productive talks yesterday with China on Trade. Will continue today! I will be leaving for Hanoi, Vietnam, early tomorrow for a Summit with Kim Jong Un of North Korea, where we both expect a continuation of the progress made at first Summit in Singapore. Denuclearization?","rating":4},{"id":872419018799550500,"text":"I will be nominating Christopher A. Wray, a man of impeccable credentials, to be the new Director of the FBI. Details to follow.","rating":2},{"id":1138148226853417000,"text":"Can’t believe they are bringing in John Dean, the disgraced Nixon White House Counsel who is a paid CNN contributor. No Collusion - No Obstruction! Democrats just want a do-over which they’ll never get!","rating":7},{"id":908643633901039600,"text":"Loser terrorists must be dealt with in a much tougher manner.The internet is their main recruitment tool which we must cut off &amp, use better!","rating":6},{"id":1011231137233080300,"text":"....If this is done, illegal immigration will be stopped in it’s tracks - and at very little, by comparison, cost. This is the only real answer - and we must continue to BUILD THE WALL!","rating":7},{"id":1276183263774675000,"text":"Failed presidential candidate (thank you President Trump!), Carly Fiorina, said she will be voting for Corrupt Joe Biden. She lost so badly to me, twice in one campaign, that she should be voting for Joe. No complaints!!!","rating":9},{"id":1031154974942810100,"text":"Study the late Joseph McCarthy, because we are now in period with Mueller and his gang that make Joseph McCarthy look like a baby! Rigged Witch Hunt!","rating":8},{"id":1099995611305254900,"text":"We have a State of Emergency at our Southern Border. Border Patrol, our Military and local Law Enforcement are doing a great job, but without the Wall, which is now under major construction, you cannot have Border Security. Drugs, Gangs and Human Trafficking must be stopped!","rating":6},{"id":803558077144399900,"text":"The Great State of Michigan was just certified as a Trump WIN giving all of our MAKE AMERICA GREAT AGAIN supporters another victory - 306!","rating":5},{"id":1076523416516264000,"text":"Will be having lunch in White House residence with large group concerning Border Security.","rating":3},{"id":1162096224486510600,"text":"Walmart, a great indicator as to how the U.S. is doing, just released outstanding numbers. Our Country, unlike others, is doing great! Don’t let the Fake News convince you otherwise.","rating":7},{"id":1101464443114922000,"text":"Great to be back from Vietnam, an amazing place. We had very substantive negotiations with Kim Jong Un - we know what they want and they know what we must have. Relationship very good, let’s see what happens!","rating":4},{"id":897048688639574000,"text":"The Obstructionist Democrats have given us (or not fixed) some of the worst trade deals in World History. I am changing that fast!","rating":5},{"id":1112758339958698000,"text":"Democrats should stop fighting Sen. David Perdue’s disaster relief bill. They are blocking funding and relief for our great farmers and rural America!","rating":5},{"id":1072459097855938600,"text":"Despite the large Caravans that WERE forming and heading to our Country, people have not been able to get through our newly built Walls, makeshift Walls &amp, Fences, or Border Patrol Officers &amp, Military. They are now staying in Mexico or going back to their original countries.......","rating":6},{"id":951419415794511900,"text":"In new Quinnipiac Poll, 66% of people feel the economy is “Excellent or Good.” That is the highest number ever recorded by this poll.","rating":4},{"id":1235375346494644200,"text":"Retired Four Star General Jack Keane will receive the PRESIDENTIAL MEDAL OF FREEDOM next week!","rating":3},{"id":817453219613917200,"text":"Monitoring the terrible situation in Florida. Just spoke to Governor Scott. Thoughts and prayers for all. Stay safe!","rating":3},{"id":1068120444279103500,"text":"Billions of Dollars are pouring into the coffers of the U.S.A. because of the Tariffs being charged to China, and there is a long way to go. If companies don’t want to pay Tariffs, build in the U.S.A. Otherwise, lets just make our Country richer than ever before!","rating":6},{"id":965079126829871100,"text":"General McMaster forgot to say that the results of the 2016 election were not impacted or changed by the Russians and that the only Collusion was between Russia and Crooked H, the DNC and the Dems. Remember the Dirty Dossier, Uranium, Speeches, Emails and the Podesta Company!","rating":8},{"id":1114673372275728400,"text":"....In the meantime, the Democrats in Congress must help the Republicans (we need their votes) to end the horrible, costly and foolish loopholes in our Immigration Laws. Once that happens, all will be smooth. We can NEVER allow Open Borders!","rating":4},{"id":965968309358334000,"text":"A woman I don’t know and, to the best of my knowledge, never met, is on the FRONT PAGE of the Fake News Washington Post saying I kissed her (for two minutes yet) in the lobby of Trump Tower 12 years ago. Never happened! Who would do this in a public space with live security......","rating":7},{"id":1168898509841555500,"text":"....”knife crime,” which is totally out of control in London. People are afraid to even walk the streets. He is a terrible mayor who should stay out of our business!","rating":6},{"id":1057997981922873300,"text":"Just had a long and very good conversation with President Xi Jinping of China. We talked about many subjects, with a heavy emphasis on Trade. Those discussions are moving along nicely with meetings being scheduled at the G-20 in Argentina. Also had good discussion on North Korea!","rating":3},{"id":991090373417152500,"text":"The White House is running very smoothly despite phony Witch Hunts etc. There is great Energy and unending Stamina, both necessary to get things done. We are accomplishing the unthinkable and setting positive records while doing so! Fake News is going “bonkers!”","rating":5},{"id":1135332642851893200,"text":"Hearing word that Russia, Syria and, to a lesser extent, Iran, are bombing the hell out of Idlib Province in Syria, and indiscriminately killing many innocent civilians. The World is watching this butchery. What is the purpose, what will it get you? STOP!","rating":4},{"id":986576502358671400,"text":"Slippery James Comey, the worst FBI Director in history, was not fired because of the phony Russia investigation where, by the way, there was NO COLLUSION (except by the Dems)!","rating":7},{"id":1145733138984964100,"text":"That’s right, The Trump Foundation gave away 100% plus, with Zero rent or expenses charged, and has been being sued by Cuomo and New York State for years - another part of the political Witch Hunt. Just in case anyone is interested - Clinton Foundation never even looked at!","rating":8},{"id":1146862295466819600,"text":"Been fully briefed on earthquake in Southern California. All seems to be very much under control!","rating":3},{"id":1157825761941819400,"text":"Today’s shooting in El Paso, Texas was not only tragic, it was an act of cowardice. I know that I stand with everyone in this Country to condemn today’s hateful act. There are no reasons or excuses that will ever justify killing innocent people....","rating":2},{"id":1003266374473519100,"text":"As only one of two people left who could become President, why wouldn’t the FBI or Department of “Justice” have told me that they were secretly investigating Paul Manafort (on charges that were 10 years old and had been previously dropped) during my campaign? Should have told me!","rating":5},{"id":1006992524366504000,"text":"Senator Claire McCaskill of the GREAT State of Missouri flew around in a luxurious private jet during her RV tour of the state. RV’s are not for her. People are really upset, so phony! Josh Hawley should win big, and has my full endorsement.","rating":6},{"id":1054755401651179500,"text":"The people of Puerto Rico are wonderful but the inept politicians are trying to use the massive and ridiculously high amounts of hurricane/disaster funding to pay off other obligations. The U.S. will NOT  bail out long outstanding &amp, unpaid obligations with hurricane relief money!","rating":7},{"id":1067398375337791500,"text":"....The Fake News Media builds Bob Mueller up as a Saint, when in actuality he is the exact opposite. He is doing TREMENDOUS damage to our Criminal Justice System, where he is only looking at one side and not the other. Heroes will come of this, and it won’t be Mueller and his...","rating":7},{"id":1013141673776500700,"text":"Either we need to elect more Republicans in November or Republicans must end the ridiculous 60 vote, or Filibuster, rule - or better yet, do both. Cryin’ Chuck would do it on day one, but we’ll never give him the chance. Some great legislation awaits - be smart!","rating":4},{"id":1172858577951821800,"text":"Who the hell is Joy-Ann Reid? Never met her, she knows ZERO about me, has NO talent, and truly doesn’t have the “it” factor needed for success in showbiz. Had a bad reputation, and now works for the Comcast/NBC losers making up phony stories about me. Low Ratings. Fake News!","rating":8},{"id":982264844136017900,"text":"China, which is a great economic power, is considered a Developing Nation within the World Trade Organization. They therefore get tremendous perks and advantages, especially over the U.S. Does anybody think this is fair. We were badly represented. The WTO is unfair to U.S.","rating":6},{"id":1090571586778923000,"text":"When I became President, ISIS was out of control in Syria &amp, running rampant. Since then tremendous progress made, especially over last 5 weeks. Caliphate will soon be destroyed, unthinkable two years ago. Negotiating are proceeding well in Afghanistan after 18 years of fighting..","rating":5},{"id":1238460927328075800,"text":"The Federal Reserve must FINALLY lower the Fed Rate to something comparable to their competitor Central Banks. Jay Powell and group are putting us at a decided economic &amp; physiological disadvantage. Should never have been this way. Also, STIMULATE!","rating":4},{"id":1001212077699149800,"text":"A Democratic lawmaker just introduced a bill to Repeal the GOP Tax Cuts (no chance). This is too good to be true for Republicans...Remember, the Nancy Pelosi Dems are also weak on Crime, the Border and want to be gentle and kind to MS-13 gang members...not good!","rating":6},{"id":1134452086857523200,"text":"Mexico has taken advantage of the United States for decades. Because of the Dems, our Immigration Laws are BAD. Mexico makes a FORTUNE from the U.S., have for decades, they can easily fix this problem. Time for them to finally do what must be done!","rating":5},{"id":897834894822342700,"text":"Memorial service today for beautiful and incredible Heather Heyer, a truly special young woman. She will be long remembered by all!","rating":3},{"id":516382177798680600,"text":"Every time I speak of the haters and losers I do so with great love and affection. They cannot help the fact that they were born fucked up!","rating":9},{"id":1027214330503352300,"text":"As long as I campaign and/or support Senate and House candidates (within reason), they will win! I LOVE the people, &amp, they certainly seem to like the job I’m doing. If I find the time, in between China, Iran, the Economy and much more, which I must, we will have a giant Red Wave!","rating":6},{"id":1030940529037652000,"text":"I allowed White House Counsel Don McGahn, and all other requested members of the White House Staff, to fully cooperate with the Special Counsel. In addition we readily gave over one million pages of documents. Most transparent in history. No Collusion, No Obstruction. Witch Hunt!","rating":5},{"id":1174305447513186300,"text":"I have just instructed the Secretary of the Treasury to substantially increase Sanctions on the country of Iran!","rating":3},{"id":1165111122510237700,"text":"For all of the Fake News Reporters that don’t have a clue as to what the law is relative to Presidential powers, China, etc., try looking at the Emergency Economic Powers Act of 1977. Case closed!","rating":6},{"id":1012295859072127000,"text":"Russia continues to say they had nothing to do with Meddling in our Election! Where is the DNC Server, and why didn’t Shady James Comey and the now disgraced FBI agents take and closely examine it? Why isn’t Hillary/Russia being looked at? So many questions, so much corruption!","rating":8},{"id":1034456273306243100,"text":"Google search results for “Trump News” shows only the viewing/reporting of Fake News Media. In other words, they have it RIGGED, for me &amp, others, so that almost all stories &amp, news is BAD. Fake CNN is prominent. Republican/Conservative &amp, Fair Media is shut out. Illegal? 96% of....","rating":9},{"id":1199352946187800600,"text":"The D.C. Wolves and Fake News Media are reading far too much into people being forced by Courts to testify before Congress. I am fighting for future Presidents and the Office of the President. Other than that, I would actually like people to testify. Don McGahn’s respected....","rating":7},{"id":1121380133137461200,"text":"As has been incorrectly reported by the Fake News Media, I never told then White House Counsel Don McGahn to fire Robert Mueller, even though I had the legal right to do so. If I wanted to fire Mueller, I didn’t need McGahn to do it, I could have done it myself. Nevertheless,....","rating":6},{"id":1207085185579262000,"text":"Democrat “leadership,” despite their denials, are putting tremendous pressure on their members to vote yes on this ridiculous Impeachment. If they vote yes, it will be much easier for Republicans to win in 2020!","rating":7},{"id":887475373981696000,"text":"Fake News story of secret dinner with Putin is \"\"sick.\"\" All G 20 leaders, and spouses, were invited by the Chancellor of Germany. Press knew!","rating":8},{"id":923150966551171100,"text":"Working hard on the biggest tax cut in U.S. history. Great support from so many sides. Big winners will be the middle class, business &amp, JOBS","rating":4},{"id":1175924464116097000,"text":"Just leaving the Great State of Ohio for New York and a few big days at the United Nations. Your Country will be well represented!","rating":3},{"id":1183232552464720000,"text":"The same people that got us into the Middle East Quicksand, 8 Trillion Dollars and many thousands of lives (and millions of lives when you count the other side), are now fighting to keep us there. Don’t listen to people that haven’t got a clue. They have proven to be inept!","rating":7},{"id":1265601615261827000,"text":"....happen again. Just like we can’t let large scale Mail-In Ballots take root in our Country. It would be a free for all on cheating, forgery and the theft of Ballots. Whoever cheated the most would win. Likewise, Social Media. Clean up your act, NOW!!!!","rating":8},{"id":1207151165894471700,"text":"So, if Comey &amp, the top people in the FBI were dirty cops and cheated on the FISA Court, wouldn’t all of these phony cases have to be overturned or dismissed? They went after me with the Fake Dossier, paid for by Crooked Hillary &amp, the DNC, which they illegally presented to FISA...","rating":7},{"id":1146435093491277800,"text":"The News Reports about the Department of Commerce dropping its quest to put the Citizenship Question on the Census is incorrect or, to state it differently, FAKE! We are absolutely moving forward, as we must, because of the importance of the answer to this question.","rating":6},{"id":1018093807060045800,"text":"So funny! I just checked out Fake News CNN, for the first time in a long time (they are dying in the ratings), to see if they covered my takedown yesterday of Jim Acosta (actually a nice guy). They didn’t! But they did say I already lost in my meeting with Putin. Fake News......","rating":8},{"id":1026585401874677800,"text":"Democrats want Open Borders and they want to abolish ICE, the brave men and women that are protecting our Country from some of the most vicious and dangerous people on earth! Sorry, we can’t let that happen! Also, change the rules in the Senate and approve STRONG Border Security!","rating":6},{"id":1197507542726910000,"text":"The Navy will NOT be taking away Warfighter and Navy Seal Eddie Gallagher’s Trident Pin. This case was handled very badly from the beginning. Get back to business!","rating":5},{"id":1122334000519868400,"text":"....Ever since Andrew came to my office to ask that I appoint him to the U.S. Supreme Court, and I said NO, he has been very hostile! Also asked for pardon for his friend. A good “pal” of low ratings Shepard Smith.","rating":9},{"id":1067066584882126800,"text":"....hundreds of people closely involved with my campaign who never met, saw or spoke to a Russian during this period? So many campaign workers, people inside from the beginning, ask me why they have not been called (they want to be). There was NO Collusion &amp, Mueller knows it!","rating":5},{"id":1194031678395687000,"text":"Schiff is giving Republicans NO WITNESSES, NO LAWYER &amp, NO DUE PROCESS! It is a totally one sided Witch Hunt. This can’t be making the Democrats look good. Such a farce!","rating":7},{"id":1053839625679183900,"text":"Watched North Dakota’s Rep. Kevin Cramer easily win debate with Senator Heidi Heitkamp. Great job Kevin, you will be a great Senator!","rating":4},{"id":1154359332252860400,"text":"Fox Poll say best Economy in DECADES!","rating":5},{"id":1074339834351759400,"text":"The Democrats policy of Child Seperation on the Border during the Obama Administration was far worse than the way we handle it now. Remember the 2014 picture of children in cages - the Obama years. However, if you don’t separate, FAR more people will come. Smugglers use the kids!","rating":8},{"id":913035855509491700,"text":"..But the people were Pro-Trump! Virtually no President has accomplished what we have accomplished in the first 9 months-and economy roaring","rating":7},{"id":1044903153987203100,"text":"Consumer confidence hits an 18 year high, close to breaking the all-time record. A big jump from last 8 years. People are excited about the USA again! We are getting Bigger and Richer and Stronger. WAY MORE TO GO!","rating":5},{"id":852297935219982300,"text":"One by one we are keeping our promises - on the border, on energy, on jobs, on regulations. Big changes are happening!","rating":4},{"id":987766033862873100,"text":"So funny, the Democrats have sued the Republicans for Winning. Now he R’s counter and force them to turn over a treasure trove of material, including Servers and Emails!","rating":9},{"id":1197502055415451600,"text":"I never in my wildest dreams thought my name would in any way be associated with the ugly word, Impeachment! The calls (Transcripts) were PERFECT, there was NOTHING said that was wrong. No pressure on Ukraine. Great corruption &amp, dishonesty by Schiff on the other side!","rating":9},{"id":1207339280504414200,"text":"In the end here, nothing happened. We don’t approach anything like the egregious conduct that should be necessary before a President should be removed from office. I believe that a President can’t be removed from office if there is no reasonable possibility that the Senate..","rating":3},{"id":991776286489169900,"text":"I have been briefed on the U.S. C-130 “Hercules” cargo plane from the Puerto Rico National Guard that crashed near Savannah Hilton Head International Airport. Please join me in thoughts and prayers for the victims, their families and the great men and women of the National Guard.","rating":2},{"id":1247631178959663000,"text":"White House news conference at 5:30 P.M. Eastern. Thank you!","rating":1},{"id":1107385751577088000,"text":"Those Republican Senators who voted in favor of Strong Border Security (and the Wall) are being uniformly praised as they return to their States. They know there is a National Emergency at the Southern Border, and they had the courage to ACT. Great job!","rating":6},{"id":1108187855954870300,"text":"Campaigning for the Popular Vote is much easier &amp, different than campaigning for the Electoral College. It’s like training for the 100 yard dash vs. a marathon. The brilliance of the Electoral College is that you must go to many States to win. With the Popular Vote, you go to....","rating":3},{"id":1178465036811034600,"text":"“All that’s swirling around us now is Impeachment. We talk about it day and night, it’s what’s on the news, there is NOTHING that has turned up that is Impeachable. Our founding fathers set impeachment to be extremely rare. We need to get good stuff done. Let the people vote,....","rating":4},{"id":1131901353872244700,"text":"I don’t know why the Radical Left Democrats want Bob Mueller to testify when he just issued a 40 Million Dollar Report that states, loud &amp, clear &amp, for all to hear, No Collusion and No Obstruction (how do you Obstruct a NO crime?) Dems are just looking for trouble and a Do-Over!","rating":8},{"id":1156015173997432800,"text":"Elijah Cummings never even went to the Southern Border and then he screams at the very good people who, despite Congresses failure to fix the Loopholes and Asylum, make it work (crossings are way down and the Wall is being built). Even with zero Dem help, Border getting strong!","rating":5},{"id":1143140105076564000,"text":"Despite a Federal Reserve that doesn’t know what it is doing - raised rates far too fast (very low inflation, other parts of world slowing, lowering &amp, easing) &amp, did large scale tightening, $50 Billion/month, we are on course to have one of the best Months of June in US history...","rating":6},{"id":1212730938683207700,"text":"Sohrab Ahmari, New York Post “The Trump Campaign raised $10 million in the two days following the impeachment (Scam) vote. It seems the Democrats have shot themselves in the foot in one more way. They set up a process they know is not going to lead to the Presidents removal, &amp,...","rating":5},{"id":838351476401520600,"text":"Is it true the DNC would not allow the FBI access to check server or other equipment after learning it was hacked? Can that be possible?","rating":7},{"id":884728971530829800,"text":"The Senate Democrats have only confirmed 48 of 197 Presidential Nominees. They  can't win so all they do is slow things down &amp, obstruct!","rating":4},{"id":884013689736769500,"text":"...We negotiated a ceasefire in parts of Syria which will save lives. Now it is time to move forward in working constructively with Russia!","rating":5},{"id":1303322616078504000,"text":"My Campaign spent a lot of money up front in order to compensate for the false reporting and Fake News concerning our handling of the China Virus. Now they see the GREAT job we have done, and we have 3 times more than we had 4 years ago - &amp; are up in polls. Lots of $’s &amp; ENERGY!","rating":7},{"id":1117748268820201500,"text":"Mueller, and the A.G. based on Mueller findings (and great intelligence), have already ruled No Collusion, No Obstruction. These were crimes committed by Crooked Hillary, the DNC, Dirty Cops and others! INVESTIGATE THE INVESTIGATORS!","rating":8},{"id":1129429624331657200,"text":"With all of the Fake and Made Up News out there, Iran can have no idea what is actually going on!","rating":7},{"id":939851058788134900,"text":"Getting closer and closer on the Tax Cut Bill. Shaping up even better than projected. House and Senate working very hard and smart. End result will be not only important, but SPECIAL!","rating":5},{"id":1266711223657205800,"text":"....have been greeted with the most vicious dogs, and most ominous weapons, I have ever seen. That’s when people would have been really badly hurt, at least. Many Secret Service agents just waiting for action. “We put the young ones on the front line, sir, they love it, and....","rating":9},{"id":1059827782434328600,"text":"There is a rumor, put out by the Democrats, that Josh Hawley of Missouri left the Arena last night early. It is Fake News. He met me at the plane when I arrived, spoke at the great Rally, &amp, stayed to the very end. In fact, I said goodbye to him and left before he did. Deception!","rating":6},{"id":1191087187443490800,"text":"I hope everyone in the Great State of Virginia will get out and VOTE on Tuesday in all of the local and state elections to send a signal to D.C. that you want lower taxes, a strong Military, Border &amp, 2nd Amendment, great healthcare, and must take care of our Vets. VOTE REPUBLICAN","rating":4},{"id":1192068562682368000,"text":"Thank you to Kurt Volker, U.S. Envoy to Ukraine, who said in his Congressional Testimony, just released, “You asked what conversations did I have about that quid pro quo, et cetra. NONE, because I didn’t know there was a quid pro quo.”  Witch Hunt!","rating":6},{"id":997493407097524200,"text":"School shooting in Texas. Early reports not looking good. God bless all!","rating":3},{"id":1049638803177128000,"text":"The paid D.C. protesters are now ready to REALLY protest because they haven’t gotten their checks - in other words, they weren’t paid! Screamers in Congress, and outside, were far too obvious - less professional than anticipated by those paying (or not paying) the bills!","rating":8},{"id":1036052758389051400,"text":"“There’s no fairness here, if you’re a Democrat or a friend of Hillary you get immunity or off scott free. If you’re connected to Donald Trump, you get people like Robert Mueller &amp, Andrew Weissman, and his team of partisans, coming after you with a vengeance and abusing their....","rating":7},{"id":988106076028653600,"text":"A complete Witch Hunt!","rating":8},{"id":952525384242876400,"text":"The Wall Street Journal stated falsely that I said to them “I have a good relationship with Kim Jong Un” (of N. Korea). Obviously I didn’t say that. I said “I’d have a good relationship with Kim Jong Un,” a big difference. Fortunately we now record conversations with reporters...","rating":7},{"id":1161325870516265000,"text":"Our Intelligence has informed us that the Chinese Government is moving troops to the Border with Hong Kong. Everyone should be calm and safe!","rating":5},{"id":1148769874379980800,"text":"So now the Obama appointed judge on the Census case (Are you a Citizen of the United States?) won’t let the Justice Department use the lawyers  that it wants to use. Could this be a first?","rating":6},{"id":1121829933679042600,"text":"Great NRA crowd and enthusiasm in Indiana. Thank you! Leaving now for meetings in the Oval Office.","rating":3},{"id":1119946842148622300,"text":"Despite No Collusion, No Obstruction, The Radical Left Democrats do not want to go on to Legislate for the good of the people, but only to Investigate and waste time. This is costing our Country greatly, and will cost the Dems big time in 2020!","rating":6},{"id":993484478633922600,"text":"Is this Phony Witch Hunt going to go on even longer so it wrongfully impacts the Mid-Term Elections, which is what the Democrats always intended? Republicans better get tough and smart before it is too late!","rating":7},{"id":1185726930764611600,"text":"I thought I was doing something very good for our Country by using Trump National Doral, in Miami, for hosting the G-7 Leaders. It is big, grand, on hundreds of acres, next to MIAMI INTERNATIONAL AIRPORT, has tremendous ballrooms &amp, meeting rooms, and each delegation would have...","rating":9},{"id":1148747084167831600,"text":"....Why would Kentucky ever think of giving up the most powerful position in Congress, the Senate Majority Leader, for a freshman Senator with little power in what will hopefully be the minority party. We need Mitch in the Senate to Keep America Great!!","rating":4},{"id":1033332301579661300,"text":"Jeff Sessions said he wouldn’t allow politics to influence him only because he doesn’t understand what is happening underneath his command position. Highly conflicted Bob Mueller and his gang of 17 Angry Dems are having a field day as real corruption goes untouched. No Collusion!","rating":8},{"id":937641904338063400,"text":"Democrats refusal to give even one vote for massive Tax Cuts is why we need Republican Roy Moore to win in Alabama. We need his vote on stopping crime, illegal immigration, Border Wall, Military, Pro Life, V.A., Judges 2nd Amendment and more. No to Jones, a Pelosi/Schumer Puppet!","rating":8},{"id":1096980408401625100,"text":"The United States is asking Britain, France, Germany and other European allies to take back over 800 ISIS fighters that we captured in Syria and put them on trial. The Caliphate is ready to fall. The alternative is not a good one in that we will be forced to release them........","rating":5},{"id":988146462625181700,"text":"Kim Strassel of the WSJ just said, after reviewing the dumb Comey Memos, “you got to ask, what was the purpose of the Special Counsel? There’s no there there.” Dan Henninger of the WSJ said Memos would show that this would be one of the weakest obstruction cases ever brought!","rating":4},{"id":968818810005450800,"text":"The Heritage Foundation has just stated that 64% of the Trump Agenda is already done, faster than even Ronald Reagan. “We’re blown away,” said Thomas Binion of Heritage, President Trump “is very active, very conservative and very effective. Huge volume &amp, spectrum of issues.”","rating":3},{"id":1057063101189836800,"text":"Check out tweets from last two days. I refer to Fake News Media when mentioning Enemy of the People - but dishonest reporters use only the word “Media.” The people of our Great Country are angry and disillusioned at receiving so much Fake News. They get it, and fully understand!","rating":7},{"id":1076094498210500600,"text":"Even President Ronald Reagan tried for 8 years to build a Border Wall, or Fence, and was unable to do so. Others also have tried. We will get it done, one way or the other!","rating":6},{"id":971409845453762600,"text":"The U.S. is acting swiftly on Intellectual Property theft. We cannot allow this to happen as it has for many years!","rating":2},{"id":1156655361711071200,"text":"The Prosecutors who lost the case against SEAL Eddie Gallagher (who I released from solitary confinement so he could fight his case properly), were ridiculously given a Navy Achievement Medal. Not only did they lose the case, they had difficulty with respect....","rating":4},{"id":1304875170860015600,"text":"The Unsolicited Mail In Ballot Scam is a major threat to our Democracy, &amp; the Democrats know it. Almost all recent elections using this system, even though much smaller &amp;  with far fewer Ballots to count, have ended up being a disaster. Large numbers of missing Ballots &amp; Fraud!","rating":9},{"id":921726400922619900,"text":"Stock Market hits another all time high on Friday. 5.3 trillion dollars up since Election. Fake News doesn't spent much time on this!","rating":3},{"id":944187730564714500,"text":"Our big and very popular Tax Cut and Reform Bill has taken on an unexpected new source of “love” - that is big companies and corporations showering their workers with bonuses. This is a phenomenon that nobody even thought of, and now it is the rage. Merry Christmas!","rating":4},{"id":1163472272612626400,"text":"Our Economy is very strong, despite the horrendous lack of vision by Jay Powell and the Fed, but the Democrats are trying to “will” the Economy to be bad for purposes of the 2020 Election.  Very Selfish! Our dollar is so strong that it is sadly hurting other parts of the world...","rating":5},{"id":1097856404629700600,"text":"As I predicted, 16 states, led mostly by Open Border Democrats and the Radical Left, have filed a lawsuit in, of course, the 9th Circuit! California, the state that has wasted billions of dollars on their out of control Fast Train, with no hope of completion, seems in charge!","rating":7},{"id":1141349463904141300,"text":"....33,000 Emails that Hillary and her lawyer deleted and acid washed AFTER GETTING A SUBPOENA FROM CONGRESS? That is real Obstruction that the Dems want no part of because their hearings are RIGGED and a disgrace to our Country!","rating":8},{"id":935686205429157900,"text":"After North Korea missile launch, it's more important than ever to fund our gov't &amp, military! Dems shouldn't hold troop funding hostage for amnesty &amp, illegal immigration. I ran on stopping illegal immigration and won big. They can't now threaten a shutdown to get their demands.","rating":6},{"id":1072464107784323100,"text":"....however, for strictly political reasons and because they have been pulled so far left, do NOT want Border Security. They want Open Borders for anyone to come in. This brings large scale crime and disease. Our Southern Border is now Secure and will remain that way.......","rating":6},{"id":799232214793760800,"text":"My transition team, which is working long hours and doing a fantastic job, will be seeing many great candidates today. #MAGA","rating":3},{"id":1029036065158557700,"text":"Agent Peter Strzok was just fired from the FBI - finally. The list of bad players in the FBI &amp, DOJ gets longer &amp, longer. Based on the fact that Strzok was in charge of the Witch Hunt, will it be dropped? It is a total Hoax. No Collusion, No Obstruction - I just fight back!","rating":7},{"id":1202981139155210200,"text":"Without the horror show that is the Radical Left, Do Nothing Democrats, the Stock Markets and Economy would be even better, if that is possible, and the Border would be closed to the evil of Drugs, Gangs and all other problems! #2020","rating":6},{"id":1027200569096765400,"text":"5 for 5!","rating":2},{"id":1090731037355884500,"text":"....Large protests all across Venezuela today against Maduro. The fight for freedom has begun!","rating":4},{"id":1038602549971116000,"text":"Republicans are doing really well with the Senate Midterms. Races that we were not even thinking about winning are now very close, or even leading. Election night will be very interesting indeed!","rating":2},{"id":990202926114189300,"text":"....great people of Montana will not stand for this kind of slander when talking of a great human being. Admiral Jackson is the kind of man that those in Montana would most respect and admire, and now, for no reason whatsoever, his reputation has been shattered. Not fair, Tester!","rating":6},{"id":1067395266511347700,"text":"The Phony Witch Hunt continues, but Mueller and his gang of Angry Dems are only looking at one side, not the other. Wait until it comes out how horribly &amp, viciously they are treating people, ruining lives for them refusing to lie. Mueller is a conflicted prosecutor gone rogue....","rating":7},{"id":1132369575033606100,"text":"Another activist Obama appointed judge has just ruled against us on a section of the Southern Wall that is already under construction. This is a ruling against Border Security and in favor of crime, drugs and human trafficking. We are asking for an expedited appeal!","rating":5},{"id":1255825648448348200,"text":"Despite reports to the contrary, Sweden is paying heavily for its decision not to lockdown. As of today, 2462 people have died there, a much higher number than the neighboring countries of Norway (207), Finland (206) or Denmark (443). The United States made the correct decision!","rating":3},{"id":1227420618951479300,"text":"Impeachment King Steyer (how did that work out?) spent 200 Million Dollars and got less than 1% of the vote in Iowa, and only 3% of the Vote in New Hampshire. Could it be that something is just plain missing? Not easy to do what I did, is it?","rating":6},{"id":812390964740427800,"text":"As to the U.N., things will be different after Jan. 20th.","rating":3},{"id":1281556758457188400,"text":"....Absentee Ballots are fine because you have to go through a precise process to get your voting privilege. Not so with Mail-Ins. Rigged Election!!! 20% fraudulent ballots?","rating":8},{"id":937652739001212900,"text":"Putting Pelosi/Schumer Liberal Puppet Jones into office in Alabama would hurt our great Republican Agenda of low on taxes, tough on crime, strong on military and borders...&amp, so much more. Look at your 401-k’s since Election. Highest Stock Market EVER! Jobs are roaring back!","rating":5},{"id":1005030839019802600,"text":"Canada charges the U.S. a 270%  tariff on Dairy Products! They didn’t tell you that, did they? Not fair to our farmers!","rating":6},{"id":1176953905776910300,"text":"....taken out of Ukraine and China. Additionally, I demand transparency from Democrats that went to Ukraine and attempted to force the new President to do things that they wanted under the form of political threat.","rating":5},{"id":1129954116489404400,"text":"....for Life in 2020. If we are foolish and do not stay UNITED as one, all of our hard fought gains for Life can, and will, rapidly disappear!","rating":4},{"id":1252235263327125500,"text":"Congratulations to all of my many friends at The Villages in Florida on having done so well, and with such great spirit, during these rather unusual times. So proud of everyone! Mark Morse &amp; Gary Lester have really stepped up to the plate. Hope to see everyone soon.","rating":3},{"id":1021719098265362400,"text":"Tariffs are the greatest! Either a country which has treated the United States unfairly on Trade negotiates a fair deal, or it gets hit with Tariffs. It’s as simple as that - and everybody’s talking! Remember, we are the “piggy bank” that’s being robbed. All will be Great!","rating":8},{"id":1206955356280279000,"text":"Would be sooo great if the Fed would further lower interest rates and quantitative ease. The Dollar is very strong against other currencies and there is almost no inflation. This is the time to do it. Exports would zoom!","rating":6},{"id":1117826076774789100,"text":"....Since there was no Collusion, why was there an Investigation in the first place! Answer - Dirty Cops, Dems and Crooked Hillary!","rating":7},{"id":1156200908537118700,"text":"Just reminded my staff that Morning Joe &amp, Psycho were with me in my room, at their request, the night I won New Hampshire. Likewise, followed me to other states....","rating":7},{"id":1291864494608732200,"text":"Had a lengthy discussion this morning with President Macron of France concerning numerous subjects, but in particular the catastrophic event which took place in Beirut, Lebanon...","rating":4},{"id":1127681372896800800,"text":"We are right where we want to be with China. Remember, they broke the deal with us &amp, tried to renegotiate. We will be taking in Tens of Billions of Dollars in Tariffs from China. Buyers of product can make it themselves in the USA (ideal), or buy it from non-Tariffed countries...","rating":6},{"id":1179023001989374000,"text":"So if the so-called “Whistleblower” has all second hand information, and almost everything he has said about my “perfect” call with the Ukrainian President is wrong (much to the embarrassment of Pelosi &amp, Schiff), why aren’t we entitled to interview &amp, learn everything about....","rating":8},{"id":1050008315286171600,"text":"Despite so many positive events and victories, Media Reseach Center reports that 92% of stories on Donald Trump are negative on ABC, CBS and ABC. It is FAKE NEWS! Don’t worry, the Failing New York Times didn’t even put the Brett Kavanaugh victory on the Front Page yesterday-A17!","rating":7},{"id":967508938425069600,"text":"Dems are no longer talking DACA! “Out of sight, out of mind,” they say. DACA beneficiaries should not be happy. Nancy Pelosi truly doesn’t care about them. Republicans stand ready to make a deal!","rating":6},{"id":1031508193107763200,"text":"Where’s the Collusion? They made up a phony crime called Collusion, and when there was no Collusion they say there was Obstruction (of a phony crime that never existed). If you FIGHT BACK or say anything bad about the Rigged Witch Hunt, they scream Obstruction!","rating":8},{"id":1153737353648889900,"text":"I was saddened to learn of the recent passing of Bob Morgenthau, a truly great man! Bob served as a Naval Officer in World War II, was an extraordinary US Attorney, Manhattan District Attorney, and always a warrior for our Country that he loved so dearly....","rating":3},{"id":1178125611426025500,"text":"It is disgraceful what the Do Nothing Democrats are doing (the Impeachment Scam), but it is also disgraceful what they are NOT doing, namely, the USMCA vote, Prescription Drug Price Reduction, Gun Safety, Infrastructure, and much more!","rating":6},{"id":1106205023548133400,"text":"A vote for today’s resolution by Republican Senators is a vote for Nancy Pelosi, Crime, and the Open Border Democrats!","rating":7},{"id":974033924493111300,"text":"Today the House took major steps toward securing our schools by passing the STOP School Violence Act. We must put the safety of America's children FIRST by improving training and by giving schools and law enforcement better tools. A tragedy like Parkland can't happen ever again!","rating":4},{"id":1131243666968911900,"text":"....In the meantime, my Administration is achieving things that have never been done before, including unleashing perhaps the Greatest Economy in our Country’s history....","rating":5},{"id":903766326631698400,"text":"Stock Market up 5 months in a row!","rating":4},{"id":1104505623293710300,"text":"....and renovated, with MUCH MORE to follow shortly. Tens of thousands of illegals are being apprehended (captured) at the Border and NOT allowed into our Country. With another President, millions would be pouring in. I am stopping an invasion as the Wall gets built. #MAGA","rating":4},{"id":1043160312315146200,"text":"Senator Feinstein and the Democrats held the letter for months, only to release it with a bang after the hearings were OVER - done very purposefully to Obstruct &amp, Resist &amp, Delay. Let her testify, or not, and TAKE THE VOTE!","rating":6},{"id":1185726931611852800,"text":".....its own 50 to 70 unit building. Would set up better than other alternatives. I announced that I would be willing to do it at NO PROFIT or, if legally permissible, at ZERO COST to the USA. But, as usual, the Hostile Media &amp, their Democrat Partners went CRAZY!","rating":7},{"id":820425770925338600,"text":"Congressman John Lewis should finally focus on the burning and crime infested inner-cities of the U.S. I can use all the help I can get!","rating":5},{"id":874576057579565000,"text":"The Fake News Media has never been so wrong or so dirty. Purposely incorrect stories and phony sources to meet their agenda of hate. Sad!","rating":7},{"id":1170285513376485400,"text":"Thank you to Bahamian Prime Minister Hubert Minnis for your very gracious and kind words in saying that without the help of the United States and me, their would have been many more casualties. I give all credit to FEMA, the U.S. Coast Guard, &amp, the brave people of the Bahamas..","rating":3},{"id":883229754077392900,"text":"I look forward to all meetings today with world leaders, including my meeting with Vladimir Putin. Much to discuss.#G20Summit #USA🇺🇸","rating":3},{"id":1021347230022807600,"text":"“It was classified to cover up misconduct by the FBI and the Justice Department in misleading the Court by using this Dossier in a dishonest way to gain a warrant to target the Trump Team. This is a Clinton Campaign document. It was a fraud and a hoax designed to target Trump....","rating":5},{"id":999984495179726800,"text":"Can anyone even imagine having Spies placed in a competing campaign, by the people and party in absolute power, for the sole purpose of political advantage and gain? And to think that the party in question, even with the expenditure of far more money, LOST!","rating":6},{"id":1075011751165485000,"text":"Illegal immigration costs the United States more than 200 Billion Dollars a year. How was this allowed to happen?","rating":5},{"id":1014117468858650600,"text":"Just out that the Obama Administration granted citizenship, during the terrible Iran Deal negotiation, to 2,500 Iranians - including to government officials. How big (and bad) is that?","rating":9},{"id":806970576359325700,"text":"Today we lost a great pioneer of air and space in John Glenn. He was a hero and inspired generations of future explorers. He will be missed.","rating":3},{"id":1156938785189441500,"text":"BIG RALLY tonight in Cincinnati, Ohio. See you there! P.S. Our Country is doing GREAT!","rating":5},{"id":915589297096536000,"text":"NBC news is #FakeNews and more dishonest than even CNN. They are a disgrace to good reporting. No wonder their news ratings are way down!","rating":8},{"id":1017164990099415000,"text":"Ex-FBI LAYER Lisa Page today defied a House of Representatives issued Subpoena to testify before Congress! Wow, but is anybody really surprised!  Together with her lover, FBI Agent Peter Strzok, she worked on the Rigged Witch Hunt, perhaps the most tainted and corrupt case EVER!","rating":10},{"id":1117813315269320700,"text":"Mark Morgan, President Obama’s Border Patrol Chief, gave the following message to me: “President Trump, stay the course.” I agree, and believe it or not, we are making great progress with a system that has been broken for many years!","rating":6},{"id":1262392414859337700,"text":"The Wall Street Journal Editorial states that it doesn’t want me to act in an “impulsive” manner in Afghanistan. Could somebody please explain to them that we have been there for 19 years, and while soldier counts are way down now, hardly impulsive. Besides, the Taliban is.....","rating":7},{"id":1307092428097192000,"text":"...Obama killed the pharmaceutical manufacturing business in Puerto Rico. We are bringing it back from China and other faraway lands.","rating":6},{"id":802849330176659500,"text":"Hillary Clinton conceded the election when she called me just prior to the victory speech and after the results were in. Nothing will change","rating":4},{"id":1205156716054241300,"text":"I also have constantly asked, “Why aren’t Germany, France and other European countries helping Ukraine more? They are the biggest beneficiaries. Why is it always the good ol’ United States?” The Radical Left, Do Nothing Democrats, never mention this at their phony hearing!","rating":7},{"id":952887520790040600,"text":"Statement by me last night in Florida: “Honestly, I don’t think the Democrats want to make a deal. They talk about DACA, but they don’t want to help..We are ready, willing and able to make a deal but they don’t want to. They don’t want security at the border, they don’t want.....","rating":4},{"id":1273706102023237600,"text":"It was not Ambassador Lighthizer’s fault (yesterday in Committee) in that perhaps I didn’t make myself clear, but the U.S. certainly does maintain a policy option, under various conditions, of a complete decoupling from China. Thank you!","rating":5},{"id":886544734788997100,"text":"With all of its phony unnamed sources &amp, highly slanted &amp, even fraudulent reporting, #Fake News is DISTORTING DEMOCRACY in our country!","rating":7},{"id":1161767689762889700,"text":"Good things were stated on the call with China the other day. They are eating the Tariffs with the devaluation of their currency and “pouring” money into their system. The American consumer is fine with or without the September date, but much good will come from the short.....","rating":4},{"id":843088518339612700,"text":"Despite what you have heard from the FAKE NEWS, I had a GREAT meeting with German Chancellor Angela Merkel. Nevertheless, Germany owes.....","rating":6},{"id":1306971776199651300,"text":"Mini Mike Bloomberg, after making a total fool of himself as he got badly beaten up by Pocahontas and the Democrats in the Primaries, is at it again. He tried to buy an Election and went away with a major case of Depression. Now he’s throwing money at the Dems, looking for a job!","rating":8},{"id":894367017054208000,"text":"The Fake News refuses to report the success of the first 6 months: S.C., surging economy &amp, jobs,border &amp, military security,ISIS &amp, MS-13 etc.","rating":5},{"id":1242056984104521700,"text":"We will be guided by the wishes of Prime Minister Abe of Japan, a great friend of the United States and a man who has done a magnificent job on the Olympic Venue, as to attending the Olympic Games in Japan. He will make the proper decision!","rating":3},{"id":873879934040780800,"text":"I believe the James Comey leaks will be far more prevalent than anyone ever thought possible. Totally illegal? Very 'cowardly!'","rating":6},{"id":1168499355248205800,"text":"The LameStream Media has gone totally CRAZY! They write whatever they want, seldom have sources (even though they say they do), never do “fact checking” anymore, and are only looking for the “kill.” They take good news and make it bad. They are now beyond Fake, they are Corrupt..","rating":7},{"id":900346953120141300,"text":"Phoenix crowd last night was amazing - a packed house. I love the Great State of Arizona. Not a fan of Jeff Flake, weak on crime &amp, border!","rating":6},{"id":995088584221839400,"text":"Why doesn’t the Fake News Media state that the Trump Administration’s Anti-Trust Division has been, and is, opposed to the AT&amp,T purchase of Time Warner in a currently ongoing Trial. Such a disgrace in reporting!","rating":5},{"id":1011228265003077600,"text":"Hiring manythousands of judges, and going through a long and complicated legal process, is not the way to go - will always be disfunctional. People must simply be stopped at the Border and told they cannot come into the U.S. illegally. Children brought back to their country......","rating":7},{"id":1069584730880974800,"text":"I am certain that, at some time in the future, President Xi and I, together with President Putin of Russia, will start talking about a meaningful halt to what has become a major and uncontrollable Arms Race. The U.S. spent 716 Billion Dollars this year. Crazy!","rating":4},{"id":917701841466593300,"text":"With Jemele Hill at the mike, it is no wonder ESPN ratings have \"\"tanked,\"\" in fact, tanked so badly it is the talk of the industry!","rating":7},{"id":953948941674078200,"text":"The Wall is the Wall, it has never changed or evolved from the first day I conceived of it. Parts will be, of necessity, see through and it was never intended to be built in areas where there is natural protection such as mountains, wastelands or tough rivers or water.....","rating":5},{"id":882552631905988600,"text":"Getting ready to leave for Poland, after which I will travel to Germany for the G-20. Will be back on Saturday.","rating":2},{"id":1205457765961011200,"text":"Poll numbers have gone through the roof in favor of No Impeachment, especially with Swing States and Independents in Swing States. People have figured out that the Democrats have no case, it is a total Hoax. Even Pelosi admitted yesterday that she began this scam 2 1/2 years ago!","rating":6},{"id":1181227885841002500,"text":"I was elected on getting out of these ridiculous endless wars, where our great Military functions as a policing operation to the benefit of people who don’t even like the USA. The two most unhappy countries at this move are Russia &amp, China, because they love seeing us bogged.....","rating":6},{"id":1126839450330382300,"text":"Looks to me like it’s going to be SleepyCreepy Joe over Crazy Bernie. Everyone else is fading fast!","rating":7},{"id":753965070003109900,"text":"I am pleased to announce that I have chosen Governor Mike Pence as my Vice Presidential running mate. News conference tomorrow at 11:00 A.M.","rating":2},{"id":1177574382056693800,"text":"Iran wanted me to lift the sanctions imposed on them in order to meet. I said, of course, NO!","rating":5},{"id":1043966388182954000,"text":"Going to New York. Will be with Prime Minister Abe of Japan tonight, talking Military and Trade. We have done much to help Japan, would like to see more of a reciprocal relationship. It will all work out!","rating":3},{"id":881979394373406700,"text":"Really great numbers on jobs &amp, the economy! Things are starting to kick in now, and we have just begun! Don't like steel &amp, aluminum dumping!","rating":4},{"id":1067623816921272300,"text":"Brenda Snipes, in charge of voting in Broward County, Florida, was just spotted wearing a beautiful dress with 300 I VOTED signs on it. Just kidding, she is a fine, very honorable and highly respected voting tactician!","rating":8},{"id":1180551689818050600,"text":"Not only are the Do Nothing Democrats interfering in the 2020 Election, but they are continuing to interfere in the 2016 Election. They must be stopped!","rating":7},{"id":1133145260018819100,"text":"I will be making two stops this morning in Japan to visit with our Great Military, then a quick stop in Alaska and back to D.C. Meetings with Prime Minister Abe went very well, and getting to spend time with the new Emperor and Empress of Japan was a great honor!","rating":3},{"id":1159046825481068500,"text":"...Talks have begun to further increase payments to the United States. South Korea is a very wealthy nation that now feels an obligation to contribute to the military defense provided by the United States of America. The relationship between the two countries is a very good one!","rating":4},{"id":990928644100034600,"text":"Numerous countries are being considered for the MEETING, but would Peace House/Freedom House, on the Border of North &amp, South Korea, be a more Representative, Important and Lasting site than a third party country? Just asking!","rating":6},{"id":853597199619543000,"text":"Someone should look into who paid for the small organized rallies yesterday. The election is over!","rating":6},{"id":1166723477879087000,"text":"Puerto Rico is one of the most corrupt places on earth. Their political system is broken and their politicians are either Incompetent or Corrupt. Congress approved Billions of Dollars last time, more than anyplace else has ever gotten, and it is sent to Crooked Pols. No good!....","rating":9},{"id":976770619424563200,"text":"Remember when they were saying, during the campaign, that Donald Trump is giving great speeches and drawing big crowds, but he is spending much less money and not using social media as well as Crooked Hillary’s large and highly sophisticated staff. Well, not saying that anymore!","rating":7},{"id":1174696521914339300,"text":"....Knowing all of this, is anybody dumb enough to believe that I would say something inappropriate with a foreign leader while on such a potentially “heavily populated” call. I would only do what is right anyway, and only do good for the USA!","rating":8},{"id":1290967953542910000,"text":"Nevada has ZERO infrastructure for Mail-In Voting. It will be a corrupt disaster if not ended by the Courts. It will take months, or years, to figure out. Florida has built a great infrastructure, over years, with two great Republican Governors. Florida, send in your Ballots!","rating":8},{"id":858654431956672500,"text":"The Democrats, without a leader, have become the party of obstruction.They are only interested in themselves and not in what's best for U.S.","rating":6},{"id":1000151354701213700,"text":"Senator Schumer and Obama Administration let phone company ZTE flourish with no security checks. I closed it down then let it reopen with high level security guarantees, change of management and board, must purchase U.S. parts and pay a $1.3 Billion fine. Dems do nothing....","rating":5},{"id":1117033379776667600,"text":"I agree with Kim Jong Un of North Korea that our personal relationship remains very good, perhaps the term excellent would be even more accurate, and that a third Summit would be good in that we fully understand where we each stand. North Korea has tremendous potential for.......","rating":9},{"id":1036590520649306100,"text":"The Worker in America is doing better than ever before. Celebrate Labor Day!","rating":4},{"id":1190269494788264000,"text":"Stock Market up BIG! Record highs for S&amp,P 500 and NASDAQ. Enjoy!","rating":3},{"id":1177263650068816000,"text":"Adam Schiff has zero credibility. Another fantasy to hurt the Republican Party!","rating":7},{"id":1047472342354604000,"text":"The Stock Market just reached an All-Time High during my Administration for the 102nd Time, a presidential record, by far, for less than two years. So much potential as Trade and Military Deals are completed.","rating":3},{"id":1051166436029358100,"text":"Highly respected Congressman Keith Rothfus (R) of Pennsylvania is in the fight of his life because the Dems changed the District Map. He must win. Strong on crime, borders, big tax &amp, reg cuts, Military &amp, Vets. Opponent Lamb a Pelosi puppet-weak on crime. BIG ENDORSEMENT FOR KEITH","rating":5},{"id":907946177022369800,"text":"With Irma and Harvey devastation, Tax Cuts and Tax Reform is needed more than ever before. Go Congress, go!","rating":4},{"id":1244368213133144000,"text":"Will be starting The White House news conference at 5:30 P.M. Eastern.","rating":2},{"id":999252093998370800,"text":"“Trump should be happy that the FBI was SPYING on his campaign” No, James Clapper, I am not happy. Spying on a campaign would be illegal, and a scandal to boot!","rating":6},{"id":1121044792945926100,"text":"Can anyone comprehend what a GREAT job Border Patrol and Law Enforcement is doing on our Southern Border. So far this year they have APPREHENDED 418,000 plus illegal immigrants, way up from last year. Mexico is doing very little for us. DEMS IN CONGRESS MUST ACT NOW!","rating":7},{"id":1308768869432033300,"text":"Very important that, in order to watch that ALL are following the Rules &amp; Regulations, you become an Election Official at your local Polling Place. Go sign up NOW!!!","rating":3},{"id":1159522493801123800,"text":"....I know Emmanuel means well, as do all others, but nobody speaks for the United States but the United States itself. No one is authorized in any way, shape, or form, to represent us!","rating":3},{"id":1263114522925154300,"text":"My team is closely monitoring the flooding in Central Michigan – Stay SAFE and listen to local officials. Our brave First Responders are once again stepping up to serve their fellow citizens, THANK YOU!","rating":2},{"id":1124672389416144900,"text":"Very good call yesterday with President Putin of Russia. Tremendous potential for a good/great relationship with Russia, despite what you read and see in the Fake News Media. Look how they have misled you on “Russia Collusion.” The World can be a better and safer place. Nice!","rating":6},{"id":983143317889323000,"text":"Congratulations to Patrick Reed on his great and courageous MASTERS win! When Patrick had his amazing win at Doral 5 years ago, people saw his great talent, and a bright future ahead. Now he is the Masters Champion!","rating":2},{"id":802671162383802400,"text":"The Green Party scam to fill up their coffers by asking for impossible recounts is now being joined by the badly defeated &amp, demoralized Dems","rating":7},{"id":969408165308747800,"text":"Good (Great) meeting in the Oval Office tonight with the NRA!","rating":5},{"id":1134921826604331000,"text":"Washington Post got it wrong, as usual. The U.S. is charging 25% against 250 Billion Dollars of goods shipped from China, not 200 BD. Also, China is paying a heavy cost in that they will subsidize goods to keep them coming, devalue their currency, yet companies are moving to.....","rating":4},{"id":1131387240045862900,"text":"Zero is getting done with the Democrats in charge of the House. All they want to do is put the Mueller Report behind them and start all over again. No Do-Overs!","rating":6},{"id":1260174133935124500,"text":"So interesting to see all of these people I beat so badly, pundits &amp; consultants that never had a chance, telling me how to run for office. Many are Republicans who should LOVE our 280 new Judges, rebuilt Military, 2A, great V.A. Low Taxes, etc. Just don’t like that I beat them!","rating":7},{"id":1135161682580389900,"text":"NO COLLUSION, NO OBSTRUCTION, NO NOTHING! “What the Democrats are trying to do is the biggest sin in the impeachment business.” David Rivkin, Constitutional Scholar. Meantime, the Dems are getting nothing done in Congress. They are frozen stiff. Get back to work, much to do!","rating":8},{"id":982724858743328800,"text":"What does the Department of Justice and FBI have to hide? Why aren’t they giving the strongly requested documents (unredacted) to the HOUSE JUDICIARY COMMITTEE? Stalling, but for what reason? Not looking good!","rating":6},{"id":1182654371714211800,"text":"Good things are happening at China Trade Talk Meeting. Warmer feelings than in recent past, more like the Old Days. I will be meeting with the Vice Premier today. All would like to see something significant happen!","rating":3},{"id":1081549802595340300,"text":"Many people currently a part of my opposition, including President Obama &amp, the Dems, have had campaign violations, in some cases for very large sums of money. These are civil cases. They paid a fine &amp, settled. While no big deal, I did not commit a campaign violation!","rating":5},{"id":1029895689868853200,"text":"“John Brennan is a stain on the Country, we deserve better than this.” Former Secret Service Agent and author of new book, “Spygate, the Attempted Sabotage of Donald J. Trump,” Dan Bongino. Thank you Dan, and good luck with the book!","rating":4},{"id":1072483770819846100,"text":"Fake News has it purposely wrong. Many, over ten, are vying for and wanting the White House Chief of Staff position. Why wouldn’t someone want one of the truly great and meaningful jobs in Washington. Please report news correctly. Thank you!","rating":3},{"id":1133699637678870500,"text":"...If Alabama does not elect a Republican to the Senate in 2020, many of the incredible gains that we have made during my Presidency may be lost, including our Pro-Life victories. Roy Moore cannot win, and the consequences will be devastating....Judges and Supreme Court Justices!","rating":5},{"id":1292832946077008000,"text":"RINO Ben Sasse, who needed my support and endorsement in order to get the Republican nomination for Senate from the GREAT State of Nebraska, has, now that he’s got it (Thank you President T), gone rogue, again. This foolishness plays right into the hands of the Radical Left Dems!","rating":6},{"id":990200773232529400,"text":"Allegations made by Senator Jon Tester against Admiral/Doctor Ron Jackson are proving false. The Secret Service is unable to confirm (in fact they deny) any of the phony Democrat charges which have absolutely devastated the wonderful Jackson family. Tester should resign. The.....","rating":5},{"id":1179856669901111300,"text":"There wasn’t ANYTHING said wrong in my conversation with the Ukrainian President. This is a Democrat Scam!","rating":7},{"id":1126815126584266800,"text":"Talks with China continue in a very congenial manner - there is absolutely no need to rush - as Tariffs are NOW being paid to the United States by China of 25% on 250 Billion Dollars worth of goods &amp, products. These massive payments go directly to the Treasury of the U.S....","rating":3},{"id":1084586625672376300,"text":"....Likewise, do not want the Kurds to provoke Turkey. Russia, Iran and Syria have been the biggest beneficiaries of the long term U.S. policy of destroying ISIS in Syria - natural enemies. We also benefit but it is now time to bring our troops back home. Stop the ENDLESS WARS!","rating":6},{"id":1305219365743153200,"text":"...and prices are coming down FAST! Also just ended all rebates to middlemen, further reducing prices.","rating":2},{"id":1166494782904000500,"text":"....Another is a one-time BAD Congressman from Illinois who lost in his second term by a landslide, then failed in radio. The third is a man who couldn’t stand up straight while receiving an award. I should be able to take them!","rating":7},{"id":1273984211062579200,"text":"The Democrats are doing totally false advertising. They have done NOTHING for years, including when Sleepy Joe was V.P., and they now have a Fake ad that my China Deal is losing us jobs. Opposite, &amp; China is paying us $BILLIONS. Also, I LOVE Seniors &amp; protect Preexisting C’s.","rating":8},{"id":998553122179084300,"text":"Under our potential deal with China, they will purchase from our Great American Farmers practically as much as our Farmers can produce.","rating":5},{"id":948879774277128200,"text":"With all of the failed “experts” weighing in, does anybody really believe that talks and dialogue would be going on between North and South Korea right now if I wasn’t firm, strong and willing to commit our total “might” against the North. Fools, but talks are a good thing!","rating":7},{"id":1153641907781873700,"text":"....Tariffs, Remittance Fees, or all of the above. Guatemala has not been good. Big U.S. taxpayer dollars going to them was cut off by me 9 months ago.","rating":6},{"id":908161523180286000,"text":"The \"\"deplorables\"\" came back to haunt Hillary.They expressed their feelings loud and clear. She spent big money but, in the end, had no game!","rating":9},{"id":826990079738540000,"text":"Iran is rapidly taking over more and more of Iraq even after the U.S. has squandered three trillion dollars there. Obvious long ago!","rating":7},{"id":1111745178824511500,"text":"Had the Fed not mistakenly raised interest rates, especially since there is very little inflation, and had they not done the ridiculously timed quantitative tightening, the 3.0% GDP, &amp, Stock Market, would have both been much higher &amp, World Markets would be in a better place!","rating":6},{"id":1075878792168685600,"text":"General Jim Mattis will be retiring, with distinction, at the end of February, after having served my Administration as Secretary of Defense for the past two years. During Jim’s tenure, tremendous progress has been made, especially with respect to the purchase of new fighting....","rating":4},{"id":1091029180521898000,"text":"Very sadly, Murder cases in Mexico in 2018 rose 33% from 2017, to 33,341. This is a big contributor to the Humanitarian Crisis taking place on our Southern Border and then spreading throughout our Country. Worse even than Afghanistan. Much caused by DRUGS. Wall is being built!","rating":7},{"id":948322497602220000,"text":"...peace treaty with Israel. We have taken Jerusalem, the toughest part of the negotiation, off the table, but Israel, for that, would have had to pay more. But with the Palestinians no longer willing to talk peace, why should we make any of these massive future payments to them?","rating":6},{"id":912997506900021200,"text":"Spoke to Jerry Jones of the Dallas Cowboys yesterday. Jerry is a winner who knows how to get things done. Players will stand for Country!","rating":3},{"id":1029899109749203000,"text":"“Hillary Clinton clearly got a pass by the FBI. We have the unfortunate situation where they then decided they were going to frame Donald Trump” concerning the Rigged Witch Hunt. JOE DIGENOVA, former U.S. Attorney.","rating":5},{"id":1127280257965412400,"text":"I won the 2016 Election partially based on no Tax Returns while I am under audit (which I still am), and the voters didn’t care. Now the Radical Left Democrats want to again relitigate this matter. Make it a part of the 2020 Election!","rating":4},{"id":916635236238274600,"text":"More and more people are suggesting that Republicans (and me) should be given Equal Time on T.V. when you look at the one-sided coverage?","rating":6},{"id":1138418208803831800,"text":"The United States has VERY LOW INFLATION, a beautiful thing!","rating":2},{"id":862387734492663800,"text":"Dems have been complaining for months &amp, months about Dir. Comey. Now that he has been fired they PRETEND to be aggrieved. Phony hypocrites!","rating":7},{"id":1205458677681008600,"text":"The Do Nothing Democrats have become the Party of lies and deception! The Republicans are the Party of the American Dream!","rating":6},{"id":814919370711461900,"text":"Great move on delay (by V. Putin) - I always knew he was very smart!","rating":8},{"id":1115589402661724200,"text":"Congressman Jerry Nadler fought me for years on a very large development I built on the West Side of Manhattan. He wanted a Rail Yard built underneath the development or even better, to stop the job. He didn’t get either &amp, the development became VERY successful. Nevertheless,....","rating":4},{"id":1157306452228366300,"text":"....Chariman Kim has a great and beautiful vision for his country, and only the United States, with me as President, can make that vision come true. He will do the right thing because he is far too smart not to, and he does not want to disappoint his friend, President Trump!","rating":9},{"id":939642796289470500,"text":"Great Army - Navy Game. Army wins 14 to 13 and brings home the COMMANDER-IN-CHIEF’S TROPHY! Congratulations!","rating":3},{"id":971726862526361600,"text":"Looking forward to 3:30 P.M. meeting today at the White House. We have to protect &amp, build our Steel and Aluminum Industries while at the same time showing great flexibility and cooperation toward those that are real friends  and treat us fairly on both trade and the military.","rating":2},{"id":877879361130688500,"text":"By the way, if Russia was working so hard on the 2016 Election, it all took place during the Obama Admin. Why didn't they stop them?","rating":6},{"id":1134134203308752900,"text":"Very sad to hear the news on the passing of my friend, Senator Thad Cochran. He was a real Senator with incredible values - even flew back to Senate from Mississippi for important Healthcare Vote when he was desperately ill. Thad never let our Country (or me) down!","rating":3},{"id":890642377131515900,"text":"Big progress being made in ridding our country of MS-13 gang members and gang members in general. MAKE AMERICA SAFE AGAIN!","rating":5},{"id":1026087766071947300,"text":"Too bad a large portion of the Media refuses to report the lies and corruption having to do with the Rigged Witch Hunt - but that is why we call them FAKE NEWS!","rating":7},{"id":1149107726565462000,"text":"....Thank you to Lockheed Martin, one of the USA’s truly great companies!","rating":2},{"id":1228446338091823000,"text":"It has been two years since the tragedy in Parkland. We will always mourn the innocent lives taken from us – 14 wonderful students and 3 terrific educators. Earlier this week, I met with families whose experiences from that horrible day still pierce the soul....","rating":3},{"id":897079051277537300,"text":"Now that Ken Frazier of Merck Pharma has resigned from President's Manufacturing Council,he will have more time to LOWER RIPOFF DRUG PRICES!","rating":5},{"id":1236979946175725600,"text":"“Trump has outmastered the Deep State. He’s light years ahead of us.” MSDNC. I disagree. We have a long way to go. There are still some very bad, sick people in our government - people who do not love our Country (In fact, they hate our Country!).","rating":8},{"id":919909494200528900,"text":"Since Election Day on November 8, the Stock Market is up more than 25%, unemployment is at a 17 year low &amp, companies are coming back to U.S.","rating":3},{"id":874609480301936600,"text":"Fake News is at an all time high. Where is their apology to me for all of the incorrect stories???","rating":6},{"id":1052171444082360300,"text":"Now that her claims of being of Indian heritage have turned out to be a scam and a lie, Elizabeth Warren should apologize for perpetrating this fraud against the American Public. Harvard called her “a person of color” (amazing con), and would not have taken her otherwise!","rating":8},{"id":1016327387154395100,"text":"I have confidence that Kim Jong Un will honor the contract we signed &amp,, even more importantly, our handshake. We agreed to the denuclearization of North Korea. China, on the other hand, may be exerting negative pressure on a deal because of our posture on Chinese Trade-Hope Not!","rating":7},{"id":981859214380462100,"text":"The Caravan is largely broken up thanks to the strong immigration laws of Mexico and their willingness to use them so as not to cause a giant scene at our Border. Because of the Trump Administrations actions, Border crossings are at a still UNACCEPTABLE 46 year low. Stop drugs!","rating":5},{"id":926481563214377000,"text":"The rigged Dem Primary, one of the biggest political stories in years, got ZERO coverage on Fake News Network TV last night. Disgraceful!","rating":7},{"id":1222186473849544700,"text":"The Fed should get smart &amp;  lower the Rate to make our interest competitive with other Countries which pay much lower even though we are, by far, the high standard. We would then focus on paying off &amp; refinancing debt! There is almost no inflation-this is the time (2 years late)!","rating":4},{"id":1138030977521987600,"text":"....We do not anticipate a problem with the vote but, if for any reason the approval is not forthcoming, Tariffs will be reinstated!","rating":5},{"id":904305644651634700,"text":"North Korea has conducted a major Nuclear Test. Their words and actions continue to be very hostile and dangerous to the United States.....","rating":3},{"id":1173368423381962800,"text":"Saudi Arabia oil supply was attacked. There is reason to believe that we know the culprit, are locked and loaded depending on verification, but are waiting to hear from the Kingdom as to who they believe was the cause of this attack, and under what terms we would proceed!","rating":6},{"id":999282325316866000,"text":"WITCH HUNT!","rating":8},{"id":844886082663698400,"text":"Just watched the totally biased and fake news reports of the so-called Russia story on NBC and ABC. Such dishonesty!","rating":7},{"id":862135824745467900,"text":"Cryin' Chuck Schumer stated recently, \"\"I do not have confidence in him (James Comey) any longer.\"\" Then acts so indignant.  #draintheswamp","rating":6},{"id":1076512233897771000,"text":"I am in the White House, working hard. News reports concerning the Shutdown and Syria are mostly FAKE. We are negotiating with the Democrats on desperately needed Border Security (Gangs, Drugs, Human Trafficking &amp, more) but it could be a long stay. On Syria, we were originally...","rating":4},{"id":1011389124475961300,"text":"Why is Senator Mark Warner (D-VA), perhaps in a near drunken state, claiming he has information that only he and Bob Mueller, the leader of the 13 Angry Democrats on a Witch Hunt, knows? Isn’t this highly illegal. Is it being investigated?","rating":9},{"id":924414387343028200,"text":"JFK Files are released, long ahead of schedule!","rating":3},{"id":1127965567359574000,"text":"There is no reason for the U.S. Consumer to pay the Tariffs, which take effect on China today. This has been proven recently when only 4 points were paid by the U.S., 21 points by China because China subsidizes product to such a large degree. Also, the Tariffs can be.....","rating":5},{"id":1120409894799253500,"text":"Isn’t it amazing that the people who were closest to me, by far, and knew the Campaign better than anyone, were never even called to testify before Mueller. The reason is that the 18 Angry Democrats knew they would all say ‘NO COLLUSION’ and only very good things!","rating":6},{"id":920604520572424200,"text":"As it has turned out, James Comey lied and leaked and totally protected Hillary Clinton. He was the best thing that ever happened to her!","rating":6},{"id":993446539988217900,"text":"My highly respected nominee for CIA Director, Gina Haspel, has come under fire because she was too tough on Terrorists. Think of that, in these very dangerous times, we have the most qualified person, a woman, who Democrats want OUT because she is too tough on terror. Win Gina!","rating":5}]