[{"id":1014295751814533100,"text":"Tonight we gathered to celebrate the courageous men and women who make freedom possible: our brave service members, and our wonderful Veterans. For 242 years, American Independence...","rating":3},{"id":1114556595663323100,"text":"So, let’s get this straight! There was No Collusion and in fact the Phony Dossier was a Con Job that was paid for by Crooked Hillary and the DNC. So the 13 Angry Democrats were investigating an event that never happened and that was in fact a made up Fraud. I just fought back....","rating":9},{"id":1157632664171614200,"text":"Countries are coming to us wanting to negotiate REAL trade deals, not the one sided horror show deals made by past administrations. They don’t want to be targeted for Tariffs by the U.S.","rating":4},{"id":1127522225224147000,"text":"“The Democrats have nothing. Just want to distract from this President. The FBI was not doing its job, the State Department was covering things up everyday for Hillary. At the end of the day they’re fearful of what they did, and should be fearful. This is a tough.....","rating":6},{"id":941291666564141000,"text":"Republican Tax Cuts are looking very good. All are working hard. In the meantime, the Stock Market hit another record high!","rating":3},{"id":1090609577006112800,"text":"....a source of potential danger and conflict. They are testing Rockets (last week) and more, and are coming very close to the edge. There economy is now crashing, which is the only thing holding them back. Be careful of Iran. Perhaps Intelligence should go back to school!","rating":8},{"id":1147345548548223000,"text":"....As well as we are doing from the day after the great Election, when the Market shot right up, it could have been even better - massive additional wealth would have been created, &amp, used very well. Our most difficult problem is not our competitors, it is the Federal Reserve!","rating":5},{"id":999096011174924300,"text":"If the person placed very early into my campaign wasn’t a SPY put there by the previous Administration for political purposes, how come such a seemingly massive amount of money was paid for services rendered - many times higher than normal...","rating":7},{"id":1192418595323682800,"text":"Bill Barr did not decline my request to talk about Ukraine. The story was a Fake Washington Post con job with an “anonymous” source that doesn’t exist. Just read the Transcript. The Justice Department already ruled that the call was good. We don’t have freedom of the press!","rating":8},{"id":1204408551034228700,"text":"America’s great USMCA Trade Bill is looking good. It will be the best and most important trade deal ever made by the USA. Good for everybody - Farmers, Manufacturers, Energy, Unions - tremendous support. Importantly, we will finally end our Country’s worst Trade Deal, NAFTA!","rating":4},{"id":862767872879325200,"text":"Russia must be laughing up their sleeves watching as the U.S. tears itself apart over a Democrat EXCUSE for losing the election.","rating":8},{"id":1042768904857247700,"text":"S&amp,P 500 HITS ALL-TIME HIGH  Congratulations USA!","rating":3},{"id":1074650975456124900,"text":"The DEDUCTIBLE which comes with ObamaCare is so high that it is practically not even useable! Hurts families badly. We have a chance, working with the Democrats, to deliver great HealthCare! A confirming Supreme Court Decision will lead to GREAT HealthCare results for Americans!","rating":6},{"id":874608587473080300,"text":"A.G. Lynch made law enforcement decisions for political purposes...gave Hillary Clinton a free pass and protection. Totally illegal!","rating":7},{"id":1127283257383555100,"text":"So now the Radical Left Dems don’t talk about Collusion anymore, because the Mueller Report said there was No Collusion, they only want to talk about Obstruction, even though there was No Obstruction or No Crime - except for the crimes committed by the other side!","rating":7},{"id":887650824515661800,"text":"I will be having lunch at the White House today with Republican Senators concerning healthcare. They MUST keep their promise to America!","rating":4},{"id":1167876317745860600,"text":"Being scolded by failed former “Intelligence” officials, like James Clapper, on my condolences to Iran on their failed Rocket launch. Sadly for the United States, guys like him, Comey, and the even dumber John Brennan, don’t have a clue. They really set our Country back,....","rating":9},{"id":1165005927864512500,"text":"For many years China (and many other countries) has been taking advantage of the United States on Trade, Intellectual Property Theft, and much more. Our Country has been losing HUNDREDS OF BILLIONS OF DOLLARS a year to China, with no end in sight....","rating":5},{"id":1162500362810642400,"text":"Having dinner tonight with Tim Cook of Apple. They will be spending vast sums of money in the U.S. Great!","rating":2},{"id":1234869067892306000,"text":"The Federal Reserve is cutting but must further ease and, most importantly, come into line with other countries/competitors. We are not playing on a level field. Not fair to USA. It is finally time for the Federal Reserve to LEAD. More easing and cutting!","rating":4},{"id":968468176639004700,"text":"WITCH HUNT!","rating":8},{"id":901579350662938600,"text":"Wonderful coordination between Federal, State and Local Governments in the Great State of Texas - TEAMWORK! Record setting rainfall.","rating":4},{"id":1090566017238093800,"text":"Maduro willing to negotiate with opposition in Venezuela following U.S. sanctions and the cutting off of oil revenues. Guaido is being targeted by Venezuelan Supreme Court. Massive protest expected today. Americans should not travel to Venezuela until further notice.","rating":3},{"id":931123400810037200,"text":"....your release possible and, HAVE A GREAT LIFE! Be careful, there are many pitfalls on the long and winding road of life!","rating":2},{"id":1163440418555605000,"text":"Anthony Scaramucci is a highly unstable “nut job” who was with other candidates in the primary who got shellacked, &amp, then unfortunately wheedled his way into my campaign. I barely knew him until his 11 days of gross incompetence-made a fool of himself, bad on TV. Abused staff,...","rating":9},{"id":1029706933706661900,"text":"Great Republican election results last night. So far we have the team we want. 8 for 9 in Special Elections. Red Wave!","rating":5},{"id":1213115187160637400,"text":"....and more control over Iraq, and the people of Iraq are not happy with that. It will never end well!","rating":3},{"id":968467243192537100,"text":"“We’ve seen NO EVIDENCE OF COLLUSION....I have seen nothing, the firing of James Comey and all of the aftermath, that suggests that the President has obstructed justice because he’s exercising his power as the President of the U.S. I just don’t see it.”  Judge Ken Starr","rating":4},{"id":1138428346214363100,"text":"Maria, Dagan, Steve, Stuart V - When you are the big “piggy bank” that other countries have been ripping off for years (to a level that is not to be believed), Tariffs are a great negotiating tool, a great revenue producers and,  most importantly, a powerful way to get......","rating":6},{"id":1173597713860046800,"text":"They failed on the Mueller Report, they failed on Robert Mueller’s testimony, they failed on everything else, so now the Democrats are trying to build a case that I enrich myself by being President. Good idea, except I will, and have always expected to, lose BILLIONS of DOLLARS..","rating":7},{"id":822501939267141600,"text":"power from Washington, D.C. and giving it back to you, the American People. #InaugurationDay","rating":3},{"id":924649059520073700,"text":"All of this \"\"Russia\"\" talk right when the Republicans are making their big push for historic Tax Cuts &amp, Reform. Is this coincidental? NOT!","rating":6},{"id":1017650505043140600,"text":"Congressman Matt Gaetz of Florida is one of the finest and most talented people in Congress. Strong on Crime, the Border, Illegal Immigration, the 2nd Amendment, our great Military &amp, Vets, Matt worked tirelessly on helping to get our Massive Tax Cuts. He has my Full Endorsement!","rating":4},{"id":1030072571948134400,"text":"Our Economy is doing better than ever. Money is pouring into our cherished DOLLAR like rarely before, companies earnings are higher than ever, inflation is low &amp, business optimism is higher than it has ever been. For the first time in many decades, we are protecting our workers!","rating":3},{"id":1010153153084428300,"text":"80% of Mexico’s Exports come to the United States. They totally rely on us, which is fine with me. They do have, though, very strong Immigration Laws. The U.S. has pathetically weak and ineffective Immigration Laws that the Democrats refuse to help us fix. Will speak to Mexico!","rating":5},{"id":1065718109624066000,"text":"This is the coldest weather in the history of the Thanksgiving Day Parade in NYC, and one of the coldest Thanksgivings on record!","rating":4},{"id":1268683083852779500,"text":"John Kelly didn’t know I was going to fire James Mattis, nor did he have any knowledge of my asking for a letter of resignation. Why would I tell him, he was not...","rating":5},{"id":1154003030267900000,"text":"It has been reported that Robert Mueller is saying that he did not apply and interview for the job of FBI Director (and get turned down) the day before he was wrongfully appointed Special Counsel. Hope he doesn’t say that under oath in that we have numerous witnesses to the...","rating":7},{"id":1208228281402757000,"text":"Last year I signed legislation that gives our Veterans CHOICE, through private providers, and at urgent care facilities! Today we fully funded this $10 billion a year effort that gets our brave Veterans care quickly, and close to home.","rating":3},{"id":1180307952210759700,"text":"“It isn’t often I get angry at the dirty politics of the Democrats in Congress, but this time I am enraged and hope this impeachment charade will backfire on Reps. Pelosi &amp, Schiff, &amp, the Democrats. I have read thoroughly the telephone conversation between Trump &amp, the President...","rating":6},{"id":1249691642975727600,"text":"....disaster, the Energy Industry will be strong again, far faster than currently anticipated. Thank you to all of those who worked with me on getting this very big business back on track, in particular Russia and Saudi Arabia.","rating":4},{"id":1187874122279338000,"text":"Democrats just announced that they no longer want the Whistleblower to testify. But everything was about the Whistleblower (they no longer want the second Whistleblower either), which they don’t want because the account of my call bore NO RELATIONSHIP to the call itself.....","rating":7},{"id":972506194978984000,"text":"Chinese President XI JINPING and I spoke at length about the meeting with KIM JONG UN of North Korea. President XI told me he appreciates that the U.S. is working to solve the problem diplomatically rather than going with the ominous alternative. China continues to be helpful!","rating":3},{"id":981881669593559000,"text":"The Fake News Washington Post, Amazon’s “chief lobbyist,” has another (of many) phony headlines, “Trump Defiant As China Adds Trade Penalties.” WRONG! Should read, “Trump Defiant as U.S. Adds Trade Penalties, Will End Barriers And Massive  I.P. Theft.” Typically bad reporting!","rating":8},{"id":1084936400212963300,"text":"Spoke w/ President Erdogan of Turkey to advise where we stand on all matters including our last two weeks of success in fighting the remnants of ISIS, and 20 mile safe zone. Also spoke about economic development between the U.S. &amp, Turkey - great potential to substantially expand!","rating":5},{"id":839084268991230000,"text":"122 vicious prisoners, released by the Obama Administration from Gitmo, have returned to the battlefield. Just another terrible decision!","rating":6},{"id":1158350120649408500,"text":"China dropped the price of their currency to an almost a historic low. It’s called “currency manipulation.” Are you listening Federal Reserve? This is a major violation which will greatly weaken China over time!","rating":5},{"id":1024059897221206000,"text":"Congratulations to Judge Jeanine on the tremendous success of her new #1 best-selling book, “Liars, Leakers, and Liberals – The Case Against the Anti-Trump Conspiracy!”","rating":3},{"id":972846978823610400,"text":"The Democrats continue to Obstruct the confirmation of hundreds of good and talented people who are needed to run our government...A record in U.S. history. State Department, Ambassadors and many others are being slow walked. Senate must approve NOW!","rating":4},{"id":934031535757582300,"text":"After Turkey call I will be heading over to Trump National Golf Club, Jupiter, to play golf (quickly) with Tiger Woods and Dustin Johnson. Then back to Mar-a-Lago for talks on bringing even more jobs and companies back to the USA!","rating":6},{"id":972829763067883500,"text":"The Failing New York Times purposely wrote a false story stating that I am unhappy with my legal team on the Russia case and am going to add another lawyer to help out. Wrong. I am VERY happy with my lawyers, John Dowd, Ty Cobb and Jay Sekulow. They are doing a great job and.....","rating":7},{"id":1155319124127572000,"text":"....Robert Mueller’s testimony, and the Mueller Report itself, was a disaster for this illegal Democrat inspired Witch Hunt. It is an embarrassment to the USA that they don’t know how to stop. They can’t help themselves, they are totally lost, they are Clowns!","rating":8},{"id":1251561332790440000,"text":"....them happy, or even a little bit satisfied. They were RUDE and NASTY. This is their political playbook, and they will use it right up to the election on November 3rd. They will not change because they feel that this is the only way they can win. America will not be fooled!!!","rating":6},{"id":890533442135502800,"text":"Come on Republican Senators, you can do it on Healthcare. After 7 years, this is your chance to shine! Don't let the American people down!","rating":5},{"id":1178635525328113700,"text":"The Greatest Witch Hunt in the history of our Country!","rating":8},{"id":1293141671509659600,"text":"Great new book by former Director of Oval Office Operations, Madeleine Westerhout, entitled “Off the Record”. When I look at all of the Fake Books and garbage written about me, it’s really nice to see a very smart and already wise young woman write an honest depiction of what....","rating":4},{"id":1023646663590797300,"text":"When the media - driven insane by their Trump Derangement Syndrome - reveals internal deliberations of our government, it  truly puts the lives of many, not just journalists, at risk! Very unpatriotic! Freedom of the press also comes with a responsibility to report the news...","rating":6},{"id":993810085540491300,"text":"Gina Haspel, my highly respected nominee to lead the CIA, is being praised for the fact that she has been, and alway will be, TOUGH ON TERROR! This is a woman who has been a leader wherever she has gone. The CIA wants her to lead them into America’s  bright and glorious future!","rating":3},{"id":990787671281819600,"text":"Headline: “Kim Prepared to Cede Nuclear Weapons if U.S. Pledges Not to Invade” - from the Failing New York Times. Also, will shut down Nuclear Test Site in May.","rating":2},{"id":1029743849160233000,"text":"Happy Birthday to the leader of the Democrat Party, Maxine Waters!","rating":10},{"id":852134796436398100,"text":"Had a very good call last night with the President of China concerning the menace of North Korea.","rating":3},{"id":915894251967385600,"text":"Why Isn't the Senate Intel Committee looking into the Fake News Networks in OUR country to see why so much of our news is just made up-FAKE!","rating":8},{"id":1181560708808487000,"text":"I would love to send Ambassador Sondland, a really good man and great American, to testify, but unfortunately he would be testifying before a totally compromised kangaroo court, where Republican’s rights have been taken away, and true facts are not allowed out for the public....","rating":6},{"id":1106161655292010500,"text":"The Democrats are “Border Deniers.” They refuse to see or acknowledge the Death, Crime, Drugs and Human Trafficking at our Southern Border!","rating":7},{"id":1055820292881350700,"text":"The United States has been spending Billions of Dollars a year on Illegal Immigration. This will not continue. Democrats must give us the votes to pass strong (but fair) laws. If not, we will be forced to play a much tougher hand.","rating":5},{"id":880553561008078800,"text":"Good news out of the House with the passing of 'No Sanctuary for Criminals Act.' Hopefully Senate will follow.","rating":4},{"id":1295407319694680000,"text":"Getting ready to land in Minneapolis. Our great National Guard saved the city from further destruction. Should have been called up sooner by local government!","rating":6},{"id":1129877776377483300,"text":"Courts &amp, Dems in Congress, neither of which have a clue, are trying to FORCE migrants into our Country! OUR COUNTRY IS FULL, OUR DETENTION CENTERS, HOSPITALS &amp, SCHOOLS ARE PACKED. Crazy!","rating":7},{"id":1007572229935202300,"text":"FBI Agent Peter Strzok, who headed the Clinton &amp, Russia investigations, texted to his lover Lisa Page, in the IG Report, that “we’ll stop” candidate Trump from becoming President. Doesn’t get any lower than that!","rating":7},{"id":1240265729108304000,"text":"The DNC will have gotten their fondest wish and defeated Bernie Sanders, far ahead of schedule. Now they are doing everything possible to be nice to him in order to keep his supporters. Bernie has given up, just like he did last time. He will be dropping out soon! MAGA/KAG","rating":6},{"id":1129954115205914600,"text":"....Federal Judges (many more to come), two great new Supreme Court Justices, the Mexico City Policy, and a whole new &amp, positive attitude about the Right to Life. The Radical Left, with late term abortion (and worse), is imploding on this issue. We must stick together and Win....","rating":7},{"id":1022287249432563700,"text":"European Union representatives told me that they would start buying soybeans from our great farmers immediately. Also, they will be buying vast amounts of LNG!","rating":5},{"id":1029354577559281700,"text":"Strzok started the illegal Rigged Witch Hunt - why isn’t this so-called “probe” ended immediately? Why aren’t these angry and conflicted Democrats instead looking at Crooked Hillary?","rating":9},{"id":1245085379084144600,"text":"Will be starting The White House news conference at 5:15 P.M. Eastern.","rating":3},{"id":1017086416176730100,"text":"Democrats in Congress must no longer Obstruct - vote to fix our terrible Immigration Laws now. I am watching what is going on from Europe - it would be soooo simple to fix. Judges run the system and illegals and traffickers know how it works. They are just using children!","rating":8},{"id":1004846478253273100,"text":"Please tell Prime Minister Trudeau and President Macron that they are charging the U.S. massive tariffs and create non-monetary barriers. The EU trade surplus with the U.S. is $151 Billion, and Canada keeps our farmers and others out. Look forward to seeing them tomorrow.","rating":6},{"id":1132027622597128200,"text":"Mitch McConnell and our Republican Senators have been very solid and strong. We have accomplished a great deal together, in particular with our Courts, 107 Federal Judges....","rating":4},{"id":1089159145268408300,"text":"“I like the fact that the President is making the case (Border Security &amp, Crime) to the American people. Now we know where Nancy Pelosi, Chuck Schumer &amp, the Democrats stand, which is no Border Security. Will be big 2020 issue.” Matt Schlapp, Chair, ACU. Bigger than anyone knows!","rating":5},{"id":837492425283219500,"text":"...is all of the illegal leaks of classified and other information. It is a total \"\"witch hunt!\"\"","rating":6},{"id":1039107129880272900,"text":"The GDP Rate (4.2%) is higher than the Unemployment Rate (3.9%) for the first time in over 100 years!","rating":7},{"id":1243560795415470000,"text":"Invoke “P” means Defense Production Act!","rating":3},{"id":944222157218943000,"text":"With all my Administration has done on Legislative Approvals (broke Harry Truman’s Record), Regulation Cutting, Judicial Appointments, Building Military, VA, TAX CUTS &amp, REFORM, Record Economy/Stock Market and so much more, I am sure great credit will be given by mainstream news?","rating":5},{"id":869170615881793500,"text":"I look forward to paying my respects to our brave men and women on this Memorial Day at Arlington National Cemetery later this morning.","rating":2},{"id":816057920223846400,"text":"North Korea just stated that it is in the final stages of developing a nuclear weapon capable of reaching parts of the U.S. It won't happen!","rating":6},{"id":1248620586663702500,"text":"The White House Press Conference will take place today at 1:00 P.M., recognizing that it is Good Friday!","rating":1},{"id":904309527381717000,"text":"South Korea is finding, as I have told them, that their talk of appeasement with North Korea will not work, they only understand one thing!","rating":5},{"id":1071030014123098100,"text":"China talks are going very well!","rating":1},{"id":1184101618901540900,"text":"Democrats are allowing no transparency at the Witch Hunt hearings. If Republicans ever did this they would be excoriated by the Fake News. Let the facts come out from the charade of people, most of whom I do not know, they are interviewing for 9 hours each, not selective leaks.","rating":7},{"id":904307898213433300,"text":"..North Korea is a rogue nation which has become a great threat and embarrassment to China, which is trying to help but with little success.","rating":4},{"id":937279001684598800,"text":"I never asked Comey to stop investigating Flynn. Just more Fake News covering another Comey lie!","rating":6},{"id":1069631759573225500,"text":"Looking forward to being with the Bush Family to pay my respects to President George H.W. Bush.","rating":3},{"id":1052387851088867300,"text":"Elizabeth Warren is being hammered, even by the Left. Her false claim of Indian heritage is only selling to VERY LOW I.Q. individuals!","rating":9},{"id":1181913136074502100,"text":"The so-called Whistleblower, before knowing I was going to release the exact Transcript, stated that my call with the Ukrainian President was “crazy, frightening, and completely lacking in substance related to national security.” This is a very big Lie. Read the Transcript!","rating":7},{"id":991809653980966900,"text":"“This isn’t some game. You are screwing with the work of the president of the United States.”  John Dowd, March 2018.  With North Korea, China, the Middle East and so much more, there is not much time to be thinking about this, especially since there was no Russian “Collusion.”","rating":5},{"id":1124670603179565000,"text":"Anything in this very interesting world is possible, but I believe that Kim Jong Un fully realizes the great economic potential of North Korea, &amp, will do nothing to interfere or end it. He also knows that I am with him &amp, does not want to break his promise to me. Deal will happen!","rating":4},{"id":1012321218056384500,"text":"I am in Milwaukee, Wisconsin, for meetings. Soon to leave for a big groundbreaking for Foxconn, which is building a great new electronics plant in Wisconsin. 15,000 Jobs, so great!","rating":3},{"id":868517059407335400,"text":"Bringing hundreds of billions of dollars back to the U.S.A. from the Middle East - which will mean JOBS, JOBS, JOBS!","rating":4},{"id":877891129194102800,"text":"...Why did the DNC REFUSE to turn over its Server to the FBI, and still hasn't? It's all a big Dem scam and excuse for losing the election!","rating":6},{"id":805486509914779600,"text":"The Green Party just dropped its recount suit in Pennsylvania and is losing votes in Wisconsin recount. Just a Stein scam to raise money!","rating":5},{"id":1264912072892125200,"text":"....Hawaii in a big, fully loaded 747, to play. What did that do to the so-called Carbon Footprint? He also played moments after the brutal killing by ISIS of a wonderful young man. Totally inappropriate - and it was me who shattered 100% of the ISIS Caliphate. I was left a MESS!","rating":7},{"id":871725780535062500,"text":"Pathetic excuse by London Mayor Sadiq Khan who had to think fast on his \"\"no reason to be alarmed\"\" statement. MSM is working hard to sell it!","rating":6},{"id":1179932948138725400,"text":"We are simultaneously fighting the Fake News Media and their partner, the Democrat Party. Always tough to beat the “Press,” but people are beginning to see how totally CORRUPT they are, and it makes our job a whole lot easier!","rating":8},{"id":1052888451199262700,"text":"....The assault on our country at our Southern Border, including the Criminal elements and DRUGS pouring in, is far more important to me, as President, than Trade or the USMCA. Hopefully Mexico will stop this onslaught at their Northern Border. All Democrats fault for weak laws!","rating":7},{"id":924249943719727100,"text":"Very little reporting about the GREAT GDP numbers announced yesterday (3.0 despite the big hurricane hits). Best consecutive Q's in years!","rating":4},{"id":1209446138811764700,"text":"Everything we’re seeing from Speaker Pelosi and Senator Schumer suggests that they’re in real doubt about the evidence they’ve brought forth so far not being good enough,  and are very, very urgently seeking a way to find some more evidence. The only way to make this work is to..","rating":5},{"id":1094631415357075500,"text":"I don’t think the Dems on the Border Committee are being allowed by their leaders to make a deal. They are offering very little money for the desperately needed Border Wall &amp, now, out of the blue, want a cap on convicted violent felons to be held in detention!","rating":6},{"id":1100110413209858000,"text":"...Danny’s recovery reflects the best of what the United States &amp, its partners can accomplish.We work every day to bring Americans home. We maintain constant and intensive diplomatic, intelligence, and law enforcement cooperation within the United States Government and with...","rating":3},{"id":1004696266297827300,"text":"Good luck to Alice Johnson. Have a wonderful life!","rating":2},{"id":1170324532562931700,"text":"“In 22 years of patrolling our Southern Border, I have never seen Mexico act like a true Border Security Partner until President Trump got involved, and now they are stepping up to the plate and doing what they need to do.” Brandon Judd, National Border Patrol","rating":5},{"id":1020800615226794000,"text":"The Rigged Witch Hunt, headed by the 13 Angry Democrats (and now 4 more have been added, one who worked directly for Obama W.H.), seems intent on damaging the Republican Party’s chances in the November Election. This Democrat excuse for losing the ‘16 Election never ends!","rating":8},{"id":817413321058029600,"text":"I am asking the chairs of the House and Senate committees to investigate top secret intelligence shared with NBC prior to me seeing it.","rating":5},{"id":1125149867347718100,"text":"Despite the tremendous success that I have had as President, including perhaps the greatest ECONOMY and most successful first two years of any President in history, they have stollen two years of my (our) Presidency (Collusion Delusion) that we will never be able to get back.....","rating":8},{"id":1126928408934535200,"text":"Over the course of the past two days, the United States and China have held candid and constructive conversations on the status of the trade relationship between both countries. The relationship between President Xi and myself remains a very strong one, and conversations....","rating":3},{"id":1084062079907229700,"text":"...Funny thing about James Comey. Everybody wanted him fired, Republican and Democrat alike. After the rigged &amp, botched Crooked Hillary investigation, where she was interviewed on July 4th Weekend, not recorded or sworn in, and where she said she didn’t know anything (a lie),....","rating":7},{"id":905228667336499200,"text":"Congress now has 6 months to legalize DACA (something the Obama Administration was unable to do). If they can't, I will revisit this issue!","rating":4},{"id":1052741954918867000,"text":"Ever since his vicious and totally false statements about Admiral Ron Jackson, the highly respected White House Doctor for Obama, Bush &amp, me, Senator John Tester looks to be in big trouble in the Great State of Montana! He behaved worse than the Democrat Mob did with Justice K!","rating":7},{"id":1049640099007356900,"text":"Great evening last night at the White House honoring Justice Kavanaugh and family. Our country is very proud of them!","rating":3},{"id":829689436279603200,"text":"..Ryan died on a winning mission ( according to General Mattis), not a \"\"failure.\"\" Time for the U.S. to get smart and start winning again!","rating":6},{"id":1068887938761662500,"text":"....However, out of respect for the Bush Family and former President George H.W. Bush we will wait until after the funeral to have a press conference.","rating":2},{"id":930744931609694200,"text":"Our great country is respected again in Asia. You will see the fruits of our long but successful trip for many years to come!","rating":4},{"id":1151871836541608000,"text":"....of gang members, in particular MS-13. ICE and Border Patrol are doing a great job!","rating":5},{"id":1305693617969754000,"text":"We had great rallies this past weekend, after the Governor of Nevada worked very hard to cancel all of our venues. Despite the fact that he controls the state, he failed, but would have rather done rally outside. Can you imagine this man is in charge...","rating":7},{"id":987066289855303700,"text":"Mike Pompeo is outstanding. First in his class at West Point. A top student at Harvard Law School. A success at whatever he has done. We need the Senate to approve Mike ASAP. He will be a great Secretary of State!","rating":3},{"id":1132506435848495100,"text":"Great progress being made in our Trade Negotiations with Japan. Agriculture and beef heavily in play. Much will wait until after their July elections where I anticipate big numbers!","rating":4},{"id":1040220855400386600,"text":".....This was done by the Democrats in order to make me look as bad as possible when I was successfully raising Billions of Dollars to help rebuild Puerto Rico. If a person died for any reason, like old age, just add them onto the list. Bad politics. I love Puerto Rico!","rating":7},{"id":1052200515608690700,"text":"Incredible number just out, 7,036,000 job openings. Astonishing - it’s all working! Stock Market up big on tremendous potential of USA. Also, Strong Profits. We are Number One in World, by far!","rating":4},{"id":1003616210922147800,"text":"As has been stated by numerous legal scholars, I have the absolute right to PARDON myself, but why would I do that when I have done nothing wrong? In the meantime, the never ending Witch Hunt, led by 13 very Angry and Conflicted Democrats (&amp, others) continues into the mid-terms!","rating":9},{"id":925006418989715500,"text":"....Also, there is NO COLLUSION!","rating":2},{"id":940588025964265500,"text":"Consumer Confidence is at an All-Time High, along with a Record High Stock Market. Unemployment is at a 17 year low. MAKE AMERICA GREAT AGAIN! Working to pass MASSIVE TAX CUTS (looking good).","rating":3},{"id":1140065300186128400,"text":"Do you believe that the Failing New York Times just did a story stating that the United States is substantially increasing Cyber Attacks on Russia. This is a virtual act of Treason by a once great paper so desperate for a story, any story, even if bad for our Country.....","rating":8},{"id":890820505330212900,"text":"3 Republicans and 48 Democrats let the American people down. As I said from the beginning, let ObamaCare implode, then deal. Watch!","rating":4},{"id":1184293357121613800,"text":"Shifty Adam Schiff wants to rest his entire case on a Whistleblower who he now says can’t testify, &amp, the reason he can’t testify is that he is afraid to do so because his account of the Presidential telephone call is a fraud &amp, totally different from the actual transcribed call...","rating":6},{"id":1205455275953729500,"text":"The Republicans House members were fantastic yesterday. It always helps to have a much better case, in fact the Dems have no case at all, but the unity &amp, sheer brilliance of these Republican warriors, all of them, was a beautiful sight to see. Dems had no answers and wanted out!","rating":5},{"id":1029329583672307700,"text":"When you give a crazed, crying lowlife a break, and give her a job at the White House, I guess it just didn’t work out. Good work by General Kelly for quickly firing that dog!","rating":9},{"id":1119572078175367200,"text":"The Fake News Media is doing everything possible to stir up and anger the pols and as many people as possible seldom mentioning the fact that the Mueller Report had as its principle conclusion the fact that there was NO COLLUSION WITH RUSSIA. The Russia Hoax is dead!","rating":5},{"id":916120435762266100,"text":"Ralph Northam,who is running for Governor of Virginia,is fighting for the violent MS-13 killer gangs &amp, sanctuary cities.  Vote Ed Gillespie!","rating":4},{"id":951106475254059000,"text":"The fact that Sneaky Dianne Feinstein, who has on numerous occasions stated that collusion between Trump/Russia has not been found, would release testimony in such an underhanded and possibly illegal way, totally without authorization, is a disgrace. Must have tough Primary!","rating":5},{"id":1165763483322835000,"text":"In France we are all laughing at how knowingly inaccurate the U.S. reporting of events and conversations at the G-7 is. These Leaders, and many others, are getting a major case study of Fake News at it’s finest! They’ve got it all wrong, from Iran, to China Tariffs, to Boris!","rating":5},{"id":1161767691646115800,"text":"..deferral to December. It actually helps China more than us, but will be reciprocated. Millions of jobs are being lost in China to other non-Tariffed countries. Thousands of companies are leaving. Of course China wants to make a deal. Let them work humanely with Hong Kong first!","rating":3},{"id":891038014314598400,"text":"I am pleased to inform you that I have just named General/Secretary John F Kelly as White House Chief of Staff. He is a Great American....","rating":2},{"id":1037078251095687200,"text":"The Brett Kavanaugh hearings for the future Justice of the Supreme Court are truly a display of how mean, angry, and despicable the other side is. They will say anything, and are only....","rating":6},{"id":1102288283713896400,"text":"“Look how they’re acting now and how we act when we’re in the majority. What the Democrats are doing is an abuse of power. They couldn’t find anything...they took a Fake Dossier &amp, couldn’t find any Collusion. Now they have a fake witness in Cohen.” Congressman Mark Green, (R-TN).","rating":7},{"id":1128065224018473000,"text":"Wishing former President Jimmy Carter a speedy recovery from his hip surgery earlier today. He was in such good spirits when we spoke last month - he will be fine!","rating":3},{"id":965676314576543700,"text":"Obama was President up to, and beyond, the 2016 Election. So why didn’t he do something about Russian meddling?","rating":5},{"id":1171056605233852400,"text":"I know nothing about an Air Force plane landing at an airport (which I do not own and have nothing to do with) near Turnberry Resort (which I do own) in Scotland, and filling up with fuel, with the crew staying overnight at Turnberry (they have good taste!). NOTHING TO DO WITH ME","rating":6},{"id":880737163247267800,"text":"If Republican Senators are unable to pass what they are working on now, they should immediately REPEAL, and then REPLACE at a later date!","rating":4},{"id":1167783720021123000,"text":"...Yes, I am currently suing various people for violating their confidentiality agreements. Disgusting and foul mouthed Omarosa is one. I gave her every break, despite the fact that she was despised by everyone, and she went for some cheap money from a book. Numerous others also!","rating":8},{"id":818990655418617900,"text":"FAKE NEWS - A TOTAL POLITICAL WITCH HUNT!","rating":9},{"id":1106552621152780300,"text":"So, if there was knowingly &amp, acknowledged to be “zero” crime when the Special Counsel was appointed, and if the appointment was made based on the Fake Dossier (paid for by Crooked Hillary) and now disgraced Andrew McCabe (he &amp, all stated no crime), then the Special Counsel.......","rating":7},{"id":879828637733793800,"text":"I just finished a great meeting with the Republican Senators concerning HealthCare. They really want to get it right, unlike OCare!","rating":4},{"id":1159083361803149300,"text":"“Three more Central Banks cut rates.” Our problem is not China - We are stronger than ever, money is pouring into the U.S. while China is losing companies by the thousands to other countries, and their currency is under siege - Our problem is a Federal Reserve that is too.....","rating":5},{"id":1056220576098992100,"text":"Events in Pittsburgh are far more devastating than originally thought. Spoke with Mayor and Governor to inform them that the Federal Government has been, and will be, with them all the way. I will speak to the media shortly and make further statement at Future Farmers of America.","rating":3},{"id":921709468055896000,"text":"I hope the Fake News Media keeps talking about Wacky Congresswoman Wilson in that she, as a representative, is killing the Democrat Party!","rating":6},{"id":1000465814192099300,"text":"When will the 13 Angry Democrats (&amp, those who worked for President O), reveal their disqualifying Conflicts of Interest? It’s been a long time now! Will they be indelibly written into the Report along with the fact that the only Collusion is with the Dems, Justice, FBI &amp, Russia?","rating":7},{"id":1127888569543077900,"text":"I say openly to President Xi &amp, all of my many friends in China that China will be hurt very badly if you don’t make a deal because companies will be forced to leave China for other countries. Too expensive to buy in China. You had a great deal, almost completed, &amp, you backed out!","rating":4},{"id":1039261826318524400,"text":"Chuck Schumer is holding up 320 appointments (Ambassadors, Executives, etc.) of great people who have left jobs and given up so much in order to come into Government. Schumer and the Democrats continue to OBSTRUCT!","rating":5},{"id":1118137564173566000,"text":"A must read, Andy McCarthy’s column today, “Dirty dealings of dirt devils who concocted Trump-Russia probe.” The greatest Scam in political history. If the Mainstream Media were honest, which they are not, this story would be bigger and more important than Watergate. Someday!","rating":8},{"id":1122876984646934500,"text":"The Dues Sucking firefighters leadership will always support Democrats, even though the membership wants me. Some things never change!","rating":6},{"id":1161679474578079700,"text":"Tremendous amounts of money pouring into the United States. People want safety!","rating":4},{"id":1194986487588311000,"text":"Walmart announces great numbers. No impact from Tariffs (which are contributing $Billions to our Treasury). Inflation low (do you hear that Powell?)!","rating":5},{"id":973907142649397200,"text":"Hundreds of good people, including very important Ambassadors and Judges, are being blocked and/or slow walked by the Democrats in the Senate. Many important positions in Government are unfilled because of this obstruction. Worst in U.S. history!","rating":7},{"id":1164311594081247200,"text":"Henry Ford would be very disappointed if he saw his modern-day descendants wanting to build a much more expensive car, that is far less safe and doesn’t work as well, because execs don’t want to fight California regulators. Car companies should know....","rating":6},{"id":998194013193822200,"text":"Now that the Witch Hunt has given up on Russia and is looking at the rest of the World, they should easily be able to take it into the Mid-Term Elections where they can put some hurt on the Republican Party. Don’t worry about Dems FISA Abuse, missing Emails or Fraudulent Dossier!","rating":8},{"id":1065351478347530200,"text":".....are so many opposing view (on Border and Safety) cases filed there, and why are a vast number of those cases overturned. Please study the numbers, they are shocking. We need protection and security - these rulings are making our country unsafe! Very dangerous and unwise!","rating":6},{"id":918806396875010000,"text":"Hard to believe that the Democrats, who have gone so far LEFT that they are no longer recognizable, are fighting so hard for Sanctuary crime","rating":7},{"id":1107608921370513400,"text":"....are all coming back to the U.S. So is everyone else. We now have the best Economy in the World, the envy of all. Get that big, beautiful plant in Ohio open now. Close a plant in China or Mexico, where you invested so heavily pre-Trump, but not in the U.S.A. Bring jobs home!","rating":5},{"id":1245696907718078500,"text":"...It wouldn’t matter if you got ten times what was needed, it would never be good enough. Unlike other states, New York unfortunately got off to a late start. You should have pushed harder. Stop complaining &amp; find out where all of these supplies are going. Cuomo working hard!","rating":5},{"id":988056354567917600,"text":"“I can die happy now with Trump Job performance,” stated Mary Matalin. “A great overall President, stunning!” Thank you Mary.","rating":4},{"id":870234811616677900,"text":"The big story is the \"\"unmasking and surveillance\"\" of people that took place during the Obama Administration.","rating":4},{"id":1167037101038342100,"text":"Crazy Lawrence O’Donnell, who has been calling me wrong from even before I announced my run for the Presidency, even being previously forced by NBC to apologize, which he did while crying, for things he said about me &amp, The Apprentice, was again forced to apologize, this time.....","rating":9},{"id":1264912071898128400,"text":"....3 months and, if I waited 3 years, they would do their usual “hit” pieces anyway. They are sick with hatred and dishonesty. They are truly deranged! They don’t mention Sleepy Joe’s poor work ethic,  or all of the time Obama spent on the golf course, often flying to....","rating":8},{"id":1121012339552194600,"text":"A very big Caravan of over 20,000 people started up through Mexico. It has been reduced in size by Mexico but is still coming. Mexico must apprehend the remainder or we will be forced to close that section of the Border &amp, call up the Military. The Coyotes &amp, Cartels have weapons!","rating":9},{"id":1178477534347960300,"text":"“Nancy Pelosi and the Democrats can’t put down the Impeachment match. They know they couldn’t beat him in 2016 against Hillary Clinton, and they’re increasingly aware of the fact that they won’t win against him in 2020, and Impeachment is the only tool they have to get....","rating":7},{"id":1034445783876161500,"text":"I smile at Senators and others talking about how good free trade is for the U.S. What they don’t say is that we lose Jobs and over 800 Billion Dollars a year on really dumb Trade Deals....and these same countries Tariff us to death. These lawmakers are just fine with this!","rating":6},{"id":904176553621307400,"text":"Just got back to the White House from the Great States of Texas and Louisiana, where things are going well. Such cooperation &amp, coordination!","rating":4},{"id":951790999784783900,"text":"....Because of the Democrats not being interested in life and safety, DACA has now taken a big step backwards. The Dems will threaten “shutdown,” but what they are really doing is shutting down our military, at a time we need it most. Get smart, MAKE AMERICA GREAT AGAIN!","rating":8},{"id":1197573996960727000,"text":"Iran has become so unstable that the regime has shut down their entire Internet System so that the Great Iranian people cannot talk about the tremendous violence taking place within the country....","rating":5},{"id":1019520574371123200,"text":"So many people at the higher ends of intelligence loved my press conference performance in Helsinki. Putin and I discussed many important subjects at our earlier meeting. We got along well which truly bothered many haters who wanted to see a boxing match. Big results will come!","rating":9},{"id":1011584315040419800,"text":"A Harley-Davidson should never be built in another country-never! Their employees and customers are already very angry at them. If they move, watch, it will be the beginning of the end - they surrendered, they quit! The Aura will be gone and they will be taxed like never before!","rating":7},{"id":1295452178010615800,"text":"Great division between the Bernie Sanders crowd and the other Radical Lefties. Our Country would be destroyed!","rating":6},{"id":1307091601790046200,"text":"...Biden is a corrupt globalist sellout who never missed a chance to stab American workers in the back. If Biden wins, China wins – it’s just that simple!","rating":9},{"id":1313236039725650000,"text":"“You see it in enthusiasm for the President outside Walter Reed Hospital. You see it in Registrations, from Florida to Pennsylvania &amp; West Virginia, where Republicans are outstripping Democrats by 2 to 1. If the President bounces back onto the campaign trail, he will be an....","rating":4},{"id":964946611502747600,"text":"Deputy A.G. Rod Rosenstein stated at the News Conference: “There is no allegation in the indictment that any American was a knowing participant in this illegal activity. There is no allegation in the indictment that the charged conduct altered the outcome of the 2016 election.","rating":2},{"id":899945866991206400,"text":"Was with great people last night in Fort Myer, Virginia. The future of our country is strong!","rating":1},{"id":1096982979107278800,"text":"....The U.S. does not want to watch as these ISIS fighters permeate Europe, which is where they are expected to go. We do so much, and spend so much - Time for others to step up and do the job that they are so capable of doing. We are pulling back after 100% Caliphate victory!","rating":5},{"id":880602793341591600,"text":"Just finished a very good meeting with the President of South Korea. Many subjects discussed including North Korea and new trade deal!","rating":2},{"id":1170469621348098000,"text":"....only made it worse! If they cannot agree to a ceasefire during these very important peace talks, and would even kill 12 innocent people, then they probably don’t have the power to negotiate a meaningful agreement anyway. How many more decades are they willing to fight?","rating":3},{"id":1138040393033896000,"text":"When will the Failing New York Times admit that their front page story on the  the new Mexico deal at the Border is a FRAUD and nothing more than a badly reported “hit job” on me, something that has been going on since the first day I announced for the presidency! Sick Journalism","rating":8},{"id":1142506683660456000,"text":"....Sanctions come off Iran, and they become a productive and prosperous nation again - The sooner the better!","rating":3},{"id":1183709210602823700,"text":"The same people who got us into the Middle East mess are the people who most want to stay there!","rating":4},{"id":1019899507910283300,"text":"The Fake News Media wants so badly to see a major confrontation with Russia, even a confrontation that could lead to war. They are pushing so recklessly hard and hate the fact that I’ll probably have a good relationship with Putin. We are doing MUCH better than any other country!","rating":8},{"id":982969547283161100,"text":"If President Obama had crossed his stated Red Line In The Sand, the Syrian disaster would have ended long ago! Animal Assad would have been history!","rating":7},{"id":1130183995587813400,"text":"Watched some of the Fake News Political Shows this morning and continue to be amazed at how every question is asked in the most negative way. The Mainstream Media should be ashamed of itself - But the good news is that the USA is wise to your game of dishonesty and deception!","rating":9},{"id":972542173030879200,"text":"North Korea has not conducted a Missile Test since November 28, 2017 and has promised not to do so through our meetings. I believe they will honor that commitment!","rating":5},{"id":1188058730685972500,"text":"The Ukraine investigation is just as Corrupt and Fake as all of the other garbage that went on before it. Even Shifty Schiff got caught cheating when he made up what I said on the call!","rating":8},{"id":1100002139282309100,"text":"Oil prices getting too high. OPEC, please relax and take it easy. World cannot take a price hike - fragile!","rating":6},{"id":1102658425505366000,"text":"The military drills, or war games as I call them, were never even discussed in my mtg w/ Kim Jong Un of NK—FAKE NEWS! I made that decision long ago because it costs the U.S. far too much money to have those “games”, especially since we are not reimbursed for the tremendous cost!","rating":7},{"id":913589799411490800,"text":"GDP was revised upward to 3.1 for last quarter. Many people thought it would be years before that happened. We have just begun!","rating":4},{"id":891397134662193200,"text":"Unless the Republican Senators are total quitters, Repeal &amp, Replace is not dead! Demand another vote before voting on any other bill!","rating":6},{"id":1080997061821120500,"text":"....President Trump deserves a lot of credit, but again, you have the anti-Trump people who are not going to give him a lot of credit.”","rating":5},{"id":1010116816998490100,"text":"Republicans should stop wasting their time on Immigration until after we elect more Senators and Congressmen/women in November. Dems are just playing games, have no intention of doing anything to solves this decades old problem. We can pass great legislation after the Red Wave!","rating":6},{"id":1074403110523678700,"text":"....a persecution of the President.”  Daniel Henninger, The Wall Street Journal. Thank you, people are starting to see and understand what this Witch Hunt is all about. Jeff Sessions should be ashamed of himself for allowing this total HOAX to get started in the first place!","rating":8},{"id":1161719408202584000,"text":"We are winning, big time, against China. Companies &amp, jobs are fleeing. Prices to us have not gone up, and in some cases, have come down. China is not our problem, though Hong Kong is not helping. Our problem is with the Fed. Raised too much &amp, too fast. Now too slow to cut....","rating":7},{"id":1181172457811697700,"text":"The United States was supposed to be in Syria for 30 days, that was many years ago. We stayed and got deeper and deeper into battle with no aim in sight. When I arrived in Washington, ISIS was running rampant in the area. We quickly defeated 100% of the ISIS Caliphate,.....","rating":6},{"id":1055881545628704800,"text":"I want to applaud the FBI, Secret Service, Department of Justice, the U.S. Attorneys’ Office for the Southern District of New York, the NYPD, and all Law Enforcement partners across the Country for their incredible work, skill and determination!","rating":4},{"id":1147955464472338400,"text":"....brought up, not them) because the Dems won’t change the Loopholes and Asylum. Big Media Con Job!","rating":5},{"id":1298307828789194800,"text":"...They must stop calling these anarchists and agitators “peaceful protestors”. Come back into the real world! The Federal Government is ready to end this problem immediately upon your request.","rating":7},{"id":886541955311816700,"text":"Thank you to former campaign adviser Michael Caputo for saying so powerfully that there was no Russian collusion in our winning campaign.","rating":5},{"id":944308373373308900,"text":"The United Nations Security Council just voted 15-0 in favor of additional Sanctions on North Korea. The World wants Peace, not Death!","rating":4},{"id":1051317348496490500,"text":"Big day! Pastor Andrew Brunson, who could have spent 35 years in a Turkish prison, was returned safely home to his family today. Met in Oval Office, great people! Then off to Kentucky for a Rally for Congressman Andy Barr. Tremendous crowd &amp, spirit! Just returned to White House.","rating":5},{"id":999246677549768700,"text":"SPYGATE could be one of the biggest political scandals in history!","rating":8},{"id":1039150829754888200,"text":"The Economy is soooo good, perhaps the best in our country’s history (remember, it’s the economy stupid!), that the Democrats are flailing &amp, lying like CRAZY! Phony books, articles and T.V. “hits” like no other pol has had to endure-and they are losing big. Very dishonest people!","rating":7},{"id":993452275648680000,"text":"The Russia Witch Hunt is rapidly losing credibility. House Intelligence Committee found No Collusion, Coordination or anything else with Russia. So now the Probe says OK, what else is there? How about Obstruction for a made up, phony crime.There is no O, it’s called Fighting Back","rating":6},{"id":1140944847039324200,"text":"The Fake News doesn’t report it, but Republican enthusiasm is at an all time   high. Look what is going on in Orlando, Florida, right now! People have never seen anything like it (unless you play a guitar). Going to be wild - See you later!","rating":7},{"id":1114673163076395000,"text":"....it’s powerful common sense Immigration Laws to stop illegals from coming through Mexico into the U.S., and removing them back to their country of origin. Until Mexico cleans up this ridiculous &amp, massive migration, we will be focusing on Border Security, not Ports of Entry....","rating":5},{"id":1077246407554281500,"text":"I never “lashed out” at the Acting Attorney General of the U.S., a man for whom I have great respect. This is a made up story, one of many, by the Fake News Media!","rating":4},{"id":1102237752744120300,"text":"After more than two years of Presidential Harassment, the only things that have been proven is that Democrats and other broke the law. The hostile Cohen testimony, given by a liar to reduce his prison time, proved no Collusion! His just written book manuscript showed what he.....","rating":6},{"id":1060256623439110100,"text":"....We thank Attorney General Jeff Sessions for his service, and wish him well! A permanent replacement will be nominated at a later date.","rating":3},{"id":1060058718937800700,"text":"....unbelievably lucky to have him and I’m just awed at how well they’ve done. It’s all the Trump magic - Trump is the magic man. Incredible, he’s got the entire media against him, attacking him every day, and he pulls out these enormous wins.” Ben Stein, “The Capitalist Code”","rating":5},{"id":1178074545443479600,"text":"The Whistleblower’s complaint is completely different and at odds from my actual conversation with the new President of Ukraine. The so-called “Whistleblower” knew practically NOTHING in that those ridiculous charges were far more dramatic &amp, wrong, just like Liddle’ Adam Schiff..","rating":7},{"id":982680387116781600,"text":"The United States hasn’t had a Trade Surplus with China in 40 years. They must end unfair trade, take down barriers and charge only Reciprocal Tariffs. The U.S. is losing $500 Billion a year, and has been losing Billions of Dollars for decades. Cannot continue!","rating":6},{"id":1234694301734580200,"text":"The Democrats in the House should propose a very simple one year Payroll Tax cut. Great for the middle class, great for the USA!","rating":5},{"id":1030456820417081300,"text":"Wow! Big pushback on Governor Andrew Cuomo of New York for his really dumb statement about America’s lack of greatness. I have already MADE America Great Again, just look at the markets, jobs, military- setting records, and we will do even better. Andrew “choked” badly, mistake!","rating":8},{"id":1112689440303009800,"text":"Democrats, working with Republicans in Congress, can fix the Asylum and other loopholes quickly. We have a major National Emergency at our Border. GET IT DONE NOW!","rating":4},{"id":1173354644636127200,"text":"Based on the attack on Saudi Arabia, which may have an impact on oil prices, I have authorized the release of oil from the Strategic Petroleum Reserve, if needed, in a to-be-determined amount....","rating":3},{"id":1169412197841350700,"text":"“Absolutely nothing is more important than going back &amp, getting to the bottom of the origins of the investigation. We had an administration using America’s Spying Apparatus to spy on a political opponent at the height of a presidential election. Those are all known, undisputed...","rating":7},{"id":1163155586797723600,"text":"We are doing very well with China, and talking!","rating":2},{"id":1107673256268623900,"text":"GDP growth during the four quarters of 2018 was the fastest since 2005. This Administration is the first on record to have experienced economic growth that meets or exceeds its own forecasts in each of its first two years in office. GROWTH is beating MARKET EXPECTATIONS!","rating":3},{"id":1060162807960870900,"text":"In all fairness, Nancy Pelosi deserves to be chosen Speaker of the House by the Democrats. If they give her a hard time, perhaps we will add some Republican votes. She has earned this great honor!","rating":5},{"id":1234524212993372200,"text":"The only people in favor of Mini Mike continuing with his hapless campaign are me and his political consultants, who are getting richer and richer by the day!","rating":9},{"id":1253700113383534600,"text":"Great conversation with President Lenin Moreno of the Republic of Ecuador. We will be sending them desperately needed Ventilators, of which we have recently manufactured many, and helping them in other ways. They are fighting hard against CoronaVirus!","rating":2},{"id":1206581028283965400,"text":"I look very much forward to debating whoever the lucky person is who stumbles across the finish line in the little watched Do Nothing Democrat Debates. My record is so good on the Economy and all else, including debating, that perhaps I would consider more than 3 debates.....","rating":6},{"id":1204414588650807300,"text":"Nadler just said that I “pressured Ukraine to interfere in our 2020 Election.” Ridiculous, and he knows that is not true. Both the President &amp, Foreign Minister of Ukraine said, many times, that there “WAS NO PRESSURE.” Nadler and the Dems know this, but refuse to acknowledge!","rating":4},{"id":1106144173458161700,"text":"A big National Emergency vote today by The United States Senate on Border Security &amp, the Wall (which is already under major construction). I am prepared to veto, if necessary. The Southern Border is a National Security and Humanitarian Nightmare, but it can be easily fixed!","rating":5},{"id":1170469618177237000,"text":"Unbeknownst to almost everyone, the major Taliban leaders and, separately, the President of Afghanistan, were going to secretly meet with me at Camp David on Sunday. They were coming to the United States tonight. Unfortunately, in order to build false leverage, they admitted to..","rating":8},{"id":1002141448232493000,"text":"RUSH LIMBAUGH  “If the FBI was so concerned, and if they weren’t targeting Trump, they should have told Trump. If they were really concerned about the Russians infiltrating a campaign (hoax), then why not try to stop it? Why not tell Trump? Because they were pushing this scam.”","rating":7},{"id":405778664039534600,"text":"Happy Thanksgiving to all--even the haters and losers!","rating":10},{"id":1157352001593892900,"text":"....John has therefore decided to stay in Congress where he has done such an outstanding job representing the people of Texas, and our Country. I will be announcing my nomination for DNI shortly.","rating":3},{"id":1052522197347119100,"text":"“Trump could be the most honest president in modern history. When you look at the real barometer of presidential truthfulness, which is promise keeping, he is probably the most honest president in American history. He’s done exactly what he said he would do.” Marc Thiessen, WPost","rating":9},{"id":937653535486959600,"text":"With the great vote on Cutting Taxes, this could be a big day for the Stock Market - and YOU!","rating":3},{"id":1275438930276409300,"text":"....Dr. Anthony Fauci, who is with us in all ways, a very high 72% Approval Rating. So, if he is in charge along with V.P. etc., and with us doing all of these really good things, why doesn’t the Lamestream Media treat us as they should? Answer: Because they are Fake News!","rating":7},{"id":1006637373629722600,"text":"Heading back home from Singapore after a truly amazing visit. Great progress was made on the denuclearization of North Korea. Hostages are back home, will be getting the remains of our great heroes back to their families, no missiles shot, no research happening, sites closing...","rating":4},{"id":879317636164841500,"text":"The reason that President Obama did NOTHING about Russia after being notified by the CIA of meddling is that he expected Clinton would win..","rating":6},{"id":760552601356267500,"text":"President Obama will go down as perhaps the worst president in the history of the United States!","rating":8},{"id":844536536930619400,"text":"Big day for healthcare. Working hard!","rating":3},{"id":1115053022974029800,"text":"More apprehensions (captures)at the Southern Border than in many years. Border Patrol amazing! Country is FULL! System has been broken for many years. Democrats in Congress must agree to fix loopholes - No Open Borders (Crimes &amp, Drugs). Will Close Southern Border If necessary...","rating":5},{"id":1061383163811893200,"text":"These California fires are expanding very, very quickly (in some cases 80-100 acres a minute). If people don’t evacuate quickly, they risk being overtaken by the fire. Please listen to evacuation orders from State and local officials!","rating":2},{"id":1068116413498429400,"text":"When will this illegal Joseph McCarthy style Witch Hunt, one that has shattered so many innocent lives, ever end-or will it just go on forever? After wasting more than $40,000,000 (is that possible?), it has proven only one thing-there was NO Collusion with Russia. So Ridiculous!","rating":8},{"id":851584729400979500,"text":"Happy Passover to everyone celebrating in the United States of America, Israel, and around the world. #ChagSameach","rating":1},{"id":1309455713882828800,"text":"RINO Governor Charlie Baker of Massachusetts is unsuccessfully trying to defend Mail In Ballots, when there is fraud being found all over the place. Just look at some of the recent races, or the Trump Ballots in Pennsylvania that were thrown into the garbage. Wrong Charlie!","rating":6},{"id":968856971075051500,"text":"Why is A.G. Jeff Sessions asking the Inspector General to investigate potentially massive FISA abuse. Will take forever, has no prosecutorial power and already late with reports on Comey etc. Isn’t the I.G. an Obama guy? Why not use Justice Department lawyers? DISGRACEFUL!","rating":7},{"id":1004092260475162600,"text":"Imagine how much wasteful spending we’d save if we didn’t have Chuck and Nancy standing in our way! For years, Democrats in Congress have depleted our military and busted our budgets on needless spending, and to what end? No more.","rating":5},{"id":997474432443707400,"text":"Reports are there was indeed at least one FBI representative implanted, for political purposes, into my campaign for president. It took place very early on, and long before the phony Russia Hoax became a “hot” Fake News story. If true - all time biggest political scandal!","rating":8},{"id":988405962624118800,"text":"Hard to believe Obstructionists May vote against Mike Pompeo for Secretary of State. The Dems will not approve hundreds of good people, including the Ambassador to Germany. They are maxing out the time on approval process for all, never happened before. Need more Republicans!","rating":6},{"id":1183822488192671700,"text":"After defeating 100% of the ISIS Caliphate, I largely moved our troops out of Syria. Let Syria and Assad protect the Kurds and fight Turkey for their own land. I said to my Generals, why should we be fighting for Syria....","rating":6},{"id":931140567089721300,"text":"China is sending an Envoy and Delegation to North Korea - A big move, we'll see what happens!","rating":4},{"id":1000375761604370400,"text":"Put pressure on the Democrats to end the horrible law that separates children from there parents once they cross the Border into the U.S. Catch and Release, Lottery and Chain must also go with it and we MUST continue building the WALL! DEMOCRATS ARE PROTECTING MS-13 THUGS.","rating":9},{"id":982268230306709500,"text":"Do you believe that the Fake News Media is pushing hard on a story that I am going to replace A.G. Jeff Sessions with EPA Chief Scott Pruitt, who is doing a great job but is TOTALLY under siege? Do people really believe this stuff? So much of the media is dishonest and corrupt!","rating":7},{"id":1008511869970255900,"text":"The Democrats should get together with their Republican counterparts and work something out on Border Security &amp, Safety. Don’t wait until after the election because you are going to lose!","rating":5},{"id":1140849141796474900,"text":"Only a few people showed up for the so-called Impeachment rallies over the weekend. The numbers were anemic, no spirit, no hope. More importantly, No Collusion, No Obstruction!","rating":6},{"id":1083356326833602600,"text":"There is GREAT unity with the Republicans in the House and Senate, despite the Fake News Media working in overdrive to make the story look otherwise. The Opposition Party &amp, the Dems know we must have Strong Border Security, but don’t want to give “Trump” another one of many wins!","rating":5},{"id":980766121983987700,"text":"DACA is dead because the Democrats didn’t care or act, and now everyone wants to get onto the DACA bandwagon... No longer works. Must build Wall and secure our borders with proper Border legislation. Democrats want No Borders, hence drugs and crime!","rating":7},{"id":1000174070061813800,"text":"We are having very productive talks with North Korea about reinstating the Summit which, if it does happen, will likely remain in Singapore on the same date, June 12th., and, if necessary, will be extended beyond that date.","rating":3},{"id":921207772233990100,"text":"The Fake News is going crazy with wacky Congresswoman Wilson(D), who was SECRETLY on a very personal call, and gave a total lie on content!","rating":8},{"id":1230558752966762500,"text":"“The real winner last night was Donald Trump.” Mini Mike Bloomberg. I agree!","rating":6},{"id":1122879760085004300,"text":"Bob Mueller was a great HERO to the Radical Left Democrats. Now that the Mueller Report is finished, with a finding of NO COLLUSION &amp, NO OBSTRUCTION (based on a review of Report by our highly respected A.G.), the Dems are going around saying, “Bob who, sorry, don’t know the man.”","rating":6},{"id":953987636057821200,"text":"A government shutdown will be devastating to our military...something the Dems care very little about!","rating":4},{"id":893083735633129500,"text":"Our relationship with Russia is at an all-time &amp, very dangerous  low. You can thank Congress, the same people that can't even give us HCare!","rating":5},{"id":1061334384337399800,"text":"Had very productive meetings and calls for our Country today. Meeting tonight with World Leaders!","rating":2},{"id":841970726341075000,"text":"Will be going to Detroit, Michigan (love), today for a big meeting on bringing back car production to State &amp, U.S. Already happening!","rating":4},{"id":965205208191168500,"text":"Now that Adam Schiff is starting to blame President Obama for Russian meddling in the election, he is probably doing so as yet another excuse that the Democrats, lead by their fearless leader, Crooked Hillary Clinton, lost the 2016 election. But wasn’t I a great candidate?","rating":8},{"id":1206812317809143800,"text":"Congressman Jeff Van Drew is very popular in our great and very united Republican Party. It was a tribute to him that he was able to win his heavily Republican district as a Democrat. People like that are not easily replaceable!","rating":5},{"id":1153810108654035000,"text":"Just got back only to hear of a last minute change allowing a Never Trumper attorney to help Robert Mueller with his testimony before Congress tomorrow. What a disgrace to our system. Never heard of this before. VERY UNFAIR, SHOULD NOT BE ALLOWED. A rigged Witch Hunt!","rating":9},{"id":1189879743895810000,"text":"“Now is the time for Republicans to stand together and defend the leader of their party against these smears. It would be one thing if there were any indication of an underlying crime, but there is not-not in the transcripts, and not in the secret witness testimony that.....","rating":4},{"id":1190375828099674000,"text":"I love New York, but New York can never be great again under the current leadership of Governor Andrew Cuomo (the brother of Fredo), or Mayor Bill DeBlasio. Cuomo has weaponized the prosecutors to do his dirty work (and to keep him out of jams), a reason some don’t want to be...","rating":7},{"id":893452922427715600,"text":"Excellent Jobs Numbers just released - and I have only just begun. Many job stifling regulations continue to fall. Movement back to USA!","rating":3},{"id":1137354486698192900,"text":"Nervous Nancy Pelosi &amp, the Democrat House are getting nothing done. Perhaps they could lead the way with the USMCA, the spectacular &amp, very popular new Trade Deal that replaces NAFTA, the worst Trade Deal in the history of the U.S.A. Great for our Farmers, Manufacturers &amp, Unions!","rating":6},{"id":1014286054805987300,"text":"After having written many best selling books, and somewhat priding myself on my ability to write, it should be noted that the Fake News constantly likes to pore over my tweets looking for a mistake. I capitalize certain words only for emphasis, not b/c they should be capitalized!","rating":6},{"id":1023549416446279700,"text":"The biggest and best results coming out of the good GDP report was that the quarterly Trade Deficit has been reduced by $52 Billion and, of course, the historically low unemployment numbers, especially for African Americans, Hispanics, Asians and Women.","rating":4},{"id":1293586660790239200,"text":"Congratulations to Andrew Clyde on a big win last night against a strong opponent in #GA09! An early supporter of ours, Andrew will be an incredible Congressman for the people of Georgia!","rating":3},{"id":998250447394820100,"text":"The Witch Hunt finds no Collusion with Russia - so now they’re looking at the rest of the World. Oh’ great!","rating":8},{"id":1024649463435067400,"text":"Paul Manafort worked for Ronald Reagan, Bob Dole and many other highly prominent and respected political leaders. He worked for me for a very short time. Why didn’t government tell me that he was under investigation. These old charges have nothing to do with Collusion - a Hoax!","rating":7},{"id":1264734501961433000,"text":"...vacationing, relaxing &amp; making shady deals with other countries, &amp; that Barack was always playing golf, doing much of his traveling in a fume spewing 747 to play golf in Hawaii - Once even teeing off immediately after announcing the gruesome death of a great young man by ISIS!","rating":9},{"id":1000718611688943600,"text":"Who’s going to give back the young and beautiful lives (and others) that have been devastated and destroyed by the phony Russia Collusion Witch Hunt? They journeyed down to Washington, D.C., with stars in their eyes and wanting to help our nation...They went back home in tatters!","rating":8},{"id":905381817695526900,"text":"Will be going to North Dakota today to discuss tax reform and tax cuts. We are the highest taxed nation in the world - that will change.","rating":4},{"id":1003738642903420900,"text":"The Fake News Media is desperate to distract from the economy and record setting economic numbers and so they keep talking about the phony Russian Witch Hunt.","rating":6},{"id":1134223799300153300,"text":"The Navy put out a disclaimer on the McCain story. Looks like the story was an exaggeration, or even Fake News - but why not, everything else is!","rating":6},{"id":1065346909362143200,"text":"Sorry Chief Justice John Roberts, but you do indeed have “Obama judges,” and they have a much different point of view than the people who are charged with the safety of our country. It would be great if the 9th Circuit was indeed an “independent judiciary,” but if it is why......","rating":5},{"id":1164228810310426600,"text":"....Because of me, these countries have agreed to pay ONE HUNDRED BILLION DOLLARS more - but still way short of what they should pay for the incredible military protection provided. Sorry!","rating":7},{"id":1076881816462737400,"text":"I am pleased to announce that our very talented Deputy Secretary of Defense, Patrick Shanahan, will assume the title of Acting Secretary of Defense starting January 1, 2019. Patrick has a long list of accomplishments while serving as Deputy, &amp, previously Boeing. He will be great!","rating":3},{"id":980764358530789400,"text":"...Congress must immediately pass Border Legislation, use Nuclear Option if necessary, to stop the massive inflow of Drugs and People. Border Patrol Agents (and ICE) are GREAT, but the weak Dem laws don’t allow them to do their job. Act now Congress, our country is being stolen!","rating":8},{"id":926249604936556500,"text":"....This is real collusion and dishonesty. Major violation of Campaign Finance Laws and Money Laundering - where is our Justice Department?","rating":6},{"id":1257736426206032000,"text":"Most of the money raised by the RINO losers of the so-called “Lincoln Project”, goes into their own pockets. With what I’ve done on Judges, Taxes, Regulations, Healthcare, the Military, Vets (Choice!) &amp; protecting our great 2A, they should love Trump. Problem is, I BEAT THEM ALL!","rating":7},{"id":1128257892514246700,"text":"....of the tremendous ground we have lost to China on Trade since the ridiculous one sided formation of the WTO. It will all happen, and much faster than people think!","rating":5},{"id":884211874518192100,"text":"The fact that President Putin and I discussed a Cyber Security unit  doesn't mean I think it can happen. It can't-but a ceasefire can,&amp, did!","rating":6},{"id":914099295963553800,"text":"The Fake News Networks are working overtime in Puerto Rico doing their best to take the spirit away from our soldiers and first R's. Shame!","rating":7},{"id":880017678978736100,"text":"Some of the Fake News Media likes to say that I am not totally engaged in healthcare. Wrong, I know the subject well &amp, want victory for U.S.","rating":5},{"id":1300170579048358000,"text":"..The people of Portland, like all other cities &amp;  parts of our great Country, want Law &amp; Order. The Radical Left Democrat Mayors, like the dummy running Portland, or the guy right now in his basement unwilling to lead or even speak out against crime, will never be able to do it!","rating":8},{"id":1234483443712561200,"text":"Jack Welch, former Chairman and CEO of GE, a business legend, has died. There was no corporate leader like “neutron” Jack. He was my friend and supporter. We made wonderful deals together. He will never be forgotten. My warmest sympathies to his wonderful wife &amp; family!","rating":4},{"id":964110212885106700,"text":"So many signs that the Florida shooter was mentally disturbed, even expelled from school for bad and erratic behavior. Neighbors and classmates knew he was a big problem. Must always report such instances to authorities, again and again!","rating":6},{"id":1187373187820130300,"text":"The Federal Reserve is derelict in its duties if it doesn’t lower the Rate and even, ideally, stimulate. Take a look around the World at our competitors. Germany and others are  actually GETTING PAID to borrow money. Fed was way too fast to raise, and way too slow to cut!","rating":4},{"id":1295699653753745400,"text":"Many thousands of people work for our government. With that said, a former DISGRUNTLED EMPLOYEE named Miles Taylor, who I do not know (never heard of him), said he left &amp; is on the open arms Fake News circuit. Said to be a real “stiff”. They will take anyone against us!","rating":6},{"id":1071939400517500900,"text":"I am in the process of interviewing some really great people for the position of White House Chief of Staff. Fake News has been saying with certainty it was Nick Ayers, a spectacular person who will always be with our #MAGA agenda. I will be making a decision soon!","rating":3},{"id":933837062293291000,"text":"ObamaCare premiums are going up, up, up, just as I have been predicting for two years. ObamaCare is OWNED by the Democrats, and it is a disaster. But do not worry. Even though the Dems want to Obstruct, we will Repeal &amp, Replace right after Tax Cuts!","rating":5},{"id":1010110544605581300,"text":"Our great Judge Jeanine Pirro is out with a new book, “Liars, Leakers and Liberals, the Case Against the Anti-Trump Conspiracy,” which is fantastic. Go get it!","rating":2},{"id":1145097779632627700,"text":"....again with China as our relationship with them continues to be a very good one. The quality of the transaction is far more important to me than speed. I am in no hurry, but things look very good! There will be no reduction in the Tariffs currently being charged to China.","rating":4},{"id":912624892239077400,"text":"Ratings for NFL football are way down except before game starts, when people tune in to see whether or not our country will be disrespected!","rating":7},{"id":1113044765405315100,"text":"....The best thing that ever happened to Puerto Rico is President Donald J. Trump. So many wonderful people, but with such bad Island leadership and with so much money wasted. Cannot continue to hurt our Farmers and States with these massive payments, and so little appreciation!","rating":8},{"id":872427222392504300,"text":"Getting ready to leave for Cincinnati, in the GREAT STATE of OHIO, to meet with ObamaCare victims and talk Healthcare &amp, also Infrastructure!","rating":3},{"id":1022074252999225300,"text":"Every time I see a weak politician asking to stop Trade talks or the use of Tariffs to counter unfair Tariffs, I wonder, what can they be thinking? Are we just going to continue and let our farmers and country get ripped off?  Lost $817 Billion on Trade last year. No weakness!","rating":5}]