[{"id":894512983384129500,"text":"The Trump base is far bigger &amp,  stronger than ever before (despite some phony Fake News polling). Look at rallies in Penn, Iowa, Ohio.......","rating":7},{"id":1170897584510124000,"text":"When all of the people pushing so hard for Criminal Justice Reform were  unable to come even close to getting it done, they came to me as a group and asked for my help. I got it done with a group of Senators &amp, others who would never have gone for it. Obama couldn’t come close....","rating":5},{"id":1066790517944606700,"text":"Europe has to pay their fair share for Military Protection. The European Union, for many years, has taken advantage of us on Trade, and then they don’t live up to their Military commitment through NATO. Things must change fast!","rating":6},{"id":991084673697812500,"text":"During Small Business Week, we celebrate the great, hard-working entrepreneurs across our country who have started and operate a small business!","rating":3},{"id":1035148684432953300,"text":"Wow, Nellie Ohr, Bruce Ohr’s wife, is a Russia expert who is fluent in Russian. She worked for Fusion GPS where she was paid a lot. Collusion! Bruce was a boss at the Department of Justice and is, unbelievably, still there!","rating":8},{"id":1155967243835940900,"text":"Senator Cindy Hyde-Smith is doing a GREAT JOB for the people of Mississippi and fully supports our #MAGA Agenda. Cindy is tough on Crime, Strong on the Border and Illegal Immigration....","rating":4},{"id":980958298445885400,"text":"As ridiculous as it sounds, the laws of our country do not easily allow us to send those crossing our Southern Border back where they came from. A whole big wasted procedure must take place. Mexico &amp, Canada have tough immigration laws, whereas ours are an Obama joke. ACT CONGRESS","rating":7},{"id":961962694650757100,"text":"Costs on non-military lines will never come down if we do not elect more Republicans in the 2018 Election, and beyond. This Bill is a BIG VICTORY for our Military, but much waste in order to get Dem votes. Fortunately, DACA not included in this Bill, negotiations to start now!","rating":5},{"id":1268688014630322200,"text":"...Unrelated, I gave Alaska ANWR, major highways, and more. Get any candidate ready, good or bad, I don’t care, I’m endorsing. If you have a pulse, I’m with you!","rating":9},{"id":1117213859696267300,"text":"I never offered Pardons to Homeland Security Officials, never ordered anyone to close our Southern Border (although I have the absolute right to do so, and may if Mexico does not apprehend the illegals coming to our Border), and am not “frustrated.” It is all Fake &amp, Corrupt News!","rating":6},{"id":1081528502602612700,"text":"Great support coming from all sides for Border Security (including Wall) on our very dangerous Southern Border. Teams negotiating this weekend! Washington Post and NBC reporting of events, including Fake sources, has been very inaccurate (to put it mildly)!","rating":6},{"id":1024096373917016000,"text":"A highly respected Federal judge today stated that the “Trump Administration gets great credit” for reuniting illegal families. Thank you, and please look at the previous administrations record - not good!","rating":5},{"id":1041751173034848300,"text":"Americans deserve to know the lowest drug price at their pharmacy, but “gag clauses” prevent your pharmacist from telling you! I support legislation that will remove gag clauses and urge the Senate to act. #AmericanPatientsFirst","rating":3},{"id":1156933712761753600,"text":"China, Iran &amp, other foreign countries are looking at the Democrat Candidates and “drooling” over the small prospect that they could be dealing with them in the not too distant future. They would be able to rip off our beloved USA like never before. With President Trump, NO WAY!","rating":8},{"id":980065419632566300,"text":"...does not include the Fake Washington Post, which is used as a “lobbyist” and should so  REGISTER. If the P.O. “increased its parcel rates, Amazon’s shipping costs would rise by $2.6 Billion.” This Post Office scam must stop. Amazon must pay real costs (and taxes) now!","rating":7},{"id":1068887935838228500,"text":"I was very much looking forward to having a press conference just prior to leaving Argentina because we have had such great success in our dealing with various countries and their leaders at the G20....","rating":4},{"id":799969130237542400,"text":"I settled the Trump University lawsuit for a small fraction of the potential award because as President I have to focus on our country.","rating":6},{"id":1105686760653234200,"text":"So many records being set with respect to our Economy. Unemployment numbers among BEST EVER. A beautiful thing to watch!","rating":4},{"id":922440008971292700,"text":"I had a very respectful conversation with the widow of Sgt. La David Johnson, and spoke his name from beginning, without hesitation!","rating":5},{"id":1155580142225383400,"text":"....be leaving office on August 15th. I would like to thank Dan for his great service to our Country. The Acting Director will be named shortly.","rating":3},{"id":1106153554518130700,"text":"My Administration looks forward to negotiating a large scale Trade Deal with the United Kingdom. The potential is unlimited!","rating":4},{"id":1127342552745762800,"text":"I was NOT going to fire Bob Mueller, and did not fire Bob Mueller. In fact, he was allowed to finish his Report with unprecedented help from the Trump Administration. Actually, lawyer Don McGahn had a much better chance of being fired than Mueller. Never a big fan!","rating":6},{"id":922951009277825000,"text":"So nice being with Republican Senators today. Multiple standing ovations! Most are great people who want big Tax Cuts and success for U.S.","rating":4},{"id":1079830268708556800,"text":"....Senator Schumer, more than a year longer than any other Administration in history. These are people who have been approved by committees and all others, yet Schumer continues to hold them back from serving their Country! Very Unfair!","rating":3},{"id":926580912036466700,"text":"Getting ready to land in Hawaii. Looking so much forward to meeting with our great Military/Veterans at Pearl Harbor!","rating":2},{"id":1146900759906279400,"text":"Weather looking good, clearing rapidly and temperatures going down fast. See you in 45 minutes, 6:30 to 7:00 P.M. at Lincoln Memorial!","rating":2},{"id":1079724622868820000,"text":"If anybody but Donald Trump did what I did in Syria, which was an ISIS loaded mess when I became President, they would be a national hero. ISIS is mostly gone, we’re slowly sending our troops back home to be with their families, while at the same time fighting ISIS remnants......","rating":5},{"id":972563247160275000,"text":"In the first hours after hearing that North Korea’s leader wanted to meet with me to talk denuclearization and that missile launches will end, the press was startled &amp, amazed.They couldn’t believe it. But by the following morning the news became FAKE.They said so what, who cares!","rating":7},{"id":1147955463201480700,"text":"....United States Citizens first. Border Patrol, and others in Law Enforcement, have been doing a great job. We said there was a Crisis - the Fake News &amp, the Dems said it was “manufactured.” Now all agree we were right, but they always knew that. They are crowded (which we.....","rating":5},{"id":1070306739092889600,"text":"Very strong signals being sent by China once they returned home from their long trip, including stops, from Argentina. Not to sound naive or anything, but I believe President Xi meant every word of what he said at our long and hopefully historic meeting. ALL subjects discussed!","rating":3},{"id":829384587482656800,"text":"Big increase in traffic into our country from certain areas, while our people are far more vulnerable, as we wait for what should be EASY D!","rating":6},{"id":1028347518822826000,"text":"The big story that the Fake News Media refuses to report is lowlife Christopher Steele’s many meetings with Deputy A.G. Bruce Ohr and his beautiful wife, Nelly. It was Fusion GPS that hired Steele to write the phony &amp, discredited Dossier, paid for by Crooked Hillary &amp, the DNC....","rating":7},{"id":889800510106107900,"text":"Jared Kushner did very well yesterday in proving he did not collude with the Russians. Witch Hunt. Next up, 11 year old Barron Trump!","rating":9},{"id":1322868388155318300,"text":"...The place was a mess and would have lost much more business if I hadn’t come along. Many new plants are starting. Foreign countries and companies now treat the USA, and Michigan, with respect. Big jobs plans. Please remember this when you go to cast your very important vote!","rating":5},{"id":1060138691778302000,"text":"Ron DeSantis showed great courage in his hard fought campaign to become the Governor of Florida. Congratulations to Ron and family!","rating":3},{"id":830042498806460400,"text":"LAWFARE: \"\"Remarkably, in the entire opinion, the panel did not bother even to cite this (the) statute.\"\" A disgraceful decision!","rating":4},{"id":837489578193846300,"text":"...intentional. This whole narrative is a way of saving face for Democrats losing an election that everyone thought they were supposed.....","rating":4},{"id":1128739521753907200,"text":"....Different opinions are expressed and I make a decisive and final decision - it is a very simple process. All sides, views, and policies are covered. I’m sure that Iran will want to talk soon.","rating":3},{"id":900352052068401200,"text":"Last night in Phoenix I read the things from my statements on Charlottesville that the Fake News Media didn't cover fairly. People got it!","rating":6},{"id":1130093130857013200,"text":"....Conditions, drug prices down for first time in 51 years (&amp, soon will drop much further), Right to Try, protecting your 2nd Amendment, big Tax &amp, Reg Cuts, 3.2 GDP, Strong Foreign Policy, &amp, much much more that nobody else would have been able to do. Our Country is doing GREAT!","rating":4},{"id":1044575765109624800,"text":"Will be speaking at the United Nations this morning. Our country is much stronger and much richer than it was when I took office less than two years ago. We are also MUCH safer!","rating":3},{"id":997471413266247700,"text":"Why isn’t disgraced FBI official Andrew McCabe being investigated for the $700,000 Crooked Hillary Democrats in Virginia, led by Clinton best friend Terry M (under FBI investigation that they killed) gave to McCabe’s wife in her run for office? Then dropped case on Clinton!","rating":9},{"id":991672075491438600,"text":"NEW BOOK - A MUST READ! “The Russia Hoax - The Illicit Scheme to Clear Hillary Clinton and Frame Donald Trump” by the brilliant Fox News Legal Analyst Gregg Jarrett. A sad chapter for law enforcement. A rigged system!","rating":7},{"id":843803115044454400,"text":"Just heard Fake News CNN is doing polls again despite the fact that their election polls were a WAY OFF disaster. Much higher ratings at Fox","rating":5},{"id":1192463709400117200,"text":"The Amazon Washington Post and three lowlife reporters, Matt Zapotosky, Josh Dawsey, and Carol Leonnig, wrote another Fake News story, without any sources (pure fiction), about Bill Barr &amp, myself. We both deny this story, which they knew before they wrote it. A garbage newspaper!","rating":8},{"id":1131529223489892400,"text":"....drug prices, pre-existing conditions and our great Vets. All they are geared up to do, six committees, is squander time, day after day, trying to find anything which will be bad for me. A pure fishing expedition like this never happened before, &amp, it should never happen again!","rating":4},{"id":1205455803378999300,"text":"My Approval Rating in the Republican Party is 95%, a Record. Thank you! #2020Election","rating":2},{"id":948195478428102700,"text":"Since taking office I have been very strict on Commercial Aviation. Good news - it was just reported that there were Zero deaths in 2017, the best and safest year on record!","rating":3},{"id":1202232739937702000,"text":"Great progress has been made by NATO over the last three years. Countries other than the U.S. have agreed to pay 130 Billion Dollars more per year, and by 2024, that number will be 400 Billion Dollars. NATO will be richer and stronger than ever before....","rating":4},{"id":813498739923054600,"text":"President Obama said that he thinks he would have won against me. He should say that but I say NO WAY! - jobs leaving, ISIS, OCare, etc.","rating":6},{"id":1115217618846265300,"text":"“The reason the whole process seems so politicized is that Democrats made up this complete lie about Collusion ....and none of it happened.” Charles Hurt. The Russian Hoax never happened, it was a fraud on the American people!","rating":8},{"id":886743367815766000,"text":"Heading back to Washington, D.C. Much will be accomplished this week on trade, the military and security!","rating":3},{"id":1036740691211284500,"text":"President Bashar al-Assad of Syria must not recklessly attack Idlib Province. The Russians and Iranians would be making a grave humanitarian mistake to take part in this potential human tragedy. Hundreds of thousands of people could be killed. Don’t let that happen!","rating":4},{"id":1126106540015071200,"text":"The reason for the China pullback &amp, attempted renegotiation of the Trade Deal is the sincere HOPE that they will be able to “negotiate” with Joe Biden or one of the very weak Democrats, and thereby continue to ripoff the United States (($500 Billion a year)) for years to come....","rating":7},{"id":1265255845358645200,"text":"....living in the state, no matter who they are or how they got there, will get one. That will be followed up with professionals telling all of these people, many of whom have never even thought of voting before, how, and for whom, to vote. This will be a Rigged Election. No way!","rating":6},{"id":846533818811080700,"text":"Why isn't the House Intelligence Committee looking into the Bill &amp, Hillary deal that allowed big Uranium to go to Russia, Russian speech....","rating":5},{"id":1226537476476502000,"text":"They are really mad at Senator Joe Munchkin in West Virginia. He couldn’t understand the Transcripts. Romney could, but didn’t want to!","rating":7},{"id":1183506863431786500,"text":"“Congressman Adam Schiff, who when seeing the REAL Ukraine phone call Transcript decided he’d better make up one of his own. ‘I’m going to say this only SEVEN times, so you better listen good. I want you to MAKE UP DIRT ON MY POLITICAL OPPONENT, UNDERSTAND, LOTS OF IT, AND.....","rating":9},{"id":1163425829331841000,"text":"Great cohesion inside the Republican Party, the best I have ever seen. Despite all of the Fake News, my Poll Numbers are great. New internal polls show them to be the strongest we’ve had so far! Think what they’d be if I got fair media coverage!","rating":4},{"id":1127755536638906400,"text":"“Just another abuse of power in a long series of abuses of power by the Democrats that began during the Obama Administration, continued through the Mueller FBI operation, &amp, now the baton has been passed to Jerry Nadler to continue to abuse power to harass President Trump..","rating":6},{"id":1023531550690955300,"text":"Tom Homan, fmr ICE Director: “There is nobody that has done more for border security &amp, public safety than President Trump. I’ve worked for six presidents, and I respect them all, but nobody has done more than this Administration &amp, President Trump, that’s just a stone cold fact!”","rating":4},{"id":824968416486387700,"text":"Look forward to seeing final results of VoteStand. Gregg Phillips and crew say at least 3,000,000 votes were illegal. We must do better!","rating":6},{"id":1146068975350009900,"text":"Robert Mueller is being asked to testify yet again. He said he could only stick to the Report, &amp, that is what he would and must do. After so much testimony &amp, total transparency, this Witch Hunt must now end. No more Do Overs. No Collusion, No Obstruction. The Great Hoax is dead!","rating":7},{"id":1014100908127543300,"text":"How can the Democrats, who are weak on the Border and weak on Crime, do well in November. The people of our Country want and demand Safety and Security, while the Democrats are more interested in  ripping apart and demeaning (and not properly funding) our great Law Enforcement!","rating":5},{"id":1076655729820471300,"text":"Brett McGurk, who I do not know, was appointed by President Obama in 2015. Was supposed to leave in February but he just resigned prior to leaving. Grandstander? The Fake News is making such a big deal about this nothing event!","rating":6},{"id":1040242677877551100,"text":"The Wall Street Journal has it wrong, we are under no pressure to make a deal with China, they are under pressure to make a deal with us. Our markets are surging, theirs are collapsing. We will soon be taking in Billions in Tariffs &amp, making products at home. If we meet, we meet?","rating":7},{"id":1292838130526158800,"text":"Thank you to Senator Bill Cassidy of Louisiana for his very smart words on the just signed Executive Orders!","rating":3},{"id":1056299897882923000,"text":"...This evil Anti-Semitic attack is an assault on humanity. It will take all of us working together to extract the poison of Anti-Semitism from our world. We must unite to conquer hate.","rating":2},{"id":987820963038449700,"text":"“At least two Memos Comey shared with a friend contained Classified Information.”  Wall Street Journal","rating":3},{"id":1020285014616002600,"text":"My deepest sympathies to the families and friends of those involved in the terrible boat accident which just took place in Missouri. Such a tragedy, such a great loss. May God be with you all!","rating":2},{"id":1203387348274360300,"text":"Hard to believe, but if Nancy Pelosi had put our great Trade Deal with Mexico and Canada, USMCA, up for a vote long ago, our economy would be even better. If she doesn’t move quickly, it will collapse!","rating":7},{"id":1018096402520518700,"text":"....Remember, it was Little Jeff Z and his people, who are told exactly what to say, who said I could not win the election in that “there was no way to 270” (over &amp, over again) in the Electoral College. I got 306! They were sooooo wrong in their election coverage. Still hurting!","rating":8},{"id":889274373689028600,"text":"If Republicans don't Repeal and Replace the disastrous ObamaCare, the repercussions will be far greater than any of them understand!","rating":6},{"id":855901315305795600,"text":"I am committed to keeping our air and water clean but always remember that economic growth enhances environmental protection. Jobs matter!","rating":4},{"id":1030458489070596100,"text":"When a politician admits that “We’re not going to make America great again,” there doesn’t seem to be much reason to ever vote for him. This could be a career threatening statement by Andrew Cuomo, with many wanting him to resign-he will get higher ratings than his brother Chris!","rating":5},{"id":1155223906959147000,"text":"Democrats don’t care about Border Security. They refuse to give the votes necessary to fix the Loopholes and Asylum. Would be so easy! They want Open Borders, which means CRIME,CRIME,CRIME!","rating":9},{"id":1222544696964264000,"text":"There is much talk that certain Democrats are going to be voting with Republicans on the Impeachment Hoax, so that the Senate can get back to the business of taking care of the American people. Sorry, but Cryin’ Chuck Schumer will never let that happen!","rating":8},{"id":911189860769255400,"text":"The greatest influence over our election was the Fake News Media \"\"screaming\"\" for Crooked Hillary Clinton. Next, she was a bad candidate!","rating":7},{"id":915523382686478300,"text":"A great day in Puerto Rico yesterday. While some of the news coverage is Fake, most showed great warmth and friendship.","rating":3},{"id":1139878112701927400,"text":"All in for Senator Steve Daines as he proposes an Amendment for a strong BAN on burning our American Flag. A no brainer!","rating":6},{"id":1020290163933630500,"text":"....The United States should not be penalized because we are doing so well. Tightening now hurts all that we have done. The U.S. should be allowed to recapture what was lost due to illegal currency manipulation and BAD Trade Deals. Debt coming due &amp, we are raising rates - Really?","rating":6},{"id":1004160401658073100,"text":"Wow, Strzok-Page, the incompetent &amp, corrupt FBI lovers, have texts referring to a counter-intelligence operation into the Trump Campaign dating way back to December, 2015. SPYGATE is in full force! Is the Mainstream Media interested yet? Big stuff!","rating":8},{"id":1301528521026744300,"text":"Based on the massive number of Unsolicited &amp; Solicited Ballots that will be sent to potential Voters for the upcoming 2020 Election, &amp; in order for you to MAKE SURE YOUR VOTE COUNTS &amp; IS COUNTED, SIGN &amp; MAIL IN your Ballot as EARLY as possible. On Election Day, or Early Voting,..","rating":5},{"id":999278498182258700,"text":"There will be big news coming soon for our great American Autoworkers. After many decades of losing your jobs to other countries, you have waited long enough!","rating":4},{"id":871679061847879700,"text":"In any event we are EXTREME VETTING people coming into the U.S. in order to help keep our country safe. The courts are slow and political!","rating":5},{"id":943856675294982100,"text":"House Democrats want a SHUTDOWN for the holidays in order to distract from the very popular, just passed, Tax Cuts. House Republicans, don’t let this happen. Pass the C.R. TODAY and keep our Government OPEN!","rating":6},{"id":1140059246781968400,"text":".....the first 2 1/2 years of his Presidency, including the fact that we have one of the best Economies in the history of our Country. It is called Earned Media. In any event, enjoy the show!","rating":3},{"id":842724011234791400,"text":"North Korea is behaving very badly. They have been \"\"playing\"\" the United States for years. China has done little to help!","rating":7},{"id":1158709475517325300,"text":"Massive amounts of money from China and other parts of the world is pouring into the United States for reasons of safety, investment, and interest rates! We are in a very strong position. Companies are also coming to the U.S. in big numbers. A beautiful thing to watch!","rating":4},{"id":1114223249917788200,"text":"Will soon be landing in Calexico, California to look at a portion of the new WALL being built on our Southern Border. Within two years we will have close to 400 miles built or under construction &amp, keeping our Country SAFE – not easy when the Dems are always fighting to stop you!","rating":6},{"id":1004211778837012500,"text":"Mitch McConnell announced he will cancel the Senate’s August Recess. Great, maybe the Democrats will finally get something done other than their acceptance of High Crime and High Taxes. We need Border Security!","rating":4},{"id":1023662510371741700,"text":"Is Robert Mueller ever going to release his conflicts of interest with respect to President Trump, including the fact that we had a very nasty &amp, contentious business relationship, I turned him down to head the FBI (one day before appointment as S.C.) &amp, Comey is his close friend..","rating":6},{"id":1068444287380025300,"text":"....Lightly looked at doing a building somewhere in Russia. Put up zero money, zero guarantees and didn’t do the project. Witch Hunt!","rating":7},{"id":1024236805477097500,"text":"The globalist Koch Brothers, who have become a total joke in real Republican circles, are against Strong Borders and Powerful Trade. I never sought their support because I don’t need their money or bad ideas. They love my Tax &amp, Regulation Cuts, Judicial picks &amp, more. I made.....","rating":7},{"id":1181577775246905300,"text":"Someone please tell the Radical Left Mayor of Minneapolis that he can’t price out Free Speech. Probably illegal! I stand strongly &amp, proudly with the great Police Officers and Law Enforcement of Minneapolis and the Great State of Minnesota! See you Thursday Night!","rating":6},{"id":924637600094326800,"text":"...the Uranium to Russia deal, the  33,000 plus deleted Emails, the Comey fix and so much more. Instead they look at phony Trump/Russia,....","rating":5},{"id":1260171664865796000,"text":"Our Testing is the BEST in the World, by FAR! Numbers are coming down in most parts of our Country, which wants to open and get going again. It is happening, safely!","rating":3},{"id":873878232264822800,"text":"...way up. Regulations way down. 600,000+ new jobs added. Unemployment down to 4.3%. Business and economic enthusiasm way up- record levels!","rating":3},{"id":1014146835135516700,"text":"Now that Harley-Davidson is moving part of its operation out of the U.S., my Administration is working with other Motor Cycle companies who want to move into the U.S. Harley customers are not happy with their move - sales are down 7% in 2017. The U.S. is where the Action is!","rating":4},{"id":375609403376144400,"text":"AGAIN, TO OUR VERY FOOLISH LEADER, DO NOT ATTACK SYRIA - IF YOU DO MANY VERY BAD THINGS WILL HAPPEN &amp, FROM THAT FIGHT THE U.S. GETS NOTHING!","rating":8},{"id":742053354189299700,"text":"Is President Obama going to finally mention the words radical Islamic terrorism? If he doesn't he should immediately resign in disgrace!","rating":9},{"id":1078375400974307300,"text":"The Democrats OBSTRUCTION of the desperately needed Wall, where they almost all recently agreed it should be built, is exceeded only by their OBSTRUCTION of 350 great people wanting &amp, expecting to come into Government after being delayed for more than two years, a U.S. record!","rating":8},{"id":876390681056600000,"text":"...massive regulation cuts, 36 new legislative bills signed, great new S.C.Justice, and Infrastructure, Healthcare and Tax Cuts in works!","rating":5},{"id":1164914962529247200,"text":"....your companies HOME and making your products in the USA. I will be responding to China’s Tariffs this afternoon. This is a GREAT opportunity for the United States. Also, I am ordering all carriers, including Fed Ex, Amazon, UPS and the Post Office, to SEARCH FOR &amp, REFUSE,....","rating":6},{"id":1071015457409384400,"text":"...the lying and leaking by the people doing the Report, &amp, also Bruce Ohr (and his lovely wife Molly), Comey, Brennan, Clapper, &amp, all of the many fired people of the FBI, be listed in the Report? Will the corruption within the DNC &amp, Clinton Campaign be exposed?..And so much more!","rating":7},{"id":936219599422574600,"text":"Stock Market hits new Record High. Confidence and enthusiasm abound. More great numbers coming out!","rating":3},{"id":1058356796262412300,"text":"Will be going to West Virginia and Indiana today, TWO RALLIES! Don’t tell anyone (big secret), but I will be bringing Coach Bobby Knight to Indiana. He’s been a supporter right from the beginning of the Greatest Political Movement in American History!","rating":4},{"id":1024860399458508800,"text":"Incredibly beautiful ceremony as U.S. Korean War remains are returned to American soil. Thank you to Honolulu and all of our great Military participants on a job well done. A special thanks to Vice President Mike Pence on delivering a truly magnificent tribute!","rating":2},{"id":912664574461120500,"text":"The NFL has all sorts of rules and regulations. The only way out for them is to set a rule that you can't kneel during our National Anthem!","rating":7},{"id":926403023861141500,"text":"Everybody is asking why the Justice Department (and FBI) isn't looking into all of the dishonesty going on with Crooked Hillary &amp, the Dems..","rating":8},{"id":1008732992481710100,"text":"Comey gave Strozk his marching orders. Mueller is Comey’s best friend. Witch Hunt!","rating":8},{"id":931122234437046300,"text":"To the three UCLA basketball players I say:  You're welcome, go out and give a big Thank You to President Xi Jinping of China who made.....","rating":7},{"id":1134921830773469200,"text":"...travesty that is taking place in allowing millions of people to easily meander through their country and INVADE the U.S., not to mention the Drugs &amp, Human Trafficking pouring in through Mexico. Are the Drug Lords, Cartels &amp, Coyotes really running Mexico? We will soon find out!","rating":9},{"id":1117825163234426900,"text":"The Mueller Report, which was written by 18 Angry Democrats who also happen to be Trump Haters (and Clinton Supporters), should have focused on the people who SPIED on my 2016 Campaign, and others who fabricated the whole Russia Hoax. That is, never forget, the crime.....","rating":8},{"id":1070328136150200300,"text":"Hopefully OPEC will be keeping oil flows as is, not restricted. The World does not want to see, or need, higher oil prices!","rating":5},{"id":819159806489591800,"text":"Russia has never tried to use leverage over me. I HAVE NOTHING TO DO WITH RUSSIA - NO DEALS, NO LOANS, NO NOTHING!","rating":6},{"id":1031152483949838300,"text":"Some members of the media are very Angry at the Fake Story in the New York Times. They actually called to complain and apologize - a big step forward. From the day I announced, the Times has been Fake News, and with their disgusting new Board Member, it will only get worse!","rating":7},{"id":1041438771366060000,"text":"Congratulations to all of our Mexican friends on National Independence Day. We will be doing great things together!","rating":4},{"id":1158407059496460300,"text":"....used currency manipulation to steal our businesses and factories, hurt our jobs, depress our workers’ wages and harm our farmers’ prices. Not anymore!","rating":7},{"id":996723907867676700,"text":"Congratulations to Lou Barletta of Pennsylvania. He will be a great Senator and will represent his people well - like they haven’t been represented in many years. Lou is a friend of mine and a special guy, he will very much help MAKE AMERICA GREAT AGAIN!","rating":6},{"id":1071001119697109000,"text":"Robert Mueller and Leakin’ Lyin’ James Comey are Best Friends, just one of many Mueller Conflicts of Interest. And bye the way, wasn’t the woman in charge of prosecuting Jerome Corsi (who I do not know) in charge of “legal” at the corrupt Clinton Foundation? A total Witch Hunt...","rating":9},{"id":907930425657626600,"text":"I will be traveling to Florida tomorrow to meet with our great Coast Guard, FEMA and many of the brave first responders &amp, others.","rating":4},{"id":869503804307275800,"text":"We have a MASSIVE trade deficit with Germany, plus they pay FAR LESS than they should on NATO &amp, military. Very bad for U.S. This will change","rating":6},{"id":871674214356484100,"text":"People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!","rating":7},{"id":1207997316424188000,"text":"A far left magazine, or very “progressive,” as some would call it, which has been doing poorly and hasn’t been involved with the Billy Graham family for many years, Christianity Today, knows nothing about reading a perfect transcript of a routine phone call and would rather.....","rating":7},{"id":1084070845826371600,"text":".....who is being totally protected by his best friend, Bob Mueller, &amp, the 13 Angry Democrats - leaking machines who have NO interest in going after the Real Collusion (and much more) by Crooked Hillary Clinton, her Campaign, and the Democratic National Committee. Just Watch!","rating":8},{"id":1071055923848855600,"text":"We will be doing a major Counter Report to the Mueller Report. This should never again be allowed to happen to a future President of the United States!","rating":6},{"id":1010320166486454300,"text":"Based on the Tariffs and Trade Barriers long placed on the U.S. &amp, its great companies and workers by the European Union, if these Tariffs and Barriers are not soon broken down and removed, we will be placing a 20% Tariff on all of their cars coming into the U.S. Build them here!","rating":5},{"id":1196977794183499800,"text":"Congressman Van Drew (D-NJ): We’ve spent millions of Dollars, in my opinion, tons of money, tons of time, tons of hurt, fracturing the Nation apart. I haven’t seen this to be a good thing.”","rating":3},{"id":1042033116695670800,"text":"China has openly stated that they are actively trying to impact and change our election by attacking our farmers, ranchers and industrial workers because of their loyalty to me. What China does not understand is that these people are great patriots and fully understand that.....","rating":5},{"id":1191708046126399500,"text":"A wonderful family and friends from Utah got caught between two vicious drug cartels, who were shooting at each other, with the result being many great American people killed, including young children, and some missing. If Mexico needs or requests help in cleaning out these.....","rating":5},{"id":1017290478839050200,"text":"....On top of it all, Germany just started paying Russia, the country they want protection from, Billions of Dollars for their Energy needs coming out of a new pipeline from Russia. Not acceptable! All NATO Nations must meet their 2% commitment, and that must ultimately go to 4%!","rating":6},{"id":874087477807599600,"text":"Great numbers on the economy. All of our work, including the passage of many bills &amp, regulation killing Executive Orders, now kicking in!","rating":4},{"id":1140977371421564900,"text":"Had a very good telephone conversation with President Xi of China. We will be having an extended meeting next week at the G-20 in Japan. Our respective teams will begin talks prior to our meeting.","rating":3},{"id":1004742470700322800,"text":"When will people start saying, “thank you, Mr. President, for firing James Comey?”","rating":8},{"id":1207289040182988800,"text":"“It’s sad. Here’s a gentleman who came to the White House and all they had was never to let him have an easy breath. All they wanted to do is impeach him. They started the day after he was elected, even the day after he was sworn in.  But this President came to Washington and....","rating":5},{"id":1126078423816921100,"text":"....you would get it by building, or even buying. You always wanted to show losses for tax purposes....almost all real estate developers did - and often re-negotiate with banks, it was sport. Additionally, the very old information put out is a highly inaccurate Fake News hit job!","rating":7},{"id":1165281416206266400,"text":"“Face It, You Probably Got A Tax Cut!” This was a New York Times headline, and it is very true. If Republicans take back the House, and keep the Senate and Presidency, one of our first acts will be to approve a major middle income Tax Cut! Democrats only want to raise your taxes!","rating":6},{"id":1232657640515342300,"text":"Crazy, chaotic Democrat Debate last night. Fake News said Biden did well, even though he said half of our population was shot to death. Would be OVER for most. Mini Mike was weak and unsteady, but helped greatly by his many commercials (which are not supposed to be allowed....","rating":9},{"id":1288520300250923000,"text":"If the Federal Government and its brilliant Law Enforcement (Homeland) didn’t go into Portland one week ago, there would be no Portland -- It would be burned and beaten to the ground. If the Mayor and Governor...","rating":7},{"id":1028996374174593000,"text":"Wacky Omarosa, who got fired 3 times on the Apprentice, now got fired for the last time. She never made it, never will. She begged me for a job, tears in her eyes, I said Ok. People in the White House hated her. She was vicious, but not smart. I would rarely see her but heard....","rating":8},{"id":1188054937839775700,"text":"....We should all work together to clean up these hazardous waste and homeless sites before the whole city rots away. Very bad and dangerous conditions, also severely impacting the Pacific Ocean and water supply. Pelosi must work on this mess and turn her District around!","rating":5},{"id":1144014401164337200,"text":"Why aren’t the Democrats in the House calling Comey, Brennan, Clapper, Page and her FBI lover (whose invaluable phone records were illegally deleted), Crooked Hillary, Podesta, Ohr (and Nellie), the GPS Fusion characters, Christopher Steele, the DNC (&amp, their missing server)....","rating":6},{"id":1017178539706212400,"text":"How can the Rigged Witch Hunt proceed when it was started, influenced and worked on, for an extended period of time, by former FBI Agent/Lover Peter Strzok? Read his hate filled and totally biased Emails and the answer is clear!","rating":7},{"id":1114153614216441900,"text":"....However, if for any reason Mexico stops apprehending and bringing the illegals back to where they came from, the U.S. will be forced to Tariff at 25% all cars made in Mexico and shipped over the Border to us. If that doesn’t work, which it will, I will close the Border.......","rating":7},{"id":993483042177118200,"text":"Lisa Page, who may hold the record for the most Emails in the shortest period of time (to her Lover, Peter S), and attorney Baker, are out at the FBI as part of the Probers getting caught? Why is Peter S still there? What a total mess. Our Country has to get back to Business!","rating":6},{"id":1194219655717642200,"text":"Many of the people in DACA, no longer very young, are far from “angels.” Some are very tough, hardened criminals. President Obama said he had no legal right to sign order, but would anyway. If Supreme Court remedies with overturn, a deal will be made with Dems for them to stay!","rating":6},{"id":1181232251390042000,"text":"....the captured ISIS fighters and families. The U.S. has done far more than anyone could have ever expected, including the capture of 100% of the ISIS Caliphate. It is time now for others in the region, some of great wealth, to protect their own territory. THE USA IS GREAT!","rating":5},{"id":1078401678930559000,"text":"Brad Blakeman: “The American people understand that we have been played by foreign actors who would rather have us fight their battles for them. The President says look, this is your neighborhood, you’ve got to stand up to protect yourselves. Don’t always look to America.”","rating":4},{"id":893964041630212100,"text":"Working in Bedminster, N.J., as long planned construction is being done at the White House. This is not a vacation - meetings and calls!","rating":3},{"id":910328626075390000,"text":"Puerto Rico being hit hard by new monster Hurricane. Be careful, our hearts are with you- will be there to help!","rating":3},{"id":878711517537083400,"text":"Since the Obama Administration was told way before the 2016 Election that the Russians were meddling, why no action? Focus on them, not T!","rating":5},{"id":1025830647649247200,"text":"Tariffs are working far better than anyone ever anticipated. China market has dropped 27% in last 4months, and they are talking to us. Our market is stronger than ever, and will go up dramatically when these horrible Trade Deals are successfully renegotiated. America First.......","rating":6},{"id":1184435422346305500,"text":"Republicans are totally deprived of their rights in this Impeachment Witch Hunt. No lawyers, no questions, no transparency! The good news is that the Radical Left Dems have No Case. It is all based on their Fraud and Fabrication!","rating":7},{"id":1021917767467982800,"text":"So sad and unfair that the FCC wouldn’t approve the Sinclair Broadcast merger with Tribune. This would have been a great and much needed Conservative voice for and of the People. Liberal Fake News NBC and Comcast gets approved, much bigger, but not Sinclair. Disgraceful!","rating":6},{"id":1172522443174531000,"text":"The two big Congressional wins in North Carolina on Tuesday, Dan Bishop and Greg Murphy, have reverberated all over the World. They showed a lot of people how strong the Republican Party is, and how well it is doing. 2020 is a big, and very important, Election. We will WIN!","rating":4},{"id":1236976241305170000,"text":"Cryin’ Chuck Schumer said, “You will pay the price for this. You won’t know what HIT YOU.” That is far beyond simple rhetoric. That is a physical threat, or at least a threat that you better vote for us.” Trouble ahead!","rating":8},{"id":1206946946289668000,"text":"The Stock Market hit another Record High yesterday, number 133 in less than three years as your all time favorite President, and the Radical Left, Do Nothing Democrats, want to impeach me. Don’t worry, I have done nothing wrong. Actually, they have!","rating":5},{"id":1195202834645405700,"text":"Democrats must apologize to USA: Ukrainian Foreign Minister Vadym Prystaiko said that “United States Ambassador Gordon Sondland did NOT link financial military assistance to a request for Ukraine to open up an investigation into former V.P. Joe Biden &amp, his son, Hunter Biden.....","rating":4},{"id":1186635396567961600,"text":"Can’t believe that Nervous Nancy Pelosi isn’t moving faster on USMCA. Her people want it, they don’t know why she isn’t putting it up for a bipartisan vote. Taking too long!","rating":5},{"id":981521901079146500,"text":"When you’re already $500 Billion DOWN, you can’t lose!","rating":7},{"id":1178986524630802400,"text":"Congratulations to President Xi and the Chinese people on the 70th Anniversary of the People’s Republic of China!","rating":3},{"id":1146020283045810200,"text":"As most people are aware, according to the Polls, I won EVERY debate, including the three with Crooked Hillary Clinton, despite the fact that in the first debate, they modulated the sound on me, and got caught. This crew looks somewhat easier than Crooked, but you never know?","rating":8},{"id":884020939264073700,"text":"...have it. Fake News said 17 intel agencies when actually 4 (had to apologize). Why did Obama do NOTHING when he had info before election?","rating":6},{"id":1003268646070874100,"text":"....Paul Manafort came into the campaign very late and was with us for a short period of time (he represented Ronald Reagan, Bob Dole &amp, many others over the years), but we should have been told that Comey and the boys were doing a number on him, and he wouldn’t have been hired!","rating":5},{"id":1064246787161145300,"text":"From day one Rick Scott never wavered. He was a great Governor and will be even a greater Senator in representing the People of Florida. Congratulations to Rick on having waged such a courageous and successful campaign!","rating":4},{"id":1030433779112923100,"text":"The U.S. has more than double the growth rate than it had 18 months ago.","rating":2},{"id":898547379451740200,"text":"Heading to Camp David for major meeting on National Security, the Border and the Military (which we are rapidly building to strongest ever).","rating":3},{"id":1156574362918686700,"text":"“The lesser of two Socialists is still a Socialist!” Senator John Kennedy of Louisiana","rating":5},{"id":1025847254660403200,"text":"Iran, and it’s economy, is going very bad, and fast! I will meet, or not meet, it doesn’t matter - it is up to them!","rating":6},{"id":1189167309455331300,"text":"Supposedly, according to the Corrupt Media, the Ukraine call “concerned” today’s Never Trumper witness. Was he on the same call that I was? Can’t be possible! Please ask him to read the Transcript of the call. Witch Hunt!","rating":7},{"id":1169600039188160500,"text":"....said what she did, even being on a much higher rated show, she would have been thrown off television. Will Fake News NBC allow a McCarthy style Racist to continue? ABC fired Roseanne. Watch the double standard!","rating":8},{"id":1060960329876697100,"text":"In the 2016 Election I was winning by so much in Florida that Broward County, which was very late with vote tabulation and probably getting ready to do a “number,” couldn’t do it because not enough people live in Broward for them to falsify a victory!","rating":7},{"id":1315744432042528800,"text":"307,000 Veterans Died waiting for Healthcare at the V.A. During Sleepy Joe Biden’s Watch. 800,000 Records Stalled! A complete and total disaster.","rating":6},{"id":1037173907625832400,"text":"The already discredited Woodward book, so many lies and phony sources, has me calling Jeff Sessions “mentally retarded” and “a dumb southerner.” I said NEITHER, never used those terms on anyone, including Jeff, and being a southerner is a GREAT thing. He made this up to divide!","rating":8},{"id":1190079193582899200,"text":"....this decision, but in the end it will be best for all concerned. As President, I will always be there to help New York and the great people of New York. It will always have a special place in my heart!","rating":3},{"id":1202606535995732000,"text":"The Do Nothing, Radical Left Democrats have just announced that they are going to seek to Impeach me over NOTHING. They already gave up on the ridiculous Mueller “stuff,” so now they hang their hats on two totally appropriate (perfect) phone calls with the Ukrainian President....","rating":6},{"id":1052556222459727900,"text":"Hard to believe that with thousands of people from South of the Border, walking unimpeded toward our country in the form of large Caravans, that the Democrats won’t approve legislation that will allow laws for the protection of our country. Great Midterm issue for Republicans!","rating":5},{"id":1038180008479608800,"text":"14 days for $28 MILLION - $2 MILLION a day, No Collusion. A great day for America!","rating":4},{"id":971186041171439600,"text":"Will be making a decision soon on the appointment of new Chief Economic Advisor. Many people wanting the job - will choose wisely!","rating":3},{"id":1056200966809288700,"text":"Watching the events unfolding in Pittsburgh, Pennsylvania. Law enforcement on the scene. People in Squirrel Hill area should remain sheltered. Looks like multiple fatalities. Beware of active shooter. God Bless All!","rating":3},{"id":989144989690187800,"text":"Looking forward to my meeting with Tim Cook of Apple. We will be talking about many things, including how the U.S. has been treated unfairly for many years, by many countries, on trade.","rating":5},{"id":1068001369746022400,"text":"So much happening with the now discredited Witch Hunt. This total Hoax will be studied for years!","rating":7},{"id":992354530510721000,"text":"NBC NEWS is wrong again! They cite “sources” which are constantly wrong. Problem is, like so many others, the sources probably don’t exist, they are fabricated, fiction! NBC, my former home with the Apprentice, is now as bad as Fake News CNN. Sad!","rating":6},{"id":1194033162936103000,"text":"Just like Schiff fabricated my phone call, he will fabricate the transcripts that he is making and releasing!","rating":6},{"id":993813485745295400,"text":"I will be speaking to my friend, President Xi of China, this morning at 8:30. The primary topics will be Trade, where good things will happen, and North Korea, where relationships and trust are building.","rating":4},{"id":1140252529428717600,"text":".....news is that at the end of 6 years, after America has been made GREAT again and I leave the beautiful White House (do you think the people would demand that I stay longer? KEEP AMERICA GREAT), both of these horrible papers will quickly go out of business &amp, be forever gone!","rating":8},{"id":1185934502906007600,"text":"“The ceasefire is holding up very nicely. There are some minor skirmishes that have ended quickly. New areas being resettled with Kurds. U.S. soldiers are not in combat or ceasefire zone. We have secured the Oil.” Mark Esper, Secretary of Defense. Ending endless wars!","rating":5},{"id":679506175239532500,"text":"When I said that Hillary Clinton got schlonged by Obama, it meant got beaten badly. The media knows this. Often used word in politics!","rating":9},{"id":1178671715624394800,"text":"The Fake News Media wants to stay as far away as possible from the Ukraine and China deals made by the Bidens. A Corrupt Media is so bad for our Country! In actuality, the Media may be even more Corrupt than the Bidens, which is hard to do!","rating":7},{"id":1186049749989892000,"text":"So interesting that, when I announced Trump National Doral in Miami would be used for the hosting of the G-7, and then rescinded due to Do Nothing Democrat/Fake News Anger, very few in Media mentioned that NO PROFITS would be taken, or would be given FREE, if legally permissible!","rating":7},{"id":1002159087830827000,"text":"The corrupt Mainstream Media is working overtime not to mention the infiltration of people, Spies (Informants), into my campaign! Surveillance much?","rating":8},{"id":1206573270121767000,"text":"READ THE TRANSCRIPTS! The Impeachment Hoax is the greatest con job in the history of American politics! The Fake News Media, and their partner, the Democrat Party, are working overtime to make life for the United Republican Party, and all it stands for, as difficult as possible!","rating":9},{"id":884374529660903400,"text":"When I left Conference Room for short meetings with Japan and other countries, I asked Ivanka to hold seat. Very standard. Angela M agrees!","rating":6},{"id":837987684660412400,"text":"The first meeting Jeff Sessions had with the Russian Amb was set up by the Obama Administration under education program for 100 Ambs......","rating":6},{"id":820251730407473200,"text":"Congressman John Lewis should spend more time on fixing and helping his district, which is in horrible shape and falling apart (not to......","rating":8},{"id":1103997393073254400,"text":"PRESIDENTIAL HARASSMENT!","rating":10},{"id":1191687950360359000,"text":"Virginia, with all of the massive amount of defense and other work I brought to you, and with everything planned, go out and vote Republican today. I know the Dems are saying that they have your vote locked up, but that would mean a long slide down. VOTE REPUBLICAN TODAY!","rating":7},{"id":881271809433374700,"text":"....the 2016 election with interviews, speeches and social media. I had to beat #FakeNews, and did. We will continue to WIN!","rating":7},{"id":984371491277099000,"text":"If I wanted to fire Robert Mueller in December, as reported by the Failing New York Times, I would have fired him. Just more Fake News from a biased newspaper!","rating":8},{"id":1068346689784696800,"text":"Arrived in Argentina with a very busy two days planned. Important meetings scheduled throughout. Our great Country is extremely well represented. Will be very productive!","rating":3},{"id":1026471244949061600,"text":"“Collusion with Russia was very real. Hillary Clinton and her team 100% colluded with the Russians, and so did Adam Schiff who is on tape trying to collude with what he thought was Russians to obtain compromising material on DJT. We also know that Hillary Clinton paid through....","rating":7},{"id":1220336691539599400,"text":"Mini Mike Bloomberg is playing poker with his foolhardy and unsuspecting Democrat rivals. He says that if he loses (he really means when!) in the primaries, he will spend money helping whoever the Democrat nominee is. By doing this, he figures, they won’t hit him as hard....","rating":6},{"id":1030782921500766200,"text":"All of the fools that are so focused on looking only at Russia should start also looking in another direction, China. But in the end, if we are smart, tough and well prepared, we will get along with everyone!","rating":5},{"id":1143601086080659500,"text":"A brave former fighter jet pilot and warrior, Senator Martha McSally of Arizona has done an outstanding job in D.C., and is fully supportive of our agenda – she is with us all the way....","rating":3},{"id":1004172786359849000,"text":"...This is a level of criminality beyond the pale. This is such a grave abuse of power and authority, it’s like nothing else we’ve seen in our history. This makes the Nixon Watergate burglary look like keystone cop stuff","rating":8},{"id":948211438472089600,"text":"Democrats are doing nothing for DACA - just interested in politics.  DACA activists and Hispanics will go hard against Dems, will start “falling in love” with Republicans and their President! We are about RESULTS.","rating":6},{"id":934961858380955600,"text":"Back in D.C., big week for Tax Cuts and many other things of great importance to our Country.  Senate Republicans will hopefully come through for all of us. The Tax Cut Bill is getting better and better. The end result will be great for ALL!","rating":4},{"id":1140119581983481900,"text":"....More and more states want to do this but their governors and leaders don’t have the courage to do so. The politics will soon mandate, however, because people from California, &amp, all over the land, are demanding that Sanctuary Cities be GONE. No illegals, Drugs or Trafficking!","rating":7},{"id":912863676792787000,"text":"Congratulations to Roy Moore on his Republican Primary win in Alabama. Luther Strange started way back &amp, ran a good race. Roy, WIN in Dec!","rating":4},{"id":806214078465245200,"text":"Masa (SoftBank) of Japan has agreed to invest $50 billion in the U.S. toward businesses and 50,000 new jobs....","rating":3},{"id":1218165916451602400,"text":"Mini Mike Bloomberg doesn’t get on the Democrat Debate Stage because he doesn’t want to - he is a terrible debater and speaker. If he did, he would go down in the polls even more (if that is possible!).","rating":7},{"id":793824247168766000,"text":"Praying for the families of the two Iowa police who were ambushed this morning. An attack on those who keep us safe is an attack on us all.","rating":2},{"id":889467610332528600,"text":"So why aren't the Committees and investigators, and of course our beleaguered A.G., looking into Crooked Hillarys crimes &amp, Russia relations?","rating":8},{"id":1178648670583042000,"text":"“After many years, the United States is finally waking up to Beijing’s plans and ambitions to pass us as the dominant economic &amp, military superpower in the 21st Century. What’s happening now is that the U.S. is finally responding (thank you President Trump). This is taking.....","rating":4},{"id":991884309400342500,"text":"Ainsley Earnhardt, a truly great person, just wrote a wonderful book, “The Light Within Me,” which is doing really well. She is very special and so is her new book...bring it to number one!","rating":3},{"id":1145720615925637100,"text":"“In my opinion the President has done more good on the Korean issue in the last year and a half than President Obama did in eight years. If you look at the strides they made during the Obama years, which advocated strategic patience-they stuck their head in the sand. This is.....","rating":5},{"id":971402791930552300,"text":"China has been asked to develop a plan for the year of a One Billion Dollar reduction in their massive Trade Deficit with the United States. Our relationship with China has been a very good one, and we look forward to seeing what ideas they come back with. We must act soon!","rating":4},{"id":1205485784968630300,"text":"Record Stock Market &amp, Jobs!","rating":6},{"id":1220326789182034000,"text":"Attorney Generals from 21 States are urging the Senate to reject Impeachment. They say the Articles have legal &amp; factual problems, and the Democrats case sets a dangerous historical precedent. “EVEN AN UNSUCCESSFUL EFFORT TO IMPEACH THE PRESIDENT UNDERMINES THE INTEGRITY.....","rating":5},{"id":1024263146008207400,"text":"Collusion is not a crime, but that doesn’t matter because there was No Collusion (except by Crooked Hillary and the Democrats)!","rating":8},{"id":1099656646840778800,"text":"President Xi of China has been very helpful in his support of my meeting with Kim Jong Un. The last thing China wants are large scale nuclear weapons right next door. Sanctions placed on the border by China and Russia have been very helpful. Great relationship with Chairman Kim!","rating":4},{"id":1014875575557804000,"text":".....Country being forced to endure a long and costly trial. Tell the people “OUT,” and they must leave, just as they would if they were standing on your front lawn. Hiring thousands of “judges” does not work and is not acceptable - only Country in the World that does this!","rating":7},{"id":1238856787824164900,"text":"News Conference at White House in 10 minutes.","rating":2},{"id":984372760230154200,"text":"California Governor Jerry Brown is doing the right thing and sending the National Guard to the Border. Thank you Jerry, good move for the safety of our Country!","rating":5},{"id":1233987865350148000,"text":"Tom Steyer who, other than Mini Mike Bloomberg, spent more dollars for NOTHING than any candidate in history, quit the race today proclaiming how thrilled he was to be a part of the the Democrat Clown Show. Go away Tom and save whatever little money you have left!","rating":9},{"id":1112915488424816600,"text":"....are GREAT, but the politicians are incompetent or corrupt. Puerto Rico got far more money than Texas &amp, Florida combined, yet their government can’t do anything right, the place is a mess - nothing works. FEMA &amp, the Military worked emergency miracles, but politicians like.....","rating":6},{"id":1030235363258851300,"text":"Turkey has taken advantage of the United States for many years. They are now holding our wonderful Christian Pastor, who I must now ask to represent our Country as a great patriot hostage. We will pay nothing for the release of an innocent man, but we are cutting back on Turkey!","rating":5},{"id":1018068353305411600,"text":"I have arrived in Scotland and will be at Trump Turnberry for two days of meetings, calls and hopefully, some golf - my primary form of exercise! The weather is beautiful, and this place is incredible! Tomorrow I go to Helsinki for a Monday meeting with Vladimir Putin.","rating":3},{"id":1324750561514848300,"text":"....Legislature. They just ignored that, ignored the Constitution. Now we bring it down to the counting houses, and outrageously, observers, who are the sentinels of integrity &amp; transparency, were excluded. Pennsylvania has conducted itself in a horrible lawless way, and....","rating":7},{"id":920981920787386400,"text":"Workers of firm involved with the discredited and Fake Dossier take the 5th. Who paid for it, Russia, the FBI or the Dems (or all)?","rating":8},{"id":1167064301565358000,"text":"The Farmers are going to be so happy when they see what we are doing for Ethanol, not even including the E-15, year around, which is already done. It will be a giant package, get ready! At the same time I was able to save the small refineries from certain closing. Great for all!","rating":5},{"id":1052883467430694900,"text":"I am watching the Democrat Party led (because they want Open Borders and existing weak laws) assault on our country by Guatemala, Honduras and El Salvador, whose leaders are doing little to stop this large flow of people, INCLUDING MANY CRIMINALS, from entering Mexico to U.S.....","rating":7},{"id":948189482284707800,"text":"Companies are giving big bonuses to their workers because of the Tax Cut Bill. Really great!","rating":4},{"id":1022812910702215200,"text":".....I did NOT know of the meeting with my son, Don jr. Sounds to me like someone is trying to make up stories in order to get himself out of an unrelated jam (Taxi cabs maybe?). He even retained Bill and Crooked Hillary’s lawyer. Gee, I wonder if they helped him make the choice!","rating":9},{"id":1037840881531801600,"text":"Are the investigative “journalists” of the New York Times going to investigate themselves - who is the anonymous letter writer?","rating":6},{"id":1160997363177181200,"text":"Scaramucci, who like so many others had nothing to do with my Election victory, is only upset that I didn’t want him back in the Administration (where he desperately wanted to be). Also, I seldom had time to return his many calls to me. He just wanted to be on TV!","rating":7},{"id":1047137342924959700,"text":"Happy 7th birthday to Tristan, a very special member of the Trump family!","rating":1},{"id":1157633906025402400,"text":"Things are going along very well with China. They are paying us Tens of Billions of Dollars, made possible by their monetary devaluations and pumping in massive amounts of cash to keep their system going. So far our consumer is paying nothing - and no inflation. No help from Fed!","rating":5},{"id":1147339582586916900,"text":"My deepest sympathies go out to the family and friends of great businessman and energy expert Chris Cline, his wonderful daughter, Kameron, and their friends, on the tragic accident which took place in the Bahamas. The great people of West Virginia will never forget them!","rating":3},{"id":1021924262045802500,"text":"“The Russia Hoax, The Illicit Scheme To Clear Hillary Clinton &amp, Frame Donald Trump” is a Hot Seller, already Number One! More importantly, it is a great book that everyone is talking about. It covers the Rigged Witch Hunt brilliantly. Congratulations to Gregg Jarrett!","rating":4},{"id":878715504063643600,"text":"Obama Administration official said they \"\"choked\"\" when it came to acting on Russian meddling of election. They didn't want to hurt Hillary?","rating":3},{"id":1123536601462788100,"text":"“The Democrats can’t come to grips with the fact that there was No Collusion, there was No Conspiracy, there was No Obstruction. What we should be focused on is what’s been going on in our government, at the highest levels of the FBI....” Senator Josh Hawley","rating":2},{"id":912629775629418500,"text":"But while Dallas dropped to its knees as a team, they all stood up for our National Anthem. Big progress being made-we all love our country!","rating":3},{"id":940567812053053400,"text":"Lightweight Senator Kirsten Gillibrand, a total flunky for Chuck Schumer and someone who would come to my office “begging” for campaign contributions not so long ago (and would do anything for them), is now in the ring fighting against Trump. Very disloyal to Bill &amp, Crooked-USED!","rating":7},{"id":1101469141213630500,"text":"Congress must demand the transcript of Michael Cohen’s new book, given to publishers a short time ago. Your heads will spin when you see the lies, misrepresentations and contradictions  against his Thursday testimony. Like a different person! He is totally discredited!","rating":5},{"id":1063834733430206500,"text":"....I can’t imagine any President having a better or closer relationship with their Vice President then the two of us. Just more FAKE NEWS, the Enemy of the People!","rating":6},{"id":1167037101906497500,"text":"....for the most ridiculous claim of all, that Russia, Russia, Russia, or Russian oligarchs, co-signed loan documents for me, a guarantee. Totally false, as is virtually everything else he, and much of the rest of the LameStream Media, has said about me for years. ALL APOLOGIZE!","rating":5},{"id":1007577375905861600,"text":"The IG Report is a total disaster for Comey, his minions and sadly, the FBI. Comey will now officially go down as the worst leader, by far, in the history of the FBI. I did a great service to the people in firing him. Good Instincts. Christopher Wray will bring it proudly back!","rating":4},{"id":1323330590867861500,"text":"Every corrupt force in American life that betrayed you and hurt your are supporting Joe Biden: The failed establishment that started the disastrous foreign wars; The career politicians that offshored your industries &amp; decimated your factories; The open borders lobbyists...","rating":6},{"id":816635078067490800,"text":"Thank you to Ford for scrapping a new plant in Mexico and creating 700 new jobs in the U.S. This is just the beginning - much more to follow","rating":2},{"id":889215815022727200,"text":"As the phony Russian Witch Hunt continues, two groups are laughing at this excuse for a lost election taking hold, Democrats and Russians!","rating":5},{"id":1233977649552384000,"text":"Congratulations to Sleepy Joe Biden!","rating":1},{"id":1160309383701680000,"text":"China wants to make a deal so badly. Thousands of companies are leaving because of the Tariffs, they must stem the flow. At the same time China may be hoping for a Democrat to win so they could continue the great ripoff of America, &amp, the theft of hundreds of Billions of $’s!","rating":4},{"id":1182387197066039300,"text":"We defeated 100% of the ISIS Caliphate and no longer have any troops in the area under attack by Turkey, in Syria. We did our job perfectly! Now Turkey is attacking the Kurds, who have been fighting each other for 200 years....","rating":5},{"id":967472757025001500,"text":"Armed Educators (and trusted people who work within a school) love our students and will protect them. Very smart people. Must be firearms adept &amp, have annual training. Should get yearly bonus. Shootings will not happen again - a big &amp, very inexpensive deterrent. Up to States.","rating":6},{"id":1177574932689182700,"text":"“IT WAS A PERFECT CONVERSATION WITH UKRAINE PRESIDENT!”","rating":7},{"id":1010486772541816800,"text":"The Russian Witch Hunt is Rigged!","rating":3},{"id":1235232818692792300,"text":"Mini Mike Bloomberg will now FIRE Tim O’Brien, and all of the fools and truly dumb people who got him into this MESS. This has been the worst, and most embarrassing, experience of his life...and now on to Sleepy Joe!","rating":8},{"id":1207857396913201200,"text":"“This is political malpractice. This is a horrible judgement call on the part of the Speaker. You put your members in Trump friendly districts in a very difficult spot. It’s only going to extend it out further. This looks like the joke that it actually is.” Ben Domenech","rating":3},{"id":1165400505222389800,"text":"The Media is destroying the Free Press! Mark Levin. So True!","rating":6},{"id":1011994162076573700,"text":"Harley-Davidson should stay 100% in America, with the people that got you your success. I’ve done so much for you, and then this. Other companies are coming back where they belong! We won’t forget, and neither will your customers or your now very HAPPY competitors!","rating":8},{"id":913403237033742300,"text":"The electric power grid in Puerto Rico is totally shot. Large numbers of generators are now on Island. Food and water on site.","rating":4},{"id":843776582825267200,"text":"The Democrats made up and pushed the Russian story as an excuse for running a terrible campaign. Big advantage in Electoral College &amp, lost!","rating":7},{"id":1148747083219984400,"text":"Democrats are coming after our great Kentucky Senator, Mitch McConnell, with someone who compared my election to September 11th....","rating":5},{"id":1148951075778682900,"text":"“Our company has grown, since Trump has taken control of the White House &amp, the Presidency, in the sense that we have better opportunities now to do what we’ve been wanting to do for quite some time, and that is to create manufacturing jobs. I believe that President Trump has.....","rating":3},{"id":1130947086739025900,"text":"So even though I didn’t have to do it with Presidential Privilege, I allowed everyone to testify, including White House Counsel Don McGahn (for over 30 hours), to Robert Mueller and the 18 Angry Trump-Hating Democrats, and they arrived....","rating":5},{"id":1139866464599642100,"text":"Despite the Greatest Presidential Harassment of all time by people that are very dishonest and want to destroy our Country, we are doing great in the Polls, even better than in 2016, and will be packed at the Tuesday Announcement Rally in Orlando, Florida. KEEP AMERICA GREAT!","rating":6},{"id":981117684489379800,"text":"The Fake News Networks, those that knowingly have a sick and biased AGENDA, are worried about the competition and quality of Sinclair Broadcast. The “Fakers” at CNN, NBC, ABC &amp, CBS have done so much dishonest reporting that they should only be allowed to get awards for fiction!","rating":7},{"id":1273620779645665300,"text":"When Wacko John Bolton went on Deface the Nation and so stupidly said that he looked at the “Libyan Model” for North Korea, all hell broke out. Kim Jong Un, who we were getting along with very well, went “ballistic”, just like his missiles - and rightfully so....","rating":9},{"id":1161977535946731500,"text":"Go out and get Andrew McCarthy’s new book, “Ball of Collusion.” “Supervision became the investigator, and when they pushed the envelope, there was nobody there to tell them NO. It goes right to the President (Obama). Plenty of information that Obama was informed &amp, knew exactly...","rating":5},{"id":901031532164468700,"text":"General John Kelly is doing a fantastic job as Chief of Staff. There is tremendous spirit and talent in the W.H. Don't believe the Fake News","rating":4},{"id":1070110615627333600,"text":"We are either going to have a REAL DEAL with China, or no deal at all - at which point we will be charging major Tariffs against Chinese product being shipped into the United States. Ultimately, I believe, we will be making a deal - either now or into the future....","rating":6},{"id":1065601413189984300,"text":"Will be speaking with our great military in different parts of the world, through teleconference, at 9:00 A.M. Eastern. Then it will be off to see our Coast Guard patriots &amp, to thank them for the great job they have been doing, especially with the hurricanes. Happy Thanksgiving!","rating":3},{"id":1066788767133040600,"text":"General Anthony Tata: “President Trump is a man of his word &amp, he said he was going to be tough on the Border, and he is tough on the Border. He has rightfully strengthened the Border in the face of an unprecedented threat. It’s the right move by President Trump.” Thanks General!","rating":4},{"id":1342823967019688000,"text":"I simply want to get out great people $2000, rather than the measly $600 that is now in the bill. Also, stop the billions of dollars in “pork”.","rating":7},{"id":1168326060280307700,"text":"“We hold that legislative prayer is government speech not open to attack via those channels.” Third Circuit, Court of Appeals. “Lou, that’s why this next Election is so important, the soul of America. They want to take religion out of American lives. Thank God for judges like....","rating":5},{"id":1205856971758473200,"text":"“There are 31 House Democrats in Trump won Congressional Districts. Those Dems will have to answer to their constituents come 2020. If you look at the facts, there’s no crime, there’s no witness, there’s no evidence, there’s no victim, President Zelensky said there was....","rating":6},{"id":986988633822412800,"text":"Thank you San Diego County for defending the rule of law and supporting our lawsuit against California's illegal and unconstitutional 'Sanctuary' policies. California's dangerous policies release violent criminals back into our communities, putting all Americans at risk.","rating":4},{"id":1179402197093814300,"text":"All the Do Nothing Democrats are focused on is Impeaching the President for having a very good conversation with the Ukrainian President. I knew that many people were listening, even have a transcript. They have been at this “stuff” from the day I got elected. Bad for Country!","rating":6},{"id":1153274069028089900,"text":"With almost no inflation, our Country is needlessly being forced to pay a MUCH higher interest rate than other countries only because of a very misguided Federal Reserve. In addition, Quantitative Tightening is continuing, making it harder for our Country to compete. As good.....","rating":5},{"id":1222496715422433300,"text":"....many more mistakes of judgement, gets fired because frankly, if I listened to him, we would be in World War Six by now, and goes out and IMMEDIATELY writes a nasty &amp; untrue book. All Classified National Security. Who would do this?","rating":8},{"id":1156979443900067800,"text":"Our representatives have just returned from China where they had constructive talks having to do with a future Trade Deal. We thought we had a deal with China three months ago, but sadly, China decided to re-negotiate the deal prior to signing. More recently, China agreed to...","rating":4},{"id":1117793692281135100,"text":"The Radical Left Democrats will never be satisfied with anything we give them. They will always Resist and Obstruct!","rating":7},{"id":886261674029854700,"text":"Stock Market hit another all-time high yesterday - despite the Russian hoax story! Also, jobs numbers are starting to look very good!","rating":6},{"id":911541328013676500,"text":"John McCain never had any intention of voting for this Bill, which his Governor loves. He campaigned on Repeal &amp, Replace. Let Arizona down!","rating":7},{"id":986218871991492600,"text":"So many people are seeing the benefits of the Tax Cut Bill. Everyone is talking, really nice to see!","rating":5},{"id":970628441115643900,"text":"...treat our farmers much better. Highly restrictive. Mexico must do much more on stopping drugs from pouring into the U.S. They have not done what needs to be done. Millions of people addicted and dying.","rating":6},{"id":941094961482780700,"text":"Thank you Omarosa for your service! I wish you continued success.","rating":4},{"id":883752778379792400,"text":"The #G20Summit was a wonderful success and carried out beautifully by Chancellor Angela Merkel. Thank you!","rating":3},{"id":942829676699021300,"text":"My thoughts and prayers are with everyone involved in the train accident in DuPont, Washington. Thank you to all of our wonderful First Responders who are on the scene. We are currently monitoring here at the White House.","rating":3},{"id":1008316495733186600,"text":"Chuck Schumer said “the Summit was what the Texans call all cattle and no hat.” Thank you Chuck, but are you sure you got that right? No more nuclear testing or rockets flying all over the place, blew up launch sites. Hostages already back, hero remains coming home &amp, much more!","rating":5},{"id":918267396493922300,"text":"Network news has become so partisan, distorted and fake that licenses must be challenged and, if appropriate, revoked. Not fair to public!","rating":7},{"id":1004351340041199600,"text":"Great night for Republicans! Congratulations to John Cox on a really big number in California. He can win. Even Fake News CNN said the Trump impact was really big, much bigger than they ever thought possible. So much for the big Blue Wave, it may be a big Red Wave. Working hard!","rating":4},{"id":1186985455058899000,"text":"Big success on the Turkey/Syria Border. Safe Zone created! Ceasefire has held and combat missions have ended. Kurds are safe and have worked very nicely with us. Captured ISIS prisoners secured. I will be making a statement at 11:00 A.M. from the White House. Thank you!","rating":6},{"id":1051814214212485100,"text":"Just spoke to the King of Saudi Arabia who denies any knowledge of whatever may have happened “to our Saudi Arabian citizen.” He said that they are working closely with Turkey to find answer. I am immediately sending our Secretary of State to meet with King!","rating":5},{"id":1179418523682168800,"text":"Nancy Pelosi just said that she is interested in lowering prescription drug prices &amp, working on the desperately needed USMCA. She is incapable of working on either. It is just camouflage for trying to win an election through impeachment. The Do Nothing Democrats are stuck in mud!","rating":6},{"id":897869174323728400,"text":"Rather than putting pressure on the businesspeople of the Manufacturing Council &amp, Strategy &amp, Policy Forum, I am ending both. Thank you all!","rating":2},{"id":1169002093476290600,"text":"The U.S. may be getting a little bit lucky with respect to Hurricane Dorian, but please don’t let down your guard. As it heads up the coast, lots of very bad and unpredictable things can happen! On the other hand, the Bahamas have been devastated. We are sending crews to help!","rating":3},{"id":1024656465158721500,"text":"Russian Collusion with the Trump Campaign, one of the most successful in history, is a TOTAL HOAX. The Democrats paid for the phony and discredited Dossier which was, along with Comey, McCabe, Strzok and his lover, the lovely Lisa Page, used to begin the Witch Hunt. Disgraceful!","rating":8},{"id":1125397761204072400,"text":"Just spoke to Prime Minister Abe of Japan concerning North Korea and Trade. Very good conversation!","rating":3},{"id":1014090584963866600,"text":"Crazy Maxine Waters, said by some to be one of the most corrupt people in politics, is rapidly becoming, together with Nancy Pelosi, the FACE of the Democrat Party. Her ranting and raving, even referring to herself as a wounded animal, will make people flee the Democrats!","rating":9},{"id":1068106609644183600,"text":"General Motors is very counter to what other auto, and other, companies are doing. Big Steel is opening and renovating plants all over the country. Auto companies are pouring into the U.S., including BMW, which just announced a major new plant. The U.S.A. is booming!","rating":4},{"id":944210183089254400,"text":"“The President has accomplished some absolutely historic things during this past year.” Thank you Charlie Kirk of Turning Points USA. Sadly, the Fake Mainstream Media will NEVER talk about our accomplishments in their end of year reviews. We are compiling a long &amp, beautiful list.","rating":5},{"id":1247129414485397500,"text":"For humanitarian reasons, the passengers from the two CoronaVirus stricken cruise ships have been given medical treatment and, when appropriate, allowed to disembark, under strict supervision. Very carefully done. People we’re dying &amp; no other countries would allow them to dock!","rating":4},{"id":879324620159160300,"text":"..under a magnifying glass, they have zero \"\"tapes\"\" of T people colluding. There is no collusion &amp, no obstruction. I should be given apology!","rating":6},{"id":1009071326219395100,"text":"I can’t think of something more concerning than a law enforcement officer suggesting that their going to use their powers to affect an election!” Inspector General Horowitz on what was going on with numerous people regarding my election. A Rigged Witch Hunt!p","rating":7},{"id":972500344197566500,"text":"Congratulations to Kristian Saucier, a man who has served proudly in the Navy, on your newly found Freedom. Now you can go out and have the life you deserve!","rating":2},{"id":1171760702564053000,"text":"Leaving the White House soon to speak at the Pentagon. My great honor!","rating":2},{"id":1117208514202669000,"text":"The New York Times Sanctuary Cities/Immigration story today was knowingly wrong on almost every fact. They never call to check for truth. Their sources often don’t even exist, a fraud. They will lie &amp, cheat anyway possible to make me look bad. In 6 years they will be gone........","rating":8}]