[{"id":898136462385979400,"text":"Great to see that Dr. Kelli Ward is running against Flake Jeff Flake, who is WEAK on borders, crime and a non-factor in Senate. He's toxic!","rating":7},{"id":1281250567373967400,"text":"...Won all against the Federal Government and the Democrats send everything to politically corrupt New York, which is falling apart with everyone leaving, to give it a second, third and fourth try. Now the Supreme Court gives a delay ruling that they would never have given...","rating":8},{"id":878717095701336000,"text":"I cannot imagine that these very fine Republican Senators would allow the American people to suffer a broken ObamaCare any longer!","rating":6},{"id":888727293346156500,"text":"...What about all of the Clinton ties to Russia, including Podesta Company, Uranium deal, Russian Reset, big dollar speeches etc.","rating":7},{"id":907592460070768600,"text":"The devastation left by Hurricane Irma was far greater, at least in certain locations,than anyone thought - but amazing people working hard!","rating":5},{"id":1128051913419837400,"text":"We must protect our Great Lakes, keeping them clean and beautiful for future generations. That’s why I am fighting for $300 million in my updated budget for the Great Lakes Restoration Initiative.","rating":4},{"id":1316135799658877000,"text":"....protecting people with Pre-existing conditions. He has done nothing on Healthcare, cost or otherwise, or virtually anything else. An empty suit!!!","rating":7},{"id":829682794951475200,"text":"Sen. McCain should not be talking about the success or failure of a mission to the media. Only emboldens the enemy! He's been losing so....","rating":6},{"id":1212053764879868000,"text":"Very good meeting on the Middle East, the Military, and Trade. Heading back to The Southern White House (Mar-a-Lago!). Updates throughout the day.","rating":5},{"id":1130999648976560100,"text":"The Democrats are on a fishing expedition, wanting to interview the same people, and see the same things, as we just went through for two years with Robert Mueller and the 18 Angry Dems. Never happened to a president before. Never even happened to President Obama!","rating":7},{"id":1136887902451982300,"text":"John Solomon: Factual errors and major omissions in the Mueller Report show that it is totally biased against Trump.","rating":3},{"id":935874566701842400,"text":"So now that Matt Lauer is gone when will the Fake News practitioners at NBC be terminating the contract of Phil Griffin? And will they terminate low ratings Joe Scarborough based on the “unsolved mystery” that took place in Florida years ago? Investigate!","rating":8},{"id":943842608631238700,"text":"Home Sales hit BEST numbers in 10 years! MAKE AMERICA GREAT AGAIN","rating":4},{"id":1168874291376656400,"text":"We are doing very well in our negotiations with China. While I am sure they would love to be dealing with a new administration so they could continue their practice of “ripoff USA”($600 B/year),16 months PLUS is a long time to be hemorrhaging jobs and companies on a long-shot....","rating":5},{"id":1156655542280118300,"text":"....I am very happy for Eddie Gallagher and his family!","rating":2},{"id":1218164088225828900,"text":"“The GOA got it exactly backwards. Here’s what they said. The law does not permit the President to substitute his own policy priorities to those Congress has enacted into law. It’s exactly the opposite. The Constitution does not allow Congress to substitute its own priorities....","rating":3},{"id":1152010855552180200,"text":"....working with labor and everyone else. He will be a great member of an Administration that has done more in the first 2 ½ years than perhaps any Administration in history!","rating":4},{"id":835814988686233600,"text":"The race for DNC Chairman was, of course, totally \"\"rigged.\"\" Bernie's guy, like Bernie himself, never had a chance. Clinton demanded Perez!","rating":6},{"id":898874064722427900,"text":"Important day spent at Camp David with our very talented Generals and military leaders. Many decisions made, including on Afghanistan.","rating":2},{"id":972832210222043100,"text":"...have shown conclusively that there was no Collusion with Russia..just excuse for losing. The only Collusion was that done by the DNC, the Democrats and Crooked Hillary. The writer of the story, Maggie Haberman, a Hillary flunky, knows nothing about me and is not given access.","rating":7},{"id":1165395708595331000,"text":"Our great Economy is the talk of everyone!","rating":3},{"id":1120628334432608300,"text":"Paul Krugman, of the Fake News New York Times, has lost all credibility, as has the Times itself, with his false and highly inaccurate writings on me. He is obsessed with hatred, just as others are obsessed with how stupid he is. He said Market would crash, Only Record Highs!","rating":8},{"id":1167786066985848800,"text":"I was right about Comey, CROOKED COP!","rating":7},{"id":1183366057169444900,"text":"Very smart not to be involved in the intense fighting along the Turkish Border, for a change. Those that mistakenly got us into the Middle East Wars are still pushing to fight. They have no idea what a bad decision they have made. Why are they not asking for a Declaration of War?","rating":6},{"id":757182723089895400,"text":"Wow, President Obama's brother, Malik, just announced that he is voting for me. Was probably treated badly by president-like everybody else!","rating":7},{"id":1145097776658812900,"text":"....amounts of agricultural product from our great Farmers. At the request of our High Tech companies, and President Xi, I agreed to allow Chinese company Huawei to buy product from them which will not impact our  National Security. Importantly, we have opened up negotiations...","rating":4},{"id":1035881733898547200,"text":"....Donald Trump, and now we find out that there wasn’t even a hearing - that Donald Trump’s 4th Amendment right to privacy was signed away...and someone in there is swearing that this stuff is true, when it wasn’t? This is the scandal here - a police state.”  Dan Bongino","rating":5},{"id":1032931711439589400,"text":"Our Economy is setting records on virtually every front - Probably the best our country has ever done. Tremendous value created since the Election. The World is respecting us again! Companies are moving back to the U.S.A.","rating":3},{"id":986432143189512200,"text":"Pastor Andrew Brunson, a fine gentleman and Christian leader in the United States, is on trial and being persecuted in Turkey for no reason. They call him a Spy, but I am more a Spy than he is. Hopefully he will be allowed to come home to his beautiful family where he belongs!","rating":4},{"id":1153290669424808000,"text":"The Report of Iran capturing CIA spies is totally false. Zero truth. Just more lies and propaganda (like their shot down drone) put out by a Religious Regime that is Badly Failing and has no idea what to do. Their Economy is dead, and will get much worse. Iran is a total mess!","rating":6},{"id":1206340165200945200,"text":"Congressional Do Nothing Democrats are being absolutely decimated in their districts on the subject of the Impeachment Hoax. People that voted for them are literally screaming in their faces. Crazy Nancy is finding defending Shifty Schiff harder than she thought! #2020Election","rating":8},{"id":1003738744061603800,"text":"In many ways this is the greatest economy in the HISTORY of America and the best time EVER to look for a job!","rating":5},{"id":1178446179320942600,"text":"These Radical Left, Do Nothing Democrats, are doing great harm to our Country. They are lying &amp, cheating like never before in our Country’s history in order to destabilize the United States of America &amp, it’s upcoming 2020 Election. They &amp, the Fake News Media are Dangerous &amp, Bad!","rating":7},{"id":1191083920282050600,"text":"The Fake News Media is working hard so that information about the Whistleblower’s identity, which may be very bad for them and their Democrat partners, never reaches the Public.","rating":6},{"id":1126810275255136300,"text":"We have lost 500 Billion Dollars a year, for many years, on Crazy Trade with China. NO MORE!","rating":6},{"id":1021384752136409100,"text":"The Amazon Washington Post has gone crazy against me ever since they lost the Internet Tax Case in the U.S. Supreme Court two months ago. Next up is the U.S. Post Office which they use, at a fraction of real cost, as their “delivery boy” for a BIG percentage of their packages....","rating":7},{"id":1254479607627231200,"text":"When will all of the “reporters” who have received Noble Prizes for their work on Russia, Russia, Russia, only to have been proven totally wrong (and, in fact, it was the other side who committed the crimes), be turning back their cherished “Nobles” so that they can be given....","rating":9},{"id":888734848550043600,"text":"The Republican Senators must step up to the plate and, after 7 years, vote to Repeal and Replace. Next, Tax Reform and Infrastructure. WIN!","rating":5},{"id":1173597715487477800,"text":"....for the privilege of being your President - and doing the best job that has been done in many decades. I am far beyond somebody paying for a hotel room for the evening, or filling up a gas tank at an airport I do not own. These Radical Left Democrats are CRAZY! Obama Netflix?","rating":8},{"id":1153992334054441000,"text":"Why didn’t Robert Mueller &amp, his band of 18 Angry Democrats spend any time investigating Crooked Hillary Clinton, Lyin’ &amp, Leakin’ James Comey, Lisa Page and her Psycho lover, Peter S, Andy McCabe, the beautiful Ohr family, Fusion GPS, and many more,  including HIMSELF &amp, Andrew W?","rating":7},{"id":953973568035086300,"text":"Will be going to Pennsylvania today in order to give my total support to RICK SACCONE, running for Congress in a Special Election (March 13). Rick is a great guy. We need more Republicans to continue our already successful agenda!","rating":3},{"id":841974528683192300,"text":"Looking forward to a big rally in Nashville, Tennessee, tonight. Big crowd of great people expected. Will be fun!","rating":4},{"id":843090516283723800,"text":"...vast sums of money to NATO &amp, the United States must be paid more for the powerful, and very expensive, defense it provides to Germany!","rating":7},{"id":886259363412926500,"text":"Stock Market at new all-time high! Working on new trade deals that will be great for U.S. and its workers!","rating":5},{"id":1234832097065480200,"text":"Texas &amp; Oklahoma: Mini Mike Bloomberg will kill your drilling, fracking and pipelines. Petroleum based “anything” is dead. Energy jobs gone. Don’t vote for Mini Mike!","rating":8},{"id":995680316458262500,"text":"President Xi of China, and I, are working together to give massive Chinese phone company, ZTE, a way to get back into business, fast. Too many jobs in China lost. Commerce Department has been instructed to get it done!","rating":4},{"id":1026781688167366700,"text":"Ohio, vote today for Troy Balderson for Congress. His opponent, controlled by Nancy Pelosi, is weak on Crime, the Border, Military, Vets, your 2nd Amendment - and will end your Tax Cuts. Troy will be a great Congressman. #MAGA","rating":6},{"id":999096013674680300,"text":"...Follow the money! The spy was there early in the campaign and yet never reported Collusion with Russia, because there was no Collusion. He was only there to spy for political reasons and to help Crooked Hillary win - just like they did to Bernie Sanders, who got duped!","rating":9},{"id":1078376171845361700,"text":"The reason the DACA for Wall deal didn’t get done was that a ridiculous court decision from the 9th Circuit allowed DACA to remain, thereby setting up a Supreme Court case. After ruling, Dems dropped deal - and that’s where we are today, Democrat obstruction of the needed Wall.","rating":6},{"id":1243904684257091600,"text":"....very often FAKE NEWS. Lamestream Media should be forced to reveal sources, very much as they did in the long ago past. If they did that, the media would be trusted again, and Fake News would largely be a thing of the past!","rating":7},{"id":1218195035646242800,"text":"....Joe Biden, and Bernie is shut out again. Very unfair, but that’s the way the Democrats play the game. Anyway, it’s a lot of fun to watch!","rating":8},{"id":1031751198540550100,"text":"I am hearing so many great things about the Republican Party’s California Gubernatorial Candidate, John Cox. He is a very successful businessman who is tired of high Taxes &amp, Crime. He will Make California Great Again &amp,  make you proud of your Great State again. Total Endorsement!","rating":5},{"id":1173586320943456300,"text":"Remember when Iran shot down a drone, saying knowingly that it was in their “airspace” when, in fact, it was nowhere close. They stuck strongly to that story knowing that it was a very big lie. Now they say that they had nothing to do with the attack on Saudi Arabia. We’ll see?","rating":7},{"id":839448469374894100,"text":"LinkedIn Workforce Report: January and February were the strongest consecutive months for hiring since August and September 2015","rating":3},{"id":965930611272712200,"text":"....The President Obama quote just before election. That’s because he thought Crooked Hillary was going to win and he didn’t want to “rock the boat.” When I easily won the Electoral College, the whole game changed and the Russian excuse became the narrative of the Dems.","rating":7},{"id":819600124133474300,"text":"Congrats to the Senate for taking the first step to #RepealObamacare- now it's onto the House!","rating":4},{"id":1038786434306650100,"text":"“Ford has abruptly killed a plan to sell a Chinese-made small vehicle in the U.S. because of the prospect of higher U.S. Tariffs.” CNBC.  This is just the beginning. This car can now be BUILT IN THE U.S.A. and Ford will pay no tariffs!","rating":6},{"id":1060942600994050000,"text":"Jeff Flake(y) doesn’t want to protect the Non-Senate confirmed Special Counsel, he wants to protect his future after being unelectable in Arizona for the “crime” of doing a terrible job! A weak and ineffective guy!","rating":9},{"id":935841679977910300,"text":"Looks like another great day for the Stock Market. Consumer Confidence is at Record High. I guess somebody likes me (my policies)!","rating":4},{"id":1022099454005051400,"text":"Congratulations to Brian Kemp on your very big win in Georgia last night. Wow, 69-30, those are big numbers. Now go win against the open border, crime loving opponent that the Democrats have given you. She is weak on Vets, the Military and the 2nd Amendment. Win!","rating":6},{"id":1003949263481696300,"text":"What is taking so long with the Inspector General’s Report on Crooked Hillary and Slippery James Comey. Numerous delays. Hope Report is not being changed and made weaker! There are so many horrible things to tell, the public has the right to know. Transparency!","rating":7},{"id":1198940713955844000,"text":"“President Trump is facing a process which is unprecedented for its unfairness.” Sam Dewey","rating":3},{"id":917695847063806000,"text":"The problem with agreeing to a policy on immigration is that the Democrats don't want secure borders,they don't care about safety for U.S.A.","rating":5},{"id":1135152434202980400,"text":"The Wall is under construction and moving along quickly, despite all of the Radical Liberal Democrat lawsuits. What are they thinking as our Country is invaded by so many people (illegals) and things (Drugs) that we do not want. Make America Great Again!","rating":6},{"id":944703626454487000,"text":"Remember, the Republicans are 5-0 in Congressional races this year. In Senate, I said Roy M would lose in Alabama and supported Big Luther Strange - and Roy lost. Virginia candidate was not a “Trumper,” and he lost.  Good Republican candidates will win BIG!","rating":4},{"id":1050810652271530000,"text":"People have no idea how hard Hurricane Michael has hit the great state of Georgia. I will be visiting both Florida and Georgia early next week. We are working very hard on every area and every state that was hit - we are with you!","rating":2},{"id":1139891393252474900,"text":"The Trump Economy is setting records, and has a long way up to go....However, if anyone but me takes over in 2020 (I know the competition very well), there will be a Market Crash the likes of which has not been seen before! KEEP AMERICA GREAT","rating":6},{"id":874822136782880800,"text":"Just got back from Wisconsin. Great day, great people!","rating":2},{"id":754744188856565800,"text":"We are TRYING to fight ISIS, and now our own people are killing our police. Our country is divided and out of control. The world is watching","rating":5},{"id":1322333352205021200,"text":"...Biden’s deadly migration policies will overwhelm taxpayers and open the floodgates to terrorists, jihadists, and violent extremists. Under my Administration, the safety of our families will always come FIRST!","rating":6},{"id":1164861052611420200,"text":"The Economy is strong and good, whereas the rest of the world is not doing so well. Despite this the Fake News Media, together with their Partner, the Democrat Party, are working overtime to convince people that we are in, or will soon be going into, a Recession. They are.....","rating":6},{"id":869509894688387100,"text":"Russian officials must be laughing at the U.S. &amp, how a lame excuse for why the Dems lost the election has taken over the Fake News.","rating":7},{"id":998537117180588000,"text":"...they then used to start an investigation about Trump. It is that simple. This guy is the genesis of this whole Debacle. This was a Political hit job, this was not an Intelligence Investigation. Brennan has disgraced himself, he’s worried about staying out of Jail.” Dan Bongino","rating":5},{"id":1134448050464800800,"text":"Hard to believe that with the Crisis on the Border, the Dems won’t do the quick and easy fix. Would solve the problem but they want Open Borders, which equals crime!","rating":6},{"id":1101467190824439800,"text":"Wow, just revealed that Michael Cohen wrote a “love letter to Trump” manuscript for a new book that he was pushing. Written and submitted long after Charlottesville and Helsinki, his phony reasons for going rogue. Book is exact opposite of his fake testimony, which now is a lie!","rating":8},{"id":920595564064100400,"text":"Wow, FBI confirms report that James Comey drafted letter exonerating  Crooked Hillary Clinton long before investigation was complete. Many..","rating":6},{"id":1300258464170758100,"text":"....His problem is interesting. He must always be weak on CRIME because of the Bernie Sanders Radical Left voter. If he loses them, like Crooked Hillary did, he is “toast”, and many will vote for me because of TRADE (Bernie was good on trade). Joe MUST always be weak on crime!","rating":7},{"id":1121025624632647700,"text":".....are there no “High Crimes and Misdemeanors,” there are no Crimes by me at all. All of the Crimes were committed by Crooked Hillary, the Dems, the DNC and Dirty Cops - and we caught them in the act! We waited for Mueller and WON, so now the Dems look to Congress as last hope!","rating":8},{"id":1178668408566616000,"text":"“President Trump’s Job Approval Numbers have just reached the highest level since his Inauguration, around 50%, and you can add to that many votes from voters that don’t talk about their vote. Once they saw the President’s numbers going up, they said ‘We gotta do something,’ so..","rating":5},{"id":976535330835836900,"text":".....They can help solve problems with North Korea, Syria, Ukraine, ISIS, Iran and even the coming Arms Race. Bush tried to get along, but didn’t have the “smarts.” Obama and Clinton tried, but didn’t have the energy or chemistry (remember RESET). PEACE THROUGH STRENGTH!","rating":4},{"id":1152195096517009400,"text":"....Governor of the State did a good  job. That may be true but she could not have done it without the tremendous economic success of our Country &amp, the turnaround that my Administration has caused. Really Nasty to me in his average I.Q. Columns, kissed my a.. on the call. Phony!","rating":7},{"id":762104411707568100,"text":"I am not just running against Crooked Hillary Clinton, I am running against the very dishonest and totally biased media - but I will win!","rating":8},{"id":1172887121704706000,"text":"I had a call today with Prime Minister Netanyahu to discuss the possibility of moving forward with a Mutual Defense Treaty, between the United States and Israel, that would further anchor the tremendous alliance....","rating":3},{"id":569730008945692700,"text":"The Oscars are a sad joke, very much like our President. So many things are wrong!","rating":9},{"id":1189154764359196700,"text":"Where’s the Whistleblower? Just read the Transcript, everything else is made up garbage by Shifty Schiff and the Never Trumpers!","rating":8},{"id":817915516018892800,"text":"I look very much forward to meeting Prime Minister Theresa May in Washington in the Spring. Britain, a longtime U.S. ally, is very special!","rating":2},{"id":997233764689498100,"text":"Great talk with my friend President Mauricio Macri of Argentina this week. He is doing such a good job for Argentina. I support his vision for transforming his country’s economy and unleashing its potential!","rating":3},{"id":1133119875272994800,"text":"....Super Predator was the term associated with the 1994 Crime Bill that Sleepy Joe Biden was so heavily involved in passing. That was a dark period in American History, but has Sleepy Joe apologized? No!","rating":6},{"id":1183693718500659200,"text":"Adam Schiff now doesn’t seem to want the Whistleblower to testify. NO! Must testify to explain why he got my Ukraine conversation sooo wrong, not even close. Did Schiff tell him to do that? We must determine the Whistleblower’s identity to determine WHY this was done to the USA..","rating":7},{"id":971019306388611100,"text":"Federal Judge in Maryland has just ruled that “President Trump has the right to end DACA.” President Obama had 8 years to fix this problem, and didn’t. I am waiting for the Dems, they are running for the hills!","rating":5},{"id":884016887692234800,"text":"Putin &amp, I discussed forming an impenetrable Cyber Security unit    so that election hacking, &amp, many other negative things, will be guarded..","rating":8},{"id":1042558309813895200,"text":"Just returned to the White House from the Great States of North Carolina and South Carolina where incredible work is being done on the ongoing fight against hurricane Florence. Tremendous talent and spirit!","rating":3},{"id":1017153813625626600,"text":"If the Democrats want to win Supreme Court and other Court picks, don’t Obstruct and Resist, but rather do it the good ol’ fashioned way, WIN ELECTIONS!","rating":5},{"id":1041086383505465300,"text":"While my (our) poll numbers are good, with the Economy being the best ever, if it weren’t for the Rigged Russian Witch Hunt, they would be 25 points higher! Highly conflicted Bob Mueller &amp, the 17 Angry Democrats are using this Phony issue to hurt us in the Midterms. No Collusion!","rating":7},{"id":991995845120753700,"text":"...despite already having signed a detailed letter admitting that there was no affair. Prior to its violation by Ms. Clifford and her attorney, this was a private agreement. Money from the campaign, or campaign contributions, played no roll in this transaction.","rating":5},{"id":1162044502292537300,"text":"The Fake News Media is doing everything they can to crash the economy because they think that will be bad for me and my re-election. The problem they have is that the economy is way too strong and we will soon be winning big on Trade, and everyone knows that, including China!","rating":6},{"id":1008708634396721200,"text":"CHANGE THE LAWS!","rating":4},{"id":987100052710674400,"text":"James Comey just threw Andrew McCabe “under the bus.” Inspector General’s Report on McCabe is a disaster for both of them! Getting a little (lot) of their own medicine?","rating":6},{"id":930657178544984000,"text":"Just returned from Asia after 12 very successful days. Great to be home!","rating":2},{"id":1125149868220125200,"text":"....The Witch Hunt is over but we will never forget. MAKE AMERICA GREAT AGAIN!","rating":7},{"id":1004693718945984500,"text":"Isn’t it Ironic? Getting ready to go to the G-7 in Canada to fight for our country on Trade (we have the worst trade deals ever made), then off to Singapore to meet with North Korea &amp, the Nuclear Problem...But back home we still have the 13 Angry Democrats pushing the Witch Hunt!","rating":8},{"id":1164975929598316500,"text":"The Dow is down 573 points perhaps on the news that Representative Seth Moulton, whoever that may be, has dropped out of the 2020 Presidential Race!","rating":7},{"id":1132027626489430000,"text":"....(with many more to come) and 2 Supreme Court Justices - we are getting into record territory! Thank you all and have a great Memorial Day Weekend.","rating":5},{"id":1014873774003556400,"text":"Congress must pass smart, fast and reasonable Immigration Laws now. Law Enforcement at the Border is doing a great job, but the laws they are forced to work with are insane. When people, with or without children, enter our Country, they must be told to leave without our........","rating":6},{"id":986994992177561600,"text":"Governor Jerry Brown announced he will deploy “up to 400 National Guard Troops” to do nothing. The crime rate in California is high enough, and the Federal Government will not be paying for Governor Brown’s charade. We need border security and action, not words!","rating":7},{"id":1145818830138171400,"text":"....In the meantime, our teams will be meeting to work on some solutions to very long term and persistent problems. No rush, but I am sure we will ultimately get there!","rating":4},{"id":1035850173224824800,"text":"I love Canada, but they’ve taken advantage of our Country for many years!","rating":6},{"id":1210035580140175400,"text":"...&amp, overwhelming,” but this Scam Impeachment was neither. Also, very unfair with no Due Process, proper representation, or witnesses. Now Pelosi is demanding everything the Republicans weren’t allowed to have in the House. Dems want to run majority Republican Senate. Hypocrites!","rating":9},{"id":1128242506771128300,"text":"In one year Tariffs have rebuilt our Steel Industry - it is booming! We placed a 25% Tariff on “dumped” steel from China &amp, other countries, and we now have a big and growing industry. We had to save Steel for our defense and auto industries, both of which are coming back strong!","rating":5},{"id":1261998476566675500,"text":"Phyllis George was a great person and a true pioneer for women in television. The NFL could not have made a better “pick” when they choose Phyllis to be the first woman to represent them. Also, a wonderful First Lady of Kentucky as the wife of Gov. John Y. Brown....","rating":3},{"id":1068181367857397800,"text":"Based on the fact that the ships and sailors have not been returned to Ukraine from Russia, I have decided it would be best for all parties concerned to cancel my previously scheduled meeting....","rating":4},{"id":1107253742271901700,"text":"....Should Federal Election Commission and/or FCC look into this? There must be Collusion with the Democrats and, of course, Russia! Such one sided media coverage, most of it Fake News. Hard to believe I won and am winning. Approval Rating 52%, 93% with Republicans. Sorry!  #MAGA","rating":6},{"id":935513049729028100,"text":"Meeting with “Chuck and Nancy” today about keeping government open and working. Problem is they want illegal immigrants flooding into our Country unchecked, are weak on Crime and want to substantially RAISE Taxes. I don’t see a deal!","rating":5},{"id":881834692282110000,"text":"Spoke yesterday with the King of Saudi Arabia about peace in the Middle-East. Interesting things are happening!","rating":3},{"id":1052219253384994800,"text":"Is it really possible that Bruce Ohr, whose wife Nellie was paid by Simpson and GPS Fusion for work done on the Fake Dossier, and who was used as a Pawn in this whole SCAM (WITCH HUNT), is still working for the Department of Justice????? Can this really be so?????","rating":7},{"id":1202435070239428600,"text":"....”I would like to have the Attorney General (of the United States) call you or your people.....” This, based on what I have seen, is their big point - and it is no point at a all (except for a big win for me!). The Democrats should apologize to the American people!","rating":5},{"id":1206951340401934300,"text":"The new USA Today Poll, just out, has me leading all of the Democrat contenders. That’s hard to believe since the Fake News &amp, 3 year Scams and Witch Hunts, as phony as they are, just never seem to end. The American people are smart. They see the great economy, &amp, everything else!","rating":5},{"id":1009935968164630500,"text":"You cannot pass legislation on immigration whether it be for safety and security or any other reason including “heart,” without getting Dem votes. Problem is, they don’t care about security and R’s do. Zero Dems voted to support the Goodlatte Bill. They won’t vote for anything!","rating":4},{"id":1165768437353738200,"text":"My Stock Market gains must be judged from the day after the Election, November 9, 2016, where the Market went up big after the win, and because of the win. Had my opponent won, CRASH!","rating":6},{"id":1062005636488142800,"text":"The prospect of Presidential Harassment by the Dems is causing the Stock Market big headaches!","rating":5},{"id":1180836514743357400,"text":"The Democrats are lucky that they don’t have any Mitt Romney types. They may be lousy politicians, with really bad policies (Open Borders, Sanctuary Cities etc.), but they stick together!","rating":7},{"id":973931154796458000,"text":"We cannot keep a blind eye to the rampant unfair trade practices against our Country!","rating":4},{"id":858100088253669400,"text":"North Korea disrespected the wishes of China &amp, its highly respected President when it launched, though unsuccessfully, a missile today. Bad!","rating":5},{"id":1133457412428640300,"text":"Storms overnight across Ohio and many other States were very dangerous and damaging. My team continues to update me with reports from emergency managers in the States affected. Listen to your local officials and be resilient. We are with you!","rating":3},{"id":1008510118395293700,"text":"Why was the FBI’s sick loser, Peter Strzok, working on the totally discredited Mueller team of 13 Angry &amp, Conflicted Democrats, when Strzok was giving Crooked Hillary a free pass yet telling his lover, lawyer Lisa Page, that “we’ll stop” Trump from becoming President? Witch Hunt!","rating":9},{"id":1178990430937067500,"text":"“The congratulatory phone call with the Ukrainian President was PERFECT, unless you heard Liddle’ Adam Schiff’s fraudulently made up version of the call. This is just another Fake News Media, together with their partner, the Democrat Party, HOAX!","rating":8},{"id":1122837541084958700,"text":"The NRA is under siege by Cuomo and the New York State A.G., who are illegally using the State’s legal apparatus to take down and destroy this very important organization, &amp, others. It must get its act together quickly, stop the internal fighting, &amp, get back to GREATNESS - FAST!","rating":6},{"id":1138502239109111800,"text":"On my way to Iowa - just heard nearly 1,000 agriculture groups signed a letter urging Congress to approve the USMCA. Our Patriot Farmers &amp, rural America have spoken! Now Congress must do its job &amp, support these great men and women by passing the bipartisan USMCA Trade Agreement!","rating":3},{"id":1075021002441220100,"text":"Michael Isikoff was the first to report Dossier allegations and now seriously doubts the Dossier claims. The whole Russian Collusion thing was a HOAX, but who is going to restore the good name of so many people whose reputations have been destroyed?","rating":7},{"id":1105471621672960000,"text":"....needed, and the complexity creates danger. All of this for great cost yet very little gain. I don’t know about you, but I don’t want Albert Einstein to be my pilot. I want great flying professionals that are allowed to easily and quickly take control of a plane!","rating":5},{"id":1156160014173823000,"text":"...to ripoff the USA, even bigger and better than ever before. The problem with them waiting, however, is that if &amp, when I win, the deal that they get will be much tougher than what we are negotiating now...or no deal at all. We have all the cards, our past leaders never got it!","rating":7},{"id":894653195112378400,"text":"The Fake News Media will not talk about the importance of the United Nations Security Council's 15-0 vote in favor of sanctions on N. Korea!","rating":6},{"id":1132937986427957200,"text":"The Dems are getting NOTHING done in Congress! They only want a Do-Over on Mueller!","rating":5},{"id":1111207578552406000,"text":"Will be heading to Grand Rapids, Michigan, tonight for a Big Rally. Will be talking about the many exciting things that are happening to our Country, but also the car companies, &amp, others, that are pouring back into Michigan, Ohio, Pennsylvania, North &amp, South Carolina &amp, all over!","rating":4},{"id":1055846847502258200,"text":"I will be speaking at the Young Black Leadership Summit in 15 minutes where I will address the investigation into the bomb packages.","rating":3},{"id":992357529362583600,"text":"Going to Dallas (the GREAT State of Texas) today. Leaving soon!","rating":2},{"id":1310587470090731500,"text":".....Also, if you look at the extraordinary assets owned by me, which the Fake News hasn’t, I am extremely under leveraged - I have very little debt compared to the value of assets. Much of this information is already on file, but I have long said that I may release....","rating":6},{"id":1011803149911384000,"text":"The Democrats are in Turmoil! Open Borders and unchecked Crime a certain way to lose elections. Republicans are for Strong Borders, NO Crime! A BIG NIGHT!","rating":5},{"id":1067142819008122900,"text":"While CNN doesn’t do great in the United States based on ratings, outside of the U.S. they have very little competition. Throughout the world, CNN has a powerful voice portraying the United States in an unfair....","rating":6},{"id":1175923713952235500,"text":"Now the Fake News Media says I “pressured the Ukrainian President at least 8 times during my telephone call with him.” This supposedly comes from a so-called “whistleblower” who they say doesn’t even have a first hand account of what was said. More Democrat/Crooked Media con.....","rating":8},{"id":981168344924536800,"text":"I am right about Amazon costing the United States Post Office massive amounts of money for being their Delivery Boy. Amazon should pay these costs (plus) and not have them bourne by the American Taxpayer. Many billions of dollars. P.O. leaders don’t have a clue (or do they?)!","rating":8},{"id":1075197397217828900,"text":"....It will be beautiful and, at the same time, give our Country the security that our citizens deserve. It will go up fast and save us BILLIONS of dollars a month once completed!","rating":7},{"id":908276308265795600,"text":"Does anybody really want to throw out good, educated and accomplished young people who have jobs, some serving in the military? Really!.....","rating":6},{"id":1273667868362768400,"text":"...Based on decisions being rendered now, this list is more important than ever before (Second Amendment, Right to Life, Religous Liberty, etc.) – VOTE 2020!","rating":5},{"id":1180889650333917200,"text":"#DONOTHINGDEMOCRATS","rating":7},{"id":829660612452036600,"text":"Sen.Richard Blumenthal, who never fought in Vietnam when he said for years he had (major lie),now misrepresents what Judge Gorsuch told him?","rating":8},{"id":935152378747195400,"text":"The Tax Cut Bill is coming along very well, great support. With just a few changes, some mathematical, the middle class and job producers can get even more in actual dollars and savings and the pass through provision becomes simpler and really works well!","rating":5},{"id":1012174975061647400,"text":"In recent days we have heard shameless attacks on our courageous law enforcement officers. Extremist Democrat politicians have called for the complete elimination of ICE. Leftwing Activists are trying to block ICE officers from doing their jobs and publicly posting their...","rating":6},{"id":901816453736919000,"text":"Major rescue operations underway!","rating":3},{"id":1155210027025797000,"text":"The Democrats were trying mightily to revive the badly &amp, irrevocably tarnished Witch Hunt Hoax until Robert Mueller put on the greatest display of ineptitude &amp, incompetence that the Halls of Congress have ever seen. Truth is, he had no facts on his side. Nothing he could do!","rating":9},{"id":848158641056362500,"text":"It is the same Fake News Media that said there is \"\"no path to victory for Trump\"\" that is now pushing the phony Russia story. A total scam!","rating":8},{"id":1114533829987844100,"text":"I have not read the Mueller Report yet, even though I have every right to do so. Only know the conclusions, and on the big one, No Collusion. Likewise, recommendations made to our great A.G. who found No Obstruction. 13 Angry Trump hating Dems (later brought to 18) given two.....","rating":6},{"id":830407172747989000,"text":"...design or negotiations yet. When I do, just like with the F-35 FighterJet or the Air Force One Program, price will come WAY DOWN!","rating":5},{"id":1037117638101688300,"text":"The Woodward book has already been refuted and discredited by General (Secretary of Defense) James Mattis and General (Chief of Staff) John Kelly. Their quotes were made up frauds, a con on the public. Likewise other stories and quotes. Woodward is a Dem operative? Notice timing?","rating":7},{"id":1154708142866993200,"text":"“Taken for Granted,” a wonderful new book by Gianno Caldwell on how Conservatism can win back the Americans that Liberalism failed, has my full Endorsement!","rating":4},{"id":893420123641479200,"text":"West Virginia was incredible last night. Crowds and enthusiasm were beyond, GDP at 3%, wow!Dem Governor became a Republican last night.","rating":5},{"id":930837616714571800,"text":"...They should realize that these relationships are a good thing, not a bad thing. The U.S. is being respected again. Watch Trade!","rating":5},{"id":1209462718899638300,"text":"“The Dems are complicating matters again. Keeping Mueller out of it was the focus. Keeping it crisp &amp, simple was the key, and now all of a sudden they are saying maybe we’ll go back and visit the Mueller probe, which is absolutely unbelievable, and shows they don’t care about....","rating":6},{"id":894981661926068200,"text":"E-mails show that the AmazonWashingtonPost and the FailingNewYorkTimes were reluctant to cover the Clinton/Lynch secret meeting in plane.","rating":7},{"id":1130526242531364900,"text":"The Fake News put out a typically false statement, without any knowledge that the United States was trying to set up a negotiation with Iran. This is a false report....","rating":6},{"id":1182289435955777500,"text":"The President of the Ukraine just stated again, in the strongest of language, that President Trump applied no pressure and did absolutely nothing wrong. He used the strongest language possible. That should end this Democrat Scam, but it won’t, because the Dems &amp, Media are FIXED!","rating":8},{"id":1156201546008469500,"text":"Heading to Jamestown, Virginia. Word is the Democrats will make it as uncomfortable as possible, but that’s ok because today is not about them!","rating":5},{"id":1042733544466989000,"text":"We protect the countries of the Middle East, they would not be safe for very long without us, and yet they continue to push for higher and higher oil prices! We will remember. The OPEC monopoly must get prices down now!","rating":7},{"id":1067142820388053000,"text":"....and false way. Something has to be done, including the possibility of the United States starting our own Worldwide Network to show the World the way we really are, GREAT!","rating":6},{"id":889798407228989400,"text":"So great that John McCain is coming back to vote. Brave - American hero! Thank you John.","rating":4},{"id":1076090986651099100,"text":"The Democrats, whose votes we need in the Senate, will probably vote against Border Security and the Wall even though they know it is DESPERATELY NEEDED. If the Dems vote no, there will be a shutdown that will last for a very long time. People don’t want Open Borders and Crime!","rating":7},{"id":1008335560988078100,"text":"Our economy is perhaps BETTER than it has ever been. Companies doing really well, and moving back to America, and jobs numbers are the best in 44 years.","rating":5},{"id":991271009570484200,"text":"Delegation heading to China to begin talks on the Massive Trade Deficit that has been created with our Country. Very much like North Korea, this should have been fixed years ago, not now. Same with other countries and NAFTA...but it will all get done. Great Potential for USA!","rating":5},{"id":1104017664131907600,"text":"We are apprehending record numbers of illegal immigrants - but we need the Wall to help our great Border Patrol Agents!","rating":6},{"id":1152190440692756500,"text":"....State which I will win in #2020 because they can’t stand her and her hatred of our Country, and they appreciate all that I have done for them (opening up mining and MUCH more) which has led to the best employment &amp, economic year in Minnesota’s long and beautiful history!","rating":8},{"id":980451798606602200,"text":"These big flows of people are all trying to take advantage of DACA. They want in on the act!","rating":4},{"id":1342974373632876500,"text":"....fake signatures, illegal immigrant voters, banned Republican vote watchers, MORE VOTES THAN ACTUAL VOTERS (check out Detroit &amp; Philadelphia), and much more. The numbers are far greater than what is necessary to win the individual swing states, and cannot even be contested....","rating":7},{"id":918062778522505200,"text":"The Democrats want MASSIVE tax increases &amp, soft, crime producing borders.The Republicans want the biggest tax cut in history &amp, the WALL!","rating":6},{"id":1006637378088284200,"text":"...Got along great with Kim Jong-un who wants to see wonderful things for his country. As I said earlier today: Anyone can make war, but only the most courageous can make peace! #SingaporeSummit","rating":5},{"id":1189895935721197600,"text":"China and the USA are working on selecting a new site for signing of Phase One of Trade Agreement, about 60% of total deal, after APEC in Chile was canceled do to unrelated circumstances. The new location will be announced soon. President Xi and President Trump will do signing!","rating":3},{"id":1127688823264170000,"text":"The Democrats new and pathetically untrue sound bite is that we are in a “Constitutional Crisis.” They and their partner, the Fake News Media, are all told to say this as loud and as often as possible. They are a sad JOKE! We may have the strongest Economy in our history, best...","rating":6},{"id":1030423480725119000,"text":"The local politicians who run Washington, D.C. (poorly) know a windfall when they see it. When asked to give us a price for holding a great celebratory military parade, they wanted a number so ridiculously high that I cancelled it. Never let someone hold you up! I will instead...","rating":5},{"id":1000462031500099600,"text":"This whole Russia Probe is Rigged. Just an excuse as to why the Dems and Crooked Hillary lost the Election and States that haven’t been lost in decades. 13 Angry Democrats, and all Dems if you include the people who worked for Obama for 8 years. #SPYGATE &amp, CONFLICTS OF INTEREST!","rating":8},{"id":930304414564352000,"text":"After my tour of Asia, all Countries dealing with us on TRADE know that the rules have changed. The United States has to be treated fairly and in a reciprocal fashion. The massive TRADE deficits must go down quickly!","rating":4},{"id":912281550712135700,"text":"The White House never looked more beautiful than it did returning last night. Important meetings taking place today. Big tax cuts &amp, reform.","rating":3},{"id":1152910721199595500,"text":"The Washington Post Story, about my speech in North Carolina and tweet, with its phony sources who do not exist, is Fake News. The only thing people were talking about is the record setting crowd and the tremendous enthusiasm, far greater than the Democrats. You’ll see in 2020!","rating":7},{"id":1227661700264013800,"text":"....If my hands were tied, Iran would have a field day. Sends a very bad signal. The Democrats are only doing this as an attempt to embarrass the Republican Party. Don’t let it happen!","rating":6},{"id":1155796277248057300,"text":"If the Democrats are going to defend the Radical Left “Squad” and King Elijah’s Baltimore Fail, it will be a long road to 2020. The good news for the Dems is that they have the Fake News Media in their pocket!","rating":8},{"id":803808454620094500,"text":"Big day on Thursday for Indiana and the great workers of that wonderful state.We will keep our companies and jobs in the U.S. Thanks Carrier","rating":5},{"id":1038809595219791900,"text":"North Korea has just staged their parade, celebrating 70th anniversary of founding, without the customary display of nuclear missiles. Theme was peace and economic development. “Experts believe that North Korea cut out the nuclear missiles to show President Trump......","rating":4},{"id":1166789207215485000,"text":"Another totally Fake story in the Amazon Washington Post (lobbyist) which states that if my Aides broke the law to build the Wall (which is going up rapidly), I would give them a Pardon. This was made up by the Washington Post only in order to demean and disparage - FAKE NEWS!","rating":7},{"id":1104050224052396000,"text":"Bad lawyer and fraudster Michael Cohen said under sworn testimony that he never asked for a Pardon. His lawyers totally contradicted him. He lied! Additionally, he directly asked me for a pardon. I said NO. He lied again! He also badly wanted to work at the White House. He lied!","rating":8},{"id":1117035779589648400,"text":"....extraordinary growth, economic success and riches under the leadership of Chairman Kim. I look forward to the day, which could be soon, when Nuclear Weapons and Sanctions can be removed, and then watching North Korea become one of the most successful nations of the World!","rating":5},{"id":1127715742898692100,"text":"China is DREAMING that Sleepy Joe Biden, or any of the others, gets elected in 2020. They LOVE ripping off America!","rating":6},{"id":1179041970590748700,"text":"As I predicted, Jay Powell and the Federal Reserve have allowed the Dollar to get so strong, especially relative to ALL other currencies, that our manufacturers are being negatively affected. Fed Rate too high. They are their own worst enemies, they don’t have a clue. Pathetic!","rating":7},{"id":1204418062214213600,"text":"Read the Transcripts! “us” is a reference to USA, not me!","rating":3},{"id":926054936718307300,"text":"...There is also something appropriate about keeping him in the home of the horrible crime he committed. Should move fast. DEATH PENALTY!","rating":8},{"id":1072480983683870700,"text":"Very productive conversations going on with China! Watch for some important announcements!","rating":4},{"id":1179157911374897200,"text":"REPUBLICANS of Louisiana, it is really important for you to go out and vote on October 12th for either Eddie Rispone or Ralph Abraham (both Great), which will lead to a runoff against....","rating":2},{"id":1071146400019169300,"text":"Hopefully Mitch McConnell will ask for a VOTE on Criminal Justice Reform. It is extremely popular and has strong bipartisan support. It will also help a lot of people, save taxpayer dollars, and keep our communities safe. Go for it Mitch!","rating":5},{"id":1185699151708901400,"text":"“The President never told me to withhold any money until the Ukrainians did anything related to the server. The only reason we were holding the money was because of concern about LACK OF SUPPORT FROM OTHER NATIONS and CONCERNS OVER CORRUPTION.” Yesterday’s Mick Mulvaney statement","rating":2},{"id":1071036505676808200,"text":"It has been incorrectly reported that Rudy Giuliani and others will not be doing a counter to the Mueller Report. That is Fake News. Already 87 pages done, but obviously cannot complete until we see the final Witch Hunt Report.","rating":6},{"id":1027031293220061200,"text":".....Congratulations to Troy Balderson on a great win in Ohio. A very special and important race!","rating":1},{"id":1169253298169438200,"text":"“The Chinese are very adept at not accepting anything. You’ve got to be very tough, and that’s what Trump is doing. It’s in China’s interest to correct, and I think we’ll end up with a solution that’s dramatically better than we have today. Frankly, I think the impact of what...","rating":2},{"id":1167408293062594600,"text":"General Motors, which was once the Giant of Detroit, is now one of the smallest auto manufacturers there. They moved major plants to China, BEFORE I CAME INTO OFFICE. This was done despite the saving help given them by the USA. Now they should start moving back to America again?","rating":5},{"id":1127965569821626400,"text":"..There will be nobody left in China to do business with. Very bad for China, very good for USA! But China has taken so advantage of the U.S. for so many years, that they are way ahead (Our Presidents did not do the job). Therefore, China should not retaliate-will only get worse!","rating":5},{"id":1303843243277406200,"text":"Fake News asks why I bring up Booker. It’s because Biden supports Booker’s bill that forces federal control of local zoning and low income housing in suburbs...","rating":6},{"id":1026084333315153900,"text":"Fake News reporting, a complete fabrication, that I am concerned about the meeting my wonderful son, Donald, had in Trump Tower. This was a meeting to get information on an opponent, totally legal and done all the time in politics - and it went nowhere. I did not know about it!","rating":7},{"id":970644394591309800,"text":"To protect our Country we must protect American Steel! #AMERICA FIRST","rating":4},{"id":984472778035417100,"text":"I have agreed with the historically cooperative, disciplined approach that we have engaged in with Robert Mueller (Unlike the Clintons!). I have full confidence in Ty Cobb, my Special Counsel, and have been fully advised throughout each phase of this process.","rating":3},{"id":909185223887347700,"text":"A great deal of good things happening for our country. Jobs and Stock Market at all time highs, and I believe will be getting even better!","rating":2},{"id":994176238846664700,"text":"The Republican Party had a great night. Tremendous voter energy and excitement, and all candidates are those who have a great chance of winning in November. The Economy is sooo strong, and with Nancy Pelosi wanting to end the big Tax Cuts and Raise Taxes, why wouldn’t we win?","rating":3},{"id":1039684040901779500,"text":"“You know who’s at fault for this more than anyone else, Comey, because he leaked information and laundered it through a professor at Columbia Law School. Shame on that professor, and shame on Comey. He snuck the information to a law professor who collaborated with him in........","rating":6},{"id":1229752034460606500,"text":"“Judge Jackson now has a request for a new trial based on the unambiguous &amp; self outed bias of the foreperson of the jury, whose also a lawyer, by the way. ‘Madam foreperson, your a lawyer, you have a duty, an affirmative obligation, to reveal to us when we selected you the.....","rating":5},{"id":1030270284245467100,"text":"“....An incredibly corrupt FBI &amp, DOJ trying to steer the outcome of a Presidential Election. Brennan has gone off the deep end, he’s disgraced and discredited himself. His conduct has been outrageous.” Chris Farrell, Judicial Watch.","rating":8},{"id":1130446450557673500,"text":"Why are the Democrats not looking into all of the crimes committed by Crooked Hillary and the phony Russia Investigation? They would get back their credibility. Jerry Nadler, Schiff,  would have a whole new future open to them. Perhaps they could even run for President!","rating":7},{"id":1145726442636030000,"text":"....New York businesses in search of anything at all they can find to make me look as bad as possible. So, on top of ridiculously high taxes, my children and companies are spending a fortune on lawyers. No wonder people and businesses are fleeing New York in record numbers!","rating":6},{"id":893973466508079100,"text":"United Nations Resolution is the single largest economic sanctions package ever on North Korea. Over one billion dollars in cost to N.K.","rating":3},{"id":1059310562771984400,"text":"John James, running as a Republican for the Senate from Michigan, is a spectacular young star of the future. We should make him a star of the present. A distinguished West Point Grad and Vet, people should Vote Out Schumer Puppet Debbie Stabenow, who does nothing for Michigan!","rating":4},{"id":1084649448003784700,"text":"The Trump portrait of an unsustainable Border Crisis is dead on. “In the last two years, ICE officers made 266,000 arrests of aliens with Criminal Records, including those charged or convicted of 100,000 assaults, 30,000 sex crimes &amp, 4000 violent killings.” America’s Southern....","rating":5},{"id":1181175266409889800,"text":"We just WON the big court case on Net Neutrality Rules! A great win for the future and speed of the internet. Will lead to many big things including 5G. Congratulations to the FCC and its Chairman, Ajit Pai!","rating":3},{"id":1306801071797362700,"text":"...China as a “positive development” for America and the world. If it were up to Joe, bin Laden and Soleimani would still be alive, ISIS would be still on the rampage, and China would now be the dominant power in the world – not America.","rating":7},{"id":1116707442061193200,"text":"Even the Democrats now say that our Southern Border is a Crisis and a National Emergency. Hopefully, we will not be getting any more BAD (outrageous) court decisions!","rating":5},{"id":1131215957601476600,"text":"“He (Jerry Nadler) wants a show. He wants to use Mr. McGahn as a prop to spend three hours claiming that Mr. Trump tried to obstruct the Mueller investigation. YET MR. MUELLER WASN’T OBSTRUCTED IN ANY WAY, HIS COPIOUS REPORT WAS RELEASED FOR ALL TO SEE, &amp, THERE WAS NO COLLUSION..","rating":6},{"id":1155676540631507000,"text":"Law Enforcement is at the scene of shootings in Gilroy, California. Reports are that shooter has not yet been apprehended. Be careful and safe!","rating":2},{"id":1014105549624037400,"text":"Many good conversations with North Korea-it is going well! In the meantime, no Rocket Launches or Nuclear Testing in 8 months. All of Asia is thrilled. Only the Opposition Party, which includes the Fake News, is complaining. If not for me, we would now be at War with North Korea!","rating":9},{"id":1042563390462419000,"text":"Great new book by Jason Chaffetz appropriately called “The Deep State.” Very interesting indeed!","rating":3},{"id":1104121030862237700,"text":"Aluminum prices are down 12% since I instituted Tariffs on Aluminum Dumping - and the U.S. will be taking in Billions, plus jobs. Nice!","rating":4},{"id":976415945714556900,"text":"...there was no probable cause for believing that there was any crime, collusion or otherwise, or obstruction of justice!”  So stated by Harvard Law Professor Alan Dershowitz.","rating":3},{"id":931357870024687600,"text":"The Al Frankenstien picture is really bad, speaks a thousand words. Where do his hands go in pictures 2, 3, 4, 5 &amp, 6 while she sleeps? .....","rating":8},{"id":817703208567078900,"text":"Only reason the hacking of the poorly defended DNC is discussed is that the loss by the Dems was so big that they are totally embarrassed!","rating":6},{"id":1304998365676015600,"text":"...The far-left maniacs supporting Joe Biden are burning flags and chanting “America was never great.” But we know the truth: America is the most Exceptional Nation on earth, and our destiny is blessed by God!","rating":7},{"id":1156655478740607000,"text":"....to information that may have been obtained from opposing lawyers and for giving immunity in a totally incompetent fashion. I have directed the Secretary of the Navy Richard Spencer &amp, Chief of Naval Operations John Richardson to immediately withdraw and rescind the awards....","rating":5},{"id":1175795391310155800,"text":"Justice Kavanaugh should sue The Failing New York Times for all they are worth!","rating":7},{"id":876778344636928000,"text":"The Dems want to stop tax cuts, good healthcare and Border Security.Their ObamaCare is dead with 100% increases in P's. Vote now for Karen H","rating":6},{"id":1022079127799701500,"text":"China is targeting our farmers, who they know I love &amp, respect, as a way of getting me to continue allowing them to take advantage of the U.S. They are being vicious in what will be their failed attempt. We were being nice - until now! China made $517 Billion on us last year.","rating":6},{"id":1005047468705439700,"text":"I am heading for Canada and the G-7 for talks that will mostly center on the long time unfair trade practiced against the United States. From there I go to Singapore and talks with North Korea on Denuclearization. Won’t be talking about the Russian Witch Hunt Hoax for a while!","rating":5},{"id":1161289557079466000,"text":"ALL THE NEWS THAT’S NOT FIT TO PRINT! “The New York Times is no longer the paper we grew up with. It is no longer a news organization. It is now an agenda driven organization out to change the Country (for the worse!).” Michael Goodwin, Highly Respected New York Post Columnist.","rating":7},{"id":1035879783547199500,"text":"“You have a Fake Dossier, gathered by Steele, paid by the Clinton team to get information on Trump. The Dossier is Fake, nothing in it has been verified. It then filters into our American court system in order to spy on Barrack Obama and Hillary Clinton’s political opponent......","rating":6},{"id":1168146165130518500,"text":"“James Comey has been rebuked at the highest level, with much more to come. An IG Report doesn’t get any stronger, calling him dangerous, insubordinate. THANK GOODNESS THAT DONALD TRUMP WAS ELECTED, BECAUSE IF HE WASN’T ELECTED, THESE PEOPLE WOULD STILL BE IN POWER. Two more.....","rating":5},{"id":1024641683600879600,"text":"“FBI Agent Peter Strzok (on the Mueller team) should have recused himself on day one. He was out to STOP THE ELECTION OF DONALD TRUMP. He needed an insurance policy. Those are illegal, improper goals, trying to influence the Election. He should never, ever been allowed to........","rating":5},{"id":1044540438806483000,"text":"Despite requests, I have no plans to meet Iranian President Hassan Rouhani. Maybe someday in the future. I am sure he is an absolutely lovely man!","rating":7},{"id":1097103477329649700,"text":"Important meetings and calls on China Trade Deal, and more, today with my staff. Big progress being made on soooo many different fronts! Our Country has such fantastic potential for future growth and greatness on an even higher level!","rating":4},{"id":818421066859167700,"text":"Hillary flunky who lost big. For the 100th time, I never \"\"mocked\"\" a disabled reporter (would never do that) but simply showed him.......","rating":8},{"id":902889225061896200,"text":"Will be leaving for Missouri soon for a speech on tax cuts and tax reform - so badly needed!","rating":4},{"id":1181905661300560000,"text":"....IN THE HISTORY OF OUR COUNTRY! We went to war under a false &amp, now disproven premise, WEAPONS OF MASS DESTRUCTION. There were NONE! Now we are slowly &amp, carefully bringing our great soldiers &amp, military home. Our focus is on the BIG PICTURE! THE USA IS GREATER THAN EVER BEFORE!","rating":4},{"id":921828280998744000,"text":"Officials behind the now discredited \"\"Dossier\"\" plead the Fifth. Justice Department and/or FBI should immediately release who paid for it.","rating":6},{"id":1043130170612244500,"text":"The radical left lawyers want the FBI to get involved NOW. Why didn’t someone call the FBI 36 years ago?","rating":7},{"id":977286489410240500,"text":"Obama Administration legalized bump stocks. BAD IDEA. As I promised, today the Department of Justice will issue the rule banning BUMP STOCKS with a mandated comment period. We will BAN all devices that turn legal weapons into illegal machine guns.","rating":4},{"id":919160558712172500,"text":"Health Insurance stocks, which have gone through the roof during the ObamaCare years, plunged yesterday after I ended their Dems windfall!","rating":5},{"id":1107607058600349700,"text":"General Motors and the UAW are going to start “talks” in September/October. Why wait, start them now! I want jobs to stay in the U.S.A. and want Lordstown (Ohio), in one of the best economies in our history, opened or sold to a company who will open it up fast! Car companies.....","rating":3},{"id":1196632739266596900,"text":"At my meeting with Jay Powell this morning, I protested fact that our Fed Rate is set too high relative to the interest rates of other competitor countries. In fact, our rates should be lower than all others (we are the U.S.). Too strong a Dollar hurting manufacturers &amp, growth!","rating":3},{"id":887280380423938000,"text":"As I have always said, let ObamaCare fail and then come together and do a great healthcare plan. Stay tuned!","rating":4},{"id":1029745594540150800,"text":"Our Country was built on Tariffs, and Tariffs are now leading us to great new Trade Deals - as opposed to the horrible and unfair Trade Deals that I inherited as your President. Other Countries should not be allowed to come in and steal the wealth of our great U.S.A. No longer!","rating":4},{"id":1029355952414371800,"text":"Lou Dobbs: “This cannot go forward...this Special Counsel with all of his conflicts, with his 17 Angry Democrats, without any evidence of collusion by the Trump Campaign and Russia. The Dems are the ones who should be investigated.” Thank you Lou, so true!","rating":6},{"id":1166467681182261200,"text":"It is amazing that I can be at 51% with Zogby when the Fake &amp, Corrupt News is almost 100% against me. Great job Mr. President!","rating":7},{"id":1189023754912964600,"text":"“Americans know by now that the Impeachment inquiry is just another hoax and silent coup to remove the President from office.” J.J. Crovatto  Don’t worry J.J., Schiff is a leaker &amp, corrupt politician who made up what I said on the call in order to hurt the Republican Party &amp, me!","rating":8},{"id":928770248370729000,"text":"My meetings with President Xi Jinping were very productive on both trade and the subject of North Korea. He is a highly respected and powerful representative of his people. It was great being with him and Madame Peng Liyuan!","rating":3},{"id":1191058382695927800,"text":"The Democrats are Fixers, and they are working overtime to FIX the Impeachment “Process” in order to hurt the Republican Party and me. Nancy Pelosi should instead Fix her broken District and Corrupt Adam should clean up &amp, manage the California forests which are always burning!","rating":9},{"id":1012312287280074800,"text":"Peter Strzok worked as the leader of the Rigged Witch Hunt for a long period of time - he got it started and was only fired because the gig was up. But remember, he took his orders from Comey and McCabe and they took their orders from you know who. Mueller/Comey best friends!","rating":6},{"id":1090573972306038800,"text":"....Fighting continues but the people of Afghanistan want peace in this never ending war. We will soon see if talks will be successful? North Korea relationship is best it has ever been with U.S. No testing, getting remains, hostages returned. Decent chance of Denuclearization...","rating":4},{"id":1006993862152392700,"text":"Congratulations to Danny Tarkanian on his big GOP primary win in Nevada. Danny worked hard an got a great result. Looking good in November!","rating":2},{"id":1244056559577071600,"text":"....Federal Government. A quarantine will not be necessary. Full details will be released by CDC tonight. Thank you!","rating":1},{"id":996887371210788900,"text":"Gina Haspel is one step closer to leading our brave men and women at the CIA. She is exceptionally qualified and the Senate should confirm her immediately. We need her to keep our great country safe! #ConfirmGina","rating":2},{"id":1022805381440069600,"text":"Arrived back in Washington last night from a very emotional reopening of a major U.S. Steel plant in Granite City, Illinois, only to be greeted with the ridiculous news that the highly conflicted Robert Mueller and his gang of 13 Angry Democrats obviously cannot find Collusion...","rating":7},{"id":1031505811074412500,"text":"....looking for trouble. They are enjoying ruining people’s lives and REFUSE to look at the real corruption on the Democrat side - the lies, the firings, the deleted Emails and soooo much more! Mueller’s Angry Dems are looking to impact the election. They are a National Disgrace!","rating":8},{"id":1161985864412668000,"text":"The Philadelphia shooter should never have been allowed to be on the streets. He had a long and very dangerous criminal record. Looked like he was having a good time after his capture, and after wounding so many police. Long sentence - must get much tougher on street crime!","rating":5},{"id":1233403109038346200,"text":"Will be in the Great State of South Carolina tonight, 7:00 P.M., for a really BIG Rally. Best place to be is a Trump Rally. See you later!","rating":3},{"id":1253699994516947000,"text":"Just spoke to President Juan Orlando Hernandez of the Republic of Honduras. We work closely together on the Southern Border. Will be helping him with his request for Ventilators and Testing.","rating":2},{"id":1164543211660042200,"text":"The Economy is doing really well. The Federal Reserve can easily make it Record Setting! The question is being asked, why are we paying much more in interest than Germany and certain other countries? Be early (for a change), not late. Let America win big, rather than just win!","rating":4},{"id":1100126391729774600,"text":"China Trade Deal (and more) in advanced stages. Relationship between our two Countries is very strong. I have therefore agreed to delay U.S. tariff hikes. Let’s see what happens?","rating":3},{"id":950206338411499500,"text":"“His is turning out to be an enormously consequential presidency. So much so that, despite my own frustration over his missteps, there has never been a day when I wished Hillary Clinton were president. Not one. Indeed, as Trump’s accomplishments accumulate, the mere thought of...","rating":6},{"id":1137052508231069700,"text":"Heading back to D.C. Many great things are happening for our Country!","rating":2},{"id":931360196554821600,"text":".And to think that just last week he was lecturing anyone who would listen about sexual harassment and respect for women. Lesley Stahl tape?","rating":7},{"id":830764596235485200,"text":"After two days of very productive talks, Prime Minister Abe is heading back to Japan. L","rating":1},{"id":977850135697911800,"text":"France honors a great hero. Officer died after bravely swapping places with hostage in ISIS related terror attack. So much bravery around the world constantly fighting radical Islamic terrorism. Even stronger measures needed, especially at borders!","rating":4},{"id":1203722735333134300,"text":"“Any president has the authority to investigate corruption. The President himself released the transcript of the call. Now the Democrats have no evidence of a crime and no evidence of violating the law. This is a kangaroo court in the House, but it’s going to go to the Senate,...","rating":5},{"id":1182661081849835500,"text":"One of the great things about the China Deal is the fact that, for various reasons, we do not have to go through the very long and politically complex Congressional Approval Process. When the deal is fully negotiated, I sign it myself on behalf of our Country. Fast and Clean!","rating":6},{"id":1105795445794717700,"text":"Defying voters, the Governor of California will halt all death penalty executions of 737 stone cold killers. Friends and families of the always forgotten VICTIMS are not thrilled, and neither am I!","rating":7},{"id":965932714141651000,"text":"Republicans are now leading the Generic Poll, perhaps because of the popular Tax Cuts which the Dems want to take away. Actually, they want to raise you taxes, substantially. Also, they want to do nothing on DACA, R’s want to fix!","rating":5},{"id":891437168798965800,"text":"I love reading about all of the \"\"geniuses\"\" who were so instrumental in my election success. Problem is, most don't exist. #Fake News! MAGA","rating":7},{"id":977875057572745200,"text":"....lawyer or law firm will take months to get up to speed (if for no other reason than they can bill more), which is unfair to our great country - and I am very happy with my existing team. Besides, there was NO COLLUSION with Russia, except by Crooked Hillary and the Dems!","rating":5},{"id":1143529905323479000,"text":"....The wonderful Iranian people are suffering, and for no reason at all. Their leadership spends all of its money on Terror, and little on anything else. The U.S. has not forgotten Iran’s use of IED’s &amp, EFP’s (bombs), which killed 2000 Americans, and wounded many more...","rating":4},{"id":1144014405715161100,"text":"....and all of the others who have leaked, lied and did so many other terrible things? How is it even possible that these people are not being brought forward? Because it is a Rigged Democrat Con Game, and the Fake and Corrupt Media loves every minute of it!","rating":6},{"id":1036056454954995700,"text":"“No information was ever given by the Trump Team to Russia, yet the Hillary Clinton campaign paid for information from Kremlin sources and just washed it through an intermediary, Christopher Steele.”  Jesse Waters","rating":5},{"id":1010502249263624200,"text":"The National Association of Manufacturers just announced that 95.1% of Manufacturers “have a positive outlook for their companies.”  This is the best number in the Association’s history!","rating":3},{"id":952526145064505300,"text":"...and they knew exactly what I said and meant. They just wanted a story. FAKE NEWS!","rating":7},{"id":1047469711938736100,"text":"The Failing New York Times did something I have never seen done before. They used the concept of “time value of money” in doing a very old, boring and often told hit piece on me. Added up, this means that 97% of their stories on me are bad. Never recovered from bad election call!","rating":8},{"id":1297275241203458000,"text":"....that they are trying to pull off in violation of everything that our Country stands for. Vote NO to the Pelosi/ Schumer money wasting HOAX which is taking place now. Then fight the $51 million unasked for Ballots. Only ABSENTEE BALLOTS are acceptable!","rating":6},{"id":1125098705533767700,"text":"....to testify. Are they looking for a redo because they hated seeing the strong NO COLLUSION conclusion? There was no crime, except on the other side (incredibly not covered in the Report), and NO OBSTRUCTION. Bob Mueller should not testify. No redos for the Dems!","rating":5},{"id":1002023477531070500,"text":"The soon to be released book, “The Russia Hoax, The Illicit Scheme To Clear Hillary Clinton And Frame Donald Trump,” written by Gregg Jarrett, looks like a real deal big hit. The Phony Witch Hunt will be opened up for the world to see! Out in 5 weeks.","rating":4},{"id":1017190186269184000,"text":"Billions of additional dollars are being spent by NATO countries since my visit last year, at my request, but it isn’t nearly enough. U.S. spends too much. Europe’s borders are BAD! Pipeline dollars to Russia are not acceptable!","rating":5},{"id":1026076959980302300,"text":"..Because of Tariffs we will be able to start paying down large amounts of the $21 Trillion in debt that has been accumulated, much by the Obama Administration, while at the same time reducing taxes for our people. At minimum, we will make much better Trade Deals for our country!","rating":4},{"id":853945633903923200,"text":"The Fake Media (not Real Media) has gotten even worse since the election. Every story is badly slanted. We have to hold them to the truth!","rating":6},{"id":816333480409833500,"text":"There should be no further releases from Gitmo. These are extremely dangerous people and should not be allowed back onto the battlefield.","rating":3},{"id":1248410991437611000,"text":"....We will always be there for our Great Farmers, Cattlemen, Ranchers, and Producers!","rating":5},{"id":1220329778810687500,"text":"The Democrats &amp; Shifty Schiff, whose presentation to the Senate was loaded with lies and misrepresentations, are refusing to state that the Obama Administration withheld aid from many countries including Ukraine, Pakistan, Philippines, Egypt, Honduras, &amp; Mexico. Witch Hunt!","rating":8},{"id":1003969399148118000,"text":"Separating families at the Border is the fault of bad legislation passed by the Democrats. Border Security laws should be changed but the Dems can’t get their act together! Started the Wall.","rating":7},{"id":1173216300287635500,"text":"Now the Radical Left Democrats and their Partner, the LameStream Media, are after Brett Kavanaugh again, talking loudly of their favorite word, impeachment. He is an innocent man who has been treated HORRIBLY. Such lies about him. They want to scare him into turning Liberal!","rating":9},{"id":888736256145985500,"text":"ObamaCare is dead and the Democrats are obstructionists, no ideas or votes, only obstruction. It is solely up to the 52 Republican Senators!","rating":6},{"id":976655903729610800,"text":"Democrats refused to take care of DACA. Would have been so easy, but they just didn’t care. I had to fight for Military and start of Wall.","rating":7},{"id":1003634405036961800,"text":"Farmers have not been doing well for 15 years. Mexico, Canada, China and others have treated them unfairly. By the time I finish trade talks, that will change. Big trade barriers against U.S. farmers, and other businesses, will finally be broken. Massive trade deficits no longer!","rating":5},{"id":1121844339200540700,"text":"Spoke to Saudi Arabia and others about increasing oil flow. All are in agreement. The California tax on gasoline is causing big problems on pricing for that state. Speak to your Governor about reducing. Economic numbers, 3.2% GDP for what is often worst quarter, looking good!","rating":6},{"id":1142476293331738600,"text":"I am at Camp David working on many things, including Iran! We have a great Economy, Tariffs have been very helpful both with respect to the huge Dollars coming IN, &amp, on helping to make good Trade Deals. The Dow heading to BEST June in 80 years! Stock Market BEST June in 50 years!","rating":5},{"id":973185831547670500,"text":"Very strong improvement and strengthening of background checks will be fully backed by White House. Legislation moving forward. Bump Stocks will soon be out. Highly trained expert teachers will be allowed to conceal carry, subject to State Law. Armed guards OK, deterrent!.......","rating":6},{"id":1075404434862235600,"text":"...sleazebag AG Eric Schneiderman, who has since resigned over horrific women abuse, when I wanted to close the Foundation so as not to be in conflict with politics. Shady Eric was head of New Yorkers for Clinton, and refused to even look at the corrupt Clinton Foundation......","rating":7},{"id":1196109916769005600,"text":"The Do Nothing Dems are now doing even less - and soooo much work to be done!","rating":6},{"id":967538684789739500,"text":"The Democrat memo response on government surveillance abuses is a total political and legal BUST. Just confirms all of the terrible things that were done. SO ILLEGAL!","rating":8},{"id":1190079192358105000,"text":"....New York, and always will, but unfortunately, despite the fact that I pay millions of dollars in city, state and local taxes each year, I have been treated very badly by the political leaders of both the city and state. Few have been treated worse. I hated having to make....","rating":5},{"id":1140065304019644400,"text":".....ALSO, NOT TRUE! Anything goes with our Corrupt News Media today. They will do, or say, whatever it takes, with not even the slightest thought of consequence! These are true cowards and without doubt, THE ENEMY OF THE PEOPLE!","rating":9},{"id":1195389486659776500,"text":"....A double standard like never seen before in the history of our Country?","rating":4},{"id":922798321739161600,"text":"Bob Corker, who helped President O give us the bad Iran Deal &amp, couldn't get elected dog catcher in Tennessee, is now fighting Tax Cuts....","rating":7},{"id":1193248307402797000,"text":"....Whatever happened to the so-called “informer” to Whistleblower #1? Seems to have disappeared after I released the Transcript of the call. Shouldn’t he be on the list to testify? Witch Hunt!","rating":7},{"id":1126106541004873700,"text":"....Guess what, that’s not going to happen! China has just informed us that they (Vice-Premier) are now coming to the U.S. to make a deal. We’ll see, but I am very happy with over $100 Billion a year in Tariffs filling U.S. coffers...great for U.S., not good for China!","rating":6},{"id":1112687993528217600,"text":"Now that the long awaited Mueller Report conclusions have been released, most Democrats and othershave gone back to the pre-Witch Hunt phase of their lives before Collusion Delusion took over. Others are pretending that their former hero, Bob Mueller, no longer exists!","rating":6}]