[{"id":951785587765280800,"text":"The so-called bipartisan DACA deal presented yesterday to myself and a group of Republican Senators and Congressmen was a big step backwards. Wall was not properly funded, Chain &amp, Lottery were made worse and USA would be forced to take large numbers of people from high crime.....","rating":4},{"id":1178074551541997600,"text":"....fraudulently and illegally inserted his made up &amp, twisted words into my call with the Ukrainian President to make it look like I did something very wrong. He then boldly read those words to Congress and millions of people, defaming &amp, libeling me. He must resign from Congress!","rating":8},{"id":1128261066654408700,"text":"Our great Patriot Farmers will be one of the biggest beneficiaries of what is happening now. Hopefully China will do us the honor of continuing to buy our great farm product, the best, but if not your Country will be making up the difference based on a very high China buy......","rating":5},{"id":1175561536510812200,"text":"The LameStream Media had a very bad week. They pushed numerous phony stories and got caught, especially The Failing New York Times, which has lost more money over the last 10 years than any paper in history, and The Amazon Washington Post. They are The Enemy of the People!","rating":9},{"id":1052529703800721400,"text":"Ted Cruz has done so much for Texas, including massive cuts in taxes and regulations - which has brought Texas to the best jobs numbers in the history of the state. He watches carefully over your 2nd Amendment. O’Rourke would blow it all! Ted has long had my Strong Endorsement!","rating":3},{"id":893081237082001400,"text":"Business is looking better than ever with business enthusiasm at record levels. Stock Market at an all-time high. That doesn't just happen!","rating":2},{"id":889474780356915200,"text":"Republicans have a last chance to do the right thing on Repeal &amp, Replace after years of talking &amp, campaigning on it.","rating":4},{"id":1073703744766922800,"text":"I am pleased to announce that Mick Mulvaney, Director of the Office of Management &amp, Budget, will be named Acting White House Chief of Staff, replacing General John Kelly, who has served our Country with distinction. Mick has done an outstanding job while in the Administration....","rating":2},{"id":1159473912616501200,"text":"....in the world, there is nobody even close, but unfortunately the same cannot be said about our Federal Reserve. They have called it wrong at every step of the way, and we are still winning. Can you imagine what would happen if they actually called it right?","rating":6},{"id":884012097805406200,"text":"I strongly pressed President Putin twice about Russian meddling in our election. He vehemently denied it. I've already given my opinion.....","rating":7},{"id":1159603340667445200,"text":"....career in the military, retiring from the U.S. Navy in 2010. He commanded at every level, including the Naval Special Warfare Command. He has also served as a National Security Fellow at Harvard University. I have no doubt he will do a great job!","rating":2},{"id":1203030938663428000,"text":"King Salman of Saudi Arabia just called to express his sincere condolences and give his sympathies to the families and friends of the warriors who were killed and wounded in the attack that took place in Pensacola, Florida....","rating":3},{"id":1000458567147839500,"text":"With Spies, or “Informants” as the Democrats like to call them because it sounds less sinister (but it’s not), all over my campaign, even from a very early date, why didn’t the crooked highest levels of the FBI or “Justice” contact me to tell me of the  phony Russia problem?","rating":8},{"id":1130220543427457000,"text":"....who got them there. Chris Wallace said, “I actually think, whether you like his opinions or not, that Mayor Pete has a lot of substance...fascinating biography.” Gee, he never speaks well of me - I like Mike Wallace better...and Alfred E. Newman will never be President!","rating":7},{"id":1002539852171305000,"text":"Canada has treated our Agricultural business and Farmers very poorly for a very long period of time. Highly restrictive on Trade! They must open their markets and take down their trade barriers! They report a really high surplus on trade with us. Do Timber &amp, Lumber in U.S.?","rating":5},{"id":1210179032031072300,"text":"Brad Blakeman “I happen to believe as a lawyer that the charges are defective, they don’t meet the Constitutional standard of high crimes and misdemeanors, so I would like to see a Motion to Dismiss. At least 51 Republican Senators would agree with that-there should be no trial.”","rating":4},{"id":1220687131292643300,"text":"After having been treated unbelievably unfairly in the House, and then having to endure hour after hour of lies, fraud &amp; deception by Shifty Schiff, Cryin’ Chuck Schumer &amp; their crew, looks like my lawyers will be forced to start on Saturday, which is called Death Valley in T.V.","rating":6},{"id":787267564405653500,"text":"Hillary Clinton should have been prosecuted and should be in jail. Instead she is running for president in what looks like a rigged election","rating":9},{"id":1212096499942854700,"text":"“It’s my opinion as a lawyer that the Articles of Impeachment are defective on their face, which means I would like to see a Motion to Dismiss and have this disbursed without the necessity of a trial. I don’t think there should be a trial. I think it should be dismissed....","rating":5},{"id":880402366373269500,"text":"New Sugar deal negotiated with Mexico is a very good one for both Mexico and the U.S. Had no deal for many years which hurt U.S. badly.","rating":3},{"id":1025512396654346200,"text":"NASA, which is making a BIG comeback under the Trump Administration, has just named 9 astronauts for Boeing and Spacex space flights. We have the greatest facilities in the world and we are now letting the private sector pay to use them. Exciting things happening. Space Force!","rating":5},{"id":1076888530276810800,"text":"Unthinkable devastation from the tsunami disaster in Indonesia. More than two hundred dead and nearly a thousand injured or unaccounted for. We are praying for recovery and healing. America is with you!","rating":3},{"id":1248578583225872400,"text":"Congress must go back to DEDUCTIBILITY by businesses if Restaurants, Clubs &amp; Entertaiment is expected to flourish (like never before)!","rating":6},{"id":1071479075699490800,"text":"Watched Da Nang Dick Blumenthal on television spewing facts almost as accurate as his bravery in Vietnam (which he never saw). As the bullets whizzed by Da Nang Dicks head, as he was saving soldiers....","rating":9},{"id":925739132579729400,"text":"Wouldn't it be great to Repeal the very unfair and unpopular Individual Mandate in ObamaCare and use those savings for further Tax Cuts.....","rating":4},{"id":980063581592047600,"text":"While we are on the subject, it is reported that the U.S. Post Office will lose $1.50 on average for each package it delivers for Amazon. That amounts to Billions of Dollars. The Failing N.Y. Times reports that “the size of the company’s lobbying staff has ballooned,” and that...","rating":7},{"id":974241711315710000,"text":"Larry Kudlow will be my Chief Economic Advisor as Director of the National Economic Council. Our Country will have many years of Great Economic &amp, Financial Success, with low taxes, unparalleled innovation, fair trade and an ever expanding labor force leading the way! #MAGA","rating":4},{"id":1076127773444526100,"text":"General Anthony Tata, author, “Dark Winter.” I think the President is making the exact right move in Syria. All the geniuses who are protesting the withdrawal of troops from Syria are the same geniuses who cooked the books on ISIS intelligence and gave rise to ISIS.”","rating":6},{"id":905770927526432800,"text":"Hurricane Irma is raging but we have great teams of talented and brave people already in place and ready to help. Be careful, be safe! #FEMA","rating":3},{"id":1021388295618682900,"text":"....In my opinion the Washington Post is nothing more than an expensive (the paper loses a fortune) lobbyist for Amazon. Is it used as protection against antitrust claims which many feel should be brought?","rating":7},{"id":1313551795646541800,"text":"...request, and looking to the future of our Country. I have instructed my representatives to stop negotiating until after the election when, immediately after I win, we will pass a major Stimulus Bill that focuses on hardworking Americans and Small Business. I have asked...","rating":4},{"id":970626966004162600,"text":"We have large trade deficits with Mexico and Canada. NAFTA, which is under renegotiation right now, has been a bad deal for U.S.A. Massive relocation of companies &amp, jobs. Tariffs on Steel and Aluminum will only come off if new &amp, fair NAFTA agreement is signed. Also, Canada must..","rating":5},{"id":868801710038372400,"text":"Just returned from Europe. Trip was a great success for America. Hard work but big results!","rating":3},{"id":1009777520659652600,"text":"I will be going the Columbia, South Carolina, on Monday night to do a campaign speech for one of my very early supporters, a man who truly loves the people of South Carolina, Governor Henry McMaster. Henry worked so hard &amp, was so loyal to me that I look forward to reciprocating!","rating":3},{"id":1189555450485837800,"text":"“Our Country cannot afford for the Democrats in Congress to take a one year vacation from any productive legislation just because they would rather obsess over Impeachment. ISIS &amp, other radical terrorists are not going to hit the pause button because Democrats won’t fund......","rating":6},{"id":1300170578134003700,"text":"....He tried mixing with the Agitators and Anarchists and they mocked him. He would like to blame me and the Federal Government for going in, but he hasn’t seen anything yet. We have only been there with a small group to defend our U.S. Courthouse, because he couldn’t do it....","rating":7},{"id":812773204561379300,"text":"The big loss yesterday for Israel in the United Nations will make it much harder to negotiate peace.Too bad, but we will get it done anyway!","rating":4},{"id":1186982946336624600,"text":"Young campus Conservatives are flocking to Turning Point USA &amp, other Conservative speaker events all over the Country, AND IN RECORD NUMBERS. Thousands of students are turning out. “I just want to compliment the President of the United States for signing that historic Executive..","rating":2},{"id":1012174976668061700,"text":"...home addresses – putting these selfless public servants in harm’s way. These radical protesters want ANARCHY – but the only response they will find from our government is LAW AND ORDER!","rating":6},{"id":861300169438113800,"text":"Congratulations to Emmanuel Macron on his big win today as the next President of France. I look very much forward to working with him!","rating":2},{"id":848529014667055100,"text":"The real story turns out to be SURVEILLANCE and LEAKING! Find the leakers.","rating":5},{"id":910453612630900700,"text":"After allowing North Korea to research and build Nukes while Secretary of State (Bill C also), Crooked Hillary now criticizes.","rating":7},{"id":1164174364994080800,"text":"....WHERE IS THE FEDERAL RESERVE?","rating":8},{"id":859604996236742700,"text":"...Trump/Russia story was an excuse used by the Democrats as justification for losing the election. Perhaps Trump just ran a great campaign?","rating":6},{"id":803237535178772500,"text":"If Cuba is unwilling to make a better deal for the Cuban people, the Cuban/American people and the U.S. as a whole, I will terminate deal.","rating":4},{"id":1163169730477396000,"text":"Our economy is the best in the world, by far. Lowest unemployment ever within almost all categories. Poised for big growth after trade deals are completed. Import prices down, China eating Tariffs. Helping targeted Farmers from big Tariff money coming in. Great future for USA!","rating":3},{"id":1221813147918569500,"text":"Senate hearing on the Impeachment Hoax starts today at 1:00 P.M.","rating":5},{"id":1025833273191264300,"text":"....Tariffs will make our country much richer than it is today. Only fools would disagree. We are using them to negotiate fair trade deals and, if countries are still unwilling to negotiate, they will pay us vast sums of money in the form of Tariffs. We win either way......","rating":4},{"id":1166467125155905500,"text":"The G7 in France was so successful, and yet when I came back and read the Corrupt and Fake News, and watched numerous networks, it was not even recognizable from what actually took place at the Great G7 event!","rating":3},{"id":1034599532787630100,"text":"Such a fantastic win for Ron DeSantis and the people of the Great State of Florida. Ron will be a fantastic Governor. On to November!","rating":2},{"id":1061954325843468300,"text":".....hundreds of billions of dollars, for the great privilege of losing hundreds of billions of dollars with these same countries on trade. I told them that this situation cannot continue - It is, and always has been, ridiculously unfair to the United States. Massive amounts.....","rating":6},{"id":1035908242277376000,"text":"....Remember, NAFTA was one of the WORST Trade Deals ever made. The U.S. lost thousands of businesses and millions of jobs. We were far better off before NAFTA - should never have been signed. Even the Vat Tax was not accounted for. We make new deal or go back to pre-NAFTA!","rating":5},{"id":1172853679642333200,"text":"“A Very Stable Genius!” Thank you.","rating":9},{"id":1165286432308695000,"text":"North Carolina Governor Cooper Vetoed a Bill that would have required Sheriffs to cooperate with Ice. This is a terrible decision for the great people of North Carolina. He should reverse his decision and get back to the basics of fighting crime!","rating":6},{"id":1053336553391452200,"text":"Secretary of State Mike Pompeo was never given or shown a Transcript or Video of the Saudi Consulate event. FAKE NEWS!","rating":7},{"id":1131567352045297700,"text":"When the Democrats in Congress refinish, for the 5th time, their Fake work on their very disappointing Mueller Report finding, they will have the time to get the REAL work of the people done. Move quickly!","rating":7},{"id":1188187870877618200,"text":"LOUISIANA! Extreme Democrat John Bel Edwards has sided with Nancy Pelosi and Chuck Schumer to support Sanctuary Cities, High Taxes, and Open Borders. He is crushing Louisiana’s economy and your Second Amendment rights....","rating":7},{"id":1191088472997744600,"text":"Virginia has the best Unemployment and Economic numbers in the history of the State. If the Democrats get in, those numbers will go rapidly in the other direction. On Tuesday, Vote Republican!","rating":4},{"id":1004092104488947700,"text":"The HISTORIC Rescissions Package we’ve proposed would cut $15,000,000,000 in Wasteful Spending! We are getting our government back on track.","rating":5},{"id":1201507027891212300,"text":"The Do Nothing Democrats get 3 Constitutional lawyers for their Impeachment hoax (they will need them!), the Republicans get one. Oh, that sounds fair!","rating":8},{"id":1035125176617365500,"text":"The news from the Financial Markets is even better than anticipated. For all of you that have made a fortune in the markets, or seen your 401k’s rise beyond your wildest expectations, more good news is coming!","rating":3},{"id":758286077400580100,"text":"Not one American flag on the massive stage at the Democratic National Convention until people started complaining-then a small one. Pathetic","rating":8},{"id":751370918027489300,"text":"Prayers and condolences to all of the families who are so thoroughly devastated by the horrors we are all watching take place in our country","rating":2},{"id":1017025845905494000,"text":"I am in Brussels, but always thinking about our farmers. Soy beans fell 50% from 2012 to my election. Farmers have done poorly for 15 years. Other countries’ trade barriers and tariffs have been destroying their businesses. I will open...","rating":4},{"id":1070314629732163600,"text":".....considered to be the worst and most dangerous, addictive and deadly substance of them all. Last year over 77,000 people died from Fentanyl. If China cracks down on this “horror drug,” using the Death Penalty for distributors and pushers, the results will be incredible!","rating":6},{"id":1148951077603205100,"text":"....done a great job of reducing crime in the African American Community because more African Americans are at work today. Trump is not a Racist, he’s a Businessman. Because he’s a great businessman, he’s pushing for lives to be better.” Michael Brown, CEO, Hydromatic Tech","rating":5},{"id":884027201804488700,"text":"Sanctions were not discussed at my meeting with President Putin. Nothing will be done until the Ukrainian &amp, Syrian problems are solved!","rating":3},{"id":992348740529815600,"text":"Our Southern Border is under siege. Congress must act now to change our weak and ineffective immigration laws. Must build a Wall. Mexico, which has a massive crime problem, is doing little to help!","rating":7},{"id":1175023772375683000,"text":"The Radical Left Democrats and their Fake News Media partners, headed up again by Little Adam Schiff, and batting Zero for 21 against me, are at it again! They think I may have had a “dicey” conversation with a certain foreign leader based on a “highly partisan” whistleblowers..","rating":9},{"id":1056880287974649900,"text":"....of Anger and Outrage and we will then be able to bring all sides together in Peace and Harmony. Fake News Must End!","rating":7},{"id":1028269087133257700,"text":"Why isn’t the FBI giving Andrew McCabe text messages  to Judicial Watch or appropriate governmental authorities. FBI said they won’t give up even one (I may have to get involved, DO NOT DESTROY). What are they hiding? McCabe wife took big campaign dollars from Hillary people.....","rating":8},{"id":1161026203345723400,"text":"The United States is learning much from the failed missile explosion in Russia. We have similar, though more advanced, technology. The Russian “Skyfall” explosion has people worried about the air around the facility, and far beyond. Not good!","rating":6},{"id":1223002606664065000,"text":"Leaving Michigan now, great visit, heading for Iowa. Big Rally!","rating":3},{"id":1029002242932834300,"text":"...really bad things. Nasty to people &amp, would constantly miss meetings &amp, work. When Gen. Kelly came on board he told me she was a loser &amp, nothing but problems. I told him to try working it out, if possible, because she only said GREAT things about me - until she got fired!","rating":7},{"id":1012315534220808200,"text":"When is Bob Mueller going to list his Conflicts of Interest? Why has it taken so long? Will they be listed at the top of his $22,000,000 Report...And what about the 13 Angry Democrats, will they list their conflicts with Crooked H? How many people will be sent to jail and......","rating":7},{"id":839086723552411600,"text":"Our wonderful new Healthcare Bill is now out for review and negotiation. ObamaCare is a complete and total disaster - is imploding fast!","rating":4},{"id":950012437788586000,"text":"Leaving Camp David for the White House. Great meetings with the Cabinet and Military on many very important subjects including Border Security &amp, the desperately needed Wall, the ever increasing Drug and Opioid Problem, Infrastructure, Military, Budget, Trade and DACA.","rating":5},{"id":1024060658072076300,"text":"Illegal immigration is a top National Security problem. After decades of playing games, with the whole World laughing at the stupidity of our immigration laws, and with Democrats thinking...","rating":5},{"id":1003956743133651000,"text":"We will proudly be playing the National Anthem and other wonderful music celebrating our Country today at 3 P.M., The White House, with the United States Marine Band and the United States Army Chorus. Honoring America! NFL, no escaping to Locker Rooms!","rating":4},{"id":1010567610352611300,"text":"Heading to Nevada to talk trade and immigration with supporters. Country’s economy is stronger than ever before with numbers that are getting better by the week. Tremendous potential, and trade deals are coming along well.","rating":3},{"id":997136144465842200,"text":"Congrats to the House for passing the VA MISSION Act yesterday. Without this funding our veterans will be forced to stand in never ending lines in order to receive care. Putting politics over our veterans care is UNACCEPTABLE – Senate must vote yes on this bill by Memorial Day!","rating":3},{"id":1183369132634456000,"text":"Do you remember two years ago when Iraq was going to fight the Kurds in a different part of Syria. Many people wanted us to fight with the Kurds against Iraq, who we just fought for. I said no, and the Kurds left the fight, twice. Now the same thing is happening with Turkey......","rating":5},{"id":1121053578603397100,"text":"I didn’t call Bob Costa of the Washington Post, he called me (Returned his call)!  Just more Fake News.","rating":6},{"id":1196458467982270500,"text":"Just finished a very good &amp, cordial meeting at the White House with Jay Powell of the Federal Reserve. Everything was discussed including interest rates, negative interest, low inflation, easing, Dollar strength &amp, its effect on manufacturing, trade with China, E.U. &amp, others, etc.","rating":4},{"id":1004363400674234400,"text":"Many more Republican voters showed up yesterday than the Fake News thought possible. The political pundits just don’t get what is going on out there - or they do get it but refuse to report the facts! Remember, Dems are High Tax, High Crime, easy to beat!","rating":7},{"id":1079728684427341800,"text":".....Except the results are FAR BETTER than I ever said they were going to be! I campaigned against the NEVER ENDING WARS, remember!","rating":8},{"id":1039235839333679100,"text":"The Storms in the Atlantic are very dangerous. We encourage anyone in the path of these storms to prepare themselves and to heed the warnings of State and Local officials. The Federal Government is closely monitoring and ready to assist. We are with you!","rating":2},{"id":1033327353227882500,"text":"Michaels Cohen’s attorney clarified the record, saying his client does not know if President Trump knew about the Trump Tower meeting (out of which came nothing!). The answer is that I did NOT know about the meeting. Just another phony story by the Fake News Media!","rating":4},{"id":1201455858636472300,"text":"Brazil and Argentina have been presiding over a massive devaluation of their currencies. which is not good for our farmers. Therefore, effective immediately, I will restore the Tariffs on all Steel &amp, Aluminum that is shipped into the U.S. from those countries. The Federal....","rating":6},{"id":1025092714839371800,"text":"Pennsylvania has to love Trump because unlike all of the others before me, I am bringing STEEL BACK in a VERY BIG way. Plants opening up in Pennsylvania, and all over the Country, and Congressman Lou Barletta, who is running for the Senate in Pennsylvania, is really helping!","rating":6},{"id":980799183425802200,"text":"So funny to watch Fake News Networks, among the most dishonest groups of people I have ever dealt with, criticize Sinclair Broadcasting for being biased. Sinclair is far superior to CNN and even more Fake NBC, which is a total joke.","rating":8},{"id":992562394051293200,"text":"Our high level delegation is on the way back from China where they had long meetings with Chinese leaders and business representatives. We will be meeting tomorrow to determine the results, but it is hard for China in that they have become very spoiled with U.S. trade wins!","rating":6},{"id":879315860178993200,"text":"The Democrats have become nothing but OBSTRUCTIONISTS, they have no policies or ideas. All they do is delay and complain.They own ObamaCare!","rating":7},{"id":1117829011860787200,"text":"Heading to the Great State of Minnesota!","rating":3},{"id":1177543513015246800,"text":"Obama loving (wrote Obama book) Peter Baker of the Failing New York Times, married to an even bigger Trump Hater than himself, should not even be allowed to write about me. Every story is a made up disaster with sources and leakers that don’t even exist. I had a simple and very..","rating":9},{"id":1306662932714008600,"text":"Biden and the Democrats want to get rid of the Private Healthcare Plans for 180 MILLION Americans that are happy. They’ll be put on socialized medicine!","rating":7},{"id":830769247185952800,"text":"I know Mark Cuban well. He backed me big-time but I wasn't interested in taking all of his calls.He's not smart enough to run for president!","rating":8},{"id":1184540536134406100,"text":"Guatemala, Honduras &amp, El Salvador have all signed historic Asylum Cooperation Agreements and are working to end the scourge of human smuggling. To further accelerate this progress, the U.S. will shortly be approving targeted assistance in the areas of law enforcement &amp, security.","rating":4},{"id":874626492310978600,"text":"2 million more people just dropped out of ObamaCare. It is in a death spiral. Obstructionist Democrats gave up, have no answer = resist!","rating":7},{"id":1225820694723862500,"text":"Iowa and New Hampshire will not be moved from the Primary Schedule as long as I am President. Great tradition!","rating":5},{"id":1181640563696820200,"text":"Radical Left Dem Mayor of Minneapolis, Jacob Frey, is doing everything possible to stifle Free Speech despite a record sell-out crowd at the Target Center. Presidents Clinton and Obama paid almost nothing! The Minneapolis Police have been incredible....","rating":6},{"id":1121385795481423900,"text":".....Despite the fact that the Mueller Report was “composed” by Trump Haters and Angry Democrats, who had unlimited funds and human resources, the end result was No Collusion, No Obstruction. Amazing!","rating":5},{"id":740972317191352300,"text":"Obama just endorsed Crooked Hillary. He wants four more years of Obama—but nobody else does!","rating":7},{"id":1152899604473667600,"text":"Big progress at the Border, but Dems in Congress must change the Immigration Laws for all to be good! End the Loopholes and much more.","rating":4},{"id":914465475777695700,"text":"We have done a great job with the almost impossible situation in Puerto Rico. Outside of the Fake News or politically motivated ingrates,...","rating":6},{"id":1070844413910368300,"text":"Statement from China: “The teams of both sides are now having smooth communications and good cooperation with each other. We are full of confidence that an agreement can be reached within the next 90 days.” I agree!","rating":3},{"id":1130109633673211900,"text":"....he would see that it was nevertheless strong on NO COLLUSION and, ultimately, NO OBSTRUCTION...Anyway, how do you Obstruct when there is no crime and, in fact, the crimes were committed by the other side? Justin is a loser who sadly plays right into our opponents hands!","rating":8},{"id":1152190439325339600,"text":"....Mainstream Media, which has lost all credibility, has either officially or unofficially become a part of the Radical Left Democrat Party. It is a sick partnership, so pathetic to watch! They even covered a tiny staged crowd as they greeted Foul Mouthed Omar in Minnesota, a...","rating":7},{"id":1169992234382610400,"text":"“China is eating the Tariffs.” Billions pouring into USA. Targeted Patriot Farmers getting massive Dollars from the incoming Tariffs! Good Jobs Numbers, No Inflation(Fed). China having worst year in decades. Talks happening, good for all!","rating":5},{"id":1031137499995930600,"text":"....and have demanded transparency so that this Rigged and Disgusting Witch Hunt can come to a close. So many lives have been ruined over nothing - McCarthyism at its WORST! Yet Mueller &amp, his gang of Dems refuse to look at the real crimes on the other side - Media is even worse!","rating":8},{"id":1122853926087348200,"text":"....People are fleeing New York State because of high taxes and yes, even oppression of sorts. They didn’t even put up a fight against SALT - could have won. So much litigation. The NRA should leave and fight from the outside of this very difficult to deal with (unfair) State!","rating":7},{"id":926247543801045000,"text":"Donna Brazile just stated the DNC RIGGED the system to illegally steal the Primary from Bernie Sanders. Bought and paid for by Crooked H....","rating":9},{"id":936555753946705900,"text":"Republicans Senators are working hard to pass the biggest Tax Cuts in the history of our Country. The Bill is getting better and better. This is a once in a generation chance. Obstructionist Dems trying to block because they think it is too good and will not be given the credit!","rating":6},{"id":1157306445567803400,"text":".....Chairman Kim does not want to disappoint me with a violation of trust, there is far too much for North Korea to gain - the potential as a Country, under Kim Jong Un’s leadership, is unlimited. Also, there is far too much to lose. I may be wrong, but I believe that......","rating":8},{"id":1027039880105414700,"text":"Congratulations to Bill Schuette. You will have a Big win in November and be a tremendous Governor for the Great State of Michigan. Lots of car and other companies moving back!","rating":4},{"id":877234140483121200,"text":"While I greatly appreciate the efforts of President Xi &amp, China to help with North Korea, it has not worked out. At least I know China tried!","rating":5},{"id":1034817106632761300,"text":"Consumer Confidence Index, just out, is the HIGHEST IN 18 YEARS! Also, GDP revised upward to 4.2 from 4.1. Our country is doing great!","rating":3},{"id":1171452881729228800,"text":"....I asked John for his resignation, which was given to me this morning. I thank John very much for his service. I will be naming a new National Security Advisor next week.","rating":6},{"id":1141706991464849400,"text":"S&amp,P opens at Record High!","rating":2},{"id":1138412971846189000,"text":"“Mueller has spoken. He found No Collusion between the Trump Campaign and the Russians. The bottom line is what the Democrat House is doing is trying to destroy the Trump Presidency (which has been a tremendous success), and I can assure you that we’re done with the Mueller......","rating":7},{"id":800332639844659200,"text":"General James \"\"Mad Dog\"\" Mattis, who is being considered for Secretary of Defense, was very impressive yesterday. A true General's General!","rating":3},{"id":851766546825347100,"text":"I explained to the President of China that a trade deal with the U.S. will be far better for them if they solve the North Korean problem!","rating":5},{"id":1128251530442940400,"text":"We can make a deal with China tomorrow, before their companies start leaving so as not to lose USA business, but the last time we were close they wanted to renegotiate the deal. No way! We are in a much better position now than any deal we could have made. Will be taking in.....","rating":6},{"id":1203791855684599800,"text":"“This would be the first Impeachment in American history without a specific criminal statute or crime that the president whose impeached would have allegedly committed.” Paul Gigot, The Wall Street Journal","rating":2},{"id":1077057874235400200,"text":"“The President has been remarkable. I do not doubt that he will thrive in this new environment, and he will be a constant reminder of what populism is.” Thank you to Tammy Bruce and Steve Hilton. Presidential Harassment has been with me from the beginning!","rating":4},{"id":1237378225417961500,"text":"The Federal Reserve must be a leader, not a very late follower, which it has been!","rating":3},{"id":1003017786355015700,"text":"Why is it that the Wall Street Journal, though well meaning, never mentions the unfairness of the Tariffs routinely charged against the U.S. by other countries, or the many Billions of Dollars that the Tariffs we are now charging are, and will be, pouring into U.S. coffers?","rating":5},{"id":998525737593376800,"text":"China has agreed to buy massive amounts of ADDITIONAL Farm/Agricultural Products - would be one of the best things to happen to our farmers in many years!","rating":3},{"id":907928888587808800,"text":"The approval process for the biggest Tax Cut &amp, Tax Reform package in the history of our country will soon begin. Move fast Congress!","rating":4},{"id":877363446530007000,"text":"Ralph Norman ran a fantastic race to win in the Great State of South Carolina's 5th District. We are all honored by your success tonight!","rating":2},{"id":857931397562085400,"text":"We are making tremendous progress with the V. A. There has never been so much done so quickly, and we have just started. We love our VETS!","rating":3},{"id":1182147895371473000,"text":"In case the Kurds or Turkey lose control, the United States has already taken the 2 ISIS militants tied to beheadings in Syria, known as the Beetles, out of that country and into a secure location controlled by the U.S. They are the worst of the worst!","rating":6},{"id":1242281185084149800,"text":"....us since the beginning of this crisis.” They meant the opposite? Forgot to mention that I closed our Country to China (and Europe) very early, long before it was considered acceptable to do so. Sleepy Joe said I was “xenophobic”, but I saved thousands of lives! Fake News!","rating":7},{"id":1198276426975400000,"text":"Joe Concha, The Hill: “In Emerson College Poll, Impeachment among independents, 49% Oppose, 34% Support. You see why Pelosi is reluctant to go in with this. Dems have to go home and explain why they haven’t done something on Opioid crisis, drug prices, USMCA, the Border, etc.","rating":4},{"id":1191155312084082700,"text":"If Shifty Adam Schiff, who is a corrupt politician who fraudulently made up what I said on the “call,” is allowed to release transcripts of the Never Trumpers &amp, others that are &amp, were interviewed, he will change the words that were said to suit the Dems purposes. Republicans...","rating":8},{"id":1148600594829103100,"text":"Recent “strained” decisions by the United States Supreme Court, some so simple as allowing the question, “Are you a citizen of the United States” on our very expensive Census Report, or the even more strained decisions (2) allowing the world’s most expensive &amp, pathetic......","rating":5},{"id":1009076294615814100,"text":"#CHANGETHELAWS   Now is the best opportunity ever for Congress to change the ridiculous and obsolete laws on immigration. Get it done, always keeping in mind that we must have strong border security.","rating":4},{"id":819858926455967700,"text":"All of my Cabinet nominee are looking good and doing a great job. I want them to be themselves and express their own thoughts, not mine!","rating":3},{"id":935712056690577400,"text":"Just won the lawsuit on leadership of Consumer Financial Protection Bureau, CFPB. A big win for the Consumer!","rating":4},{"id":910101538336583700,"text":"Big day at the United Nations - many good things, and some tricky ones, happening. We have a great team. Big speech at 10:00 A.M.","rating":3},{"id":1031550517552603100,"text":"Will Bruce Ohr, whose family received big money for helping to create the phony, dirty and discredited Dossier, ever be fired from the Jeff Sessions  “Justice” Department? A total joke!","rating":7},{"id":1076929590050897900,"text":"Senator Bob Corker just stated that, “I’m so priveledged to serve in the Senate for twelve years, and that’s what I told the people of our state that’s what I’d do, serve for two terms.” But that is Not True - wanted to run but poll numbers TANKED when I wouldn’t endorse him.....","rating":8},{"id":1120642109676118000,"text":"....Dumb and Sick. A really bad show with low ratings - and will only get worse. CNN has been a proven and long term ratings and beyond disaster. In fact, it rewarded Chris Cuomo with a now unsuccessful prime time slot, despite his massive failure in the morning. Only on CNN!","rating":9},{"id":843813078076719100,"text":"What about all of the contact with the Clinton campaign and the Russians? Also, is it true that the DNC would not let the FBI in to look?","rating":6},{"id":1162022701457989600,"text":"The United States is now, by far, the Biggest, Strongest and Most Powerful Economy in the World, it is not even close! As others falter, we will only get stronger. Consumers are in the best shape ever, plenty of cash. Business Optimism is at an All Time High!","rating":4},{"id":835104946034991100,"text":"The FBI is totally unable to stop the national security \"\"leakers\"\" that have permeated our government for a long time. They can't even......","rating":6},{"id":926456409260286000,"text":"I always felt I would be running and winning against Bernie Sanders, not Crooked H, without cheating, I was right.","rating":7},{"id":982214297160839200,"text":"Despite the Aluminum Tariffs, Aluminum prices are DOWN 4%. People are surprised, I’m not! Lots of money coming into U.S. coffers and Jobs, Jobs, Jobs!","rating":5},{"id":1021349516878975000,"text":"....and the DOJ, FBI and Obama Gang need to be held to account. Source #1 was the major source. Avoided talking about it being the Clinton campaign behind it. Misled the Court to provide a pretext to SPY on the Trump Team. Not about Carter Page..was all about getting Trump.....","rating":8},{"id":961671974153080800,"text":"I will be meeting with Henry Kissinger at 1:45pm. Will be discussing North Korea, China and the Middle East.","rating":3},{"id":1134909712267436000,"text":"Emmet Flood, who came to the White House to help me with the Mueller Report, will be leaving service on June 14th. He has done an outstanding job – NO COLLUSION - NO OBSTRUCTION! Case Closed! Emmet is my friend, and I thank him for the GREAT JOB he has done.","rating":4},{"id":914466534365569000,"text":"...people are now starting to recognize the amazing work that has been done by FEMA and our great Military. All buildings now inspected.....","rating":3},{"id":1139126119440035800,"text":"....is not Constitutionally Permissable.” Alan Dershowitz, Constitutional Lawyer","rating":2},{"id":1046714711268622300,"text":"....deficiencies and mistakes in NAFTA, greatly opens markets to our Farmers and Manufacturers, reduces Trade Barriers to the U.S. and will bring all three Great Nations together in competition with the rest of the world. The USMCA is a historic transaction!","rating":3},{"id":1249103831994118100,"text":"The Wall Street Journal Editorial Board doesn’t have a clue on how to fight and win. Their views on Tariffs &amp; Trade are losers for the U.S., but winners for other countries, including China. If we followed their standards,  we’d have no Country left. They should love Sleepy Joe!","rating":7},{"id":841985915778142200,"text":"CEO's most optimistic since 2009. It will only get better as we continue to slash unnecessary regulations and when we begin our big tax cut!","rating":4},{"id":1073269881334849500,"text":"If it was a Conservative that said what “crazed” Mika Brzezinski stated on her show yesterday, using a certain horrible term, that person would be banned permanently from television....","rating":8},{"id":901804388649500700,"text":"We are in the NAFTA (worst trade deal ever made) renegotiation process with Mexico &amp, Canada.Both being very difficult,may have to terminate?","rating":5},{"id":1003995933540044800,"text":"Vote for Congressman Devin Nunes, a true American Patriot the likes of which we rarely see in our modern day world....he truly loves our country and deserves everyone’s support!","rating":3},{"id":982950739441004500,"text":"The Washington Post is far more fiction than fact. Story after story is made up garbage - more like a poorly written novel than good reporting. Always quoting sources (not names), many of which don’t exist. Story on John Kelly isn’t true, just another hit job!","rating":6},{"id":1172520695605207000,"text":"Illegal Immigration costs the USA over 300 Billion Dollars a year. There is no reason for this, and things are being set in motion to have this number come WAY DOWN. Democrats could end Loopholes and it would be a whole lot easier, and faster. But it will all happen anyway!....","rating":7},{"id":1073205176872435700,"text":"I never directed Michael Cohen to break the law. He was a lawyer and he is supposed to know the law. It is called “advice of counsel,” and a lawyer has great liability if a mistake is made. That is why they get paid. Despite that many campaign finance lawyers have strongly......","rating":5},{"id":1140357430095810600,"text":"......If Republicans ever did that to the Democrats, there would be all hell to pay. It would be a scandal like no other!","rating":6},{"id":1126625647214964700,"text":"House Republicans should not vote for the BAD DEMOCRAT Disaster Supplemental Bill which hurts our States, Farmers &amp, Border Security. Up for vote tomorrow. We want to do much better than this. All sides keep working and send a good BILL for immediate signing!","rating":6},{"id":891040645581873200,"text":"I would like to thank Reince Priebus for his service and dedication to his country. We accomplished a lot together and I am proud of him!","rating":3},{"id":894659355324424200,"text":"How much longer will the failing nytimes, with its big losses and massive unfunded liability (and non-existent sources), remain in business?","rating":8},{"id":1091088745191874600,"text":"....I would suggest you read the COMPLETE testimony from Tuesday. A false narrative is so bad for our Country. I value our intelligence community. Happily, we had a very good meeting, and we are all on the same page!","rating":4},{"id":1125069836088950800,"text":"....of additional goods sent to us by China remain untaxed, but will be shortly, at a rate of 25%. The Tariffs paid to the USA have had little impact on product cost, mostly borne by China. The Trade Deal with China continues, but too slowly, as they attempt to renegotiate. No!","rating":5},{"id":877104262463008800,"text":"KAREN HANDEL FOR CONGRESS. She will fight for lower taxes, great healthcare strong security-a hard worker who will never give up! VOTE TODAY","rating":4},{"id":1068000629409398800,"text":"Sebastian Gorka, a very talented man who I got to know well while he was working at the White House, has just written an excellent book, “Why We Fight.” Much will be learned from this very good read!","rating":3},{"id":1088399969038594000,"text":"A great new book just out, “Game of Thorns,” by Doug Wead, Presidential Historian and best selling author. The book covers the campaign of 2016, and what could be more exciting than that?","rating":2},{"id":1009780708381024300,"text":"Last night in Minnesota was incredible. What a crowd!","rating":4},{"id":1146016075139702800,"text":"Mark Levin has written a big number one bestselling book called, conspicuously and accurately, “Unfreedom of the Press.” It is a great book that tells it like it is, fake news and all. Keep this book number one!","rating":3},{"id":977858212635594800,"text":"Much can be done with the $1.6 Billion given to building and fixing the border wall. It is just a down payment. Work will start immediately. The rest of the money will come - and remember DACA, the Democrats abandoned you (but we will not)!","rating":5},{"id":928074747316928500,"text":"Ed Gillespie worked hard but did not embrace me or what I stand for. Don’t forget, Republicans won 4 out of 4 House seats, and with the economy doing record numbers, we will continue to win, even bigger than before!","rating":6},{"id":1160665444619100200,"text":"..TV talent. Then, during the 2016 Election, I would watch as Joe Scarborough &amp, his very angry Psycho wife(?) would push Donny to the point of total humiliation. He would never fight back because he wanted to stay on TV, even on a very low rated show, all in the name of ambition!","rating":8},{"id":1173978059105423400,"text":"The New York Times is at its lowest point in its long and storied history. Not only is it losing a lot of money, but it is a journalistic disaster, being laughed at even in the most liberal of enclaves. It has become a very sad joke all all over the World. Witch Hunt hurt them...","rating":7},{"id":846543183223963600,"text":"The Democrats will make a deal with me on healthcare as soon as ObamaCare folds - not long. Do not worry, we are in very  good shape!","rating":5},{"id":1227271072535498800,"text":"When Jerome Powell started his testimony today, the Dow was up 125, &amp; heading higher. As he spoke it drifted steadily downward, as usual, and is now at -15. Germany &amp; other countries get paid to borrow money. We are more prime, but Fed Rate is too high, Dollar tough on exports.","rating":4},{"id":876964061027684400,"text":"Big day tomorrow in Georgia and South Carolina. ObamaCare is dead. Dems want to raise taxes big! They can only obstruct, no ideas. Vote \"\"R\"\"","rating":5},{"id":1179402463805345800,"text":"#DONOTHINGDEMS","rating":8},{"id":1081725924457041900,"text":"“The number of employed Americans has now set a 14th record under President Trump. Over the year, average hourly earnings have increased by 84 cents, or 3.2%. Participation Rate hits Trump-Era High.” CNS NEWS.  And we will do even better with new trade deals and all else!","rating":3},{"id":1178641557097975800,"text":"The Fake Whistleblower complaint is not holding up. It is mostly about the call to the Ukrainian President which, in the name of transparency, I immediately released to Congress &amp,  the public. The Whistleblower knew almost nothing, its 2ND HAND description of the call is a fraud!","rating":6},{"id":1076089846266036200,"text":"No matter what happens today in the Senate, Republican House Members should be very proud of themselves. They flew back to Washington from all parts of the World in order to vote for Border Security and the Wall. Not one Democrat voted yes, and we won big. I am very proud of you!","rating":5},{"id":1065357030985252900,"text":"“Thank you to President Trump on the Border. No American President has ever done this before.” Hector Garza, National Border Patrol Council","rating":4},{"id":1170333046672937000,"text":"Russia and Ukraine just swapped large numbers of prisoners. Very good news, perhaps a first giant step to peace. Congratulations to both countries!","rating":2},{"id":1281637140951109600,"text":"With Tropical Storm Fay heading towards the Great State of New Hampshire this weekend, we are forced to reschedule our Portsmouth, New Hampshire Rally at the Portsmouth International Airport at Pease. Stay safe, we will be there soon! #MAGA2020","rating":2},{"id":1179023004241727500,"text":"....the Whistleblower, and also the person who gave all of the false information to him. This is simply about a phone conversation that could not have been nicer, warmer, or better. No pressure at all (as confirmed by  Ukrainian Pres.). It is just another Democrat Hoax!","rating":6},{"id":1162555521855107000,"text":"Great time in New Hampshire last night. Placed was maxed out, totally packed, with thousands coming to the arena floor at start. Thousands more outside that were not allowed in per code. Energy was really great to see. We will win New Hampshire in 2020!","rating":4},{"id":1126207770783621100,"text":"Getting ready to leave for one of my favorite places, the Florida Panhandle, where we’ve given, and are giving, billions of $$$ for the devastation caused by Hurricane Michael. Even though the Dems are totally in our way (they don’t want money to go there) we’re getting it done!","rating":5},{"id":1163440419423826000,"text":"....got fired. Wrote a very nice book about me just recently. Now the book is a lie? Said his wife was driving him crazy, “something big” was happening with her. Getting divorced. He was a mental wreck. We didn’t want him around. Now Fake News puts him on like he was my buddy!","rating":8},{"id":884008221970763800,"text":"The G 20 Summit was a great success for the U.S. - Explained that the U.S. must fix the many bad trade deals it has made. Will get done!","rating":3},{"id":863002719400976400,"text":"...Maybe the best thing to do would be to cancel all future \"\"press briefings\"\" and hand out written responses for the sake of accuracy???","rating":9},{"id":1012290012279435300,"text":"Lover FBI Agent Peter Strzok was given poor marks on yesterday’s closed door testimony and, according to most reports, refused to answer many questions. There was no Collusion and the Witch Hunt, headed by 13 Angry Democrats and others who are totally conflicted, is Rigged!","rating":7},{"id":1127878613905420300,"text":"“It’s the attack strategy of harass. This is not about the Attorney General, who is very sophisticated &amp, knows it isn’t about him, it’s about trying to destroy President Trump through an assault on his AG for upholding the rule of law. He released a massive amount of......","rating":4},{"id":1003963157734453200,"text":"Meeting in Singapore with North Korea will hopefully be the start of something big...we will soon see!","rating":5},{"id":1008333717545410600,"text":"The denuclearization deal with North Korea is being praised and celebrated all over Asia. They are so happy! Over here, in our country, some people would rather see this historic deal fail than give Trump a win, even if it does save potentially millions &amp, millions of lives!","rating":6},{"id":830747067379232800,"text":"72% of refugees admitted into U.S. (2/3 -2/11) during COURT BREAKDOWN are from 7 countries: SYRIA, IRAQ, SOMALIA, IRAN, SUDAN, LIBYA &amp, YEMEN","rating":4},{"id":1050747691062493200,"text":"My thoughts and prayers are with Pastor Brunson, and we hope to have him safely back home soon!","rating":2},{"id":1080235018310635500,"text":"Washington Examiner - “MAGA list: 205 ‘historic results’ help Trump make case for 2020 re-election.”  True!","rating":3},{"id":1304133443861844000,"text":"Will be doing a News Conference live from the White House at 3:30 P.M. Eastern.","rating":3},{"id":848519587675201500,"text":"Anybody (especially  Fake News media) who thinks that Repeal &amp, Replace of ObamaCare is dead does not know the love and strength in R Party!","rating":5},{"id":864452996129853400,"text":"I have been asking Director Comey &amp, others, from the beginning of my administration, to find the LEAKERS in the intelligence community.....","rating":4},{"id":1156200909791268900,"text":"....Don’t watch show, but heard Mika said I asked to preside over their marriage. Not true—does anyone really believe that? They were married by Elijah, King of Baltimore!","rating":8},{"id":1166471454705275000,"text":"They do stories so big on Elizabeth “Pocahontas” Warren’s crowd sizes, adding many more people than are actually there, and yet my crowds, which are far bigger, get no coverage at all. Fake News!","rating":7},{"id":1034626683066826800,"text":"Our new Trade Deal with Mexico focuses on FARMERS, GROWTH for our country, tearing down TRADE BARRIERS, JOBS and having companies continue to POUR BACK INTO OUR COUNTRY. It will be a big hit!","rating":4},{"id":1059469158830796800,"text":"REMEMBER FLORIDA: I have been President of the United States for almost two years. During that time Senator Bill Nelson didn’t call me once. Rick Scott called constantly requesting dollars plus for Florida. Did a GREAT job on hurricanes. VOTE SCOTT!","rating":6},{"id":969178931369783300,"text":"Many ideas, some good &amp, some not so good, emerged from our bipartisan meeting on school safety yesterday at the White House. Background Checks a big part of conversation. Gun free zones are proven targets of killers. After many years, a Bill should emerge. Respect 2nd Amendment!","rating":3},{"id":905967331662319600,"text":"We will confront ANY challenge, no matter how strong the winds or high the water. I’m proud to stand with Presidents for #OneAmericaAppeal.","rating":3},{"id":855859245023211500,"text":"Today on Earth Day, we celebrate our beautiful forests, lakes and land. We stand committed to preserving the natural beauty of our nation.","rating":2},{"id":1177262335771021300,"text":"A whistleblower with second hand information? Another Fake News Story! See what was said on the very nice, no pressure, call. Another Witch Hunt!","rating":8},{"id":1030237078586617900,"text":"“The FBI received documents from Bruce Ohr (of the Justice Department &amp, whose wife Nelly worked for Fusion GPS).” Disgraced and fired FBI Agent Peter Strzok. This is too crazy to be believed! The Rigged Witch Hunt has zero credibility.","rating":9},{"id":1193716259944304600,"text":"If Iran is able to turn over to the U.S. kidnapped former FBI Agent Robert A. Levinson, who has been missing in Iran for 12 years, it would be a very positive step. At the same time, upon information &amp, belief, Iran is, &amp, has been, enriching uranium. THAT WOULD BE A VERY BAD STEP!","rating":7},{"id":917130468025348100,"text":"Bob Corker gave us the Iran Deal, &amp, that's about it. We need HealthCare, we need Tax Cuts/Reform, we need people that can get the job done!","rating":6},{"id":1129382204990214100,"text":"The Fake News Media is hurting our Country with its fraudulent and highly inaccurate coverage of Iran. It is scattershot, poorly sourced (made up), and DANGEROUS. At least Iran doesn’t know what to think, which at this point may very well be a good thing!","rating":8},{"id":1179375408405450800,"text":"Louisiana Republicans must go out and vote REPUBLICAN in your Governor’s race. A Republican will win if you can force a runoff! Early voting has started. Your 2nd Amendment, and much else, is at stake.","rating":5},{"id":801029194906038300,"text":"Great meetings will take place today at Trump Tower concerning the formation of the people who will run our government for the next 8 years.","rating":7},{"id":1052527724143763500,"text":"Watched the debate last night &amp, Beto O’Rourke, who wants higher taxes and far more regulations, is not in the same league with Ted Cruz &amp, what the great people of Texas stand for &amp, want. Ted is strong on Crime, Border &amp, 2nd A, loves our Military, Vets, Low Taxes. Beto is a Flake!","rating":8},{"id":1305351399706783700,"text":"...to the families of crime victims and fallen officers. In the Republican Party, we know that police officers are not villains, but HEROES who risk their lives to KEEP US SAFE 24/7/365!","rating":4},{"id":1059439426022137900,"text":"No matter what she says, Senator Claire McCaskill will always vote against us and the Great State of Missouri! Vote for Josh Hawley - he will be a great Senator!","rating":5},{"id":1041630722413527000,"text":"Tariffs have put the U.S. in a very strong bargaining position, with Billions of Dollars, and Jobs, flowing into our Country - and yet cost increases have thus far been almost unnoticeable. If countries will not make fair deals with us, they will be “Tariffed!”","rating":6},{"id":1137048453173862400,"text":"Democrats are incapable of doing a good and solid Immigration Bill!","rating":5},{"id":1042376378593804300,"text":"“The recovery got started on Election Day 2016. It took Trump’s Tax Cuts and Regulation Cuts to get the economy booming. Before that it was the worst and slowest economic recovery since the Great Depression. It took just 6 months for Trump to get to 3%, even though they said.....","rating":6},{"id":1164861053433499600,"text":"..willing to lose their wealth, or a big part of it, just for the possibility of winning the Election. But it won’t work because I always find a way to win, especially for the people! The greatest political movement in the history of our Country will have another big win in 2020!","rating":7},{"id":1044537328415506400,"text":"Republican Party Favorability is the highest it has been in 7 years - 3 points higher than Democrats!  Gallup","rating":4},{"id":811564284706689000,"text":"I have not heard any of the pundits or commentators discussing the fact that I spent FAR LESS MONEY on the win than Hillary on the loss!","rating":5},{"id":1122875949933051900,"text":"Sleepy Joe Biden is having his first rally in the Great State of Pennsylvania. He obviously doesn’t know that Pennsylvania is having one of the best economic years in its history, with lowest unemployment EVER, a now thriving Steel Industry (that was dead) &amp, great future!........","rating":7},{"id":973199981292216300,"text":"If schools are mandated to be gun free zones, violence and danger are given an open invitation to enter. Almost all school shootings are in gun free zones. Cowards will only go where there is no deterrent!","rating":8},{"id":1099660044004704300,"text":"Chairman Kim realizes, perhaps better than anyone else, that without nuclear weapons, his country could fast become one of the great economic powers anywhere in the World. Because of its location and people (and him), it has more potential for rapid growth than any other nation!","rating":6},{"id":1009071330661142500,"text":"Crime in Germany is up 10% plus (officials do not want to report these crimes) since migrants were accepted. Others countries are even worse. Be smart America!","rating":7},{"id":878596457741287400,"text":"Democrats slam GOP healthcare proposal as Obamacare premiums &amp, deductibles increase by over 100%. Remember keep your doctor, keep your plan?","rating":2},{"id":1291864495648891000,"text":"...At 3pm this afternoon, spoke to President Aoun of Lebanon to inform him that 3 large aircraft are on the way, loaded up with Medical Supplies, Food and Water. Also, First Responders, Technicians, Doctors, and Nurses on the way...","rating":3},{"id":1185574689156059100,"text":"Such a disgrace that the Do Nothing Democrats are doing just as their name suggests, Doing Nothing! USMCA anyone?","rating":5},{"id":1196156991682568200,"text":"The Crazed, Do Nothing Democrats are turning Impeachment into a routine partisan weapon. That is very bad for our Country, and not what the Founders had in mind!!!!","rating":6},{"id":1195337867989573600,"text":"The Impeachment Witch Hunt should be over with the statement made last night by the President and Foreign Minister of Ukraine. Nervous Nancy Pelosi, who should be home cleaning up the dangerous &amp, disgusting Slum she is making of her District in San Francisco, where even the......","rating":7},{"id":1076125633275666400,"text":"There has never been a president who has been tougher (but fair) on China or Russia - Never, just look at the facts. The Fake News tries so hard to paint the opposite picture.","rating":4},{"id":1001420270094168000,"text":"Why aren’t the 13 Angry and heavily conflicted Democrats investigating the totally Crooked Campaign of totally Crooked Hillary Clinton. It’s a Rigged Witch Hunt, that’s why! Ask them if they enjoyed her after election celebration!","rating":7},{"id":1055412328571850800,"text":"The so-called experts on Trump over at the New York Times wrote a long and boring article on my cellphone usage that is so incorrect I do not have time here to correct it. I only use Government Phones, and have only one seldom used government cell phone. Story is soooo wrong!","rating":4},{"id":1033148759084093400,"text":"Congratulations to new Australian Prime Minister Scott Morrison. There are no greater friends than the United States and Australia!","rating":1},{"id":1074993036831191000,"text":"Good luck today in court to General Michael Flynn. Will be interesting to see what he has to say, despite tremendous pressure being put on him, about Russian Collusion in our great and, obviously, highly successful political campaign. There was no Collusion!","rating":5},{"id":1036681588573130800,"text":"Two long running, Obama era, investigations of  two very popular Republican Congressmen were brought to a well publicized charge, just ahead of the Mid-Terms, by the Jeff Sessions Justice Department. Two easy wins now in doubt because there is not enough time. Good job Jeff......","rating":7},{"id":1238410051758575600,"text":".... Their response to H1N1 Swine Flu was a full scale disaster, with thousands dying, and nothing meaningful done to fix the testing problem, until now. The changes have been made and testing will soon happen on a very large scale basis. All Red Tape has been cut, ready to go!","rating":5},{"id":1197227388683206700,"text":"....”I WANT NOTHING! I WANT NOTHING! I WANT NO QUID PRO QUO! TELL PRESIDENT ZELENSKY TO DO THE RIGHT THING!” Later, Ambassador Sondland said that I told him, “Good, go tell the truth!” This Witch Hunt must end NOW. So bad for our Country!","rating":8},{"id":1003637916919320600,"text":"The appointment of the Special Counsel is totally UNCONSTITUTIONAL! Despite that, we play the game because I, unlike the Democrats, have done nothing wrong!","rating":6},{"id":1033045273361178600,"text":"I have asked Secretary of State Mike Pompeo not to go to North Korea, at this time, because I feel we are not making sufficient progress with respect to the denuclearization of the Korean Peninsula...","rating":4},{"id":260482827458592770,"text":"Everyone knows I am right that Robert Pattinson should dump Kristen Stewart. In a couple of years, he will thank me. Be smart, Robert.","rating":9},{"id":918058910673760300,"text":"Stock Market has increased by 5.2 Trillion dollars since the election on November 8th, a 25% increase. Lowest unemployment in 16 years and..","rating":3},{"id":1180859894003572700,"text":"....and separately got 1.5 Billion Dollars from China despite no experience and for no apparent reason. There is NO WAY these can be legitimate transactions? As lawyers &amp, others have stated, as President, I have an OBLIGATION to look into possible, or probable, CORRUPTION!","rating":6},{"id":1180088140004040700,"text":"The Washington Times, “Ukraine envoy blows ‘massive hole’ into Democrat accusations. Republicans at hearing find no Trump Pressure.” The Ukrainian President also strongly stated that NO pressure was put on him. Case Closed!","rating":4},{"id":987719560282476500,"text":"Heading to the Southern White House to watch the Funeral Service of Barbara Bush. First Lady Melania has arrived in Houston to pay our respects. Will be a beautiful day!","rating":3},{"id":1141445414824136700,"text":"Just returning from Orlando and Doral (Miami), Florida, and heading to the Oval Office, where I will present the great Economist, Dr. Arthur Laffer, with the Presidential Medal of Freedom.","rating":4},{"id":974276383051583500,"text":"We do have a Trade Deficit with Canada, as we do with almost all countries (some of them massive). P.M. Justin Trudeau of Canada, a very good guy, doesn’t like saying that Canada has a Surplus vs. the U.S.(negotiating), but they do...they almost all do...and that’s how I know!","rating":5},{"id":1166389407588466700,"text":"The Federal Reserve loves watching our manufacturers struggle with their exports to the benefit of other parts of the world. Has anyone looked at what almost all other countries are doing to take advantage of the good old USA? Our Fed has been calling it wrong for too long!","rating":6},{"id":1247897591611682800,"text":"...the Fake News Media into not covering them, but that effort failed because the ratings are through the roof according to, of all sources, the Failing New York Times, “Monday Night Football, Bachelor Finale” type numbers (&amp; sadly, they get it $FREE). Trump Derangement Syndrome!","rating":7},{"id":1035162684633825300,"text":"Will be going to Evansville, Indiana, tonight for a big crowd rally with Mike Braun, a very successful businessman who is campaigning to be Indiana’s next U.S. Senator. He is strong on Crime &amp, Borders, the 2nd Amendment, and loves our Military &amp, Vets. Will be a big night!","rating":4},{"id":967539664692351000,"text":"Dem Memo: FBI did not disclose who the clients were - the Clinton Campaign and the DNC. Wow!","rating":5},{"id":1100012620441100300,"text":"Meeting for breakfast with our Nation’s Governors - then off to Vietnam for a very important Summit with Kim Jong Un. With complete Denuclearization, North Korea will rapidly become an Economic Powerhouse. Without it, just more of the same. Chairman Kim will make a wise decision!","rating":3},{"id":980806557846863900,"text":"So sad that the Department of “Justice” and the FBI are slow walking, or even not giving, the unredacted documents requested by Congress. An embarrassment to our country!","rating":6},{"id":1131537528736100400,"text":"Rex Tillerson, a man who is “dumb as a rock” and totally ill prepared and ill equipped to be Secretary of State, made up a story (he got fired) that I was out-prepared by Vladimir Putin at a meeting in Hamburg, Germany. I don’t think Putin would agree. Look how the U.S. is doing!","rating":9},{"id":965937068907073500,"text":"Hope Republicans in the Great State of Pennsylvania challenge the new “pushed” Congressional Map, all the way to the Supreme Court, if necessary. Your Original was correct! Don’t let the Dems take elections away from you so that they can raise taxes &amp, waste money!","rating":5},{"id":1022833271040815100,"text":"GREAT GDP numbers just released. Will be having a news conference soon!","rating":4},{"id":1057655675080314900,"text":"Republicans will protect people with pre-existing conditions far better than the Dems!","rating":3},{"id":873183401620230100,"text":"Congratulations to Jeb Hensarling &amp, Republicans on successful House vote to repeal major parts of the 2010 Dodd-Frank financial law. GROWTH!","rating":4},{"id":900354657133801500,"text":"If Republican Senate doesn't get rid of the Filibuster Rule &amp, go to a simple majority, which the Dems would do, they are just wasting time!","rating":5},{"id":1018530167902228500,"text":"Heading to Helsinki, Finland – looking forward to meeting with President Putin tomorrow. Unfortunately, no matter how well I do at the Summit, if I was given the great city of Moscow as retribution for all of the sins and evils committed by Russia...","rating":8},{"id":939120304542101500,"text":"Big crowd expected today in Pensacola, Florida, for a Make America Great Again speech. We have done so much in so short a period of time...and yet are planning to do so much more! See you there!","rating":2},{"id":1299376529672208400,"text":"Succes: Since the National Guard moved into Kenosha, Wisconsin, two days ago, there has been NO FURTHER VIOLENCE, not even a small problem. When legally asked to help by local authorities, the Federal Government will act and quickly succeed. Are you listening Portland?","rating":6},{"id":1008328413210398700,"text":"Funny how the Fake News, in a coordinated effort with each other, likes to say I gave sooo much to North Korea because I “met.” That’s because that’s all they have to disparage! We got so much for peace in the world, &amp, more is being added in finals. Even got our hostages/remains!","rating":7},{"id":1126180647956099100,"text":"Our Nation grieves at the unspeakable violence that took a precious young life and badly injured others in Colorado. God be with the families and thank you to the First Responders for bravely intervening. We are in close contact with Law Enforcement.","rating":2},{"id":1196425921802178600,"text":"Our Crazy, Do Nothing (where’s USMCA, infrastructure, lower drug pricing &amp, much more?) Speaker of the House, Nervous Nancy Pelosi, who is petrified by her Radical Left knowing she will soon be gone (they &amp, Fake News Media are her BOSS), suggested on Sunday’s DEFACE THE NATION....","rating":9},{"id":1024685313778741200,"text":"“We already have a smoking gun about a campaign getting dirt on their opponent, it was Hillary Clinton. How is it OK for Hillary Clinton to proactively seek dirt from the Russians but the Trump campaign met at the Russians request and that is bad?” Marc Thiessen, Washington Post","rating":8},{"id":1130093129745543200,"text":"....was a depleted disaster, will soon be stronger than ever before, our Vets are finally being taken care of and now have Choice, our Courts will have 145 great new Judges, and 2 Supreme Court Justices, got rid of the disastrous Individual Mandate &amp, will protect Pre-Existing....","rating":4},{"id":1178650939374424000,"text":"Again, the President of Ukraine said there was NO (ZERO) PRESSURE PUT ON HIM BY ME. Case closed!","rating":6},{"id":834377364947816400,"text":"One thing I will say about Rep. Keith Ellison, in his fight to lead the DNC, is that he was the one who predicted early that I would win!","rating":3},{"id":980961086546632700,"text":"Honduras, Mexico and many other countries that the U.S. is very generous to, sends many of their people to our country through our WEAK IMMIGRATION POLICIES. Caravans are heading here. Must pass tough laws and build the WALL. Democrats allow open borders, drugs and crime!","rating":7},{"id":1180307953557090300,"text":"....of Ukraine, and cannot find any reason to charge the President with high crimes &amp, misdemeanors. This is just a phony Witch Hunt, perpetuated by Democrats to get rid of Trump because they cannot beat him in a fair election.”  Richard Ketay","rating":5},{"id":1304033430062203000,"text":"New York City indoor dining to reopen on September 30, at 25% capacity. A step in the right direction, but should go faster!","rating":2},{"id":914094625488502800,"text":"Fake News CNN and NBC are going out of their way to disparage our great First Responders as a way to \"\"get Trump.\"\" Not fair to FR or effort!","rating":6},{"id":918457595618365400,"text":"The Fake News Is going all out in order to demean and denigrate! Such hatred!","rating":5},{"id":911287725847908400,"text":"Thank you to Doug Parker and American Airlines for all of the help you have given to the U.S. with Hurricane flights. Fantastic job!","rating":3},{"id":1123263701686149100,"text":"....European countries are not helping at all, even though this was very much done for their benefit. They are refusing to take back prisoners from their specific countries. Not good!","rating":4},{"id":940584383605563400,"text":"The people of Alabama will do the right thing. Doug Jones is Pro-Abortion, weak on Crime, Military and Illegal Immigration, Bad for Gun Owners and Veterans and against the WALL. Jones is a Pelosi/Schumer Puppet. Roy Moore will always vote with us. VOTE ROY MOORE!","rating":8},{"id":982722926305833000,"text":"Lawmakers of the House Judiciary Committee are angrily accusing the Department of Justice of missing the Thursday Deadline for turning over UNREDACTED Documents relating to FISA abuse, FBI, Comey, Lynch, McCabe, Clinton Emails and much more. Slow walking - what is going on? BAD!","rating":6},{"id":936039501474025500,"text":"The only people who don’t like the Tax Cut Bill are the people that don’t understand it or the Obstructionist Democrats that know how really good it is and do not want the credit and success to go to the Republicans!","rating":5},{"id":1146185983458775000,"text":"I am pleased to announce that it is my intention to nominate Judy Shelton, Ph. D., U.S. Executive Dir, European Bank of Reconstruction &amp, Development to be on the board of the Federal Reserve....","rating":3},{"id":1029731513573822500,"text":"The Rigged Russian Witch Hunt goes on and on as the “originators and founders” of this scam continue to be fired and demoted for their corrupt and illegal activity. All credibility is gone from this terrible Hoax, and much more will be lost as it proceeds. No Collusion!","rating":7},{"id":1038792215617830900,"text":"“Trump has set Economic Growth on fire. During his time in office, the economy has achieved feats most experts thought impossible. GDP is growing at a 3 percent-plus rate. The unemployment rate is near a 50 year low.” CNBC...Also, the Stock Market is up almost 50% since Election!","rating":6},{"id":1053121500151074800,"text":"Jon Tester says one thing to voters and does the EXACT OPPOSITE in Washington. Tester takes his orders form Pelosi &amp, Schumer. Tester wants to raise your taxes, take away your 2A, open your borders, and deliver MOB RULE. Retire Tester &amp, Elect America-First Patriot Matt Rosendale!","rating":7},{"id":1242296014633087000,"text":"The Hill/HarrisX: 61% to 39% Approval Rating on handling of Coronavirus situation. Thank you!","rating":4},{"id":984631073865953300,"text":"Would only join TPP if the deal were substantially better than the deal offered to Pres. Obama. We already have BILATERAL deals with six of the eleven nations in TPP, and are working to make a deal with the biggest of those  nations, Japan, who has hit us hard on trade for years!","rating":5},{"id":1171074780566622200,"text":"The Trump Administration has achieved more in the first 2 1/2 years of its existence than perhaps any administration in the history of our Country. We get ZERO media credit for what we have done, and are doing, but the people know, and that’s all that is important!","rating":6},{"id":1203104561105449000,"text":"Nadler hasn’t had a single fact witness testify! Zero substance—Country wants #USMCA and Growth, not Impeachment. Polls have tanked on the Do Nothing Democrats!","rating":5},{"id":943489378462130200,"text":"The Tax Cuts are so large and so meaningful, and yet the Fake News is working overtime to follow the lead of their friends, the defeated Dems, and only demean. This is truly a case where the results will speak for themselves, starting very soon. Jobs, Jobs, Jobs!","rating":7},{"id":1137697506454835200,"text":".....not mentioned in yesterday press release, one in particular, were agreed upon. That will be announced at the appropriate time. There is now going to be great cooperation between Mexico &amp, the USA, something that didn’t exist for decades. However, if for some unknown reason...","rating":4},{"id":1220325842330538000,"text":"“There is no evidence of a crime.” Robert Charles, Fmr Asst Secy of State. The crimes were committed by the other side!","rating":6},{"id":1080084113762197500,"text":"Dr. Sebastian Gorka, a very good and talented guy, has a great new book just out, “Why We Fight.” Lots of insight - Enjoy!","rating":3},{"id":1113773525188395000,"text":"Despite the unnecessary and destructive actions taken by the Fed, the Economy is looking very strong, the China and USMCA deals are moving along nicely, there is little or no Inflation, and USA optimism is very high!","rating":5},{"id":265895292191248400,"text":"The concept of global warming was created by and for the Chinese in order to make U.S. manufacturing non-competitive.","rating":10},{"id":859601184285491200,"text":"FBI Director Comey was the best thing that ever happened to Hillary Clinton in that he gave her a free pass for many bad deeds! The phony...","rating":8},{"id":1025920073159110700,"text":"A great night in Ohio’s 12th Congressional District with Troy Balderson! Troy loves Ohio, and he loves the people of Ohio. He will be fighting for you all the way...","rating":4},{"id":1071076077903040500,"text":"I am pleased to announce that Heather Nauert, Spokeswoman for the United States Department of State, will be nominated to serve as United Nations Ambassador. I want to congratulate Heather, and thank Ambassador Nikki Haley for her great service to our Country!","rating":3},{"id":1190247105841057800,"text":"Chicago will never stop its crime wave with the current Superintendent of Police. It just won’t happen! Thank you to Kevin Graham and all of the GREAT Chicago Police Officers I just had the privilege to meet. Tremendous crime fighting potential if allowed to do your thing!","rating":6},{"id":1013136536576188400,"text":"A friend of mine and a man who has truly seen politics and life as few others ever will, Sean Spicer, has written a great new book, “The Briefing: Politics, the Press and the President.” It is a story told with both heart and knowledge. Really good, go get it!","rating":4},{"id":998524172858019800,"text":"I ask Senator Chuck Schumer, why didn’t President Obama &amp, the Democrats do something about Trade with China, including Theft of Intellectual Property etc.? They did NOTHING! With that being said, Chuck &amp, I have long agreed on this issue! Fair Trade, plus, with China will happen!","rating":5},{"id":901777333513855000,"text":"Great coordination between agencies at all levels of government. Continuing rains and flash floods are being dealt with. Thousands rescued.","rating":2},{"id":996368474556584000,"text":"Trade negotiations are continuing with China. They have been making hundreds of billions of dollars a year from the U.S., for many years. Stay tuned!","rating":4},{"id":1178981327082856400,"text":"You cannot judge my Stock Market performance since the Inauguration, which was very good, but only from the day after the big Election Win, which was spectacular due to the euphoria of getting Obama/Biden OUT, &amp, getting Trump/Pence IN. WentI up BIG between Nov. 9 &amp, Inauguration!","rating":7},{"id":1019891915402203100,"text":"The Democrats have a death wish, in more ways than one - they actually want to abolish ICE. This should cost them heavily in the Midterms. Yesterday, the Republicans overwhelmingly passed a bill supporting ICE!","rating":8},{"id":1164681625613021200,"text":"Just concluded a very good meeting on preventing Mass Shootings. Talks are ongoing w/ both Republicans &amp, Democrats. We are likewise engaging with lawful gun owners, survivors, grieving family members, law enforcement, the NRA, mental health professionals, and school officials...","rating":3},{"id":1183823970979713000,"text":"....I would much rather focus on our Southern Border which abuts and is part of the United States of America. And by the way, numbers are way down and the WALL is being built!","rating":6}]