[{"id":816718880731234300,"text":"Jackie Evancho's album sales have skyrocketed after announcing her Inauguration performance.Some people just don't understand the \"\"Movement\"\"","rating":5},{"id":1041094855592689700,"text":"Five deaths have been recorded thus far with regard to hurricane Florence! Deepest sympathies and warmth go out to the families and friends of the victims. May God be with them!","rating":3},{"id":991886413686861800,"text":"Our great financial team is in China trying to negotiate a level playing field on trade! I look forward to being with President Xi in the not too distant future. We will always have a good (great) relationship!","rating":4},{"id":891332290474848300,"text":"After seven years of \"\"talking\"\" Repeal &amp, Replace, the people of our great country are still being forced to live with imploding ObamaCare!","rating":6},{"id":1006630395067039700,"text":"Mark Sanford has been very unhelpful to me in my campaign to MAGA. He is MIA and nothing but trouble. He is better off in Argentina. I fully endorse Katie Arrington for Congress in SC, a state I love. She is tough on crime and will continue our fight to lower taxes. VOTE Katie!","rating":7},{"id":1186035686396321800,"text":"....fiction to Congress and the American People?  I demand his deposition. He is a fraud, just like the Russia Hoax was, and the Ukraine Hoax is now. When do the Do Nothing Democrats pay a price for what they are doing to our Country, &amp, when do the Republicans finally fight back?","rating":8},{"id":1134134880860852200,"text":"Just arrived in Colorado. Getting ready to deliver the commencement speech at the Air Force Academy graduation. Very exciting - probably will be broadcast live on TV. They want good ratings!","rating":4},{"id":1026587142989008900,"text":"California wildfires are being magnified &amp, made so much worse by the bad environmental laws which aren’t allowing massive amounts of readily available water to be properly utilized. It is being diverted into the Pacific Ocean. Must also tree clear to stop fire from spreading!","rating":7},{"id":898127175525728300,"text":"Publicity seeking Lindsey Graham falsely stated that I said there is moral equivalency between the KKK, neo-Nazis &amp, white supremacists......","rating":6},{"id":889473486506385400,"text":"Sleazy Adam Schiff, the totally biased Congressman looking into \"\"Russia,\"\" spends all of his time on television pushing the Dem loss excuse!","rating":8},{"id":1155893122578206700,"text":"Looking forward to my meeting at 2:00 P.M. with wonderful Inner City Pastors!","rating":3},{"id":1173371482812162000,"text":"The Fake News is saying that I am willing to meet with Iran, “No Conditions.” That is an incorrect statement (as usual!).","rating":5},{"id":1112922221037719600,"text":"....the crazed and incompetent Mayor of San Juan have done such a poor job  of bringing the Island back to health. 91 Billion Dollars to Puerto Rico, and now the Dems want to give them more, taking dollars away from our Farmers and so many others. Disgraceful!","rating":8},{"id":905788459301908500,"text":"For all of those (DACA) that are concerned about your status during the 6 month period, you have nothing to worry about - No action!","rating":4},{"id":1025386253892694000,"text":"Congratulations to Bill Lee of Tennessee on his big primary win for Governor last night.  He ran a great campaign and now will finish off the job in November. Bill has my total and enthusiastic Endorsement!","rating":3},{"id":1114672393773912000,"text":"We have redeployed 750 agents at the Southern Border’s specific Ports of Entry in order to help with the large scale surge of illegal migrants trying to make their way into the United States. This will cause traffic &amp, commercial delays until such time as Mexico is able to use....","rating":4},{"id":1052186219696803800,"text":"For the record, I have no financial interests in Saudi Arabia (or Russia, for that matter). Any suggestion that I have is just more FAKE NEWS (of which there is plenty)!","rating":6},{"id":1186257181689237500,"text":"Great new book by wonderful and very street smart author Dan Bongino, EXONERATED, THE FAILED TAKEDOWN OF PRESIDENT DONALD TRUMP BY THE SWAMP. Dan hits all of the crooked points of the greatest Witch Hunt in political history. Nevertheless, the Scam continues!","rating":7},{"id":870083798981111800,"text":"I will be announcing my decision on Paris Accord, Thursday at 3:00 P.M.  The White House Rose Garden.  MAKE AMERICA GREAT AGAIN!","rating":4},{"id":816979231217483800,"text":"...time for Republicans &amp, Democrats to get together and come up with a healthcare plan that really works - much less expensive &amp, FAR BETTER!","rating":4},{"id":1315652617863864300,"text":"The Republicans are giving the Democrats a great deal of time, which is not mandated, to make their self serving statements relative to our great new future Supreme Court Justice. Personally, I would pull back, approve, and go for STIMULUS for the people!!!","rating":4},{"id":1139164977271595000,"text":"....and other really bad people, SPIED ON MY CAMPAIGN! They even had an “insurance policy” just in case Crooked Hillary Clinton and the Democrats lost their race for the Presidency! This is the biggest &amp, worst political scandal in the history of the United States of America. Sad!","rating":9},{"id":906139352580972500,"text":"Republicans must start the Tax Reform/Tax Cut legislation ASAP. Don't wait until the end of September. Needed now more than ever. Hurry!","rating":3},{"id":1204909996590416000,"text":"Great Rally in Pennsylvania last night. Congressman Lloyd Smucker (PA-11) was there and I informed him that he has my complete and total Endorsement for the upcoming 2020 Election. Lloyd has done a great job. I am with him all the way!  #MAGA","rating":2},{"id":1130947087955308500,"text":"....at a conclusion of NO COLLUSION and NO OBSTRUCTION! The Dems were unhappy with the outcome of the $40M Mueller Report, so now they want a do-over.","rating":5},{"id":999984503123857400,"text":"“Everyone knows there was a Spy, and in fact the people who were involved in the Spying are admitting that there was a Spy...Widespread Spying involving multiple people.” Mollie Hemingway, The Federalist Senior Editor  But the corrupt Mainstream Media hates this monster story!","rating":7},{"id":862265729718128600,"text":"James Comey will be replaced by someone who will do a far better job, bringing back the spirit and prestige of the FBI.","rating":3},{"id":1010113882344558600,"text":"Even if we get 100% Republican votes in the Senate, we need 10 Democrat votes to get a much needed Immigration Bill - &amp, the Dems are Obstructionists who won’t give votes for political reasons &amp, because they don’t care about Crime coming from Border! So we need to elect more R’s!","rating":4},{"id":948202173049049100,"text":"The Failing New York Times has a new publisher, A.G. Sulzberger. Congratulations! Here is a last chance for the Times to fulfill the vision of its Founder, Adolph Ochs, “to give the news impartially, without fear or FAVOR, regardless of party, sect, or interests involved.” Get...","rating":6},{"id":1140059245456633900,"text":"....misleading in that I personally spent only a small fraction of that time doing interviews. I do have a few other things to do, you know!). Think I will do many more Network Interviews, as I did in 2016, in order to get the word out that no President has done what I have in...","rating":5},{"id":858375278686613500,"text":"Mainstream (FAKE) media refuses to state our long list of achievements, including 28 legislative signings, strong borders &amp, great optimism!","rating":7},{"id":1195360243708047400,"text":"Another Record Stock Market, 21 times this year, despite an ongoing, &amp, totally unfounded, Witch Hunt, &amp, a Democrat Party that would love to see a nice, big, juicy recession. In actuality, the potential for the United States is unlimited. We will power through the Do Nothing Dems!","rating":8},{"id":1007278671097417700,"text":"Now that I am back from Singapore, where we had a great result with respect to North Korea, the thought process must sadly go back to the Witch Hunt, always remembering that there was No Collusion and No Obstruction of the fabricated No Crime.","rating":6},{"id":1175527078005002200,"text":"“It appears that an American spy in one of our intelligence agencies may have been spying on our own president. The complaint suggests that this intel agent was listening in on Trump’s conversation....","rating":9},{"id":949303089416294400,"text":"The Mercer Family recently dumped the leaker known as Sloppy Steve Bannon. Smart!","rating":8},{"id":1181968273333719000,"text":"So why is someone a good or great President if they needed to Spy on someone else’s Campaign in order to win (that didn’t work out so well), and if they were unable to fill 142 important Federal Judgeships (a record by far), handing them all to me to choose. Will have 182 soon!","rating":7},{"id":1345088187811700700,"text":"The BIG Protest Rally in Washington, D.C., will take place at 11.00 A.M. on January 6th. Locational details to follow. StopTheSteal!","rating":10},{"id":807935995316408300,"text":"Being at the Army - Navy Game was fantastic. There is nothing like the spirit in that stadium. A wonderful experience, and congrats to Army!","rating":5},{"id":820631495660408800,"text":"The Democrats are most angry that so many Obama Democrats voted for me. With all of the jobs I am bringing back to our Nation, that number..","rating":6},{"id":1125067530828173300,"text":"The Kentucky Derby decision was not a good one. It was a rough &amp, tumble race on a wet and sloppy track, actually, a beautiful thing to watch. Only in these days of political correctness could such an overturn occur. The best horse did NOT win the Kentucky Derby - not even close!","rating":8},{"id":1146421386820427800,"text":"S&amp,P 500 hits new record high. Up 19% for the year. Congratulations!","rating":2},{"id":1155829888701673500,"text":"The Fed “raised” way too early and way too much. Their quantitative tightening was another big mistake. While our Country is doing very well, the potential wealth creation that was missed, especially when measured against our debt, is staggering. We are competing with other.....","rating":3},{"id":1115578769518018600,"text":"The World Trade Organization finds that the European Union subsidies to Airbus has adversely impacted the United States, which will now put Tariffs on $11 Billion of EU products! The EU has taken advantage of the U.S. on trade for many years. It will soon stop!","rating":4},{"id":1193894144747430000,"text":"The lawyer for the Whistleblower takes away all credibility from this big Impeachment Scam! It should be ended and the Whistleblower, his lawyer and Corrupt politician Schiff should be investigared for fraud!","rating":7},{"id":1152195094398873600,"text":"Thomas “the Chin” Friedman, a weak and pathetic sort of guy, writes columns for The New York Times in between rounds of his favorite game, golf. Two weeks ago, while speaking to a friend on his cell phone, I unfortunately ended up speaking to Friedman. We spoke for a while and...","rating":8},{"id":1074989817061093400,"text":"Biggest outrage yet in the long, winding and highly conflicted Mueller Witch Hunt is the fact that 19,000 demanded Text messages between Peter Strzok and his FBI lover, Lisa Page, were purposely &amp, illegally deleted. Would have explained whole Hoax, which is now under protest!","rating":9},{"id":1039828966595616800,"text":"We got A Pluses for our recent hurricane work in Texas and Florida (and did an unappreciated great job in Puerto Rico, even though an inaccessible island with very poor electricity and a totally incompetent Mayor of San Juan). We are ready for the big one that is coming!","rating":6},{"id":1123542897960390700,"text":"Gallup Poll: 56% of Americans rate their financial situation as excellent or good. This is the highest number since 2002, and up 10 points since 2016.","rating":2},{"id":1191708086140047400,"text":"....monsters, the United States stands ready, willing &amp, able to get involved and do the job quickly and effectively. The great new President of Mexico has made this a big issue, but the cartels have become so large and powerful that you sometimes need an army to defeat an army!","rating":5},{"id":1027600571530969100,"text":"Congressman Ted Yoho of Florida is doing a fantastic job and has my complete and total Endorsement! Tough on Crime and Borders, Ted was really helpful on Tax Cuts. Vote all the way for Ted in the upcoming Primary - he will never let you down!","rating":3},{"id":1096242299561017300,"text":"“After The Flight 93 Election, The Vote That Saved America - And What We Still Have To Lose,” by very talented Michael Anton, is a terrific read. Check it out!","rating":3},{"id":1180886040791388200,"text":"....And by the way, I would LOVE running against 1% Joe Biden - I just don’t think it’s going to happen. Sleepy Joe won’t get to the starting gate, &amp, based on all of the money he &amp, his family probably “extorted,” Joe should hang it up. I wouldn’t want him dealing with China &amp, U!","rating":8},{"id":976420417090015200,"text":"“Special Council is told to find crimes, whether a crime exists or not. I was opposed to the selection of Mueller to be Special Council. I am still opposed to it. I think President Trump was right when he said there never should have been a Special Council appointed because.....","rating":4},{"id":913371663789625300,"text":"Democrats don't want massive tax cuts - how does that win elections? Great reviews for Tax Cut and Reform Bill.","rating":3},{"id":979108653377704000,"text":"I am pleased to announce that I intend to nominate highly respected Admiral Ronny L. Jackson, MD, as the new Secretary of Veterans Affairs....","rating":2},{"id":1170469619154530300,"text":"....an attack in Kabul that killed one of our great great soldiers, and 11 other people. I immediately cancelled the meeting and called off peace negotiations. What kind of people would kill so many in order to seemingly strengthen their bargaining position? They didn’t, they....","rating":3},{"id":1141027593774346200,"text":"Acting Secretary of Defense Patrick Shanahan, who has done a wonderful job, has decided not to go forward with his confirmation process so that he can devote more time to his family....","rating":2},{"id":1101839731761995800,"text":"Will be speaking at CPAC at 11:30 this morning. Record crowd, live broadcast. Enjoy!","rating":1},{"id":894525428236464100,"text":"Interesting to watch Senator Richard Blumenthal of Connecticut talking about hoax Russian collusion when he was a  phony Vietnam con artist!","rating":7},{"id":1195727871765074000,"text":"“My support for Donald Trump has never been greater than it is right now. It is paramountly obvious watching this, these people have to go. You elected Donald Trump to drain the Swamp, well, dismissing people like Yovanovitch is what that looks like. Dismissing people like Kent..","rating":5},{"id":1187389630271934500,"text":"The Oil Fields discussed in my speech on Turkey/Kurds yesterday were held by ISIS until the United States took them over with the help of the Kurds. We will NEVER let a reconstituted ISIS have those fields!","rating":4},{"id":1131158414279827500,"text":"Also, tremendous work is being done on pure renovation - fixing existing Walls that are in bad condition and ineffective, and bringing them to a very high standard!","rating":3},{"id":1004174436759691300,"text":"....The greatest Witch Hunt in political history!","rating":7},{"id":1143839815600918500,"text":"Democrats want Open Borders, which equals violent crime, drugs and human trafficking. They also want very high taxes, like 90%. Republicans want what’s good for America - the exact opposite!","rating":6},{"id":1031857204767453200,"text":"Even James Clapper has admonished John Brennan for having gone totally off the rails. Maybe Clapper is being nice to me so he doesn’t lose his Security Clearance for lying to Congress!","rating":5},{"id":927672843504177200,"text":"I have great confidence in King Salman and the Crown Prince of Saudi Arabia, they know exactly what they are doing....","rating":4},{"id":1030419975692005400,"text":"How does a politician, Cuomo, known for pushing people and businesses out of his state, not to mention having the highest taxes in the U.S., survive making the statement, WE’RE NOT GOING TO MAKE AMERICA GREAT AGAIN, IT WAS NEVER THAT GREAT? Which section of the sentence is worse?","rating":6},{"id":1159083370095288300,"text":"....terrible thing to watch, especially when things could be taken care of sooo easily. We will WIN anyway, but it would be much easier if the Fed understood, which they don’t, that we are competing against other countries, all of whom want to do well at our expense!","rating":3},{"id":1051984061860905000,"text":"Open enrollment starts today on lower-priced Medicare Advantage plans so loved by our great seniors. Crazy Bernie and his band of Congressional Dems will outlaw these plans. Disaster!","rating":5},{"id":1032017630662729700,"text":"Just landed in West Virginia. Big crowd, looking forward to seeing everyone soon! #MAGA","rating":2},{"id":1131393056299786200,"text":"Democrats don’t want to fix the loopholes at the Border. They don’t want to do anything. Open Borders and crime!","rating":6},{"id":1229871184193282000,"text":".....Mini is illegally buying the Democrat Nomination. They are taking it away from Bernie again. Mini Mike, Major Party Nominations are not for sale! Good luck in the debate tomorrow night and remember, no standing on boxes!","rating":10},{"id":1050746600916754400,"text":"So nice, everyone wants Ivanka Trump to be the new United Nations Ambassador. She would be incredible, but I can already hear the chants of Nepotism! We have great people that want the job.","rating":8},{"id":1148548684424056800,"text":"Very good numbers on the economy. Much potential for growth. Trade deals being negotiated or being set up for negotiation. We have been treated very unfairly (to put it mildly) by other countries for many years, but that is changing!","rating":4},{"id":921891186352287700,"text":"...2nd Amendment, Strong Military, ISIS, historic VA improvement, Supreme Court Justice, Record Stock Market, lowest unemployment in 17 yrs!","rating":3},{"id":820632299037409300,"text":"will only get higher. Car companies and others, if they want to do business in our country, have to start making things here again. WIN!","rating":5},{"id":1042030988518408200,"text":"“What will be disclosed is that there was no basis for these FISA Warrants, that the important information was kept from the court, there’s going to be a disproportionate influence of the (Fake) Dossier. Basically you have a counter terrorism tool used to spy on a presidential...","rating":6},{"id":1185735579327193000,"text":"....Therefore, based on both Media &amp, Democrat Crazed and Irrational Hostility, we will no longer consider Trump National Doral, Miami, as the Host Site for the G-7 in 2020. We will begin the search for another site, including the possibility of Camp David, immediately. Thank you!","rating":7},{"id":972835128056664000,"text":"The Republicans are 5-0 in recent Congressional races, a point which the Fake News Media continuously fails to mention. I backed and campaigned for all of the winners. They give me credit for one. Hopefully, Rick Saccone will be another big win on Tuesday.","rating":4},{"id":1104018553987100700,"text":"Women’s unemployment rate is down to 3.6% - was 7.9% in January, 2011. Things are looking good!","rating":3},{"id":793456094198759400,"text":"So terrible that Crooked didn't report she got the debate questions from Donna Brazile, if that were me it would have been front page news!","rating":8},{"id":1126909015114637300,"text":"Great Republican vote today on Disaster Relief Bill. We will now work out a bipartisan solution that gets relief for our great States and Farmers. Thank you to all. Get me a Bill that I can quickly sign!","rating":3},{"id":1030631977135812600,"text":"“Bruce Ohr of DOJ is in legal jeopardy, it’s astonishing that he’s still employed. Bruce &amp, Nelly Ohr’s bank account is getting fatter &amp, fatter because of the Dossier that they are both peddling. He doesn’t disclose it under Fed Regs. Using your Federal office for personal.......","rating":6},{"id":1075018465356996600,"text":"....WILL NEVER BE PROVEN AND ARE LIKELY FALSE.”  Thank you to Michael Isikoff, Yahoo, for honesty. What this means is that the FISA WARRANTS and the whole Russian Witch Hunt is a Fraud and a Hoax which should be ended immediately. Also, it was paid for by Crooked Hillary &amp, DNC!","rating":7},{"id":862999243560288300,"text":"The Fake Media is working overtime today!","rating":5},{"id":1031917972099612700,"text":"To the incredible people of the Great State of Wyoming: Go VOTE TODAY for Foster Friess - He will be a fantastic Governor! Strong on Crime, Borders &amp, 2nd Amendment. Loves our Military &amp, our Vets. He has my complete and total Endorsement!","rating":4},{"id":800885097775956000,"text":"Prior to the election it was well known that I have interests in properties all over the world.Only the crooked media makes this a big deal!","rating":5},{"id":785530928256933900,"text":"Paul Ryan should spend more time on balancing the budget, jobs and illegal immigration and not waste his time on fighting Republican nominee","rating":6},{"id":1009785143635206100,"text":"What is the purpose of the House doing good immigration bills when you need 9 votes by Democrats in the Senate, and the Dems are only looking to Obstruct (which they feel is good for them in the Mid-Terms). Republicans must get rid of the stupid Filibuster Rule-it is killing you!","rating":5},{"id":986436520444866600,"text":"While Japan and South Korea would like us to go back into TPP, I don’t like the deal for the United States. Too many contingencies and no way to get out if it doesn’t work. Bilateral deals are far more efficient, profitable and better for OUR workers. Look how bad WTO is to U.S.","rating":4},{"id":1183493286708875300,"text":"The Democrats are going to lose a lot of House Seats because of their Fraudulent use of Impeachment. Schiff fabricated phone call, a crime. Democrat Senate Seats will also be put at risk, even some that were supposedly safe. Look at Louisiana last night, North Carolina last week!","rating":5},{"id":1159177811573166000,"text":"Watching Sleepy Joe Biden making a speech. Sooo Boring! The LameStream Media will die in the ratings and clicks with this guy. It will be over for them, not to mention the fact that our Country will do poorly with him. It will be one big crash, but at least China will be happy!","rating":8},{"id":1216365925701705700,"text":"Michael Goodwin, New York Post: “Trump’s peace through strength philosophy is what America needs. His (John Kerry) claim bears no relation to reality. The Agreement didn’t create opportunities for America &amp; other signatories to confront Iran’s malign activities. It overlooked....","rating":3},{"id":1168174613827899400,"text":"In addition to Florida - South Carolina, North Carolina, Georgia, and Alabama, will most likely be hit (much) harder than anticipated. Looking like one of the largest hurricanes ever. Already category 5. BE CAREFUL! GOD BLESS EVERYONE!","rating":4},{"id":1183822494031065000,"text":"....and Assad to protect the land of our enemy? Anyone who wants to assist Syria in protecting the Kurds is good with me, whether it is Russia, China, or Napoleon Bonaparte. I hope they all do great, we are 7,000 miles away!","rating":7},{"id":1273665329416286200,"text":"...Religious Liberty, among many other things, are OVER and GONE!","rating":2},{"id":1004722061808427000,"text":"How could Jeff Flake, who is setting record low polling numbers in Arizona and was therefore humiliatingly forced out of his own Senate seat without even a fight (and who doesn’t have a clue), think about running for office, even a lower one, again? Let’s face it, he’s a Flake!","rating":8},{"id":1295792202526974000,"text":"...Meanwhile, I gave America energy independence in fact, so much energy we could never use it all. The Bernie/Biden/AOC Green New Deal plan would take California’s failed policies to every American!","rating":6},{"id":1274353054117236700,"text":".....who was all washed up until I brought him back and gave him a chance, broke the law by releasing Classified Information (in massive amounts). He must pay a very big price for this, as others have before him. This should never to happen again!!!","rating":6},{"id":1165005930733473800,"text":"...Additionally, the remaining 300 BILLION DOLLARS of goods and products from China, that was being taxed from September 1st at 10%, will now be taxed at 15%. Thank you for your attention to this matter!","rating":4},{"id":986303188587425800,"text":"Rasmussen just came out at 51% Approval despite the Fake News Media. They were one of the three most accurate on Election Day. Just about the most inaccurate were CNN and ABC News/Washington Post, and they haven’t changed (get new pollsters). Much of the media is a Scam!","rating":8},{"id":1066682146683846700,"text":"The large and violent French protests don’t take into account how badly the United States has been treated on Trade by the European Union or on fair and reasonable payments for our GREAT military protection. Both of these topics must be remedied soon.","rating":6},{"id":1148600596502589400,"text":"....healthcare (Obamacare) to stay in place, when it would have been replaced by something far better, shows how incredibly important our upcoming 2020 Election is. I have long heard that the appointment of Supreme Court Justices is a President’s most important decision. SO TRUE!","rating":4},{"id":921889525881819100,"text":"...9 months than this Administration. Over 50 Legislation approvals, massive regulation cuts, energy freedom, pipelines, border security....","rating":3},{"id":1188067369501053000,"text":"....greatly help the African American community (and all other communities), and which was unable to get done in past administrations despite a tremendous desire for it. This and best unemployment numbers EVER is more than Kamala will EVER be able to do for African Americans!","rating":7},{"id":1106949834739720200,"text":"On the recent non-binding vote (420-0) in Congress about releasing the Mueller Report, I told leadership to let all Republicans vote for transparency. Makes us all look good and doesn’t matter. Play along with the game!","rating":5},{"id":1153667150458081300,"text":"When an old Wall at the Southern Border, that is crumbling and falling over, built in an important section to keep out problems, is replaced with a brand new 30 foot high steel and concrete Wall, the Media says no new Wall has been built. Fake News! Building lots of Wall!","rating":7},{"id":1127965568747933700,"text":"...completely avoided if you buy from a non-Tariffed Country, or you buy the product inside the USA (the best idea). That’s Zero Tariffs. Many Tariffed companies will be leaving China for Vietnam and other such countries in Asia. That’s why China wants to make a deal so badly!...","rating":4},{"id":1040217897703026700,"text":"3000 people did not die in the two hurricanes that hit Puerto Rico. When I left the Island, AFTER the storm had hit, they had anywhere from 6 to 18 deaths. As time went by it did not go up by much. Then, a long time later, they started to report really large numbers, like 3000...","rating":9},{"id":1130433208997355500,"text":".....was very good and highly professional to deal with - and if for any reason I didn’t like them, I would have gone elsewhere....there was always plenty of money around and banks to choose from. They would be very happy to take my money. Fake News!","rating":5},{"id":933301876975718400,"text":"Will be having meetings and working the phones from the Winter White House in Florida (Mar-a-Lago). Stock Market hit new Record High yesterday - $5.5 trillion gain since E. Many companies coming back to the U.S. Military building up and getting very strong.","rating":3},{"id":927644826006425600,"text":"The state of Virginia economy, under Democrat rule, has been terrible. If you vote Ed Gillespie tomorrow, it will come roaring back!","rating":4},{"id":879827411008974800,"text":"With ZERO Democrats to help, and a failed, expensive and dangerous ObamaCare as the Dems legacy, the Republican Senators are working hard!","rating":5},{"id":1052537536961306600,"text":"August job openings hit a record 7.14 million. Congratulations USA!","rating":2},{"id":887279050263285800,"text":"We were let down by all of the Democrats and a few Republicans. Most Republicans were loyal, terrific &amp, worked really hard. We will return!","rating":4},{"id":1042264934288175100,"text":"....returned home to the United States. Also, North and South Korea will file a joint bid to host the 2032 Olympics. Very exciting!","rating":3},{"id":1019890400029499400,"text":"Thank you to Novartis for not increasing your prices on prescription drugs. Likewise to Pfizer. We are making a big push to actually reduce the prices, maybe substantially, on prescription drugs.","rating":3},{"id":1166723478776684500,"text":"....And by the way, I’m the best thing that’s ever happened to Puerto Rico!","rating":9},{"id":1016729137409486800,"text":"Many countries in NATO, which we are expected to defend, are not only short of their current commitment of 2% (which is low), but are also delinquent for many years in payments that have not been made. Will they reimburse the U.S.?","rating":6},{"id":1009900306694656000,"text":"Farm Bill just passed in the House. So happy to see work requirements included. Big win for the farmers!","rating":3},{"id":930089374187950100,"text":"I am proud of the Rep. House &amp, Senate for working so hard on cutting taxes {&amp, reform.} We’re getting close! Now, how about ending the unfair &amp, highly unpopular Indiv Mandate in OCare &amp, reducing taxes even further? Cut top rate to 35% w/all of the rest going to middle income cuts?","rating":3},{"id":965943827931549700,"text":"I have been much tougher on Russia than Obama, just look at the facts. Total Fake News!","rating":6},{"id":1026495277824401400,"text":"Kris Kobach, a strong and early supporter of mine, is running for Governor of the Great State of Kansas.  He is a fantastic guy who loves his State and our Country - he will be a GREAT Governor and has my full &amp, total Endorsement! Strong on Crime, Border &amp, Military. VOTE TUESDAY!","rating":2},{"id":1203391305990193200,"text":"“Why re-elect Democrats when you know that this is what they are doing with their majority. Their case is not strong because first it was Russian Collusion, then it was obstruction, then it was Ukraine, now their pivoting back to Russia. Why would they be doing that?” Lisa Booth","rating":4},{"id":901411986302488600,"text":"Closely monitoring #HurricaneHarvey from Camp David. We are leaving nothing to chance. City, State and Federal Govs. working great together!","rating":2},{"id":1066670550708301800,"text":"I will be in Gulfport and Tupelo, Mississippi, on Monday night doing two Rallies for Senator Hyde-Smith, who has a very important Election on Tuesday. She is an outstanding person who is strong on the Border, Crime, Military, our great Vets, Healthcare &amp, the 2nd A. Needed in D.C.","rating":3},{"id":831842652085686300,"text":"Thank you to Eli Lake of The Bloomberg View - \"\"The NSA &amp, FBI...should not interfere in our politics...and is\"\" Very serious situation for USA","rating":5},{"id":1104033876291305500,"text":"Heading now to the Great State of Alabama!","rating":1},{"id":1175923717534150700,"text":"..Breaking News: The Ukrainian Government just said they weren’t pressured at all during the “nice” call. Sleepy Joe Biden, on the other hand, forced a tough prosecutor out from investigating his son’s company by threat of not giving big dollars to Ukraine. That’s the real story!","rating":7},{"id":851092500056072200,"text":"So sad to hear of the terrorist attack in Egypt. U.S. strongly condemns. I have great...","rating":2},{"id":1005033088202756100,"text":"Looking forward to straightening out unfair Trade Deals with the G-7 countries. If it doesn’t happen, we come out even better!","rating":6},{"id":930259298407419900,"text":"Excited to be heading home to see the House pass a GREAT Tax Bill with the middle class getting big TAX CUTS!#MakeAmericaGreatAgain🇺🇸","rating":5},{"id":862998775731818500,"text":"Again, the story that there was collusion between the Russians &amp, Trump campaign was fabricated by Dems as an excuse for losing the election.","rating":7},{"id":1173728490618671000,"text":"...She can never recover, and will never return to Greatness, under current Management. The Times is DEAD, long live The New York Times!","rating":8},{"id":1228339433323290600,"text":"I was very surprised &amp; disappointed that Senator Joe Manchin of West Virginia voted against me on the Democrat’s totally partisan Impeachment Hoax. No President has done more for the great people of West Virginia than me (Pensions), and that will....","rating":7},{"id":935339687006429200,"text":"New home sales reach a 10 year high. Stock Market has more record gains. Hopefully Republican Senators will give us the much needed Tax Cuts to keep it all going! Democrats want big Tax Increases.","rating":5},{"id":1007594445104189400,"text":"“Donald Trump was 100% right to fire James Comey.” Mark Levin","rating":4},{"id":1035131133997068300,"text":"Ivanka Trump &amp, Jared Kushner had NOTHING to do with the so called “pushing out” of Don McGahn.The Fake News Media has it, purposely,so wrong! They love to portray chaos in the White House when they know that chaos doesn’t exist-just a “smooth running machine” with changing parts!","rating":6},{"id":1192467215360102400,"text":"The Radical Left Dems and LameStream Media are just trying to make it hard for Republicans and me to win in 2020. The new Impeachment Hoax is already turning against them!","rating":7},{"id":1149472282584072200,"text":"I am not a fan of Bitcoin and other Cryptocurrencies, which are not money, and whose value is highly volatile and based on thin air. Unregulated Crypto Assets can facilitate unlawful behavior, including drug trade and other illegal activity....","rating":6},{"id":1061104224090628100,"text":"Matthew G. Whitaker is a highly respected former U.S. Attorney from Iowa. He was chosen by Jeff Sessions to be his Chief of Staff. I did not know Mr. Whitaker. Likewise, as Chief, I did not know Mr. Whitaker except primarily as he traveled with A.G. Sessions. No social contact...","rating":3},{"id":1183499482069160000,"text":"My deal with China is that they will IMMEDIATELY start buying very large quantities of our Agricultural Product, not wait until the deal is signed over the next 3 or 4 weeks. THEY HAVE ALREADY STARTED! Likewise financial services and other deal aspects, start preparing....","rating":5},{"id":1027048797644439600,"text":"Congratulations to Josh Hawley on your big Senate Primary win in Missouri. I look forward to working with you toward a big win in November. We need you in Washington!","rating":2},{"id":1138023190020730900,"text":"Now with our new deal, Mexico is doing more for the USA on Illegal Immigration than the Democrats. In fact, the Democrats are doing NOTHING, they want Open Borders,which means Illigal Immigration, Drugs and Crime.","rating":7},{"id":1029180132630687700,"text":"Scott Walker of Wisconsin is a tremendous Governor who has done incredible things for that Great State. He has my complete &amp, total Endorsement! He brought the amazing Foxconn to Wisconsin with its 15,000 Jobs-and so much more. Vote for Scott on Tuesday in the Republican Primary!","rating":3},{"id":977124622285066200,"text":"House Intelligence Committee votes to release final report. FINDINGS: (1) No evidence provided of Collusion between Trump Campaign &amp, Russia. (2)  The Obama Administrations Post election response was insufficient. (3) Clapper provided inconsistent testimony on media contacts.","rating":4},{"id":884018776391503900,"text":"...and safe. Questions were asked about why the CIA &amp, FBI had to ask the DNC 13 times for their SERVER, and were rejected, still don't....","rating":4},{"id":817750330196820000,"text":"have enough problems around the world without yet another one. When I am President, Russia will respect us far more than they do now and....","rating":3},{"id":948194400114487300,"text":"Sanctions and “other” pressures are beginning to have a big impact on North Korea. Soldiers are dangerously fleeing to South Korea. Rocket man now wants to talk to South Korea for first time. Perhaps that is good news, perhaps not - we will see!","rating":6},{"id":1134921828198232000,"text":"....U.S. in order to avoid paying the 25% Tariff. Like Mexican companies will move back to the United States once the Tariff reaches the higher levels. They took many of our companies &amp, jobs, the foolish Pols let it happen, and now they will come back unless Mexico stops the.....","rating":6},{"id":1168664116095082500,"text":"....when in fact, under certain original scenarios, it was in fact correct that Alabama could have received some “hurt.” Always good to be prepared! But the Fake News is only interested in demeaning and belittling. Didn’t play my whole sentence or statement. Bad people!","rating":8},{"id":1075878793393463300,"text":"....equipment. General Mattis was a great help to me in getting allies and other countries to pay their share of military obligations. A new Secretary of Defense will be named shortly. I greatly thank Jim for his service!","rating":3},{"id":1159473911748317200,"text":"....John Deere, our car companies, &amp, others, to compete on a level playing field. With substantial Fed Cuts (there is no inflation) and no quantitative tightening, the dollar will make it possible for our companies to win against any competition. We have the greatest companies...","rating":4},{"id":1135488087453253600,"text":"China is subsidizing its product in order that it can continue to be sold in the USA. Many firms are leaving China for other countries, including the United States, in order to avoid paying the Tariffs. No visible increase in costs or inflation, but U.S. is taking Billions!","rating":5},{"id":1139236468365434900,"text":"While I very much appreciate P.M. Abe going to Iran to meet with Ayatollah Ali Khamenei, I personally feel that it is too soon to even think about making a deal. They are not ready, and neither are we!","rating":4},{"id":1171431074485817300,"text":"One of the greatest and most powerful weapons used by the Fake and Corrupt News Media is the phony Polling Information they put out. Many of these polls are fixed, or worked in such a way that a certain candidate will look good or bad. Internal polling looks great, the best ever!","rating":7},{"id":1167893379461443600,"text":"“The vindication belongs to the President for firing James Comey. It was clearly the right thing to do. You don’t want an FBI Director with Jim Comey’s ethics.” Jason Riley, Wall Street Journal","rating":4},{"id":1102004371225751600,"text":"The brand new manuscript for a new book by failed lawyer Michael Cohen shows his testimony was a total lie! Pundits should only use it.","rating":6},{"id":1129067332725297200,"text":"Congratulations to Dan Bishop on his big Republican Primary victory in the 9th Congressional District of North Carolina. Dan is strong on Crime, Loves our Military, Vets, 2A, and great Healthcare. He has my Complete and Total Endorsement! #MAGA","rating":2},{"id":992083738531192800,"text":"This spring marks 4yrs since the Phoenix VA crisis. We won't forget what happened to our GREAT VETS. Choice is vital, but the program needs work &amp, is running out of $. Congress must fix Choice Program by Memorial Day so VETS can get the care they deserve. I will sign immediately!","rating":3},{"id":1062047641889095700,"text":"Hopefully, Saudi Arabia and OPEC will not be cutting oil production. Oil prices should be much lower based on supply!","rating":5},{"id":1127681373966409700,"text":"....We will then spend (match or better) the money that China may no longer be spending with our Great Patriot Farmers (Agriculture), which is a small percentage of total Tariffs received, and distribute the food to starving people in nations around the world! GREAT! #MAGA","rating":8},{"id":1155938089044308000,"text":"....He is tough on Crime, Strong on Borders, and will fight for our Second Amendment. Daniel will never let you down. He has my Full and Complete Endorsement!","rating":4},{"id":919560102725738500,"text":"...approvals of The Keystone XL &amp, Dakota Access pipelines. Also, look at the recent EPA cancelations &amp, our great new Supreme Court Justice!","rating":3},{"id":1017288317342224400,"text":"Presidents have been trying unsuccessfully for years to get Germany and other rich NATO Nations to pay more toward their protection from Russia. They pay only a fraction of their cost. The U.S. pays tens of Billions of Dollars too much to subsidize Europe, and loses Big on Trade!","rating":6},{"id":1039111866956566500,"text":"The Woodward book is a Joke - just another assault against me, in a barrage of assaults, using now disproven unnamed and anonymous sources. Many have already come forward to say the quotes by them, like the book, are fiction. Dems can’t stand losing. I’ll write the real book!","rating":7},{"id":830405706255913000,"text":"I am reading that the great border WALL will cost more than the government originally thought, but I have not gotten involved in the.....","rating":6},{"id":1126928410310266900,"text":"....into the future will continue. In the meantime, the United States has imposed Tariffs on China, which may or may not be removed depending on what happens with respect to future negotiations!","rating":4},{"id":1130655064631238700,"text":"Megan King, who is running for Superior Court Judge in the Pennsylvania election, has my Full and Total Endorsement. She is tough on crime and fully understands all aspects of the law. Vote for Megan tomorrow (Tuesday).","rating":3},{"id":1112900816371900400,"text":"Everybody agrees that ObamaCare doesn’t work. Premiums &amp, deductibles are far too high - Really bad HealthCare! Even the Dems want to replace it, but with Medicare for all, which would cause 180 million Americans to lose their beloved private health insurance. The Republicans.....","rating":5},{"id":863007411132649500,"text":"James Comey better hope that there are no \"\"tapes\"\" of our conversations before he starts leaking to the press!","rating":9},{"id":929492038231429100,"text":"President Xi of China has stated that he is upping the sanctions against #NoKo. Said he wants them to denuclearize. Progress is being made.","rating":3},{"id":980800783313702900,"text":"Only fools, or worse, are saying that our money losing Post Office makes money with Amazon. THEY LOSE A FORTUNE, and this will be changed. Also, our fully tax paying retailers are closing stores all over the country...not a level playing field!","rating":7},{"id":1072462207416447000,"text":".....Ice, Border Patrol and our Military have done a FANTASTIC job of securing our Southern Border. A Great Wall would be, however, a far easier &amp, less expensive solution. We have already built large new sections &amp, fully renovated others, making them like new. The Democrats,.....","rating":5},{"id":1030241273784021000,"text":"“Very concerned about Comey’s firing, afraid they will be exposed,” said Bruce Ohr. DOJ’s Emails &amp, Notes show Bruce Ohr’s connection to (phony &amp, discredited) Trump Dossier. A creep thinking he would get caught in a dishonest act. Rigged Witch Hunt!","rating":8},{"id":980794173279342600,"text":"Mexico is making a fortune on NAFTA...They have very strong border laws - ours are pathetic. With all of the money they make from the U.S., hopefully they will stop people from coming through their country and into ours, at least until Congress changes our immigration laws!","rating":6},{"id":1156160004132675600,"text":"..My team is negotiating with them now, but they always change the deal in the end to their benefit. They should probably wait out our Election to see if we get one of the Democrat stiffs like Sleepy Joe. Then they could make a GREAT deal, like in past 30 years, and continue","rating":7},{"id":1146016074384773100,"text":"...Texas will defend them &amp, indemnify them against political harassment by New York State and Governor Cuomo. So many people are leaving New York for Texas and Florida that it is totally under siege. First New York taxes you too high, then they sue you, just to complete the job","rating":5},{"id":1002510522032541700,"text":"Looking forward to seeing the employment numbers at 8:30 this morning.","rating":2},{"id":1025728712560595000,"text":"Troy Balderson, running for Congress from Ohio, is in a big Election fight with a candidate who just got caught lying about his relationship with Nancy Pelosi, who is weak on Crime, Borders &amp, your 2nd Amendment-and wants to raise your Taxes (by a lot). Vote for Troy on Tuesday!","rating":4},{"id":1002968869043097600,"text":"There was No Collusion with Russia (except by the Democrats). When will this very expensive Witch Hunt Hoax ever end? So bad for our Country. Is the Special Counsel/Justice Department leaking my lawyers letters to the Fake News Media? Should be looking at Dems corruption instead?","rating":9},{"id":934792302341521400,"text":"I endorsed Luther Strange in the Alabama Primary. He shot way up in the polls but it wasn’t enough. Can’t let Schumer/Pelosi win this race. Liberal Jones would be BAD!","rating":7},{"id":869553853750014000,"text":"The U.S. Senate should switch to 51 votes, immediately, and get Healthcare and TAX CUTS approved, fast and easy. Dems would do it, no doubt!","rating":6},{"id":1011792563425116200,"text":"Tremendous win for Congressman Dan Donovan. You showed great courage in a tough race! New York, and my many friends on Staten Island, have elected someone they have always been very proud of. Congratulations!","rating":3},{"id":948205689683562500,"text":"....impartial journalists of a much higher standard, lose all of your phony and non-existent “sources,” and treat the President of the United States FAIRLY, so that the next time I (and the people) win, you won’t have to write an apology to your readers for a job poorly done! GL","rating":8},{"id":787258211283918800,"text":"This election is being rigged by the media pushing false and unsubstantiated charges, and outright lies, in order to elect Crooked Hillary!","rating":8},{"id":1183524771734184000,"text":"The U.S. has the worst of the ISIS prisoners. Turkey and the Kurds must not let them escape. Europe should have taken them back after numerous requests. They should do it now. They will never come to, or be allowed in, the United States!","rating":5},{"id":1173552937542570000,"text":"House Judiciary has given up on the Mueller Report, sadly for them after two years and $40,000,000 spent - ZERO COLLUSION, ZERO OBSTRUCTION. So they say, OK, lets look at everything else, and all of the deals that “Trump” has done over his lifetime. But it doesn’t....","rating":7},{"id":1020293430398935000,"text":"Farmers have been on a downward trend for 15 years. The price of soybeans has fallen 50% since 5 years before the Election. A big reason is bad (terrible) Trade Deals with other countries. They put on massive Tariffs and Barriers. Canada charges 275% on Dairy. Farmers will WIN!","rating":4},{"id":872062159789985800,"text":"During my recent trip to the Middle East I stated that there can no longer be funding of Radical Ideology. Leaders pointed to Qatar - look!","rating":5},{"id":914227642131509200,"text":"Results of recovery efforts will speak much louder than complaints by San Juan Mayor. Doing everything we can to help great people of PR!","rating":6},{"id":1059896399595225100,"text":"Florida, very important - get out and vote for Florida Congressional Candidate Michael Waltz (R). He has my Strong Endorsement!","rating":4},{"id":991994433750143000,"text":"...very common among celebrities and people of wealth. In this case it is in full force and effect and will be used in Arbitration for damages against Ms. Clifford (Daniels). The agreement was used to stop the false and extortionist accusations made by her about an affair,......","rating":7},{"id":868807754231820300,"text":"Whenever you see the words 'sources say' in the fake news media, and they don't mention names....","rating":5},{"id":894526670836781000,"text":"Never in U.S.history has anyone lied or defrauded voters like Senator Richard Blumenthal. He told stories about his Vietnam battles and....","rating":8},{"id":813945096269860900,"text":"The U.S. Consumer Confidence Index for December surged nearly four points to 113.7, THE HIGHEST LEVEL IN MORE THAN 15 YEARS! Thanks Donald!","rating":3},{"id":1008330598363091000,"text":"Holding back the “war games” during the negotiations was my request because they are VERY EXPENSIVE and set a bad light during a good faith negotiation. Also, quite provocative. Can start up immediately if talks break down, which I hope will not happen!","rating":5},{"id":1189173602500911000,"text":"A great new book just out, “The Plot Against the President. The True Story Of How Congressman Devin Nunez Uncovered the Biggest Political Scandal In U.S. History.” Shows very bad and corrupt people on the other side. Check it out!","rating":5},{"id":742019961946792000,"text":"Horrific incident in FL. Praying for all the victims &amp, their families. When will this stop? When will we get tough, smart &amp, vigilant?","rating":4},{"id":864438529472049200,"text":"...to terrorism and airline flight safety. Humanitarian reasons, plus I want Russia to greatly step up their fight against ISIS &amp, terrorism.","rating":4},{"id":1075726666574544900,"text":"....Russia, Iran, Syria &amp, many others are not happy about the U.S. leaving, despite what the Fake News says, because now they will have to fight ISIS and others, who they hate, without us. I am building by far the most powerful military in the world. ISIS hits us they are doomed!","rating":9},{"id":1232064874156523500,"text":"Great new book just out, “Taken for Granted, How Conservatives Can Win Back Americans That Liberalism Failed”, by Gianni Caldwell, a young winner! He will be at the Ronald Reagan Library, Simi Valley, California, on Thursday at 6 PM, PT. Check it out!","rating":2},{"id":1011360410648416300,"text":"Surprised that Harley-Davidson, of all companies, would be the first to wave the White Flag. I fought hard for them and ultimately they will not pay tariffs selling into the E.U., which has hurt us badly on trade, down $151 Billion. Taxes just a Harley excuse - be patient!  #MAGA","rating":7},{"id":811195441710764000,"text":"Bill Clinton stated that I called him after the election. Wrong, he called me (with a very nice congratulations). He \"\"doesn't know much\"\" ...","rating":6},{"id":917923131003719700,"text":"...fired. This story is totally made up by the dishonest media.The Chief is doing a FANTASTIC job for me and, more importantly, for the USA!","rating":5},{"id":1318267922112942000,"text":"....Washington wants nothing to do with him, and that’s so bad for New York, which has become a ghost town. Andrew spends too much time listening to his brother, Fredo. Forget the books and your apology tour. The Federal Government would love to help New York regain its luster!","rating":6},{"id":1204516557730275300,"text":"Just received a briefing on the horrific shootout that took place in Jersey City, NJ. Our thoughts &amp, prayers are w/ the victims &amp, their families during this very difficult &amp, tragic time. We will continue to monitor the situation as we assist local &amp, state officials on the ground.","rating":3},{"id":926456069047582700,"text":"Bernie Sanders supporters have every right to be apoplectic of the complete theft of the Dem primary by Crooked Hillary!","rating":8},{"id":1180939171755630600,"text":"Will be in Minnesota on Thursday night. Massive response, crowd and enthusiasm (actually, all over the Country) will be beyond belief! Same thing in Louisiana on Friday. Big and Bold USA!","rating":4},{"id":1029321624603054100,"text":"Tom Fitton of Judicial Watch: “The Strzok firing is as much about the Mueller operation as anything else. There would be no Mueller Special Councel to investigate so called collusion but for the machinations of Strzok &amp, his colleagues at the top levels of the FBI. We know this...","rating":5},{"id":1167876404945383400,"text":"....but now we are moving forward like never before. We are winning again, and we are respected again!","rating":3},{"id":984020136255541200,"text":"....doing things that nobody thought possible, despite the never ending and corrupt Russia Investigation, which takes tremendous time and focus. No Collusion or Obstruction (other than I fight back), so now they do the Unthinkable, and RAID a lawyers office for information! BAD!","rating":7},{"id":848928217138384900,"text":"Getting ready to meet President al-Sisi of Egypt. On behalf of the United States, I look forward to a long and wonderful relationship.","rating":2},{"id":1181212691203084300,"text":"The Radical Left Democrats have failed on all fronts, so now they are pushing local New York City and State Democrat prosecutors to go get President Trump. A thing like this has never happened to any President before. Not even close!","rating":6},{"id":914189344533024800,"text":"Despite the Fake News Media in conjunction with the Dems, an amazing job is being done in Puerto Rico. Great people!","rating":5},{"id":1221663764971491300,"text":"...(Democrats said I never met) and released the military aid to Ukraine without any conditions or investigations - and far ahead of schedule. I also allowed Ukraine to purchase Javelin anti-tank missiles. My Administration has done far more than the previous Administration.","rating":4},{"id":1030416679069777900,"text":"In speaking with some of the world’s top business leaders I asked what it is that would make business (jobs) even better in the U.S. “Stop quarterly reporting &amp, go to a six month system,” said one. That would allow greater flexibility &amp, save money. I have asked the SEC to study!","rating":3},{"id":1206445922848313300,"text":"“Here in America it will be the same victory as BREXIT, but even more so. In the U.S., while all of this has been going on, the Impeachment, the obstruction, the resistance, President Trump has managed to deliver not just promises, but a record which adds up to one.....","rating":4},{"id":858660413873025000,"text":"...healthcare plan is on its way. Will have much lower premiums &amp, deductibles while at the same time taking care of pre-existing conditions!","rating":3},{"id":1103036072005640200,"text":"....Scott has helped us to lower drug prices, get a record number of generic drugs approved and onto the market, and so many other things. He and his talents will be greatly missed!","rating":2},{"id":1030536206415802400,"text":"Which is worse, Hightax Andrew Cuomo's statement, “WE’RE NOT GOING TO MAKE AMERICA GREAT AGAIN, IT WAS NEVER THAT GREAT” or Hillary Clinton’s “DEPLORABLES” statement...","rating":7},{"id":1130433208250769400,"text":"....Now the new big story is that Trump made a lot of money and buys everything for cash, he doesn’t need banks. But where did he get all of that cash? Could it be Russia? No, I built a great business and don’t need banks, but if I did they would be there...and DeutscheBank......","rating":8},{"id":1148559446030921700,"text":"....and they are both only getting bigger, better and stronger.....Thank you, Mr. President!","rating":4},{"id":1001415199516254200,"text":"“This investigation involved far more surveillance than we ever had any idea about. It wasn’t just a wiretap against a campaign aide...it was secretly gathering information on the Trump Campaign...people call that Spying...this is unprecedented and  scandalous.” Mollie Hemingway","rating":6},{"id":1035718986871320600,"text":"Still can’t believe that Bloomberg violated a firm OFF THE RECORD statement. Will they put out an apology?","rating":5},{"id":1041631817697251300,"text":"Our Steel Industry is the talk of the World. It has been given new life, and is thriving. Billions of Dollars is being spent on new plants all around the country!","rating":3},{"id":880410114456465400,"text":"...to Mar-a-Lago 3 nights in a row around New Year's Eve, and insisted on joining me. She was bleeding badly from a face-lift. I said no!","rating":9},{"id":1197503790729121800,"text":"Corrupt politician Adam Schiff’s lies are growing by the day. Keep fighting tough, Republicans, you are dealing with human scum who have taken Due Process and all of the Republican Party’s rights away from us during the most unfair hearings in American History......","rating":8},{"id":914467502251528200,"text":"...for safety. Thank you to the Governor of P.R. and to all of those who are working so closely with our First Responders. Fantastic job!","rating":3},{"id":1173560246863876000,"text":"Because we have done so well with Energy over the last few years (thank you, Mr. President!), we are a net Energy Exporter, &amp, now the Number One Energy Producer in the World. We don’t need Middle Eastern Oil &amp, Gas, &amp, in fact have very few tankers there, but will help our Allies!","rating":5},{"id":803931490514075600,"text":"Hence, legal documents are being crafted which take me completely out of business operations. The Presidency is a far more important task!","rating":3},{"id":1164675742984224800,"text":"Just heard that Sean Spicer will be on “Dancing with the Stars.” He will do great. A terrific person who loves our Country dearly!","rating":6},{"id":1265301261903106000,"text":"....One person lost to this invisible virus is too much, it should have been stopped at its source, China, but I acted very quickly, and made the right decisions. Many of the current political complainers thought, at the time, that I was moving far to fast, like Crazy Nancy!","rating":8},{"id":1181907681512169500,"text":"The Do Nothing Democrats are Con Artists, only looking to hurt the Republican Party and President. Their total focus is 2020, nothing more, and nothing less. The good news is that WE WILL WIN!!!!","rating":7},{"id":1138444530020245500,"text":"Good day in the Stock Market. People have no idea the tremendous potential our Country has for GROWTH - and many other things!","rating":4},{"id":908154067658174500,"text":"China has a business tax rate of 15%. We should do everything possible to match them in order to win with our economy. Jobs and wages!","rating":5},{"id":864436162567471100,"text":"As President I wanted to share with Russia (at an openly scheduled W.H. meeting) which I have the absolute right to do, facts pertaining....","rating":6},{"id":1204370794266185700,"text":"“You have to look at the 17 instances of misconduct cited in the Report, they are very bad. The FISA Court was clearly taken for a ride on this, a failure of the FBI up and fown the chain of command. It’s about as strong a medicine as I’ve seen in a report of this kind...","rating":5},{"id":1069613383622803500,"text":"“Michael Cohen asks judge for no Prison Time.” You mean he can do all of the TERRIBLE, unrelated to Trump, things having to do with fraud, big loans, Taxis, etc., and not serve a long prison term? He makes up stories to get a GREAT &amp, ALREADY reduced deal for himself, and get.....","rating":7},{"id":1180108227838697500,"text":"The Whistleblower, who had the facts wrong about the phone call, reached out, and more, to the Democrat controlled House Intelligence Committee. Schiff never told us about this!","rating":7},{"id":925336826717593600,"text":"I hope people will start to focus on our Massive Tax Cuts for Business (jobs) and the Middle Class (in addition to Democrat corruption)!","rating":6},{"id":854547423464759300,"text":"Despite major outside money, FAKE media support and eleven Republican candidates, BIG \"\"R\"\" win with runoff in Georgia. Glad to be of help!","rating":5},{"id":1007278825661784000,"text":"....Schneiderman, who ran the Clinton campaign in New York, never had the guts to bring this ridiculous case, which lingered in their office for almost 2 years. Now he resigned his office in disgrace, and his disciples brought it when we would not settle.","rating":7},{"id":818307689323368400,"text":"Dishonest media says Mexico won't be paying for the wall if they pay a little later so the wall can be built more quickly. Media is fake!","rating":8},{"id":1153281479184658400,"text":"The Amazon Washington Post front page story yesterday was total Fake News. They said “Advisors wrote new talking points and handed him reams of opposition research on the four Congresswomen.” Now really, does that sound like me? What advisors, there were no talking points,....","rating":8},{"id":1131002394966462500,"text":"John Brennan on the Mueller probe, “I don’t know if I received bad information, but I THINK I SUSPECTED THAT THERE WAS MORE THAN THERE ACTUALLY WAS.” Wow, he admits he was wrong! Congress should go back to work on drug prices etc.","rating":5},{"id":1237377697917141000,"text":"Our pathetic, slow moving Federal Reserve, headed by Jay Powell, who raised rates too fast and lowered too late, should get our Fed Rate down to the levels of our competitor nations. They now have as much as a two point advantage, with even bigger currency help. Also, stimulate!","rating":5},{"id":1126821035146469400,"text":"....If we bought 15 Billion Dollars of Agriculture from our Farmers, far more than China buys now, we would have more than 85 Billion Dollars left over for new Infrastructure, Healthcare, or anything else. China would greatly slow down, and we would automatically speed up!","rating":4},{"id":1201627440470212600,"text":"The Fed should lower rates (there is almost no inflation) and loosen, making us competitive with other nations, and manufacturing will SOAR! Dollar is very strong relative to others.","rating":4},{"id":1123987855053873200,"text":"Steve Moore, a great pro-growth economist and a truly fine person, has decided to withdraw from the Fed process. Steve won the battle of ideas including Tax Cuts....","rating":3},{"id":980762392303980500,"text":"Mexico has the absolute power not to let these large “Caravans” of people enter their country. They must stop them at their Northern Border, which they can do because their border laws work, not allow them to pass through into our country, which has no effective border laws.....","rating":5},{"id":1023546197129224200,"text":"Had a very good and interesting meeting at the White House with A.G. Sulzberger, Publisher of the New York Times. Spent much time talking about the vast amounts of Fake News being put out by the media &amp, how that Fake News has morphed into phrase, “Enemy of the People.” Sad!","rating":7},{"id":820255947956383700,"text":"mention crime infested) rather than falsely complaining about the election results. All talk, talk, talk - no action or results. Sad!","rating":6},{"id":1143948712684576800,"text":"The Democrats should change the Loopholes and Asylum Laws so lives will be saved at our Southern Border. They said it was not a crisis at the Border, that it was all just “manufactured.” Now they admit that I was right - But they must do something about it. Fix the Laws NOW!","rating":5},{"id":813500123053490200,"text":"The United Nations has such great potential but right now it is just a club for people to get together, talk and have a good time. So sad!","rating":8},{"id":1047139656066842600,"text":"Great reviews on the new USMCA. Thank you! Mexico and Canada will be wonderful partners in Trade (and more) long into the future.","rating":3},{"id":1031503298967363600,"text":"Disgraced and discredited Bob Mueller and his whole group of Angry Democrat Thugs spent over 30 hours with the White House Councel, only with my approval, for purposes of transparency. Anybody needing that much time when they know there is no Russian Collusion is just someone....","rating":7},{"id":969374597127778300,"text":"Jobless claims at a 49 year low!","rating":2},{"id":987774054651301900,"text":"James Comey’s Memos are Classified, I did not Declassify them. They belong to our Government! Therefore, he broke the law! Additionally, he totally made up many of the things he said I said, and he is already a proven liar and leaker. Where are Memos on Clinton, Lynch &amp, others?","rating":6},{"id":927648870796070900,"text":"Getting ready to leave for South Korea and meetings with President Moon, a fine gentleman. We will figure it all out!","rating":2},{"id":969374909209239600,"text":"Manufacturing growing at the fastest pace in almost two decades!","rating":3},{"id":1037869794672799700,"text":"Getting ready to go on stage for Matt Rosendale, who will be a great Senator. Jon Tester has let the people of Montana down &amp, does not deserve another six years. Matt is strong on Crime, the Borders, &amp, will save your Second Amendment from the onslaught. Loves our Military &amp, Vets!","rating":5},{"id":1156666163310530600,"text":"What the Market wanted to hear from Jay Powell and the Federal Reserve was that this was the beginning of a lengthy and aggressive rate-cutting cycle which would keep pace with China, The European Union and other countries around the world....","rating":4},{"id":1149281529727766500,"text":"The Pledge of Allegiance to our great Country, in St. Louis Park, Minnesota, is under siege. That is why I am going to win the Great State of Minnesota in the 2020 Election. People are sick and tired of this stupidity and disloyalty to our wonderful USA!","rating":7},{"id":1026075214227165200,"text":"Tariffs are working big time. Every country on earth wants to take wealth out of the U.S., always to our detriment. I say, as they come,Tax them. If they don’t want to be taxed, let them make or build the product in the U.S. In either event, it means jobs and great wealth.....","rating":6},{"id":973536164044034000,"text":"The Economy is raging, at an all time high, and is set to get even better. Jobs and wages up. Vote for Rick Saccone and keep it going!","rating":2},{"id":903597166249246700,"text":"General John Kelly is doing a great job as Chief of Staff. I could not be happier or more impressed - and this Administration continues to..","rating":2},{"id":1158407373666566100,"text":"China is intent on continuing to receive the hundreds of Billions of Dollars they have been taking from the U.S. with unfair trade practices and currency manipulation. So one-sided, it should have been stopped many years ago!","rating":4},{"id":1026524292396273700,"text":"Governor Jerry Brown must allow the Free Flow of the vast amounts of water coming from the North and foolishly being diverted into the Pacific Ocean. Can be used for fires, farming and everything else. Think of California with plenty of Water - Nice! Fast Federal govt. approvals.","rating":5},{"id":1233488317049602000,"text":"Mini Mike is getting slammed. His debates were, perhaps, the worst in presidential debating history. A total phony who disavowed “Stop &amp; Frisk” after swearing by it for years, and even recently. He horribly overused it, &amp; then dropped when running as a Dem. A total phony!","rating":8},{"id":916780428253687800,"text":"Leaving the White House for the Great State of North Carolina. Big progress being made on many fronts!","rating":3},{"id":919908143475413000,"text":"Dem Senator Schumer hated the Iran deal made by President Obama, but now that I am involved, he is OK with it. Tell that to Israel, Chuck!","rating":7},{"id":890162144884514800,"text":"The crowd in Ohio was amazing last night - broke all records. We all had a great time in a great State. Will be back soon!","rating":4},{"id":808638507161882600,"text":"I have chosen one of the truly great business leaders of the world, Rex Tillerson, Chairman and CEO of ExxonMobil, to be Secretary of State.","rating":2},{"id":1099341141152055300,"text":"Great new book: “The Case For Trump” by Victor Davis Hanson, Hoover Senior Fellow.","rating":1},{"id":1175409914384126000,"text":"Now that the Democrats and the Fake News Media have gone “bust” on every other of their Witch Hunt schemes, they are trying to start one just as ridiculous as the others, call it the Ukraine Witch Hunt, while at the same time trying to protect Sleepy Joe Biden. Will fail again!","rating":8},{"id":1090987128480301000,"text":"Looking for China to open their Markets not only to Financial Services, which they are now doing, but also to our Manufacturing, Farmers and other U.S. businesses and industries. Without this a deal would be unacceptable!","rating":2},{"id":1018530179549823000,"text":"...know how to do is resist and obstruct! This is why there is such hatred and dissension in our country – but at some point, it will heal!","rating":5},{"id":1164311597587685400,"text":"....that when this Administration’s alternative is no longer available, California will squeeze them to a point of business ruin. Only reason California is now talking to them is because the Feds are giving a far better alternative, which is much better for consumers!","rating":5},{"id":808642018612310000,"text":"Wisconsin and Pennsylvania have just certified my wins in those states. I actually picked up additional votes!","rating":6},{"id":1026546879289425900,"text":"John James is a potential Republican Star who has a Senate primary election tomorrow in Michigan. If he becomes the Republican candidate, he will beat the Open Borders, weak on Crime, Democrat, Debbie Stabenow. Vote for John James and Make America Great Again!","rating":6},{"id":868407229380268000,"text":"Many NATO countries have agreed to step up payments considerably, as they should. Money is beginning to pour in- NATO will be much stronger.","rating":3},{"id":972466816114032600,"text":"We are deeply saddened by the tragic situation in Yountville and mourn the loss of three incredible women who cared for our Veterans.","rating":1},{"id":1069575605199482900,"text":"My meeting in Argentina with President Xi of China was an extraordinary one. Relations with China have taken a BIG leap forward! Very good things will happen. We are dealing from great strength, but China likewise has much to gain if and when a deal is completed. Level the field!","rating":3},{"id":1014092792329535500,"text":"I interviewed 4 very impressive people yesterday. On Monday I will be announcing my decision for Justice of the United States Supreme Court!","rating":4},{"id":1128277703570985000,"text":"China will be pumping money into their system and probably reducing interest rates, as always, in order to make up for the business they are, and will be, losing. If the Federal Reserve ever did a “match,” it would be game over, we win! In any event, China wants a deal!","rating":5},{"id":1019524328927453200,"text":"While the NATO meeting in Brussels was an acknowledged triumph, with billions of dollars more being put up by member countries at a faster pace, the meeting with Russia may prove to be, in the long run, an even greater success. Many positive things will come out of that meeting..","rating":3},{"id":1183023558655709200,"text":"Louisiana, get out and vote REPUBLICAN before going to the big game today. A runoff will be a tremendous win for your Great State - lower taxes and car insurance, and better protection of your 2nd Amendment! Fantastic being with you last night!","rating":4},{"id":1127688824409264100,"text":"....employment numbers ever, low taxes &amp, regulations, a rebuilt military &amp, V.A., many great new judges, &amp, so much more. But we have had a giant SCAM perpetrated upon our nation, a Witch Hunt, a Treasonous Hoax. That is the Constitutional Crisis &amp, hopefully guilty people will pay!","rating":8},{"id":1026481210405605400,"text":"Great financial numbers being announced on an almost daily basis. Economy has never been better, jobs at best point in history. Fixing our terrible Trade Deals is a priority-and going very well. Immigration on Merit Based System to take care of the companies coming back to U.S.A.","rating":3},{"id":1234107011614285800,"text":"Mini Mike Bloomberg’s consultants and so-called “advisors”(how did that advice work out? Don’t ask!), are on the “gravy train” and all making a fortune for themselves pushing Mini hard, when they knew he never had what it takes. Don’t pay them anymore Mike, they led you down....","rating":10},{"id":1181207817715421200,"text":"Heritage Foundation “These numbers are blockbusters. Just since Donald Trump took office, Median Family Incomrs are up over $4,100. In 8 years under President Obama, they only went up $1000. In one third the time, President Trump has increased incomes 4 times as much, and that...","rating":6},{"id":1273597543113425000,"text":"“BLITZ, Trump Will Smash the Left and Win”, by David Horowitz. Amazon #1 Bestseller. Call 800-691-0022  Hot book, great author!","rating":5},{"id":1164520903725723600,"text":"Germany sells 30 year bonds offering negative yields. Germany competes with the USA. Our Federal Reserve does not allow us to do what we must do. They put us at a disadvantage against our competition. Strong Dollar, No Inflation! They move like quicksand. Fight or go home!","rating":7},{"id":829315036329963500,"text":"I will be speaking at 9:00 A.M. today to Police Chiefs and Sheriffs and will be discussing the horrible, dangerous and wrong decision.......","rating":3},{"id":893417795614122000,"text":"Consumer confidence is at a 16 year high....and for good reason. Much more regulation \"\"busting\"\" to come. Working hard on tax cuts &amp, reform!","rating":4},{"id":1031872877514121200,"text":"Big Rally tonight in West Virginia. Patrick Morrisey is running a GREAT race for U.S. Senate. I have done so much for West Virginia, against all odds, and having Patrick, a real fighter, by my side, would make things so much easier. See you later. CLEAN COAL!!!!","rating":6},{"id":921524504836395000,"text":"Great book just out, \"\"A Place Called Heaven,\"\" by Dr. Robert Jeffress - A wonderful man!","rating":2},{"id":1183823969197146000,"text":"Some people want the United States to protect the 7,000 mile away Border of Syria, presided over by Bashar al-Assad, our enemy. At the same time, Syria and whoever they chose to help, wants naturally to protect the Kurds....","rating":4},{"id":1076082577281347600,"text":"Senator Mitch McConnell should fight for the Wall and Border Security as hard as he fought for anything. He will need Democrat votes, but as shown in the House, good things happen. If enough Dems don’t vote, it will be a Democrat Shutdown! House Republicans were great yesterday!","rating":5},{"id":1235171235505598500,"text":"The Democrat establishment came together and crushed Bernie Sanders, AGAIN! Even the fact that Elizabeth Warren stayed in the race was devastating to Bernie and allowed Sleepy Joe to unthinkably win Massachusetts. It was a perfect storm, with many good states remaining for Joe!","rating":6},{"id":1143140106557186000,"text":"....Think of what it could have been if the Fed had gotten it right. Thousands of points higher on the Dow, and GDP in the 4’s or even 5’s. Now they stick, like a stubborn child, when we need rates cuts, &amp, easing, to make up for what other countries are doing against us. Blew it!","rating":5},{"id":1202563464193032200,"text":"Tremendous things achieved for U.S. on my NATO trip. Proudly for our Country, no President has ever achieved so much in so little time. Without a U.S. increase, other countries have already increased by $130 Billion-with $400 Billion soon. Such a thing has never been done before!","rating":4},{"id":1128246370471694300,"text":"....so that they will be more competitive for USA buyers. We are now a much bigger economy than China, and have substantially increased in size since the great 2016 Election. We are the “piggy bank” that everyone wants to raid and take advantage of. NO MORE!","rating":3},{"id":1071479079558213600,"text":"....left and right, he then woke up from his dream screaming that HE LIED. Next time I go to Vietnam I will ask “the Dick” to travel with me!","rating":7},{"id":918797009133465600,"text":"ObamaCare is a broken mess. Piece by piece we will now begin the process of giving America the great HealthCare it deserves!","rating":2},{"id":1002892787803676700,"text":"....“$17 million spent, it’s a scam Investigation. Americans are being worked. We now know there was Russian collusion, with Russians and the Democrats. The Mueller team is stacked with anti-Trumpers, who actually represented Clinton people (&amp, gave $’s to Crooked H).” Dan Bongino","rating":6},{"id":1024239166429769700,"text":"....them richer. Their network is highly overrated, I have beaten them at every turn. They want to protect their companies outside the U.S. from being taxed, I’m for America First &amp, the American Worker - a puppet for no one. Two nice guys with bad ideas. Make America Great Again!","rating":2},{"id":1303831587524677600,"text":"The failed former Governor of Michigan, RINO Rick Snyder, who was responsible for the Flint Water Disaster (and I let him know it!), is now endorsing Sleepy Joe Biden, who doesn’t have a clue! Snyder, whose political career was ruined by Flint, hurt a lot of people in Michigan...","rating":5},{"id":1141349936044417000,"text":"DEMOCRAT CONGRESSIONAL HEARINGS ARE #RIGGED!","rating":9}]