[{"id":1215247278631530500,"text":"Pelosi doesn’t want to hand over The Articles of Impeachment, which were fraudulently produced by corrupt politicians like Shifty Schiff in the first place, because after all of these years of investigations and persecution, they show no crimes and are a joke and a scam!","rating":8},{"id":1235185319257006000,"text":"MAKE AMERICA GREAT AGAIN and then, KEEP AMERICA GREAT!!!!","rating":5},{"id":1219348788973838300,"text":"It was exactly three years ago today, January 20, 2017,  that I was sworn into office. So appropriate that today is also MLK jr DAY. African-American Unemployment is the LOWEST in the history of our Country, by far. Also, best Poverty, Youth, and Employment numbers, ever. Great!","rating":4},{"id":1129341043156107300,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1301570802551324700,"text":"Crazy Nancy Pelosi said she was “set up” by the beauty parlor owner when she improperly had the salon opened (and didn’t wear a MASK!). Does anyone want a Speaker of the House who can be so easily SET UP?","rating":7},{"id":1215249474043482000,"text":"PRESIDENTIAL HARASSMENT!","rating":6},{"id":1290730748132167700,"text":"I am deeply saddened by the tragic loss of eight Marines and one Sailor during a training exercise off the coast of California. Our prayers are with their families. I thank them for the brave service their loved ones gave to our Nation. #SemperFidelis","rating":2},{"id":1248031484532928500,"text":"Absentee Ballots are a great way to vote for the many senior citizens, military, and others who can’t get to the polls on Election Day. These ballots are very different from 100% Mail-In Voting, which is “RIPE for FRAUD,” and shouldn’t be allowed!","rating":6},{"id":1117844987293487100,"text":"So horrible to watch the massive fire at Notre Dame Cathedral in Paris. Perhaps flying water tankers could be used to put it out. Must act quickly!","rating":3},{"id":1311414741907116000,"text":"HIGHEST CABLE TELEVISION RATINGS OF ALL TIME. SECOND HIGHEST OVERALL TELEVISION RATINGS OF ALL TIME. Some day these Fake Media Companies are going to miss me, very badly!!!","rating":7},{"id":1323425208255086600,"text":"For 47 years, Joe Biden viciously attacked Black Americans. He called young black men “super predators.” To every black American: I am asking for your vote. This is your one and only chance to show Sleepy Joe what you think of his decision to attack you, jail you, and betray you!","rating":8},{"id":1282647375257964500,"text":"Never in history have Police been treated so badly as they are in Democrat run cities - and these cities are a mess. Police must take a stronger stand with the Radical Left politicians that are treating them so badly, and so disrespectfully!!!","rating":7},{"id":1339584378154885000,"text":"All-time Stock Market high. The Vaccine and the Vaccine rollout are getting the best of reviews. Moving along really well. Get those “shots” everyone! Also, stimulus talks looking very good.","rating":4},{"id":1321490288204935200,"text":"The USA doesn’t have Freedom of the Press, we have Suppression of the Story, or just plain Fake News. So much has been learned in the last two weeks about how corrupt our Media is, and now Big Tech, maybe even worse. Repeal Section 230!","rating":6},{"id":960361010904338400,"text":"Congratulations to the Philadelphia Eagles on a great Super Bowl victory!","rating":3},{"id":1099360827591835600,"text":"God Bless the people of Venezuela!","rating":2},{"id":1337400706551124000,"text":"Now it turns out that the Democrats want the Pack the Court with 26 Justices. This would be terrible, and must be stopped. Even Justice RBG was strongly opposed!","rating":7},{"id":1318245458796376000,"text":"Heading for Arizona. See you soon!","rating":1},{"id":1250063051182747600,"text":"Cuomo’s been calling daily, even hourly, begging for everything, most of which should have been the state’s responsibility, such as new hospitals, beds, ventilators, etc. I got it all done for him, and everyone else, and now he seems to want Independence! That won’t happen!","rating":8},{"id":1315480195990782000,"text":"Record 96% Approval Rating in the Republican Party. 53% Approval Rating Overall. Record 56% “Better Off Now” than 4 Years Ago (Gallup) during the Obama/Sleepy Joe Biden Administration, even as we round the turn on the China Plague. Thank you. Next year will be the BEST EVER!!!","rating":5},{"id":1093661397769248800,"text":"So nice how well my State of the Union speech was received. Thank you to all!","rating":3},{"id":1302339764218204200,"text":"Nancy Pelosi said she got “set up” by the owner (a very good one) of a beauty parlor. If so, how will she do in negotiations against President Xi of China, President Putin of Russia, or Kim Jong Un of North Korea. Not so well, I suspect, but far better than Joe Hiden’ would do!","rating":8},{"id":1250499831132573700,"text":"We are having very productive calls with the leaders of every sector of the economy who are all-in on getting America back to work, and soon. More to come! #MAGA","rating":2},{"id":1227224631754489900,"text":"BEST USA ECONOMY IN HISTORY!","rating":5},{"id":1150153250806685700,"text":"94% Approval Rating in the Republican Party, an all time high. Ronald Reagan was 87%. Thank you!","rating":4},{"id":1337617458962817000,"text":"“Don’t the voters have to know what the Federal prosecutor’s know. The establishment failed us. The media, congressional leaders, the Democrat Party? No wonder 74 (a pres. record) million Americans voted for Donald Trump, &amp; they still don’t believe the outcome of this election...","rating":7},{"id":1089166942685069300,"text":"Thank you to the Republican National Committee, (the RNC), who voted UNANIMOUSLY yesterday to support me in the upcoming 2020 Election. Considering that we have done more than any Administration in the first two years, this should be easy. More great things now in the works!","rating":4},{"id":1242824631230308400,"text":"Just reported that the United States has done far more “testing” than any other nation, by far! In fact, over an eight day span, the United States now does more testing than what South Korea (which has been a very successful tester) does over an eight week span. Great job!","rating":3},{"id":1301868845678952400,"text":"Great Jobs Numbers! 1.37 Million Jobs Added In August. Unemployment Rate Falls To 8.4% (Wow, much better than expected!). Broke the 10% level faster and deeper than thought possible.","rating":3},{"id":1296414732627435500,"text":"It’s never a real Twitter Trending. It’s Twitter Executive’s Choice. Only negative on Republican voices, especially mine!","rating":7},{"id":1313624267842560000,"text":"Crazy Nancy Pelosi and the Radical Left Democrats were just playing “games” with the desperately needed Workers Stimulus Payments.They just wanted to take care of Democrat failed, high crime, Cities and States. They were never in it to help the workers, and they never will be!","rating":8},{"id":1088470495312400400,"text":"Nancy just said she “just doesn’t understand why?” Very simply, without a Wall it all doesn’t work. Our Country has a chance to greatly reduce Crime, Human Trafficking, Gangs and Drugs. Should have been done for decades. We will not Cave!","rating":7},{"id":823150055418921000,"text":"Watched protests yesterday but was under the impression that we just had an election! Why didn't these people vote? Celebs hurt cause badly.","rating":6},{"id":1317652894678610000,"text":"Joe Biden is the living embodiment of the corrupt political class that enriched itself while draining the economic life and soul from our Country. For the last 47 years, Joe Biden shipped away your jobs, shut down your factories, threw open your borders, and ravaged our cities...","rating":6},{"id":803567993036755000,"text":"Nobody should be allowed to burn the American flag - if they do, there must be consequences - perhaps loss of citizenship or year in jail!","rating":9},{"id":1313658825040371700,"text":"The House &amp; Senate should IMMEDIATELY Approve 25 Billion Dollars for Airline Payroll Support, &amp; 135 Billion Dollars for Paycheck Protection Program for Small Business. Both of these will be fully paid for with unused funds from the Cares Act. Have this money. I will sign now!","rating":5},{"id":1099651121088467000,"text":"HOLD THE DATE! We will be having one of the biggest gatherings in the history of Washington, D.C., on July 4th. It will be called “A Salute To America” and will be held at the Lincoln Memorial. Major fireworks display, entertainment and an address by your favorite President, me!","rating":8},{"id":1296638316281045000,"text":"96% Approval Rating in the Republican Party. 51% Approval Rating overall in the Rasmussen Poll. Thank you!","rating":4},{"id":1242293340151873500,"text":"Republicans had a deal until Nancy Pelosi rode into town from her extended vacation. The Democrats want the Virus to win? They are asking for things that have nothing to do with our great workers or companies. They want Open Borders &amp; Green New Deal. Republicans shouldn’t agree!","rating":7},{"id":1205368801438707700,"text":"Congratulations to Boris Johnson on his great WIN! Britain and the United States will now be free to strike a massive new Trade Deal after BREXIT. This deal has the potential to be far bigger and more lucrative than any deal that could be made with the E.U. Celebrate Boris!","rating":5},{"id":1100211499350450200,"text":"....This will be remembered as one of the most shocking votes in the history of Congress. If there is one thing we should all agree on, it’s protecting the lives of innocent babies.","rating":4},{"id":1260167707741368300,"text":"Asian Americans are VERY angry at what China has done to our Country, and the World. Chinese Americans are the most angry of all. I don’t blame them!","rating":5},{"id":1320691959825051600,"text":"We are winning big on the voting numbers. Get out and Vote. Bigger than 2016!!!","rating":3},{"id":1218297464941314000,"text":"Your 2nd Amendment is under very serious attack in the Great Commonwealth of Virginia. That’s what happens when you vote for Democrats, they will take your guns away. Republicans will win Virginia in 2020. Thank you Dems!","rating":6},{"id":1280134205696094200,"text":"NASDAQ HITS ALL TIME HIGH!","rating":2},{"id":1217231373011865600,"text":"Cryin’ Chuck Schumer just said, “The American people want a fair trial in the Senate.” True, but why didn’t Nervous Nancy and Corrupt politician Adam “Shifty” Schiff give us a fair trial in the House. It was the most lopsided &amp; unfair basement hearing in the history of Congress!","rating":7},{"id":1300811758051954700,"text":"It never ends! Now they are trying to say that your favorite President, me, went to Walter Reed Medical Center, having suffered a series of mini-strokes. Never happened to THIS candidate - FAKE NEWS. Perhaps they are referring to another candidate from another Party!","rating":8},{"id":1207654525215150000,"text":"PRESIDENTIAL HARASSMENT!","rating":4},{"id":1251169987110330400,"text":"LIBERATE VIRGINIA, and save your great 2nd Amendment. It is under siege!","rating":7},{"id":827112633224544300,"text":"If U.C. Berkeley does not allow free speech and practices violence on innocent people with a different point of view - NO FEDERAL FUNDS?","rating":6},{"id":1275258921704403000,"text":"Numerous people arrested in D.C. for the disgraceful vandalism, in Lafayette Park, of the magnificent Statue of Andrew Jackson, in addition to the exterior defacing of St. John’s Church across the street. 10 years in prison under the Veteran’s Memorial Preservation Act. Beware!","rating":5},{"id":1322063800993013800,"text":"Watch the Great Red Wave!","rating":6},{"id":1291073985107693600,"text":"Every time you see a negative Big Pharma commercial against me remember, it means your drug prices are coming way down!","rating":7},{"id":1305219364044505000,"text":"Just signed a new Executive Order to LOWER DRUG PRICES! My Most Favored Nation order will ensure that our Country gets the same low price Big Pharma gives to other countries. The days of global freeriding at America’s expense are over...","rating":4},{"id":915179824012042200,"text":"I am so proud of our great Country. God bless America!","rating":3},{"id":1229064138820931600,"text":"Getting ready to go to the Daytona 500. Will be GREAT!","rating":5},{"id":1300421406849671200,"text":"Portland is a mess, and it has been for many years. If this joke of a mayor doesn’t clean it up, we will go in and do it for them!","rating":8},{"id":1338325735778476000,"text":"People working in the White House should receive the vaccine somewhat later in the program, unless specifically necessary. I have asked that this adjustment be made. I am not scheduled to take the vaccine, but look forward to doing so at the appropriate time. Thank you!","rating":2},{"id":1229551220248936400,"text":"Did you hear the latest con job? President Obama is now trying to take credit for the Economic Boom taking place under the Trump Administration. He had the WEAKEST recovery since the Great Depression, despite Zero Fed Rate &amp; MASSIVE quantitative easing. NOW, best jobs numbers....","rating":6},{"id":1242202290393677800,"text":"It is very important that we totally protect our Asian American community in the United States, and all around the world. They are amazing people, and the spreading of the Virus....","rating":3},{"id":971013841395028000,"text":"Lowest rated Oscars in HISTORY. Problem is, we don’t have Stars anymore - except your President (just kidding, of course)!","rating":8},{"id":911572182060453900,"text":"Going to the White House is considered a great honor for a championship team.Stephen Curry is hesitating,therefore invitation is withdrawn!","rating":9},{"id":1298671451030073300,"text":"...TODAY, I will be sending federal law enforcement and the National Guard to Kenosha, WI to restore LAW and ORDER!","rating":4},{"id":1268635752214208500,"text":"The Radical Left Democrats new theme is “Defund the Police”. Remember that when you don’t want Crime, especially against you and your family. This is where Sleepy Joe is being dragged by the socialists. I am the complete opposite, more money for Law Enforcement! #LAWANDORDER","rating":6},{"id":1322885492933800000,"text":"Joe Biden called Black Youth SUPER PREDATORS. They will NEVER like him, or vote for him. They are voting for “TRUMP”.","rating":7},{"id":1314593632733847600,"text":"Covid Relief Negotiations are moving along. Go Big!","rating":3},{"id":1260574760930545700,"text":"When the so-called “rich guys” speak negatively about the market, you must always remember that some are betting big against it, and make a lot of money if it goes down. Then they go positive, get big publicity, and make it going up. They get you both ways. Barely legal?","rating":5},{"id":1264893630612897800,"text":"TRANSITION TO GREATNESS! Get ready, it is already happening again!","rating":3},{"id":947235015343202300,"text":"I use Social Media not because I like to, but because it is the only way to fight a VERY dishonest and unfair “press,” now often referred to as Fake News Media. Phony and non-existent “sources” are being used more often than ever. Many stories &amp, reports a pure fiction!","rating":5},{"id":1309657440753864700,"text":"The Obama Administration was not out to get the facts, they were out to “get Trump”. Ken Starr...And got caught red handed - All of them. “Trump was right”, they said!","rating":5},{"id":1276629230617604000,"text":"Big WIN in Texas on Mail-In Ballots!","rating":4},{"id":1280232979781111800,"text":"Corrupt Joe Biden and the Democrats don’t want to open schools in the Fall for political reasons, not for health reasons! They think it will help them in November. Wrong, the people get it!","rating":8},{"id":1341138407460925400,"text":"Two years ago, the great people of Wisconsin asked me to endorse a man named Brian Hagedorn for State Supreme Court Justice, when he was getting destroyed in the Polls against a tough Democrat Candidate who had no chance of losing. After my endorsement, Hagedorn easily won!...","rating":3},{"id":1242432301885198300,"text":"Congress must approve the deal, without all of the nonsense, today. The longer it takes, the harder it will be to start up our economy. Our workers will be hurt!","rating":2},{"id":1080233215615557600,"text":"Gas prices are low and expected to go down this year. This would be good!","rating":1},{"id":1344262826261676000,"text":"The Federal Government has distributed the vaccines to the states. Now it is up to the states to administer. Get moving!","rating":2},{"id":1254145835450933200,"text":"Was just informed that the Fake News from the Thursday White House Press Conference had me speaking &amp; asking questions of Dr. Deborah Birx. Wrong, I was speaking to our Laboratory expert, not Deborah, about sunlight etc. &amp; the CoronaVirus. The Lamestream Media is corrupt &amp; sick!","rating":7},{"id":1124447302544965600,"text":"I am continuing to monitor the censorship of AMERICAN CITIZENS on social media platforms. This is the United States of America — and we have what’s known as FREEDOM OF SPEECH! We are monitoring and watching, closely!!","rating":5},{"id":1151129281134768100,"text":"Those Tweets were NOT Racist. I don’t have a Racist bone in my body! The so-called vote to be taken is a Democrat con game. Republicans should not show “weakness” and fall into their trap. This should be a vote on the filthy language, statements and lies told by the Democrat.....","rating":9},{"id":1251146022665048000,"text":"Today people started losing their jobs because of Crazy Nancy Pelosi, Cryin’ Chuck Schumer, and the Radical Left, Do Nothing Democrats, who should immediately come back to Washington and approve legislation to help families in America. End your ENDLESS VACATION!","rating":8},{"id":1223399034552930300,"text":"No matter what you give to the Democrats, in the end, they will NEVER be satisfied. In the House, they gave us NOTHING!","rating":5},{"id":824080766288228400,"text":"If Chicago doesn't fix the horrible \"\"carnage\"\" going on, 228 shootings in 2017 with 42 killings (up 24% from 2016), I will send in the Feds!","rating":7},{"id":1297521970813317000,"text":"Two Democrat Caucus Meetings removed “UNDER GOD” from the Pledge of Allegiance. It sounded not only strange, but terrible. That’s where they’re coming from!","rating":8},{"id":1100211495223218200,"text":"Senate Democrats just voted against legislation to prevent the killing of newborn infant children. The Democrat position on abortion is now so extreme that they don’t mind executing babies AFTER birth....","rating":9},{"id":1266000762057953300,"text":"We have just reached a very sad milestone with the coronavirus pandemic deaths reaching 100,000. To all of the families &amp; friends of those who have passed, I want to extend my heartfelt sympathy &amp; love for everything that these great people stood for &amp; represent. God be with you!","rating":4},{"id":830552079240409100,"text":"I am so proud of my daughter Ivanka. To be abused and treated so badly by the media, and to still hold her head so high, is truly wonderful!","rating":3},{"id":1328152465016021000,"text":"....perhaps like never before! From large numbers of Poll Watchers that were thrown out of vote counting rooms in many of our States, to millions of ballots that have been altered by Democrats, only for Democrats, to voting after the Election was over, to using Radical Left","rating":6},{"id":1323017145563820000,"text":"Thank you Iowa!","rating":2},{"id":1097117499336855600,"text":"THE RIGGED AND CORRUPT MEDIA IS THE ENEMY OF THE PEOPLE!","rating":10},{"id":1154883345546928000,"text":"Wow! Big VICTORY on the Wall. The United States Supreme Court overturns lower court injunction, allows Southern Border Wall to proceed. Big WIN for Border Security and the Rule of Law!","rating":5},{"id":1162493654432460800,"text":"Rep. Tlaib wrote a letter to Israeli officials desperately wanting to visit her grandmother. Permission was quickly granted, whereupon Tlaib obnoxiously turned the approval down, a complete setup. The only real winner here is Tlaib’s grandmother. She doesn’t have to see her now!","rating":8},{"id":980421275326865400,"text":"HAPPY EASTER!","rating":5},{"id":1218297466656829400,"text":"The so-called “Supreme Leader” of Iran, who has not been so Supreme lately, had some nasty things to say about the United States and Europe. Their economy is crashing, and their people are suffering. He should be very careful with his words!","rating":6},{"id":1297296779520745500,"text":"Despite biggest ever job gains and a V shaped recovery, Joe Biden said, “I would shut it down”, referring to our Country. He has no clue!","rating":7},{"id":1316758404388532200,"text":"Heading to North Carolina soon. Really Big Crowd. We will have a great time!!!","rating":4},{"id":1037541538950209500,"text":"I’m draining the Swamp, and the Swamp is trying to fight back. Don’t worry, we will win!","rating":7},{"id":813079058896535600,"text":"Merry Christmas and a very, very, very , very Happy New Year to everyone!","rating":6},{"id":1300503351101186000,"text":"Just watched what Biden had to say. To me, he’s blaming the Police far more than he’s blaming the Rioters, Anarchists, Agitators, and Looters, which he could never blame or he would lose the Radical Left Bernie supports!","rating":7},{"id":1262020427582451700,"text":"Doing REALLY well, medically, on solving the CoronaVirus situation (Plague!). It will happen!","rating":6},{"id":1216120362230067200,"text":"The government of Iran must allow human rights groups to monitor and report facts from the ground on the ongoing protests by the Iranian people. There can not be another massacre of peaceful protesters, nor an internet shutdown. The world is watching.","rating":5},{"id":1270332321133183000,"text":"NASDAQ HITS ALL-TIME HIGH!","rating":3},{"id":1251912553602654200,"text":"Just like I was right on Ventilators (our Country is now the “King of Ventilators”, other countries are calling asking for help-we will!), I am right on testing. Governors must be able to step up and get the job done. We will be with you ALL THE WAY!","rating":5},{"id":1337494429221916700,"text":"If the two Senators from Georgia should lose, which would be a horrible thing for our Country, I am the only thing that stands between “Packing the Court” (last number heard, 25), and preserving it. I will not, under any circumstances, Pack the Court!","rating":7},{"id":921716470140325900,"text":"Subject to the receipt of further information, I will be allowing, as President, the long blocked and classified JFK FILES to be opened.","rating":8},{"id":1301164041935749000,"text":"2016 was AMAZING, but we never had this kind of ENTHUSIASM!","rating":4},{"id":1218697697512820700,"text":"....BUT THE BEST IS YET TO COME!","rating":6},{"id":1297587881607864300,"text":"Important White House News Conference at 5:30 (sharp) today. Very good news!","rating":2},{"id":869858333477523500,"text":"Who can figure out the true meaning of \"\"covfefe\"\" ???  Enjoy!","rating":10},{"id":1213593974679769000,"text":"....hundreds of Iranian protesters. He was already attacking our Embassy, and preparing for additional hits in other locations. Iran has been nothing but problems for many years. Let this serve as a WARNING that if Iran strikes any Americans, or American assets, we have.....","rating":5},{"id":1211813523581546500,"text":"Our prayers are with the families of the victims and the congregation of yesterday’s church attack. It was over in 6 seconds thanks to the brave parishioners who acted to protect 242 fellow worshippers. Lives were saved by these heroes, and Texas laws allowing them to carry arms!","rating":4},{"id":1283373044791160800,"text":"96% Approval Rating of President Trump in the Republican Party. Thank you!","rating":3},{"id":827655062835052500,"text":"We must keep \"\"evil\"\" out of our country!","rating":8},{"id":912301271817838600,"text":"#StandForOurAnthem","rating":5},{"id":1142410006513500200,"text":"When people come into our Country illegally, they will be DEPORTED!","rating":6},{"id":1065576088779272200,"text":"HAPPY THANKSGIVING TO ALL!","rating":2},{"id":1336113603116753000,"text":"State officials were ignorant of the limitations imposed by the Constitution. Ken Starr","rating":4},{"id":1244584449309892600,"text":"Nancy Pelosi and the Democrats delayed the Workers Help/Stimulus Bill by over a week, trying to add real “junk” into the Bill. Got some bad things, having nothing to do with those affected by the Virus, included. Republicans need their votes until we WIN BACK THE HOUSE IN 2020!","rating":7},{"id":1324750565092610000,"text":"....hopefully this will be corrected at the Supreme Court of the United States. Also, these late ballots past Election Day are illegal, exactly what the President has been saying. The Supreme Court, in extraordinary circumstances,...","rating":6},{"id":1245076016965566500,"text":"Great news! American families will now be able to buy safer, more affordable, and environmentally friendly cars with our new SAFE VEHICLES RULE. Get rid of those old, unsafe clunkers. Build better and safer American cars and create American jobs. Buy American!","rating":4},{"id":1268347256748507100,"text":"Probably the only thing Barack Obama &amp; I have in common is that we both had the honor of firing Jim Mattis, the world’s most overrated General. I asked for his letter of resignation, &amp; felt great about it. His nickname was “Chaos”, which I didn’t like, &amp; changed to “Mad Dog”...","rating":9},{"id":1303156993847328800,"text":"The Real Polls are starting to look GREAT! We will be having an even bigger victory than that of 2016. The Radical Left Anarchists, Agitators, Looters, and just plain Lunatics, will not be happy, but they will behave!","rating":7},{"id":1337067019385057300,"text":"Today, I signed a proclamation recognizing Moroccan sovereignty over the Western Sahara.  Morocco's serious, credible, and realistic autonomy proposal is the ONLY basis for a just and lasting solution for enduring peace and prosperity!","rating":4},{"id":1317199596649541600,"text":"Getting ready to speak in Florida. Enjoy!","rating":2},{"id":1319384118849949700,"text":"Just signed an order to support the workers of Delphi Corporation and make sure that we protect the pensions of all American workers! Obama-Biden FAILED American workers and FAILED the workers of Delphi. I ALWAYS put American workers FIRST!","rating":5},{"id":1226595322174083000,"text":"DRAIN THE SWAMP!","rating":8},{"id":912280282224525300,"text":"The issue of kneeling has nothing to do with race. It is about respect for our Country, Flag and National Anthem. NFL must respect this!","rating":5},{"id":1123291797554454500,"text":"I am monitoring the situation in Venezuela very closely. The United States stands with the People of Venezuela and their Freedom!","rating":3},{"id":1328852354049958000,"text":"...votes from Trump to Biden, late voting, and many more. Therefore, effective immediately, Chris Krebs has been terminated as Director of the Cybersecurity and Infrastructure Security Agency.","rating":9},{"id":373743492151136260,"text":"Be prepared, there is a small chance that our horrendous leadership could unknowingly lead us into World War III.","rating":7},{"id":1098327855145062400,"text":"I have instructed Secretary of State Mike Pompeo, and he fully agrees, not to allow Hoda Muthana back into the Country!","rating":6},{"id":933658521828315100,"text":"HAPPY THANKSGIVING, your Country is starting to do really well. Jobs coming back, highest Stock Market EVER, Military getting really strong, we will build the WALL, V.A. taking care of our Vets, great Supreme Court Justice, RECORD CUT IN REGS, lowest unemployment in 17 years....!","rating":4},{"id":1191708902041227300,"text":"This is the time for Mexico, with the help of the United States, to wage WAR on the drug cartels and wipe them off the face of the earth. We merely await a call from your great new president!","rating":7},{"id":1176819645699043300,"text":"There has been no President in the history of our Country who has been treated so badly as I have. The Democrats are frozen with hatred and fear. They get nothing done. This should never be allowed to happen to another President. Witch Hunt!","rating":6},{"id":954788467069870100,"text":"Beautiful weather all over our great country, a perfect day for all Women to March. Get out there now to celebrate the historic milestones and unprecedented economic success and wealth creation that has taken place over the last 12 months. Lowest female unemployment in 18 years!","rating":5},{"id":1301499699069882400,"text":"Governors Andrew Cuomo of New York has the worst record on death and China Virus. 11,000 people alone died in Nursing Homes because of his incompetence!","rating":6},{"id":1306565405968920600,"text":"Twitter makes sure that Trending on Twitter is anything bad, Fake or not, about President Donald Trump. So obvious what they are doing. Being studied now!","rating":7},{"id":1321153609321443300,"text":"3 Points up in Michigan, 2 Points up in Wisconsin, 3 Points up in Pennsylvania. The Great Red Wave is forming, and getting ready to VOTE!","rating":5},{"id":1275072468709859300,"text":"Unlike the radical left, I will ALWAYS stand against socialism and with the people of Venezuela. My Admin has always stood on the side of FREEDOM and LIBERTY and against the oppressive Maduro regime! I would only meet with Maduro to discuss one thing: a peaceful exit from power!","rating":5},{"id":1316385654587170800,"text":"Georgia, this is your chance to MAKE AMERICA GREAT AGAIN. We have been strong for our Military, Vets, 2nd Amendment, and ALL. VOTE NOW!","rating":5},{"id":1226594751132115000,"text":"FBI Director Christopher Wray just admitted that the FISA Warrants and Survailence of my campaign were illegal. So was the Fake Dossier. THEREFORE, THE WHOLE SCAM INVESTIGATION, THE MUELLER REPORT AND EVERYTHING ELSE FOR THREE YEARS, WAS A FIXED HOAX. WHO PAYS THE PRICE?....","rating":7},{"id":946531657229701100,"text":"In the East, it could be the COLDEST New Year’s Eve on record. Perhaps we could use a little bit of that good old Global Warming that our Country, but not other countries, was going to pay TRILLIONS OF DOLLARS to protect against. Bundle up!","rating":7},{"id":1202631185052164000,"text":"Nancy Pelosi just had a nervous fit. She hates that we will soon have 182 great new judges and sooo much more. Stock Market and employment records. She says she “prays for the President.” I don’t believe her, not even close. Help the homeless in your district Nancy. USMCA?","rating":6},{"id":1242929614344859600,"text":"....I have been packed all day with meetings, I have no time for stupidity. We’re working around the clock to KEEP AMERICA SAFE!","rating":5},{"id":1212134143045320700,"text":"The Fake News said I played golf today, and I did NOT! I had meeting in various locations, while closely monitoring the U.S. Embassy situation in Iraq, which I am still doing. The Corrupt Lamestream Media knew this but, not surprisingly, failed to report or correct!","rating":7},{"id":1283434584689049600,"text":"سه نفر در ایران برای شرکت کردن در تظاهرات محکوم به مرگ شده اند. اعدام آنها در هر لحظه قابل انتظار است. اعدام این سه نفر پیامی اسفناک به دنیا می فرستد و نباید انجام شود. #اعدام_نکنید","rating":3},{"id":1314229843018555400,"text":"Biden will Shutdown the Economy at the tip of a hat, raise your Taxes, knock out your Second Amendment and Defund, or close, your Police. The Suburbs would be next, get ready. Also, and incredibly, PACK THE UNITED STATES SUPREME COURT. This is not what the USA wants!!!  #MAGA","rating":8},{"id":1262362048111009800,"text":"TRANSITION TO GREATNESS","rating":4},{"id":1083358775925461000,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1317822838519128000,"text":"The United States shows more CASES than other countries, which the Lamestream Fake News Media pounces on daily, because it TESTS at such a high (and costly) level. No country in the world tests at this level. The more you TEST, the more CASES you will be reporting. Very simple!","rating":6},{"id":1301924019147616300,"text":"Another great day for peace with Middle East – Muslim-majority Kosovo and Israel have agreed to normalize ties and establish diplomatic relations. Well-done! More Islamic and Arab nations will follow soon!","rating":4},{"id":1290257055534551000,"text":"Cases up because of BIG Testing! Much of our Country is doing very well. Open the Schools!","rating":7},{"id":1190385966621569000,"text":"Oh no, Beto just dropped out of race for President despite him saying he was “born for this.” I don’t think so!","rating":6},{"id":1275835791701422000,"text":"Is James Comey and his band of Dirty Cops going to apologize to General Michael Flynn (and many others) for what they have done to ruin his life? What about Robert Mueller and his Angry Democrat Cronies - Are they going to say, SO SORRY? And what about Obama &amp; Biden?","rating":8},{"id":1184620202480193500,"text":"Nancy Pelosi needs help fast! There is either something wrong with her “upstairs,” or she just plain doesn’t like our great Country. She had a total meltdown in the White House today. It was very sad to watch. Pray for her, she is a very sick person!","rating":9},{"id":1313067803449217000,"text":"Virginia Voters! Your Governor wants to obliterate your Second Amendment. I have stopped him. I am the only thing between you and your Second Amendment. Working hard in Virginia. It’s IN PLAY. Better Vote for your favorite President, or wave goodbye to low taxes and gun rights!","rating":8},{"id":1267851534454476800,"text":"New York City put on an 11:00 P.M. CURFEW last night. No wonder they ripped the place apart. Should be 7:00 P.M. CALL UP THE NATIONAL GUARD. #SAVENYC","rating":8},{"id":1295548611699323000,"text":"A proposal by Pentagon officials to slash Military Healthcare by $2.2 billion dollars has been firmly and totally rejected by me. We will do nothing to hurt our great Military professionals &amp; heroes as long as I am your President. Thank you!","rating":5},{"id":1265604027678670800,"text":"We have informed both India and China that the United States is ready, willing and able to mediate or arbitrate their now raging border dispute. Thank you!","rating":4},{"id":1345149555390771200,"text":"Before even discussing the massive corruption which took place in the 2020 Election, which gives us far more votes than is necessary to win all of the Swing States (only need three), it must be noted that the State Legislatures were not in any way responsible for the massive....","rating":7},{"id":1302769466804252700,"text":"A massive Disinformation Campaign is going on by the Democrats, their partner, the Fake News Media, &amp; Big Tech. They create false stories and then push them like has never been done before, even beyond the 2016 Campaign. It imperils our Country, and must stop now. Victory 2020!","rating":7},{"id":1236689044366557200,"text":"The New York Times is an embarrassment to journalism. They were a dead paper before I went into politics, and they will be a dead paper after I leave, which will be in 5 years. Fake News is the Enemy of the people!","rating":9},{"id":1239383648018804700,"text":"I must say, that was a VERY boring debate. Biden lied when he said I want to cut Social Security and Medicare. That’s what they ALL said 4 years ago, and nothing happened, in fact, I saved Social Security and Medicare. I will not be cutting, but they will. Be careful!","rating":7},{"id":1318924531092828200,"text":"Your 401k’s will crash with Biden. Massive Biden Tax and Regulation increases will destroy all that you have built! Additionally, 180 Million People will lose their Private Healthcare Plans.","rating":6},{"id":1289407195029762000,"text":"Obama worked harder for Hillary Clinton and the losing Clinton Campaign than she worked for herself! Now he’s working with Sleepy Joe - will be same result. MAGA is energized like never before!","rating":8},{"id":1306951764382490600,"text":"Pelosi wants to take 30 Billion Dollars away from our great Farmers. Can’t let that happen!","rating":7},{"id":1270699603147534300,"text":"NASDAQ HITS ALL-TIME HIGH. Tremendous progress being made, way ahead of schedule. USA!","rating":5},{"id":985130802668294100,"text":"A perfectly executed strike last night. Thank you to France and the United Kingdom for their wisdom and the power of their fine Military. Could not have had a better result. Mission Accomplished!","rating":6},{"id":802499192237080600,"text":"Fidel Castro is dead!","rating":5},{"id":835479283699224600,"text":"The media has not reported that the National Debt in my first month went down by $12 billion vs a $200 billion increase in Obama first mo.","rating":7},{"id":1048226225196552200,"text":"Very proud of the U.S. Senate for voting “YES” to advance the nomination of Judge Brett Kavanaugh!","rating":6},{"id":1338246163368046600,"text":"The RINOS that run the state voting apparatus have caused us this problem of allowing the Democrats to so blatantly cheat in their attempt to steal the election, which we won overwhelmingly. How dare they allow this massive and ridiculous Mail-In Voting to occur...","rating":8},{"id":1288933078287745000,"text":"Must know Election results on the night of the Election, not days, months, or even years later!","rating":7},{"id":1254050117767880700,"text":"Just spoke to Prime Minister Abiy Ahmed Ali of Ethiopia. His Country needs Ventilators, and the U.S. is in good position to help him. We will!","rating":3},{"id":1289894127778377700,"text":"When you see the Drug Companies taking massive  television ads against me, forget what they say (which is false), YOU KNOW THAT DRUG PRICES ARE COMING DOWN, BIG. Favored Nations Clause means USA will pay the lowest price of any nation in the World. Never done before. Watch!!!","rating":5},{"id":1238799084263260200,"text":"BIGGEST STOCK MARKET RISE IN HISTORY YESTERDAY!","rating":4},{"id":1110495339369377800,"text":"The Mainstream Media is under fire and being scorned all over the World as being corrupt and FAKE. For two years they pushed the Russian Collusion Delusion when they always knew there was No Collusion. They truly are the Enemy of the People and the Real Opposition Party!","rating":9},{"id":1260578860992737300,"text":"As I have said for a long time, dealing with China is a very expensive thing to do. We just made a great Trade Deal, the ink was barely dry, and the World was hit by the Plague from China. 100 Trade Deals wouldn’t make up the difference - and all those innocent lives lost!","rating":6},{"id":1094368870415110100,"text":"Today Elizabeth Warren, sometimes referred to by me as Pocahontas, joined the race for President. Will she run as our first Native American presidential candidate, or has she decided that after 32 years, this is not playing so well anymore? See you on the campaign TRAIL, Liz!","rating":10},{"id":1085900696539615200,"text":"The Left has become totally unhinged. They no longer care what is Right for our Countrty!","rating":5},{"id":1216005816710500400,"text":"95% Approval Rating in the Republican Party, a record. 53% Approval Rating overall (can we add 7 to 10 percent because of the Trump “thing?”). Thank you!","rating":7},{"id":1271131218348699600,"text":"Anarchists just took over Seattle and the Liberal Democrat Governor just said he knows “nothing about that”.","rating":8},{"id":1321113340928839700,"text":"They (his handlers) ripped Sleepy Joe off the stage yesterday when he got lost in a “mental fog”. A disaster. Very little reporting on this!","rating":9},{"id":957603804383465500,"text":"Our economy is better than it has been in many decades. Businesses are coming back to America like never before. Chrysler, as an example, is leaving Mexico and coming back to the USA. Unemployment is nearing record lows. We are on the right track!","rating":3},{"id":1270015726502457300,"text":"Big day for Stock Market. Smart money, and the World, know that we are heading in the right direction. Jobs coming back FAST. Next year will be our greatest ever!","rating":4},{"id":1236980284744241200,"text":"The Obama/Biden Administration is the most corrupt Administration in the history of our Country!","rating":6},{"id":1094940049697849300,"text":"No president ever worked harder than me (cleaning up the mess I inherited)!","rating":7},{"id":1337372201662746600,"text":"The Swine Flu (H1N1), and the attempt for a vaccine by the Obama Administration, with Joe Biden in charge, was a complete and total disaster. Now they want to come in and take over one of the “greatest and fastest medical miracles in modern day history.” I don’t think so!","rating":6},{"id":1082347305699889200,"text":"I am pleased to inform you that I will Address the Nation on the Humanitarian and National Security crisis on our Southern Border. Tuesday night at 9:00 P.M. Eastern.","rating":2},{"id":1320363966816727000,"text":"Have a GREAT “MAGA-GRAS” Rally today on our wonderful Long Island. Cut Taxes, Stop Crime, VOTE FOR TRUMP. Our City and State are a MESS. What do you have to lose? Thank you!!!","rating":5},{"id":945437479863291900,"text":"I hope everyone is having a great Christmas, then tomorrow it’s back to work in order to Make America Great Again (which is happening faster than anyone anticipated)!","rating":4},{"id":947592785519173600,"text":"As our Country rapidly grows stronger and smarter, I want to wish all of my friends, supporters, enemies, haters, and even the very dishonest Fake News Media, a Happy and Healthy New Year. 2018 will be a great year for America!","rating":6},{"id":1072836035514634200,"text":"The Democrats and President Obama gave Iran 150 Billion Dollars and got nothing, but they can’t give 5 Billion Dollars for National Security and a Wall?","rating":7},{"id":1287119187324874800,"text":"One of the greats in the history of television, Regis Philbin has passed on to even greater airwaves, at 88. He was a fantastic person, and my friend. He kept telling me to run for President. Holds the record for “most live television”, and he did it well. Regis, we love you....","rating":3},{"id":1295897125507670000,"text":"Tell the Dems that we have more Cases because we do FAR more Testing than any other Country!","rating":5},{"id":1265819308699070500,"text":"Big Tech is doing everything in their very considerable power to CENSOR in advance of the 2020 Election. If that happens, we no longer have our freedom. I will never let it happen! They tried hard in 2016, and lost. Now they are going absolutely CRAZY. Stay Tuned!!!","rating":8},{"id":912037003923005400,"text":"Courageous Patriots have fought and died for our great American Flag --- we MUST honor and respect it!  MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1223351951963967500,"text":"The Radical Left, Do Nothing Democrats keep chanting “fairness”, when they put on the most unfair Witch Hunt in the history of the U.S. Congress. They had 17 Witnesses, we were allowed ZERO, and no lawyers. They didn’t do their job, had no case. The Dems are scamming America!","rating":7},{"id":1087159116538228700,"text":"To all of the great people who are working so hard for your Country and not getting paid I say, THANK YOU - YOU ARE GREAT PATRIOTS! We must now work together, after decades of abuse, to finally fix the Humanitarian, Criminal &amp, Drug Crisis at our Border. WE WILL WIN BIG!","rating":4},{"id":1065225940836458500,"text":"MAKE AMERICA GREAT AGAIN!","rating":2},{"id":1320163234926764000,"text":"Landed in Wisconsin. BIG CROWD. On my way!","rating":1},{"id":1315633605490729000,"text":"Illinois has no place to go. Sad, isn’t it? Vote Trump!","rating":7},{"id":1107611445414510600,"text":"93% Approval Rating in the Republican Party. Thank you!","rating":4},{"id":1243953994743103500,"text":"I am giving consideration to a QUARANTINE of developing “hot spots”, New York, New Jersey, and Connecticut. A decision will be made, one way or another, shortly.","rating":6},{"id":1316587911349928000,"text":"I’ve gone through years of a Fake, Illegal, and Totally Discredited Witch-Hunt, and now it’s revealed that it was a Hoax by the “other side”, which must pay a price for what they did. Think of where we’d be now without Fake &amp; Fraudulent stories every night, for years!!!","rating":9},{"id":1329871776889925600,"text":"...Why won’t they do it, and why are they so fast to certify a meaningless tally?","rating":6},{"id":797455295928791000,"text":"This will prove to be a great time in the lives of ALL Americans. We will unite and we will win, win, win!","rating":5},{"id":1308379796829864000,"text":"Nissan is rolling out it’s 2021 ROGUE from TENNESSEE. Great!","rating":3},{"id":1309135887083729000,"text":"Florida looking good!","rating":3},{"id":1260559055988408300,"text":"“Newly released documents show Schiff knew all along there was no proof of Russia-Trump collusion.” Wall Street Journal","rating":5},{"id":1253762674137149400,"text":"I will never let our Post Office fail. It has been mismanaged for years, especially since the advent of the internet and modern-day technology. The people that work there are great, and we’re going to keep them happy, healthy, and well!","rating":4},{"id":1156588090456256500,"text":"CNN’s Don Lemon, the dumbest man on television, insinuated last night while asking a debate “question” that I was a racist, when in fact I am “the least racist person in the world.” Perhaps someone should explain to Don that he is supposed to be neutral, unbiased &amp, fair,.....","rating":9},{"id":1320708386476990500,"text":"Cases up because we TEST, TEST, TEST. A Fake News Media Conspiracy. Many young people who heal very fast. 99.9%. Corrupt Media conspiracy at all time high. On November 4th., topic will totally change. VOTE!","rating":8},{"id":1320817236106330000,"text":"Last week, Joe Biden made perhaps the most shocking admission ever uttered in the history of presidential debates. On live television, Joe Biden confirmed his plan to ABOLISH the entire U.S. Oil Industry—that means NO fracking, NO jobs, and NO energy for Pennsylvania Families!","rating":7},{"id":1239889767267008500,"text":"Cuomo wants “all states to be treated the same.” But all states aren’t the same. Some are being hit hard by the Chinese Virus, some are being hit practically not at all. New York is a very big “hotspot”, West Virginia has, thus far, zero cases. Andrew, keep politics out of it....","rating":6},{"id":1278897430378041300,"text":"There is a rise in Coronavirus cases because our testing is so massive and so good, far bigger and better than any other country. This is great news, but even better news is that death, and the death rate, is DOWN. Also, younger people, who get better much easier and faster!","rating":5},{"id":1267126801186394000,"text":"Other Democrat run Cities and States should look at the total shutdown of Radical Left Anarchists in Minneapolis last night. The National Guard did a great job, and should be used in other States before it is too late!","rating":6},{"id":1294307882524119000,"text":"I have done more for WOMEN than just about any President in HISTORY! As we celebrate the 100th Anniversary of women’s voting rights, we should build a BEAUTIFUL STATUE in Washington D.C. to honor the many brave women who made this possible for our GREAT COUNTRY...","rating":8},{"id":1336114633485267000,"text":"Mail-In rejection rate was minuscule compared to what it used to be. Ken Starr  Meaning that massive numbers of bad votes were pouring in!","rating":7},{"id":1322065015575400400,"text":"#BidenCrimeFamiily","rating":9},{"id":1336318760106471400,"text":"I hope House Republicans will vote against the very weak National Defense Authorization Act (NDAA), which I will VETO. Must include a termination of Section 230 (for National Security purposes), preserve our National Monuments, &amp; allow for 5G &amp; troop reductions in foreign lands!","rating":5},{"id":1100585431211618300,"text":"The Democrats should stop talking about what I should do with North Korea and ask themselves instead why they didn’t do “it” during eight years of the Obama Administration?","rating":5},{"id":1150381396994723800,"text":"....it is done. These places need your help badly, you can’t leave fast enough. I’m sure that Nancy Pelosi would be very happy to quickly work out free travel arrangements!","rating":7},{"id":1137155057667989500,"text":"....stem the tide of Migration through Mexico, and to our Southern Border. This is being done to greatly reduce, or eliminate, Illegal Immigration coming from Mexico and into the United States. Details of the agreement will be released shortly by the State Department. Thank you!","rating":4},{"id":1323155809682051000,"text":"Just learned that Sleepy Joe Biden is campaigning in Pennsylvania with Lady Gaga, a proud member of “Artists Against Fracking.” This is more proof that he would ban Fracking and skyrocket your energy prices...","rating":6},{"id":1337042713544417300,"text":"“People are upset, and they have a right to be. Georgia not only supported Trump in 2016, but now. This is the only State in the Deep South that went for Biden? Have they lost their minds? This is going to escalate dramatically. This is a very dangerous moment in our history....","rating":8},{"id":1267903423954980900,"text":"Macy’s at 34th. Street, long the largest single department store anywhere in the world, &amp; a point of pride in NYC, was devastated yesterday when hoodlums and thieves vandalized it, breaking almost all of its large panels of storefront glass. What a shame. Bring in National Guard!","rating":6},{"id":1179925259417469000,"text":"As the President of the United States, I have an absolute right, perhaps even a duty, to investigate, or have investigated, CORRUPTION, and that would include asking, or suggesting, other Countries to help us out!","rating":7},{"id":1303458451671011300,"text":"Police Chief, and most of the police in Rochester, N.Y., have resigned. The Democrat Mayor and, of courses, Governor Cuomo, have no idea what to do. New York State is a mess - No Money, High Taxes &amp; Crime, Everyone Fleeing. November 3rd. We can fix it!","rating":7},{"id":1268883561651884000,"text":"Really Big Jobs Report. Great going President Trump (kidding but true)!","rating":9},{"id":1337629306919538700,"text":"....that, after careful study and consideration, think you got “screwed”, something which will hurt them also. Many others likewise join the suit but, within a flash, it is thrown out and gone, without even looking at the many reasons it was brought. A Rigged Election, fight on!","rating":8},{"id":1250851143363805200,"text":"Major News Conference tonight, the White House at 6:00 P.M. (Eastern), to explain Guidelines for OPENING UP AMERICA AGAIN!","rating":3},{"id":1119969946002440200,"text":"Can you believe that I had to go through the worst and most corrupt political Witch Hunt in the history of the United States (No Collusion) when it was the “other side” that illegally created the diversionary &amp, criminal event and even spied on my campaign? Disgraceful!","rating":7},{"id":947614110082043900,"text":"HAPPY NEW YEAR! We are MAKING AMERICA GREAT AGAIN, and much faster than anyone thought possible!","rating":5},{"id":1154791664625606700,"text":"France just put a digital tax on our great American technology companies. If anybody taxes them, it should be their home Country, the USA. We will announce a substantial reciprocal action on Macron’s foolishness shortly. I’ve always said American wine is better than French wine!","rating":6},{"id":1311297684540620800,"text":"Nobody wants Sleepy Joe as a leader, including the Radical Left (which he lost last night!). He disrespected Bernie, effectively calling him a loser!","rating":8},{"id":1285540318503407600,"text":"Mail-In Voting, unless changed by the courts, will lead to the most CORRUPT ELECTION in our Nation’s History! #RIGGEDELECTION","rating":9},{"id":1287490820669616000,"text":"The 2020 Election will be totally rigged if Mail-In Voting is allowed to take place, &amp; everyone knows it. So much time is taken talking about foreign influence, but the same people won’t even discuss Mail-In election corruption. Look at Patterson, N.J. 20% of vote was corrupted!","rating":8},{"id":1319822460443750400,"text":"...For years, I watched one betrayal after another, as politicians like Joe Biden sold out American Workers at every turn—shattering the lives of millions of American families while THEIR families raked in millions of dollars...","rating":6},{"id":1316229344923201500,"text":"Great night in Pennsylvania. Big and Enthusiastic Crowd. Will be back soon. VOTE!!!","rating":4},{"id":1105110383227035600,"text":"Making Daylight Saving Time permanent is O.K. with me!","rating":5},{"id":1339912692736405500,"text":"Moderna vaccine overwhelmingly approved. Distribution to start immediately.","rating":3},{"id":1291842540023558100,"text":"Pelosi and Schumer only interested in Bailout Money for poorly run Democrat cities and states. Nothing to do with China Virus! Want one trillion dollars. No interest. We are going a different way!","rating":7},{"id":1304055016731422700,"text":"Democrats, OPEN THE SCHOOLS ( SAFELY), NOW! When schools are closed, let the money follow the child (FAMILY). Why should schools be paid when they are closed? They shouldn’t!","rating":6},{"id":1216506722153640000,"text":"National Security Adviser suggested today that sanctions &amp; protests have Iran “choked off”, will force them to negotiate. Actually, I couldn’t care less if they negotiate. Will be totally up to them but, no nuclear weapons and “don’t kill your protesters.”","rating":5},{"id":1242827275080532000,"text":"Congratulations to Prime Minister Abe of Japan, and the IOC, on their very wise decision to present the Olympics in 2021. It will be a great success, and I look forward to being there!","rating":3},{"id":1150381395078000600,"text":"....and viciously telling the people of the United States, the greatest and most powerful Nation on earth, how our government is to be run. Why don’t they go back and help fix the totally broken and crime infested places from which they came. Then come back and show us how....","rating":8},{"id":1251576806534250500,"text":"The most often used phrase in the Lamestream Media, by far, is “sources say”, or “officials who spoke on the condition of anonymity”, or anything similar which allows Fake News to make up a phony quote from a person who doesn’t even exist. The American people should demand NAMES!","rating":7},{"id":1309139081796911000,"text":"Sleepy Joe Biden just closed down his campaign for the day (Again). Wants to rest! He is a very LOW ENERGY INDIVIDUAL, and our Country cannot make it in these exciting, but complex and competitive times, with a Low Energy President !!!","rating":6},{"id":1085515276228153300,"text":"There are now 77 major or significant Walls built around the world, with 45 countries planning or building Walls. Over 800 miles of Walls have been built in Europe since only 2015. They have all been recognized as close to 100% successful. Stop the crime at our Southern Border!","rating":4},{"id":948359545767841800,"text":"I will be announcing THE MOST DISHONEST &amp, CORRUPT MEDIA AWARDS OF THE YEAR on Monday at 5:00 o’clock. Subjects will cover Dishonesty &amp, Bad Reporting in various categories from the Fake News Media. Stay tuned!","rating":9},{"id":1084571124556619800,"text":"Wish I could share with everyone the beauty and majesty of being in the White House and looking outside at the snow filled lawns and Rose Garden. Really is something - SPECIAL COUNTRY, SPECIAL PLACE!","rating":2},{"id":966662241977360400,"text":"I will be strongly pushing Comprehensive Background Checks with an emphasis on Mental Health. Raise age to 21 and end sale of Bump Stocks! Congress is in a mood to finally do something on this issue - I hope!","rating":3},{"id":896420822780444700,"text":"We ALL must be united &amp, condemn all that hate stands for. There is no place for this kind of violence in America. Lets come together as one!","rating":2},{"id":875166406417010700,"text":"Just left hospital. Rep. Steve Scalise, one of the truly great people, is in very tough shape - but he is a real fighter. Pray for Steve!","rating":1},{"id":910233418474098700,"text":"God bless the people of Mexico City. We are with you and will be there for you.","rating":1},{"id":1254544354603143200,"text":"Does anybody get the meaning of what a so-called Noble (not Nobel) Prize is, especially as it pertains to Reporters and Journalists? Noble is defined as, “having or showing fine personal qualities or high moral principles and ideals.” Does sarcasm ever work?","rating":8},{"id":1254747293414305800,"text":"Blame the Democrats for any “lateness” in your Enhanced Unemployment Insurance. I wanted the money to be paid directly, they insisted it be paid by states for distribution. I told them this would happen, especially with many states which have old computers.","rating":5},{"id":824083821889015800,"text":"Big day planned on NATIONAL SECURITY tomorrow. Among many other things, we will build the wall!","rating":5},{"id":1289408673324777500,"text":"Homeland Security is not leaving Portland until local police complete cleanup of Anarchists and Agitators!","rating":6},{"id":1309169908358545400,"text":"Russian Billionaire wired Hunter Biden 3 1/2 Million Dollars. This on top of all of the other money he received while Joe was V.P. Crooked as can be, but Fake Mainstream Media wants it to just go away!","rating":7},{"id":881281755017355300,"text":"My use of social media is not Presidential - it’s MODERN DAY PRESIDENTIAL. Make America Great Again!","rating":8},{"id":978932860307505200,"text":"THE SECOND AMENDMENT WILL NEVER BE REPEALED! As much as Democrats would like to see this happen, and despite the words yesterday of former Supreme Court Justice Stevens, NO WAY. We need more Republicans in 2018 and must ALWAYS hold the Supreme Court!","rating":6},{"id":1251168994066944000,"text":"LIBERATE MINNESOTA!","rating":9},{"id":1257438733240094700,"text":"MSDNC and FAKE NEWS CNN are going wild trying to protect China!","rating":7},{"id":1199812908257095700,"text":"95% Approval Rating in the Republican Party. Thank you!","rating":5},{"id":1323330770199408600,"text":"Biden can never negotiate with China. They would own the U.S. if he were ever President!","rating":7},{"id":1322616235423539200,"text":"Biden &amp; Obama owe a massive apology to the People of Flint. The water was poisoned on their watch. Not only did they fail them, Biden proudly accepted the endorsement of disastrous Gov Rick Snyder! Unlike Biden, I will always stand with the People of the Great State of MICHIGAN!","rating":6},{"id":1189927952168996900,"text":"The Greatest Witch Hunt In American History!","rating":9},{"id":1299133174564491300,"text":"Democrats Hate that I called for Big Pharma to match the lowest prescription drug prices in the World by using a FAVORED NATIONS CLAUSE. Prices will plunge!","rating":6},{"id":1304235190571597800,"text":"When we win I, as your President, will totally forgive ALL deferred payroll taxes with money from the General Fund. I will ALWAYS protect Seniors and your Social Security! Sleepy Joe Biden will do the opposite, he will raise your taxes and DESTROY our Country!","rating":7},{"id":1308539918075883500,"text":"A few weeks ago, I BANNED efforts to indoctrinate government employees with divisive and harmful sex and race-based ideologies. Today, I've expanded that ban to people and companies that do business...","rating":4},{"id":1341138409092509700,"text":"...Republicans in Wisconsin should take these 3 strong decisions to their State Legislators and overturn this ridiculous State Election. We won in a LANDSLIDE!","rating":7},{"id":1245000074167541800,"text":"With interest rates for the United States being at ZERO, this is the time to do our decades long awaited Infrastructure Bill. It should be VERY BIG &amp; BOLD, Two Trillion Dollars, and be focused solely on jobs and rebuilding the once great infrastructure of our Country! Phase 4","rating":5},{"id":1339914253596319700,"text":"Europe and other parts of the World being hit hard by the China Virus - Germany, France, Spain and Italy, in particular. The vaccines are on their way!!!","rating":3},{"id":1304767518112964600,"text":"ALERT: So now we find out that the entire Mueller “hit squad” illegally wiped their phones clean just prior to the investigation of them, all using the same really dumb reason for this “accident”, just like Crooked Hillary smashing her phones with a hammer, &amp; DELETING HER EMAILS!","rating":8},{"id":1261793132020224000,"text":"Why is it that China, for decades, and with a population much bigger than ours, is paying a tiny fraction of $’s to The World Health Organization, The United Nations and, worst of all, The World Trade Organization, where they are considered a so-called “developing country” and...","rating":4},{"id":1224724275900375000,"text":"My Approval Rating in the Republican Party = 95%, a record! Big Iowa win. Approval Rating overall = 53%, a new high. With our great Economy and other major successes, would be 20 points higher without the phony Witch Hunts and Hoaxes???","rating":6},{"id":869766994899468300,"text":"Despite the constant negative press covfefe","rating":10},{"id":1289639829810999300,"text":"Payroll Tax Cut plus Dollars!","rating":2},{"id":796897928048767000,"text":"A fantastic day in D.C. Met with President Obama for first time. Really good meeting, great chemistry. Melania liked Mrs. O a lot!","rating":3},{"id":1336112582424473600,"text":"“These actions on the part of State Officials, making these changes, were violating the Constitution of the U.S. They were usurping power.” Ken Starr","rating":4},{"id":869874798087819300,"text":"Kathy Griffin should be ashamed of herself. My children, especially my 11 year old son, Barron, are having a hard time with this. Sick!","rating":8},{"id":1152912995938443300,"text":"I don’t believe the four Congresswomen are capable of loving our Country. They should apologize to America (and Israel) for the horrible (hateful) things they have said. They are destroying the Democrat Party, but are weak &amp, insecure people who can never destroy our great Nation!","rating":7},{"id":1280203174008303600,"text":"They name teams out of STRENGTH, not weakness, but now the Washington Redskins &amp; Cleveland Indians, two fabled sports franchises, look like they are going to be changing their names in order to be politically correct. Indians, like Elizabeth Warren, must be very angry right now!","rating":9},{"id":1261138690929295400,"text":"Where is the 302? It is missing. Was it stolen or destroyed? General Flynn is being persecuted! #OBAMAGATE","rating":6},{"id":1304362313743560700,"text":"Congratulations to JPMorgan Chase for ordering everyone BACK TO OFFICE on September 21st. Will always be better than working from home!","rating":3},{"id":1315761783177576400,"text":"Sleepy Joe Biden had a particularly bad day today. He couldn’t remember the name of Mitt Romney, said again he was running for the U.S. Senate, and forgot what State he was in. If I did any of this, it would be disqualifying. With him, he’s just Sleepy Joe!","rating":7},{"id":1155547255916642300,"text":"There is nothing racist in stating plainly what most people already know, that Elijah Cummings has done a terrible job for the people of his district, and of Baltimore itself. Dems always play the race card when they are unable to win with facts. Shame!","rating":5},{"id":1217228960964038700,"text":"We are helping Apple all of the time on TRADE and so many other issues, and yet they refuse to unlock phones used by killers, drug dealers  and other violent criminal elements. They will have to step up to the plate and help our great Country, NOW! MAKE AMERICA GREAT AGAIN.","rating":6},{"id":1296275840649625600,"text":"WHY DID HE REFUSE TO ENDORSE SLOW JOE UNTIL IT WAS ALL OVER, AND EVEN THEN WAS VERY LATE? WHY DID HE TRY TO GET HIM NOT TO RUN?","rating":6},{"id":1252915116363874300,"text":"I will be signing my Executive Order prohibiting immigration into our Country today. In the meantime, even without this order, our Southern Border, aided substantially by the 170 miles of new Border Wall &amp; 27,000 Mexican soldiers, is very tight - including for human trafficking!","rating":8},{"id":1250834265471955000,"text":"Democrats are blocking additional funding for the popular Paycheck Protection Program. They are killing American small businesses. Stop playing politics Dems! Support Refilling PPP NOW – it is out of funds!","rating":7},{"id":1016663151935291400,"text":"On behalf of the United States, congratulations to the Thai Navy SEALs and all on the successful rescue of the 12 boys and their coach from the treacherous cave in Thailand. Such a beautiful moment - all freed, great job!","rating":3},{"id":1279890194653724700,"text":"Democrats want to Defund &amp; Abolish Police. This despite poor crime numbers in cities that they run. CRAZY!","rating":8},{"id":1180990908000559000,"text":"Unemployment Rate just dropped to 3.5%, the lowest in more that 50 years. Is that an impeachable event for your President?","rating":7},{"id":1240379840987115500,"text":"Today I spoke with American physicians and nurses to thank them for their tireless work. Doctors and nurses are at the front lines of this war and are true American HEROES! With their help, America will WIN.","rating":4},{"id":1193190844012122000,"text":"Just finished reading my son Donald’s just out new book, “Triggered.” It is really good! He, along with many of us, was very unfairly treated. But we all fight back, and we always win!","rating":6},{"id":1292190319845478400,"text":"Major News Conference in Ten Minutes!","rating":5},{"id":1056700376718684200,"text":"The Fake News is doing everything in their power to blame Republicans, Conservatives and me for the division and hatred that has been going on for so long in our Country. Actually, it is their Fake &amp, Dishonest reporting which is causing problems far greater than they understand!","rating":9},{"id":1318301849666134000,"text":"Heading for Tucson. See you in a little while. Winning Arizona!","rating":5},{"id":1219698190129225700,"text":"READ THE TRANSCRIPTS!","rating":2},{"id":1338254787675041800,"text":"....place in Detroit, Philadelphia, Milwaukee, Atlanta, Pittsburgh, and elsewhere. In all Swing State cases, there are far more votes than are necessary to win the State, and the Election itself. Therefore, VOTES CANNOT BE CERTIFIED. THIS ELECTION IS UNDER PROTEST!","rating":9},{"id":1084119654841364500,"text":"....I do have a plan on the Shutdown. But to understand that plan you would have to understand the fact that I won the election, and I promised safety and security for the American people. Part of that promise was a Wall at the Southern Border. Elections have consequences!","rating":8},{"id":1313650640699224000,"text":"All Russia Hoax Scandal information was Declassified by me long ago. Unfortunately for our Country, people have acted very slowly, especially since it is perhaps the biggest political crime in the history of our Country. Act!!!","rating":7},{"id":1271062068238651400,"text":"Our great National Guard Troops who took care of the area around the White House could hardly believe how easy it was. “A walk in the park”, one said. The protesters, agitators, anarchists (ANTIFA), and others, were handled VERY easily by the Guard, D.C. Police, &amp; S.S. GREAT JOB!","rating":6},{"id":1247185910673952800,"text":"Joe Biden wanted the date for the Democrat National Convention moved to a later time period. Now he wants a “Virtual” Convention, one where he doesn’t have to show up. Gee, I wonder why? Also, what ever happened to that phone call he told the Fake News he wanted to make to me?","rating":5},{"id":1313661368856457200,"text":"11,00 North Carolina residents get incorrect voter registration forms. 2000 LA County Voters received “faulty” Ballots, with NO WAY TO VOTE FOR PRESIDENT. Many others throughout USA. Here we go. This will be the most corrupt Election in American History!","rating":8},{"id":931877599034388500,"text":"Crooked Hillary Clinton is the worst (and biggest) loser of all time. She just can’t stop, which is so good for the Republican Party. Hillary, get on with your life and give it another try in three years!","rating":8},{"id":1310217730218430500,"text":"WATCH THE BALLOTS!!!","rating":3},{"id":1260169616510386200,"text":"TRANSITION TO GREATNESS","rating":4},{"id":1315748228462243800,"text":"Leaving now for Florida Rally. Big crowds!","rating":3},{"id":1338246404075118600,"text":"...They just “chickened out” and didn’t want to rule on the merits of the case. So bad for our Country!","rating":6},{"id":1215299143066947600,"text":"STOCK MARKET AT ALL-TIME HIGH! HOW ARE YOUR 401K’S DOING? 70%, 80%, 90% up? Only 50% up! What are you doing wrong?","rating":7},{"id":1208029119776247800,"text":"I will be signing our 738 Billion Dollar Defense Spending Bill today. It will include 12 weeks  Paid Parental Leave, gives our troops a raise, importantly creates the SPACE FORCE, SOUTHERN BORDER WALL FUNDING, repeals “Cadillac Tax” on Health Plans, raises smoking age to 21! BIG!","rating":5},{"id":1111217169730338800,"text":"Congressman Adam Schiff, who spent two years knowingly and unlawfully lying and leaking, should be forced to resign from Congress!","rating":7},{"id":1275379766959505400,"text":".....This action is taken effective immediately, but may also be used retroactively for destruction or vandalism already caused. There will be no exceptions!","rating":4},{"id":1257650279740301300,"text":"Oil prices moving up nicely as demand begins again!","rating":4},{"id":828939235499638800,"text":"I don't know Putin, have no deals in Russia, and the haters are going crazy - yet Obama can make a deal with Iran, #1 in terror, no problem!","rating":6},{"id":1163838736213393400,"text":"Sorry, I don’t buy Rep. Tlaib’s tears. I have watched her violence, craziness and, most importantly, WORDS, for far too long. Now tears? She hates Israel and all Jewish people. She is an anti-Semite. She and her 3 friends are the new face of the Democrat Party. Live with it!","rating":9},{"id":1321812933135995000,"text":"GDP number just announced. Biggest and Best in the History of our Country, and not even close. Next year will be FANTASTIC!!! However, Sleepy Joe Biden and his proposed record setting tax increase, would kill it all. So glad this great GDP number came out before November 3rd.","rating":6},{"id":927265906086031400,"text":"May God be w/ the people of Sutherland Springs, Texas. The FBI &amp, law enforcement are on the scene. I am monitoring the situation from Japan.","rating":2},{"id":1267826457796984800,"text":"Vaccines are coming along really well. Likewise therapeutics. Moving faster than anticipated. Good news ahead (in many ways)!","rating":3},{"id":914565910798782500,"text":"Being nice to Rocket Man hasn't worked in 25 years, why would it work now? Clinton failed, Bush failed, and Obama failed. I won't fail.","rating":7},{"id":1078431231262502900,"text":"CNN &amp, others within the Fake News Universe were going wild about my signing MAGA hats for our military in Iraq and Germany. If these brave young people ask me to sign their hat, I will sign. Can you imagine my saying NO? We brought or gave NO hats as the Fake News first reported!","rating":6},{"id":1108772952814899200,"text":"After 52 years it is time for the United States to fully recognize Israel’s Sovereignty over the Golan Heights, which is of critical strategic and security importance to the State of Israel and Regional Stability!","rating":4},{"id":1292181029541879800,"text":"Sleepy Joe Biden just agreed with the Radical Left Democrats to raise Taxes by Three Trillion Dollars. Everyone will pay - Will kill your Stocks, 401k’s, and the ECONOMY. BIG CRASH!  #MAGA","rating":8},{"id":1224722351125823500,"text":"Market up big today on very good economic news. JOBS, JOBS, JOBS!","rating":2},{"id":1007974129474121700,"text":"My supporters are the smartest, strongest, most hard working and most loyal that we have seen in our countries history. It is a beautiful thing to watch as we win elections and gather support from all over the country. As we get stronger, so does our country. Best numbers ever!","rating":3},{"id":1137572134409125900,"text":"I know it is not at all “Presidential” to hit back at the Corrupt Media, or people who work for the Corrupt Media, when they make false statements about me or the Trump Administration. Problem is, if you don’t hit back, people believe the Fake News is true. So we’ll hit back!","rating":5},{"id":1119341792460247000,"text":"....big, fat, waste of time, energy and money - $30,000,000 to be exact. It is now finally time to turn the tables and bring justice to some very sick and dangerous people who have committed very serious crimes, perhaps even Spying or Treason. This should never happen again!","rating":6},{"id":1344051613216993300,"text":"It is up to the States to distribute the vaccines once brought to the designated areas by the Federal Government. We have not only developed the vaccines, including putting up money to move the process along quickly, but gotten them to the states. Biden failed with Swine Flu!","rating":3},{"id":1210916803800707000,"text":"California and New York must do something about their TREMENDOUS Homeless problems. They are setting records! If their Governors can’t handle the situation, which they should be able to do very easily, they must call and “politely” ask for help. Would be so easy with competence!","rating":6},{"id":1133893813611782100,"text":"How do you impeach a Republican President for a crime that was committed by the Democrats? WITCH-HUNT!","rating":7},{"id":1275062328971497500,"text":"Because of MAIL-IN BALLOTS, 2020 will be the most RIGGED Election in our nations history - unless this stupidity is ended. We voted during World War One &amp; World War Two with no problem, but now they are using Covid in order to cheat by using Mail-Ins!","rating":8},{"id":1077329121745793000,"text":"I am in the Oval Office &amp, just gave out a 115 mile long contract for another large section of the Wall in Texas. We are already building and renovating many miles of Wall, some complete. Democrats must end Shutdown and finish funding. Billions of Dollars, &amp, lives, will be saved!","rating":5},{"id":1299471313128452000,"text":"No, I want Big Ten, and all other football, back - NOW. The Dems don’t want football back, for political reasons, but are trying to blame me and the Republicans. Another LIE, but this is what we are up against! They should also open up all of their Shutdown States.","rating":6},{"id":1249341768157495300,"text":"A very good sign is that empty hospital beds are becoming more and more prevalent. We deployed 418 Doctors, Nurses and Respiratory Therapists from the hospital ship Comfort and the Javits Convention Center to hospitals in NYC &amp; State. Have more bed capacity than was needed. Good!","rating":2},{"id":1269647899790540800,"text":"Somebody please tell highly overrated Colin Powell that I will have gotten almost 300 Federal Judges approved (a record), Two Great Supreme Court Justices, rebuilt our once depleted Military, Choice for Vets, Biggest Ever Tax &amp; Regulation Cuts, Saved Healthcare &amp; 2A, &amp; much more!","rating":6},{"id":987463564305797100,"text":"North Korea has agreed to suspend all Nuclear Tests and close up a major test site. This is very good news for North Korea and the World - big progress! Look forward to our Summit.","rating":4},{"id":853584968047636500,"text":"Happy Easter to everyone!","rating":1},{"id":1321430459050381300,"text":"Covid, Covid, Covid is the unified chant of the Fake News Lamestream Media. They will talk about nothing else until November 4th., when the Election will be (hopefully!) over. Then the talk will be how low the death rate is, plenty of hospital rooms, &amp; many tests of young people.","rating":9},{"id":1297329827859632000,"text":"A “Favored Nations Clause” against Big Pharma, which I signed last week, means that the USA gets a price on Prescription Drugs that matches the price of the Country that pays the lowest price anywhere in the World. 50%, 60%, maybe 70% reduction. No other President would do this!","rating":6},{"id":828375073006444500,"text":"Enjoy the #SuperBowl and then we continue: MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1054142516881248300,"text":"Facebook has just stated that they are setting up a system to “purge” themselves of Fake News. Does that mean CNN will finally be put out of business?","rating":8},{"id":1313443879253946400,"text":"Wow. Joe Biden just took a more Liberal position on Roe v. Wade than Elizabeth Warren at her highest. He also wants to PACK our great United States Supreme Court. This is what the Dems will do. Remember as they try changing positions before elections end. GET OUT AND VOTE!","rating":7},{"id":1235046124328755200,"text":"Elizabeth “Pocahontas” Warren, other than Mini Mike, was the loser of the night. She didn’t even come close to winning her home state of Massachusetts. Well, now she can just sit back with her husband and have a nice cold beer!","rating":7},{"id":1077255770725601300,"text":"I am all alone (poor me) in the White House waiting for the Democrats to come back and make a deal on desperately needed Border Security. At some point the Democrats not wanting to make a deal will cost our Country more money than the Border Wall we are all talking about. Crazy!","rating":7},{"id":825017279209410600,"text":"The #MarchForLife is so important. To all of you marching --- you have my full support!","rating":3},{"id":1060155917059219500,"text":"If the Democrats think they are going to waste Taxpayer Money investigating us at the House level, then we will likewise be forced to consider investigating them for all of the leaks of Classified Information, and much else, at the Senate level. Two can play that game!","rating":6},{"id":1209106016551481300,"text":"Pelosi gives us the most unfair trial in the history of the U.S. Congress, and now she is crying for fairness in the Senate, and breaking all rules while doing so. She lost Congress once, she will do it again!","rating":8}]