[{"id":1241388217267560400,"text":"White House News Conference at 12:30 P.M. Thank you!","rating":3},{"id":1277202162070753300,"text":"...Nobody’s been tougher on Russia than the Trump Administration. With Corrupt Joe Biden &amp; Obama, Russia had a field day, taking over important parts of Ukraine - Where’s Hunter? Probably just another phony Times hit job, just like their failed Russia Hoax. Who is their “source”?","rating":6},{"id":1004171953404629000,"text":"Chris Farrell, Judicial Watch. “They were running an operation to undermine a candidate for President of the U.S. These are all violations of law. This is intelligence tradecraft to steer an election. There’s nothing more grave when it comes to abuse of our intelligence system...","rating":4},{"id":1002160516733853700,"text":"Not that it matters but I never fired James Comey because of Russia! The Corrupt Mainstream Media loves to keep pushing that narrative, but they know it is not true!","rating":5},{"id":936209447747190800,"text":"The Chinese Envoy, who just returned from North Korea, seems to have had no impact on Little Rocket Man. Hard to believe his people, and the military, put up with living in such horrible conditions. Russia and China condemned the launch.","rating":7},{"id":1132038993682419700,"text":".....The Dems want a second shot at Bob Mueller, are very unhappy with the No Collusion Report. They should not be allowed to play this game any longer - no second chances - must get back to work. So bad for our Country!","rating":5},{"id":1221663764031905800,"text":"...transcripts of my calls with President Zelensky are all the proof that is needed, in addition to the fact that President Zelensky &amp; the Foreign Minister of Ukraine said there was no pressure and no problems. Additionally, I met with President Zelensky at the United Nations...","rating":4},{"id":982770847046922200,"text":"While Security spending was somewhat more than his predecessor, Scott Pruitt has received death threats because of his bold actions at EPA. Record clean Air &amp, Water while saving USA Billions of Dollars. Rent was about market rate, travel expenses OK. Scott is doing a great job!","rating":4},{"id":1265271286789558300,"text":"....about whether or not Joe could have done such a horrible thing? Maybe or maybe not, but I find Joe to be a total Nut Job, and I knew him well, far better than most. So many unanswered &amp; obvious questions, but I won’t bring them up now! Law enforcement eventually will?","rating":6},{"id":1012318771250384900,"text":"....persecuted on old and/or totally unrelated charges (there was no collusion and there was no obstruction of the no collusion)...And what is going on in the FBI &amp, DOJ with Crooked Hillary, the DNC and all of the lies? A disgraceful situation!","rating":5},{"id":1193249691741216800,"text":"95% Approval Rating in the Republican Party. Thank you! #MAGA #KAG2020","rating":5},{"id":916751271960436700,"text":"...hasn't worked, agreements violated before the ink was dry, makings fools of U.S. negotiators. Sorry, but only one thing will work!","rating":7},{"id":1157825763326013400,"text":"....Melania and I send our heartfelt thoughts and prayers to the great people of Texas.","rating":3},{"id":1181172467676565500,"text":"...figure the situation out, and what they want to do with the captured ISIS fighters in their “neighborhood.” They all hate ISIS, have been enemies for years. We are 7000 miles away and will crush ISIS again if they come anywhere near us!","rating":6},{"id":910641701064204300,"text":"I would not sign Graham-Cassidy if it did not include coverage of pre-existing conditions. It does! A great Bill. Repeal &amp, Replace.","rating":4},{"id":1175387095814348800,"text":"The Fake News Media and their partner, the Democrat Party, want to stay as far away as possible from the Joe Biden demand that the Ukrainian Government fire a prosecutor who was investigating his son, or they won’t get a very large amount of U.S. money, so they fabricate a.....","rating":8},{"id":1001410457092218900,"text":"We have put a great team together for our talks with North Korea. Meetings are currently taking place concerning Summit, and more. Kim Young Chol, the Vice Chairman of North Korea, heading now to New York. Solid response to my letter, thank you!","rating":4},{"id":387309175866290200,"text":"“We build too many walls and not enough bridges.” - Isaac Newton","rating":2},{"id":1104091298074685400,"text":"Congratulations to Heather Wilson, who is the sole finalist to become the next President of University of Texas at El Paso effective September 1, 2019. Heather has done an absolutely fantastic job...","rating":2},{"id":1024245909239021600,"text":"Rush Limbaugh is a great guy who truly gets it!","rating":3},{"id":1073210823936495600,"text":"....guilty even on a civil basis. Those charges were just agreed to by him in order to embarrass the president and get a much reduced prison sentence, which he did-including the fact that his family was temporarily let off the hook. As a lawyer, Michael has great liability to me!","rating":5},{"id":1302554417816907800,"text":"....fix it, and fast. The current recipient has no chance, and won’t even try. As I have often said, Baltimore is last in everything, WHAT THE HELL DO YOU HAVE TO LOSE! Kimberly is fully Endorsed by me, something I do not do lightly. Take advantage of it and MAKE BALTIMORE GREAT!","rating":6},{"id":921319017826091000,"text":"....This now allows for the passage of large scale Tax Cuts (and Reform), which will be the biggest in the history of our country!","rating":4},{"id":1029185314752000000,"text":"....such wonderful and powerful things about me - a true Champion of Civil Rights - until she got fired. Omarosa had Zero credibility with the Media (they didn’t want interviews) when she worked in the White House. Now that she says bad about me, they will talk to her. Fake News!","rating":7},{"id":926415703476928500,"text":"The real story on Collusion is in Donna B's new book. Crooked Hillary bought the DNC &amp, then stole the Democratic Primary from Crazy Bernie!","rating":8},{"id":1067792610180456400,"text":".....and G.M. would not be closing their plants in Ohio, Michigan &amp, Maryland. Get smart Congress. Also, the countries that send us cars have taken advantage of the U.S. for decades. The President has great power on this issue - Because of the G.M. event, it is being studied now!","rating":6},{"id":1251561244106141700,"text":"....Example! V.P. Mike Pence held a conference call yesterday with all Democrat Senators. He gave them everything that they would have wanted to hear in terms of gaining ground on the CoronaVirus, but nothing that anyone could have said, including “it’s over”, could have made....","rating":5},{"id":908676979561570300,"text":"CHAIN MIGRATION cannot be allowed to be part of any legislation on Immigration!","rating":5},{"id":883220875444715500,"text":"After Poland had a great meeting with Chancellor Merkel and then with PM Shinzō Abe of Japan &amp, President Moon of South Korea.","rating":3},{"id":1159083364965654500,"text":"....proud to admit their mistake of acting too fast and tightening too much (and that I was right!). They must Cut Rates bigger and faster, and stop their ridiculous quantitative tightening NOW. Yield curve is at too wide a margin, and no inflation! Incompetence is a.....","rating":6},{"id":868981969664843800,"text":"The massive TAX CUTS/REFORM that I have submitted is moving along in the process very well, actually ahead of schedule. Big benefits to all!","rating":5},{"id":1145720616777072600,"text":".....why President Trump has to deal with North Korea the way it is now. He had to figure out what to do with the Korea mess. I think this is why the President deserves a lot of credit.” Harry Kazianis, Center for the National Interest. Thank you!","rating":3},{"id":1198286523583606800,"text":"“The Democrats dirty tricks have started this whole thing. The Whistleblower, the guy who took his case to Schiff’s staff first, is what really blows the lid off this entire saga. He worked for Biden on Ukraine policy when Biden was VP. He worked for deep state henchman John","rating":8},{"id":1034778515789545500,"text":"Big Election Wins last night! The Republican Party will MAKE AMERICA GREAT AGAIN! Actually, it is happening faster than anybody thought possible! It is morphing into KEEP AMERICA GREAT!","rating":6},{"id":989134248010502100,"text":"Busy day planned.  Looking forward to watching President Macron of France address a Joint Session of Congress today. This is a great honor and seldom allowed to be done...he will be GREAT!","rating":2},{"id":1005548570332631000,"text":"Henry McMaster loves the people of South Carolina and was with me from the beginning. He is strong on Crime and Borders, great for our Military and our Vets. He is doing a fantastic job as your Governor, and has my full endorsement, a special guy. Vote on Tuesday!","rating":4},{"id":862263649821503500,"text":"The Democrats have said some of the worst things about James Comey, including the fact that he should be fired, but now they play so sad!","rating":6},{"id":1162038755093598200,"text":"Wow! The Deputy Editor of the Failing New York Times was just demoted. Should have been Fired! Totally biased and inaccurate reporting. The paper is a Fraud, Zero Credibility. Fake News takes another hit, but this time a big one!","rating":7},{"id":1120388545506619400,"text":"Spoke to the Prime Minister of Italy, Giuseppe Conte, mostly concerning Immigration, Taxes, Trade, and the Economy of both of our countries. Very good call!","rating":3},{"id":967506350283599900,"text":"Unemployment claims are at the lowest level since 1973. Much of this has to do with the massive cutting of unnecessary and job killing Regulations!","rating":4},{"id":1057638285026254800,"text":"The World is using our laws to our detriment. They laugh at the Stupidity they see!","rating":9},{"id":1189156179173433300,"text":"The Do Nothing Democrats are working hard to make everyone forget the Best Economy Ever, the monumental weekend raid, Tax Cuts, the Rebuilding of our Military, etc. The Impeachment Hoax is a disgrace. Read the transcript!","rating":6},{"id":1198328568838840300,"text":"NEW YORK POST EDITORIAL. “Worse Than Pointless. All those hours of televised testimony plainly failed on their announced goal: to change American’s minds. Part of the problem is that Democrats already leaked the best evidence they had. More important, NOT ONE WITNESS OFFERED.....","rating":4},{"id":1207151167173775400,"text":"....They want to Impeach me (I’m not worried!), and yet they were all breaking the law in so many ways. How can they do that and yet impeach a very successful (Economy Plus) President of the United States, who has done nothing wrong? These people are Crazy!","rating":7},{"id":1006833568641777700,"text":"...realize the economy is the best it’s ever been with employment being at an all time high, and many companies pouring back into our country. Wake up Punchy!","rating":5},{"id":1148958770770382800,"text":"Iran has long been secretly “enriching,” in total violation of the terrible 150 Billion Dollar deal made by John Kerry and the Obama Administration. Remember, that deal was to expire in a short number of years. Sanctions will soon be increased, substantially!","rating":5},{"id":750353319084843000,"text":"FBI director said Crooked Hillary compromised our national security. No charges. Wow! #RiggedSystem","rating":8},{"id":887654816507408400,"text":"The Republicans never discuss how good their healthcare bill is, &amp, it will get even better at lunchtime.The Dems scream death as OCare dies!","rating":6},{"id":940904649728708600,"text":"The reason I originally endorsed Luther Strange (and his numbers went up mightily), is that I said Roy Moore will not be able to win the General Election.  I was right! Roy worked hard but the deck was stacked against him!","rating":4},{"id":1011209592670425100,"text":"Former Attorney General Michael Mukasey said that President Trump is probably correct that there was surveillance on Trump Tower. Actually, far greater than would ever have been believed!","rating":7},{"id":1171760235935125500,"text":"If it weren’t for the never ending Fake News about me, and with all that I have done (more than any other President in the first 2 1/2 years!), I would be leading the “Partners” of the LameStream Media by 20 points. Sorry, but true!","rating":9},{"id":879323238425395200,"text":"The real story is that President Obama did NOTHING after being informed in August about Russian meddling. With 4 months looking at Russia...","rating":6},{"id":1165664682952163300,"text":"Big Trade Deal just agreed to with Prime Minister Abe of Japan. Will be great for our Farmers, Ranchers and more. Really big Corn purchase!","rating":5},{"id":1156979446877962200,"text":"...during the talks the U.S. will start, on September 1st, putting a small additional Tariff of 10% on the remaining 300 Billion Dollars of goods and products coming from China into our Country. This does not include the 250 Billion Dollars already Tariffed at 25%...","rating":4},{"id":991992302267785200,"text":"Mr. Cohen, an attorney, received a monthly retainer, not from the campaign and having nothing to do with the campaign, from which he entered into, through reimbursement, a private contract between two parties, known as a non-disclosure agreement, or NDA. These agreements are.....","rating":3},{"id":1134522066508685300,"text":"Saddened to hear about the loss of John Pinto, a Navajo Code Talker in World War II, over the Memorial Day Weekend. The Code Talkers are true American HEROES and John never stopped serving his fellow citizens as a longtime New Mexico State Senator. John, Rest In Peace!","rating":2},{"id":1075406772368785400,"text":"....In any event, it goes on and on &amp, the new AG, who is now being replaced by yet another AG (who openly campaigned on a GET TRUMP agenda), does little else but rant, rave &amp, politic against me. Will never be treated fairly by these people - a total double standard of “justice.”","rating":7},{"id":1165500375870427100,"text":"Such False and Inaccurate reporting thus far on the G-7. The Fake News knows this but they can’t help themselves! Leaving now to have breakfast with Boris J.","rating":6},{"id":1161719409804808200,"text":"..Spread is way too much as other countries say THANK YOU to clueless Jay Powell and the Federal Reserve. Germany, and many others, are playing the game! CRAZY INVERTED YIELD CURVE! We should easily be reaping big Rewards &amp, Gains, but the Fed is holding us back. We will Win!","rating":8},{"id":1068336562729939000,"text":"“This demonstrates the Robert Mueller and his partisans have no evidence, not a whiff of collusion, between Trump and the Russians. Russian project legal. Trump Tower meeting (son Don), perfectly legal. He wasn’t involved with hacking.”     Gregg Jarrett.  A total Witch Hunt!","rating":7},{"id":1131152788770181100,"text":"Without the ILLEGAL Witch Hunt, my poll numbers, especially because of our historically “great” economy, would be at 65%. Too bad! The greatest Hoax in American History.","rating":9},{"id":924639422066384900,"text":"...\"\"collusion,\"\" which doesn't exist. The Dems are using this terrible (and bad for our country) Witch Hunt for evil politics, but the R's...","rating":7},{"id":1154375992938549200,"text":"House Republicans should support the TWO YEAR BUDGET AGREEMENT which greatly helps our Military and our Vets. I am totally with you!","rating":3},{"id":847766558520856600,"text":"Mike Flynn should ask for immunity in that this is a witch hunt (excuse for big election loss), by media &amp, Dems, of historic proportion!","rating":8},{"id":1054451956608049200,"text":"....I say of course they’re low - because for the first time in 50 years I am making them pay a big price for doing business with America. Why should they like me? — But I still like them!","rating":6},{"id":1130526243751960600,"text":"....Iran will call us if and when they are ever ready. In the meantime, their economy continues to collapse - very sad for the Iranian people!","rating":4},{"id":1253467417482801200,"text":"Congressman Bill Posey is a tremendous fighter for the Great State of Florida. He is a big supporter of our #MAGA Agenda – Strong on Crime, the Second Amendment, and Loves our Veterans and Law Enforcement. Bill has my Complete and Total Endorsement!","rating":2},{"id":890208319566229500,"text":"...big dollars ($700,000) for his wife's political run from Hillary Clinton and her representatives. Drain the Swamp!","rating":5},{"id":1167582228433580000,"text":"Just arrived at Camp David!","rating":1},{"id":1237388788776800300,"text":"Our CoronaVirus Team has been doing a great job. Even Democrat governors have been VERY complimentary!","rating":3},{"id":1024347409483292700,"text":"...Border Security is National Security, and National Security is the long-term viability of our Country. A Government Shutdown is a very small price to pay for a safe and Prosperous America!","rating":6},{"id":916634286811435000,"text":"Late Night host are dealing with the Democrats for their very \"\"unfunny\"\" &amp, repetitive material, always anti-Trump! Should we get Equal Time?","rating":7},{"id":1124643901430796300,"text":"There is nothing easy about a USA Infrastructure Plan, especially when our great Country has spent an astounding 7 trillion dollars in the Middle East over the last 19 years, but I am looking hard at a bipartisan plan of 1 to 2 trillion dollars. Badly needed!","rating":5},{"id":900708110330978300,"text":"James Clapper, who famously got caught lying to Congress, is now an authority on Donald Trump. Will he show you his beautiful letter to me?","rating":8},{"id":1205856376930623500,"text":"“Independent voters are fed up and frustrated with the Democrats.” Congressman Michael Waltz, Florida","rating":4},{"id":1051168800324931600,"text":"Heading to the Great State of Kentucky - Big Rally for Congressman Andy Barr - Fantastic guy, need his vote for MAGA! Strong on Crime, Tax Cuts, Military, Vets &amp, 2nd A. His opponent will NEVER vote for us, only for Pelosi. Andy has my Strongest Endorsement!!! See you in Kentucky.","rating":5},{"id":931469365538672600,"text":"Great numbers on Stocks and the Economy. If we get Tax Cuts and Reform, we'll really see some great results!","rating":4},{"id":1164914609180033000,"text":"As usual, the Fed did NOTHING! It is incredible that they can “speak” without knowing or asking what I am doing, which will be announced shortly. We have a very strong dollar and a very weak Fed. I will work “brilliantly” with both, and the U.S. will do great...","rating":7},{"id":1040780813086928900,"text":"Great job FEMA, First Responders and Law Enforcement - not easy, very dangerous, tremendous talent. America is proud of you. Keep it all going - finish strong!","rating":3},{"id":1181227887543894000,"text":"....down, watching over a quagmire, &amp, spending big dollars to do so. When I took over, our Military was totally depleted. Now it is stronger than ever before. The endless and ridiculous wars are ENDING! We will be focused on the big picture, knowing we can always go back &amp, BLAST!","rating":6},{"id":998534123399663600,"text":"....top of the FBI. Brennan started this entire debacle about President Trump. We now know that Brennan had detailed knowledge of the (phony) Dossier...he knows about the Dossier, he denies knowledge of the Dossier, he briefs the Gang of 8 on the Hill about the Dossier, which....","rating":7},{"id":1071408938522996700,"text":"I am pleased to announce my nomination of four-star General Mark Milley, Chief of Staff of the United States Army – as the Chairman of the Joint Chiefs of Staff, replacing General Joe Dunford, who will be retiring....","rating":3},{"id":1011579076493144000,"text":"It was great being with Governor Henry McMaster last night in South Carolina. Henry is tough on Crime and Borders, loves our Military and our Vets and has created many jobs and a great economy. GO OUT AND VOTE FOR HENRY TODAY, HE WILL NEVER LET YOU DOWN!","rating":4},{"id":1155967245308190700,"text":"....She loves our Military and our Vets and protects our Second Amendment. Cindy has my Full and Total Endorsement! #MAGA","rating":3},{"id":1034456281120206800,"text":"....results on “Trump News” are from National Left-Wing Media, very dangerous. Google &amp, others are suppressing voices of Conservatives and hiding information and news that is good. They are controlling what we can &amp, cannot see. This is a very serious situation-will be addressed!","rating":9},{"id":997238932311068700,"text":"Tomorrow, the House will vote on a strong Farm Bill, which includes work requirements. We must support our Nation’s great farmers!","rating":2},{"id":1006837459794251800,"text":"Congratulations to Corey Stewart for his great victory for Senator from Virginia. Now he runs against a total stiff, Tim Kaine, who is weak on crime and borders, and wants to raise your taxes through the roof. Don’t underestimate Corey, a major chance of winning!","rating":6},{"id":1178651959051669500,"text":"#FakeWhistleblower","rating":8},{"id":1135360773557895200,"text":"Kevin Hassett, who has done such a great job for me and the Administration, will be leaving shortly. His very talented replacement will be named as soon as I get back to the U.S. I want to thank Kevin for all he has done - he is a true friend!","rating":3},{"id":1173354645642764300,"text":"....sufficient to keep the markets well-supplied. I have also informed all appropriate agencies to expedite approvals of the oil pipelines currently in the permitting process in Texas and various other States.","rating":2},{"id":1182286411501838300,"text":"Turkey has been planning to attack the Kurds for a long time. They have been fighting forever. We have no soldiers or Military anywhere near the attack area. I am trying to end the ENDLESS WARS. Talking to both sides. Some want us to send tens of thousands of soldiers to....","rating":7},{"id":1162498956917706800,"text":"Just completed a very good meeting on Afghanistan. Many on the opposite side of this 19 year war, and us, are looking to make a deal - if possible!","rating":5},{"id":1336303563425910800,"text":"I hope House Republicans will vote against the very weak National Defense Authorization Act (NDAA), which I will VETO. Must include a termination of Section 230 (for National Security purposes), preserve our National Monuments, &amp; allow for 5G &amp; troupe reductions in foreign lands!","rating":8},{"id":913550237377138700,"text":"...really hard to help but many have lost their homes. Military is now on site and I will be there Tuesday. Wish press would treat fairly!","rating":4},{"id":1156979450560548900,"text":"...We look forward to continuing our positive dialogue with China on a comprehensive Trade Deal, and feel that the future between our two countries will be a very bright one!","rating":3},{"id":855817226078879700,"text":"Big TAX REFORM AND TAX REDUCTION will be announced next Wednesday.","rating":5},{"id":939475127552618500,"text":"GREAT EVENING last night in Pensacola, Florida. Arena was packed to the rafters, the crowd was loud, loving and really smart. They definitely get what’s going on. Thank you Pensacola!","rating":6},{"id":1236096307858681900,"text":"....I want to thank Acting Chief Mick Mulvaney for having served the Administration so well. He will become the United States Special Envoy for Northern Ireland. Thank you!","rating":3},{"id":987065049566138400,"text":"...Hopefully the Senate will not leave Washington until our Ambassadors, Judges and the people who make Washington work are approved. The Democrats are Obstructing the process and we need these people approved for the good of our Country!","rating":6},{"id":1114151754722156500,"text":"The Crazed and Dishonest Washington Post again purposely got it wrong. Mexico, for the first time in decades, is meaningfully apprehending illegals at THEIR Southern Border, before the long march up to the U.S. This is great and the way it should be. The big flow will stop.......","rating":9},{"id":987096152892944400,"text":"Sanctuary Cities released at least 142 Gang Members across the United States, making it easy for them to commit all forms of violent crimes where none would have existed. We are doing a great job of law enforcement, but things such as this make safety in America difficult!","rating":8},{"id":1153274075155959800,"text":"....as we have done, it could have been soooo much better. Interest rate costs should have been much lower, &amp, GDP &amp, our Country’s wealth accumulation much higher. Such a waste of time &amp, money. Also, very unfair that other countries manipulate their currencies and pump money in!","rating":7},{"id":1156176532773191700,"text":"Senate is working hard on America’s Transportation Infrastructure Act. Will have BIG IMPACT on our highways and roads all across our Nation. Interest strong from Republicans and Democrats. Do I hear the beautiful word, BIPARTISAN? Get it done. I am with you!","rating":5},{"id":973909651065528300,"text":"Perhaps at no time in history have the business fundamentals of U.S. companies been better than they are today!","rating":4},{"id":929503025512693800,"text":"Met with President Putin of Russia who was at #APEC meetings. Good discussions on Syria. Hope for his help to solve, along with China the dangerous North Korea crisis. Progress being made.","rating":6},{"id":1232492832897659000,"text":"....Democrats talking point is that we are doing badly. If the virus disappeared tomorrow, they would say we did a really poor, and even incompetent, job. Not fair, but it is what it is. So far, by the way, we have not had one death. Let’s keep it that way!","rating":9},{"id":1306657201235415000,"text":"State Supreme Court in Pennsylvania just affirmed that Ballot harvesting remains illegal. We will be watching that the Democrats do not Ballot Harvest - a felony. In other words, the Republican Party won on the atrocious Ballot Harvesting Scam...","rating":7},{"id":910993665568526300,"text":"A big day for the U.S. at the United Nations!","rating":3},{"id":1182387198164947000,"text":"....We have one of three choices: Send in thousands of troops and win Militarily, hit Turkey very hard Financially and with Sanctions, or mediate a deal between Turkey and the Kurds!","rating":8},{"id":1128251531114033200,"text":"Billions of Dollars, and moving jobs back to the USA where they belong. Other countries are already negotiating with us because they don’t want this to happen to them. They must be a part of USA action. This should have been done by our leaders many years ago. Enjoy!","rating":5},{"id":1120651611410436100,"text":".....But should be much higher than that if Twitter wasn’t playing their political games. No wonder Congress wants to get involved - and they should. Must be more, and fairer, companies to get out the WORD!","rating":6},{"id":1143836568513392600,"text":"Too bad the Dems in Congress won’t do anything at all about Border Security. They want Open Borders, which means crime. But we are getting it done, including building the Wall! More people than ever before are coming because the USA Economy is so good, the best in history.","rating":5},{"id":1112903454941474800,"text":"....are developing a really great HealthCare Plan with far lower premiums (cost) &amp, deductibles than ObamaCare. In other words it will be far less expensive &amp, much more usable than ObamaCare. Vote will be taken right after the Election when Republicans hold the Senate &amp, win......","rating":4},{"id":1196155347117002800,"text":"Tell Jennifer Williams, whoever that is, to read BOTH transcripts of the presidential calls, &amp, see the just released ststement from Ukraine. Then she should meet with the other Never Trumpers, who I don’t know &amp, mostly never even heard of, &amp, work out a better presidential attack!","rating":7},{"id":932433668068528100,"text":"Republican Senators are working very hard to get Tax Cuts and Tax Reform approved. Hopefully it will not be long and they do not want to disappoint the American public!","rating":3},{"id":1140436006472245200,"text":"Congratulations to Gary Woodland in winning the United States Open Golf Championship. Fantastic playing, great heart - there will be more in Gary’s future!","rating":2},{"id":1158797734394192000,"text":"... are NOT planning to illegally subvert the 2020 Election despite all that has been said to the contrary. It all sounded good until I watched Kevin Cernekee, a Google engineer, say terrible things about what they did in 2016 and that they want to “Make sure that Trump losses...","rating":5},{"id":1034979892524458000,"text":"“Ohr told the FBI it (the Fake Dossier) wasn’t true, it was a lie and the FBI was determined to use it anyway to damage Trump and to perpetrate a fraud on the court to spy on the Trump campaign. This is a fraud on the court. The Chief Justice of the U.S. Supreme Court is in......","rating":6},{"id":885772727315030000,"text":"After all of these years of suffering thru ObamaCare, Republican Senators must come through as they have promised!","rating":3},{"id":1154763413358370800,"text":"Q2 GDP Up 2.1% Not bad considering we have the very heavy weight of the Federal Reserve anchor wrapped around our neck. Almost no inflation. USA is set to Zoom!","rating":4},{"id":1069960017204469800,"text":"Looking forward to being with the wonderful Bush family at Blair House today. The former First Lady will be coming over to the White House this morning to be given a tour of the Christmas decorations by Melania. The elegance &amp, precision of the last two days have been remarkable!","rating":2},{"id":1003952348962619400,"text":"The U.S. has an increased economic value of more than 7 Trillion Dollars since the Election. May be the best economy in the history of our country. Record Jobs numbers. Nice!","rating":3},{"id":1135247979617685500,"text":"Peggy Noonan, the simplistic writer for Trump Haters all, is stuck in the past glory of Reagan and has no idea what is happening with the Radical Left Democrats, or how vicious and desperate they are. Mueller had to correct his ridiculous statement, Peggy never understood it!","rating":5},{"id":989858791687671800,"text":"Look forward to meeting with Chancellor Angela Merkel of Germany today. So much to discuss, so little time! It will be good for both of our great countries!","rating":3},{"id":1171651786622537700,"text":"Greg Murphy won big, 62% to 37%, in North Carolina 03, &amp, the Fake News barely covered the race. The win was far bigger than anticipated - there was just nothing the Fakers could say to diminish or demean the scope of this victory. So we had TWO BIG VICTORIES tonight, Greg &amp, Dan!","rating":4},{"id":1051558072433463300,"text":"I will be interviewed on “60 Minutes” tonight at 7:00 P.M., after NFL game. Enjoy!","rating":2},{"id":918061437750267900,"text":"It would be really nice if the Fake News Media would report the virtually unprecedented Stock Market growth since the election.Need tax cuts","rating":4},{"id":939149296389251100,"text":"LAST thing the Make America Great Again Agenda needs is a Liberal Democrat in Senate where we have so little margin for victory already. The Pelosi/Schumer Puppet Jones would vote against us 100% of the time. He’s bad on Crime, Life, Border, Vets, Guns &amp, Military. VOTE ROY MOORE!","rating":6},{"id":1051861686842474500,"text":"Just arrived in Florida. Also thinking about our GREAT Alabama farmers and our many friends in North and South Carolina today. We are with you!","rating":2},{"id":888713231065391100,"text":"This morning I will be going to the Commissioning Ceremony for the largest aircraft carrier in the world, The Gerald R. Ford.  Norfolk, Va.","rating":2},{"id":1034128943480299500,"text":"Governor Doug Ducey of Arizona is doing a great job. It would be really nice to show your support tomorrow by voting for him in Tuesdays Primary. Doug is strong on Crime, the Border, and our Second Amendment. Loves our Military &amp, our Vets. He has my full and complete Endorsement.","rating":4},{"id":1073737336935071700,"text":"For the record, there were MANY people who wanted to be the White House Chief of Staff. Mick M will do a GREAT job!","rating":3},{"id":1302554416952889300,"text":"....Baltimore will turn around, and I will help. Crime will go way down, money and jobs will pour in. Life will be MUCH better because Kimberly really cares. The Dems have had 100 years and they gave you nothing but heartache. Baltimore is the WORST IN NATION, Kimberly will..","rating":6},{"id":1163472273388576800,"text":".....The Fed Rate, over a fairly short period of time, should be reduced by at least 100 basis points, with perhaps some quantitative easing as well. If that happened, our Economy would be even better, and the World Economy would be greatly and quickly enhanced-good for everyone!","rating":2},{"id":891263843908948000,"text":"If the Senate Democrats ever got the chance, they would switch to a 51 majority vote in first minute. They are laughing at R's. MAKE CHANGE!","rating":5},{"id":1168879633984643000,"text":"For all of the “geniuses” out there, many who have been in other administrations and “taken to the cleaners” by China, that want me to get together with the EU and others to go after China Trade practices remember, the EU &amp, all treat us VERY unfairly on Trade also. Will change!","rating":3},{"id":1170437808894427100,"text":"The Failing New York Times stated, in an article written by Obama flunky Peter Baker (who lovingly wrote Obama book),”Even after the President forecast the storm to include Alabama.” THIS IS NOT TRUE. I said, VERY EARLY ON, that it MAY EVEN hit Alabama. A BIG DIFFERENCE.....","rating":7},{"id":1170782374843564000,"text":"Looking forward to being in the North Carolina tomorrow night. We’re having a BIG RALLY for a great guy, Dan Bishop. Strong on Crime, Borders, your Military and our Vets, we need Dan Bishop in Washington badly. His opponent is WEAK on Crime, Borders, and against your 2nd A.","rating":2},{"id":1075718191253504000,"text":"Getting out of Syria was no surprise. I’ve been campaigning on it for years, and six months ago, when I very publicly wanted to do it, I agreed to stay longer. Russia, Iran, Syria &amp, others are the local enemy of ISIS. We were doing there work. Time to come home &amp, rebuild. #MAGA","rating":4},{"id":921888248707846100,"text":"I agree getting Tax Cuts approved  is important (we will also get HealthCare), but perhaps no Administration has done more in its first.....","rating":3},{"id":1174342163141812200,"text":"The Trump Administration is revoking California’s Federal Waiver on emissions in order to produce far less expensive cars for the consumer, while at the same time making the cars substantially SAFER. This will lead to more production because of this pricing and safety......","rating":5},{"id":1263537560829255700,"text":"....Hahn, Richard Goodstein, Donna Brazile, Niel Cavuto, and many others. They repeat the worst of the Democrat speaking points, and lies. All of the good is totally nullified, and more. Net Result = BAD! CNN &amp; MSDNC are all in for the Do Nothing Democrats! Fox WAS Great!","rating":7},{"id":1153737355188199400,"text":"....I got to know him over his many years as Chairman of the Police Athletic League, for which he devoted so much time and energy. Bob Morgenthau, a legend, will be greatly missed!","rating":2},{"id":1171120177196544000,"text":"We have been serving as policemen in Afghanistan, and that was not meant to be the job of our Great Soldiers, the finest on earth. Over the last four days, we have been hitting our Enemy harder than at any time in the last ten years!","rating":6},{"id":848521325480202200,"text":"Talks on Repealing and Replacing ObamaCare are, and have been, going on, and will continue until such time as a deal is hopefully struck.","rating":3},{"id":1181553630354260000,"text":"We may be in the process of leaving Syria, but in no way have we Abandoned the Kurds, who are special people and wonderful fighters. Likewise our relationship with Turkey, a NATO and Trading partner, has been very good. Turkey already has a large Kurdish population and fully....","rating":4},{"id":1011256862975676400,"text":"Will be heading to one of my favorite places, South Carolina, to fight for one of my original “fighters,” Governor Henry McMaster. Speaking at 7:00 P.M.","rating":3},{"id":1128050330028134400,"text":"My Administration will be fighting for $200 million for the Army Corps Everglades restoration work this year. Congress needs to help us complete the world’s largest intergovernmental watershed restoration project ASAP! Good for Florida and good for the environment.","rating":2},{"id":1199352977934487600,"text":"...love to have Mike Pompeo, Rick Perry, Mick Mulvaney and many others testify about the phony Impeachment Hoax. It is a Democrat Scam that is going nowhere but, future Presidents should in no way be compromised. What has happened to me should never happen to another President!","rating":6},{"id":1104011577718640600,"text":"Both the Judge and the lawyer in the Paul Manafort case stated loudly and for the world to hear that there was NO COLLUSION with Russia. But the Witch Hunt Hoax continues as you now add these statements to House &amp, Senate Intelligence &amp, Senator Burr. So bad for our Country!","rating":7},{"id":1073207272069890000,"text":"....stated that I did nothing wrong with respect to campaign finance laws, if they even apply, because this was not campaign finance. Cohen was guilty on many charges unrelated to me, but he plead to two campaign charges which were not criminal and of which he probably was not...","rating":6},{"id":1145707939761705000,"text":"Thank you to President Moon of South Korea for hosting the American Delegation and me immediately following the very successful G-20 in Japan. While there, it was great to call on Chairman Kim of North Korea to have our very well covered meeting. Good things can happen for all!","rating":3},{"id":1145726441612554200,"text":"....more money than it had. Going on for years, originally brought by Crooked Hillary’s Campaign Chair, A.G. Eric Schneiderman, until forced to resign for abuse against women. They never even looked at the disgusting Clinton Foundation. Now Cuomo’s A.G. is harassing all of my....","rating":7},{"id":1126815715682656300,"text":"Tariffs will bring in FAR MORE wealth to our Country than even a phenomenal deal of the traditional kind. Also, much easier &amp, quicker to do. Our Farmers will do better, faster, and starving nations can now be helped. Waivers on some products will be granted, or go to new source!","rating":5},{"id":862267781336752100,"text":"Comey lost the confidence of almost everyone in Washington, Republican and Democrat alike. When things calm down, they will be thanking me!","rating":6},{"id":1016289620596789200,"text":"The United States is spending far more on NATO than any other Country. This is not fair, nor is it acceptable. While these countries have been increasing their contributions since I took office, they must do much more. Germany is at 1%, the U.S. is at 4%, and NATO benefits.......","rating":4},{"id":1107256142584078300,"text":"Report: Christopher Steele backed up his Democrat &amp, Crooked Hillary paid for Fake &amp, Unverified Dossier with information he got from “send in watchers” of low ratings CNN. This is the info that got us the Witch Hunt!","rating":8},{"id":1139143353445040100,"text":"The Dems fight us at every turn - in the meantime they are accomplishing nothing for the people! They have gone absolutely “Loco,” or Unhinged, as they like to say!","rating":9},{"id":1138433774327410700,"text":"...Companies to come to the U.S.A and to get companies that have left us for other lands to come back home. We stupidly lost 30% of our auto business to Mexico. If the Tariffs went on at the higher level, they would all come back, and pass. But very happy with the deal I made,...","rating":5},{"id":829681034564341800,"text":"Chris Cuomo, in his interview with Sen. Blumenthal, never asked him about his long-term lie about his brave \"\"service\"\" in Vietnam. FAKE NEWS!","rating":7},{"id":944666448185692200,"text":"FBI Deputy Director Andrew McCabe is racing the clock to retire with full benefits. 90 days to go?!!!","rating":7},{"id":1129334905228468200,"text":"The Democrats now realize that there is a National Emergency at the Border and that, if we work together, it can be immediately fixed. We need Democrat votes and all will be well!","rating":5},{"id":1213149809378578400,"text":"....followed, and then it was withdrawn. The Democrats argument for impeachment has not gotten stronger over the last few weeks. As Senator Josh Hawley just said, he’s going to enter a Motion to Dismiss the Impeachment Trial because it’s never actually been brought to trial.”","rating":4},{"id":1216426942733389800,"text":"House Republicans investigating origins of the Ukraine Whistleblower complaint. ICIG Michael Atkinson facing serious questions. “The Democrats know the ICIG is a major problem-didn’t release his testimony. Looks so much like everything else we’ve seen, from the Russia Hoax, to...","rating":6},{"id":1057612657665171500,"text":"The Caravans are made up of some very tough fighters and people. Fought back hard and viciously against Mexico at Northern Border before breaking through. Mexican soldiers hurt, were unable, or unwilling to stop Caravan. Should stop them before they reach our Border, but won’t!","rating":8},{"id":1169606328945451000,"text":"Really Good Jobs Numbers!","rating":3},{"id":1022936690267177000,"text":"Congressman David Kustoff has been a champion for the Trump Agenda - I greatly appreciate his support. David is strong on crime and borders, loves our Military, Vets and Second Amendment. Get out and vote for David on Thursday, August 2nd. He has my full and total Endorsement!","rating":4},{"id":977159683151712300,"text":"DACA was abandoned by the Democrats. Very unfair to them! Would have been tied to desperately needed Wall.","rating":5},{"id":1051473226109513700,"text":"Princess Eugenie of York was a truly beautiful bride yesterday. She has been through so much, and has come out a total winner!","rating":2},{"id":1334518253918572500,"text":"Thank you to Represenative Mo Brooks!","rating":3},{"id":1042731410858168300,"text":"Financial and jobs numbers are fantastic. There are plenty of new, high paying jobs available in our great and very vibrant economy. If you are not happy where you are, start looking - but also remember, our economy is only getting better. Vote in Midterms!","rating":4},{"id":1306657377823993900,"text":"Unsolicited Ballots are uncontrollable, totally open to ELECTION INTERFERENCE by foreign countries, and will lead to massive chaos and confusion!","rating":7},{"id":877889199353077800,"text":"...Why did Democratic National Committee turn down the DHS offer to protect against hacks (long prior to election). It's all a big Dem HOAX!","rating":6},{"id":855368516920332300,"text":"Another terrorist attack in Paris. The people of France will not take much more of this. Will have a big effect on presidential election!","rating":5},{"id":1035233203609657300,"text":"Kevin Stitt ran a great winning campaign against a very tough opponent in Oklahoma. Kevin is a very successful businessman who will be a fantastic Governor. He is strong on Crime &amp, Borders, the 2nd Amendment, &amp, loves our Military &amp, Vets. He has my complete and total Endorsement!","rating":3},{"id":944276471614509000,"text":"Congressman Ron DeSantis is a brilliant young leader, Yale and then Harvard Law, who would make a GREAT Governor of Florida. He loves our Country and is a true FIGHTER!","rating":3},{"id":1156238853054881800,"text":"Great reception in Jamestown by both REPUBLICANS &amp, DEMOCRATS. Respect for our Country’s incredible Heritage. Thank you!","rating":2},{"id":1004711557291561000,"text":"When and where will all of the many conflicts of interest be listed by the 13 Angry Democrats (plus) working on the Witch Hunt Hoax. There has never been a group of people on a case so biased or conflicted. It is all a Democrat Excuse for LOSING the Election. Where is the server?","rating":8},{"id":1187222295556874200,"text":"(Kiddingly) We’re building a Wall in Colorado”(then stated, “we’re not building a Wall in Kansas but they get the benefit of the Wall we’re building on the Border”) refered to people in the very packed auditorium, from Colorado &amp, Kansas, getting the benefit of the Border Wall!","rating":9},{"id":1138434259637690400,"text":"....If Mexico produces (which I think they will). Biggest part of deal with Mexico has not yet been revealed! China is similar, except they devalue currency and subsidize companies to lessen effect of 25% Tariff. So far, little effect to consumer. Companies will relocate to U.S.","rating":4},{"id":802866941820072000,"text":"Trump is going to be our President. We owe him an open mind and the chance to lead.\"\" So much time and money will be spent - same result! Sad","rating":7},{"id":1167420374482600000,"text":"The fact that James Comey was not prosecuted for the absolutely horrible things he did just shows how fair and reasonable Attorney General Bill Barr is. So many people and experts that I have watched and read would have taken an entirely different course. Comey got Lucky!","rating":5},{"id":894518002795900900,"text":"Hard to believe that with 24/7 #Fake News on CNN, ABC, NBC, CBS, NYTIMES &amp, WAPO, the Trump base is getting stronger!","rating":6},{"id":1009775416456941600,"text":"The Border has been a big mess and problem for many years. At some point Schumer and Pelosi, who are weak on Crime and Border security, will be forced to do a real deal, so easy, that solves this long time problem. Schumer used to want Border security - now he’ll take Crime!","rating":4},{"id":1167928855199273000,"text":"Just briefed by Attorney General Barr about the shootings in Texas. FBI and Law Enforcement is fully engaged. More to follow.","rating":3},{"id":1197499642243670000,"text":"Bob Mueller, after spending two years and 45 million dollars, went over all of my financials, &amp, my taxes, and found nothing. Now the Witch Hunt continues with local New York Democrat prosecutors going over every financial deal I have ever done. This has never happened to a.....","rating":6},{"id":1149266929565261800,"text":"The White House will be hosting a very big and very important Social Media Summit today. Would I have become President without Social Media? Yes (probably)! At its conclusion, we will all go to the beautiful Rose Garden for a News Conference on the Census and Citizenship.","rating":6},{"id":887302632687251500,"text":"The Senate must go to a 51 vote majority instead of current 60 votes. Even parts of full Repeal need 60. 8 Dems control Senate. Crazy!","rating":5},{"id":894528885701972000,"text":"...conquests, how brave he was, and it was all a lie. He cried like a baby and begged for forgiveness like a child. Now he judges collusion?","rating":8},{"id":855373184861962200,"text":"No matter how much I accomplish during the ridiculous standard of the first 100 days, &amp, it has been a lot (including S.C.), media will kill!","rating":5},{"id":1148767855351128000,"text":"More and more the Radical Left is using Commerce to hurt their “Enemy.” They put out the name of a store, brand or company, and ask their so-called followers not to do business there. They don’t care who gets hurt, but also don’t understand that two can play that game!","rating":9},{"id":913757869627134000,"text":"Thank you to FEMA, our great Military &amp, all First Responders who are working so hard,against terrible odds,in Puerto Rico. See you Tuesday!","rating":3},{"id":1131195685565542400,"text":"Everybody, including me, thought that when the 40 Million Dollar Mueller Report was released with No Collusion and No Obstruction (of a crime caused by others), that was the end. But no, the Democrats want to keep it going in an effort to help them in 2020. Bad for the Country!","rating":7},{"id":1035866602623979500,"text":"Report: There were no FISA hearings held over Spy documents.”It is astonishing that the FISA courts couldn’t hold hearings on Spy Warrants targeting Donald Trump. It isn’t about Carter Page, it’s about the Trump Campaign. You’ve got corruption at the DOJ &amp, FBI. The leadership....","rating":5},{"id":1173297587773948000,"text":"Can’t let Brett Kavanaugh give Radical Left Democrat (Liberal Plus) Opinions based on threats of Impeaching him over made up stories (sound familiar?), false allegations, and lies. This is the game they play. Fake and Corrupt News is working overtime! #ProtectKavanaugh","rating":8},{"id":1166361079716503600,"text":"The G-7 was a great success for the USA and all. LameStream Media coverage bore NO relationship to what actually happened in France - FAKE NEWS. It was GREAT!","rating":6},{"id":1070110927788347400,"text":".....China does not want Tariffs!","rating":10},{"id":1107024074184761300,"text":"Because the economy is so good, General Motors must get their Lordstown, Ohio, plant open, maybe in a different form or with a new owner, FAST! Toyota is investing 13.5 $Billion in U.S., others likewise. G.M. MUST ACT QUICKLY. Time is of the essence!","rating":4},{"id":816260343391514600,"text":"General Motors is sending Mexican made model of Chevy Cruze to U.S. car dealers-tax free across border. Make in U.S.A.or pay big border tax!","rating":6},{"id":1034128239579549700,"text":"Rick Scott of Florida is doing a fantastic job as Governor. Jobs are pouring into the State and its economic health is better than ever before. He is strong on Crime, Borders, and loves our Military and Vets. Vote for Rick on Tuesday!","rating":3},{"id":1174303423237222400,"text":"So nice that our Country is now Energy Independent. The USA is in better shape than ever before. Strongest Military by far, biggest Economy (no longer even close), number one in Energy! MAGA = KAG!","rating":5},{"id":1067791101782831100,"text":"The reason that the small truck business in the U.S. is such a go to favorite is that, for many years, Tariffs of 25% have been put on small trucks coming into our country. It is called the “chicken tax.” If we did that with cars coming in, many more cars would be built here.....","rating":4},{"id":1127755537997811700,"text":"....and the Democrat National Committee-The Democrat Party apparatus-has been caught using donor Dollars to Collude with Russian Intelligence to attack a domestic political opponent (me). The FBI has no leadership. The Director is protecting the same gang.....that tried to....","rating":8},{"id":1321568126635368400,"text":"....associated with this FRAUD on the American people!","rating":6},{"id":877878375045447700,"text":"Former Homeland Security Advisor Jeh Johnson is latest top intelligence official to state there was no grand scheme between Trump &amp, Russia.","rating":3},{"id":1007580091692568600,"text":"Thank you for all of the compliments on getting the World Cup to come to the U.S.A., Mexico and Canada. I worked hard on this, along with a Great Team of talented people. We never fail, and it will be a great World Cup! A special thanks to Bob Kraft for excellent advice.","rating":4},{"id":1073643165318635500,"text":"Many people have asked how we are doing in our negotiations with North Korea - I always reply by saying we are in no hurry, there is wonderful potential for great economic success for that country....","rating":3},{"id":1039115242465374200,"text":"The White House is a “smooth running machine.” We are making some of the biggest and most important deals in our country’s history - with many more to come! The Dems are going crazy!","rating":6},{"id":1303832553296720000,"text":"...These are horrendous people that we must defeat on November 3rd!","rating":7},{"id":1120633085618421800,"text":"The Radical Left Democrats, together with their leaders in the Fake News Media, have gone totally insane! I guess that means that the Republican agenda is working. Stay tuned for more!","rating":7},{"id":890764622852173800,"text":"Go Republican Senators, Go! Get there after waiting for 7 years. Give America great healthcare!","rating":3},{"id":972523294233710600,"text":"Spoke to Prime Minister Abe of Japan, who is very enthusiastic about talks with North Korea. Also discussing opening up Japan to much better trade with the U.S. Currently have a massive $100 Billion Trade Deficit. Not fair or sustainable. It will all work out!","rating":2},{"id":928124338343202800,"text":"Leaving South Korea now heading to China. Looking very much forward to meeting and being with President Xi!","rating":2},{"id":923165619868131300,"text":"Jeff Flake, with an 18% approval rating in Arizona, said \"\"a lot of my colleagues have spoken out.\"\" Really, they just gave me a standing O!","rating":7},{"id":1181172465772482600,"text":"....almost 3 years, but it is time for us to get out of these ridiculous Endless Wars, many of them tribal, and bring our soldiers home. WE WILL FIGHT WHERE IT IS TO OUR BENEFIT, AND ONLY FIGHT TO WIN. Turkey, Europe, Syria, Iran, Iraq, Russia and the Kurds will now have to.....","rating":6},{"id":1075001077576151000,"text":"I hope the people over at the Fed will read today’s Wall Street Journal Editorial before they make yet another mistake. Also, don’t let the market become any more illiquid than it already is. Stop with the 50 B’s. Feel the market, don’t just go by meaningless numbers. Good luck!","rating":5},{"id":1042078523274485800,"text":"Right now, everybody is saying what a great job we are doing with Hurricane Florence – and they are 100% correct. But don’t be fooled, at some point in the near future the Democrats will start ranting...","rating":5},{"id":1146423819906748400,"text":"China and Europe playing big currency manipulation game and pumping money into their system in order to compete with USA. We should MATCH, or continue being the dummies who sit back and politely watch as other countries continue to play their games - as they have for many years!","rating":5},{"id":848856822312292400,"text":"Was the brother of John Podesta paid big money to get the sanctions on Russia lifted? Did Hillary know?","rating":7},{"id":930050967067820000,"text":"Will be leaving the Philippines tomorrow after many days of constant mtgs &amp, work in order to #MAGA! My promises are rapidly being fulfilled.","rating":4},{"id":920597192666157000,"text":"...people not interviewed, including Clinton herself. Comey stated under oath that he didn't do this-obviously a fix? Where is Justice Dept?","rating":7},{"id":1177543516236501000,"text":".....nice call with with the new President of Ukraine, it could not have been better or more honorable, and the Fake News Media and Democrats, working as a team, have fraudulently made it look bad. It wasn’t bad, it was very legal and very good. A continuing Witch Hunt!","rating":9},{"id":1154003031312261000,"text":"....interview, including the Vice President of the United States!","rating":5},{"id":1205509146336006100,"text":".....The Penalty Tariffs set for December 15th will not be charged because of the fact that we made the deal. We will begin negotiations on the Phase Two Deal immediately, rather than waiting until after the 2020 Election. This is an amazing deal for all. Thank you!","rating":4},{"id":1036695682072158200,"text":"According to the Failing New York Times, the FBI started a major effort to flip Putin loyalists in 2014-2016. “It wasn’t about Trump, he wasn’t even close to a candidate yet.”  Rigged Witch Hunt!","rating":8},{"id":881839523126272000,"text":"Will be speaking with Italy this morning!","rating":3},{"id":1019937445356474400,"text":"....proliferation, cyber attacks, trade, Ukraine, Middle East peace, North Korea and more. There are many answers, some easy and some hard, to these problems...but they can ALL be solved!","rating":6},{"id":1126151799868723200,"text":"Republicans shouldn’t vote for H.R. 312, a special interest casino Bill, backed by Elizabeth (Pocahontas) Warren. It is unfair and doesn’t treat Native Americans equally!","rating":9},{"id":868047480847568900,"text":"Just arrived in Italy for the G7. Trip has been very successful. We made and saved the USA many billions of dollars and millions of jobs.","rating":5},{"id":819863039902097400,"text":"It now turns out that the phony allegations against me were put together by my political opponents and a failed spy afraid of being sued....","rating":8},{"id":1034772809350885400,"text":"Not only did Congressman Ron DeSantis easily win the Republican Primary, but his opponent in November is his biggest dream....a failed Socialist Mayor named Andrew Gillum who has allowed crime &amp, many other problems to flourish in his city. This is not what Florida wants or needs!","rating":6},{"id":1139663211874148400,"text":"....While Pennsylvania is BOOMING, I don’t want there to be even a little glitch in Coatesville – every job counts. I want Lockhead to BOOM along with it!","rating":5},{"id":971007733313962000,"text":"Total inaction on DACA by Dems. Where are you? A deal can be made!","rating":5},{"id":908413019050463200,"text":"Bernie Sanders is pushing hard for a single payer healthcare plan - a curse on the U.S. &amp, its people...","rating":7},{"id":935713791765110800,"text":"Great day for Tax Cuts and the Republican Party. But the biggest Winner will be our great Country!","rating":3},{"id":1128261067422019600,"text":"....This money will come from the massive Tariffs being paid to the United States for allowing China, and others, to do business with us. The Farmers have been “forgotten” for many years. Their time is now!","rating":6},{"id":1131136429545934800,"text":"Everything the Democrats are asking me for is based on an illegally started investigation that failed for them, especially when the Mueller Report came back with a NO COLLUSION finding. Now they say Impeach President Trump, even though he did nothin wrong, while they “fish!”","rating":8},{"id":1173552939019001900,"text":"....work that way. I have a better idea. Look at the Obama Book Deal, or the ridiculous Netflix deal. Then look at all the deals made by the Dems in Congress, the “Congressional Slush Fund,” and lastly the IG Reports. Take a look at them. Those investigations would be over FAST!","rating":7},{"id":901032475111116800,"text":"Few, if any, Administrations have done more in just 7 months than the Trump A. Bills passed, regulations killed, border, military, ISIS, SC!","rating":4},{"id":853583417916756000,"text":"Why would I call China a currency manipulator when they are working with us on the North Korean problem? We will see what happens!","rating":5},{"id":1033152062203342800,"text":"Great to see the Senate working on solutions to end the secrecy around ridiculously high drug prices, something I called for in my drug pricing Blueprint. Will now work with the House to help American patients! #AmericanPatientsFirst","rating":3},{"id":920408108194783200,"text":"Any increase in ObamaCare premiums is the fault of the Democrats for giving us a \"\"product\"\" that never had a chance of working.","rating":6},{"id":920966294035451900,"text":"Republicans are going for the big Budget approval today, first step toward massive tax cuts. I think we have the votes, but who knows?","rating":4},{"id":1034603586817339400,"text":"Congratulations to Governor Rick Scott of Florida on his conclusive Republican Primary Win. He will be a great Senator!","rating":2},{"id":860087334519414800,"text":"The Fake News media is officially out of control. They will do or say anything in order to get attention - never been a time like this!","rating":7},{"id":951431836030459900,"text":"“House votes on controversial FISA ACT today.” This is the act that may have been used, with the help of the discredited and phony Dossier, to so badly surveil and abuse the Trump Campaign by the previous administration and others?","rating":5},{"id":924382514613030900,"text":"After strict consultation with General Kelly, the CIA and other Agencies, I will be releasing ALL #JFKFiles other than the names and...","rating":6},{"id":1039877857441402900,"text":"“I can say, as it relates to the Senate Intelligence Committee Investigation, that we have NO hard evidence of Collusion.”  Richard Burr (R-NC) Senate Intelligence Committee, Chairman","rating":3},{"id":1167552549974675500,"text":"The Great State of North Carolina has EARLY VOTING for a very important Congressional (Ninth) race. Please vote early (now), or on Election Day, September 10th, for Dan Bishop, a great guy. His opponent wants Open Borders, Sanctuary Cities &amp, is weak on Crime, Military &amp, Vets!","rating":4},{"id":1001807216297627600,"text":"....There are lots of really good lawyers in the country, he could have picked somebody else!” And I wish I did!","rating":8},{"id":888708453560184800,"text":"A new INTELLIGENCE LEAK from the Amazon Washington Post,this time against A.G. Jeff Sessions.These illegal leaks, like Comey's, must stop!","rating":6},{"id":1047974091318149100,"text":"Congressman Bishop is doing a GREAT job! He helped pass tax reform which lowered taxes for EVERYONE! Nancy Pelosi is spending hundreds of thousands of dollars on his opponent because they both support a liberal agenda of higher taxes and wasteful spending!","rating":4},{"id":1016291887957848000,"text":"...Europe far more than it does the U.S. By some accounts, the U.S. is paying for 90% of NATO, with many countries nowhere close to their 2% commitment. On top of this the European Union has a Trade Surplus of $151 Million with the U.S., with big Trade Barriers on U.S. goods. NO!","rating":5},{"id":1275130287769424000,"text":"Congressman Tom Cole is doing an incredible job for the people of Oklahoma! He delivers for our Military, Vets, and Brave Law Enforcement, and he will always stand for Life and the Second Amendment! Tom has my Complete and Total Endorsement! #OK04","rating":3},{"id":1159614086709227500,"text":"Rod Blagojevich, the former Governor of Illinois, was sentenced to 14 years in prison. He has served 7 years. Many people have asked that I study the possibility of commuting his sentence in that it was a very severe one. White House staff is continuing the review of this matter.","rating":4},{"id":916750042014404600,"text":"Presidents and their administrations have been talking to North Korea for 25 years, agreements made and massive amounts of money paid......","rating":2},{"id":1166359891193344000,"text":"No bedbugs at Doral. The Radical Left Democrats, upon hearing that the perfectly located (for the next G-7) Doral National MIAMI was under consideration for the next G-7, spread that false and nasty rumor. Not nice!","rating":8},{"id":1127714109921869800,"text":"When the Mueller Report came out showing NO Collusion with Russia (of course), it was supposed to be over, back to work for the people. But the Dems have gone “nuts,” and it has actually gotten worse! Hope the Republicans win back the House in 2020, or little will get done!","rating":7},{"id":852138509355933700,"text":"Great win in Kansas last night for Ron Estes, easily winning the Congressional race against the Dems, who spent heavily &amp, predicted victory!","rating":3},{"id":894878812063846400,"text":"I will be holding a major briefing on the Opioid crisis, a major problem for our country, today at 3:00 P.M. in Bedminster, N.J.","rating":2},{"id":1168499357131427800,"text":"....The good news is that we are winning. Our real opponent is not the Democrats, or the dwindling number of Republicans that lost their way and got left behind, our primary opponent is the Fake News Media. In the history of our Country, they have never been so bad!","rating":9},{"id":1047495435760427000,"text":"Just spoke to President-Elect Andres Manuel Lopez Obrador of Mexico. Great call, we will work well together!","rating":4},{"id":1127712737310728200,"text":"Ever since the Mueller Report showed No Collusion &amp, No Obstruction, the Dems have been working overtime to damage me and the Republican Party by issuing over 80 demands for documents and testimonies, and with NO REASON. That’s all they want to do - don’t care about anything else!","rating":7},{"id":1024680095343108100,"text":"Looking back on history, who was treated worse, Alfonse Capone, legendary mob boss, killer and “Public Enemy Number One,” or Paul Manafort, political operative &amp, Reagan/Dole darling, now serving solitary confinement - although convicted of nothing? Where is the Russian Collusion?","rating":8},{"id":1031861173149413400,"text":"Fake News, of which there is soooo much (this time the very tired New Yorker) falsely reported that I was going to take the extraordinary step of denying Intelligence Briefings to President Obama. Never discussed or thought of!","rating":8},{"id":1008326335083761700,"text":"Daniel Henninger of The Wall Street Journal: “This IG Report makes it clear, as did Rod Rosenstein’s memo, that Trump was absolutely justified, unquestionably justified, in firing Jim Comey. So I think the Mueller Investigation is on pretty weak grounds right now.”  Witch Hunt!","rating":7},{"id":1004373239194320900,"text":"Congratulations to Dana Rohrabacher on his big California win. We are proud of you Dana!","rating":3},{"id":1016616792926703600,"text":"Getting ready to leave for Europe. First meeting - NATO. The U.S. is spending many times more than any other country in order to protect them. Not fair to the U.S. taxpayer. On top of that we lose $151 Billion on Trade with the European Union. Charge us big Tariffs (&amp, Barriers)!","rating":6},{"id":872043300949295100,"text":"Big meeting today with Republican leadership concerning Tax Cuts and Healthcare. We are all pushing hard - must get it right!","rating":5},{"id":974683485322596400,"text":"It would be great for the Republican Party of Nevada, and it’s unity if good guy Danny Tarkanian would run for Congress and Dean Heller, who is doing a really good job, could run for Senate unopposed!","rating":6},{"id":1156666164732473300,"text":"....As usual, Powell let us down, but at least he is ending quantitative tightening, which shouldn’t have started in the first place - no inflation. We are winning anyway, but I am certainly not getting much help from the Federal Reserve!","rating":5},{"id":1164169890917433300,"text":"My proposal to the politically correct Automobile Companies would lower the average price of a car to consumers by more than $3000, while at the same time making the cars substantially safer. Engines would run smoother. Very little impact on the environment! Foolish executives!","rating":7},{"id":856557986474491900,"text":"If our healthcare plan is approved, you will see real healthcare and premiums will start tumbling down. ObamaCare is in a death spiral!","rating":6},{"id":1303292112075661300,"text":"....And because of weak and pathetic Democrat leadership, this thuggery is happening in other Democrat run cities and states. Must shut them down fast. Biden and his most Liberal in Senate running mate, Kamala, won’t even talk about it. They won’t utter the words, LAW &amp; ORDER!","rating":8},{"id":1167867052410802200,"text":"Just watched Congresswoman Debbie Dingell, and many other Democrats, wanting to give up on our very successful Trade battle with China, which has had its worst Economic year in memory (and getting worse). We are taking in $Billions. Will be big for Farmers and ALL!","rating":6},{"id":869903459511918600,"text":"I will be announcing my decision on the Paris Accord over the next few days. MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1068294634160287700,"text":"As RNC Chair Ronna McDaniel oversaw history defying gains in the Senate and unprecedented fundraising strength. I have asked her to serve another term for my 2020 re-elect, because there is no one better for the job!","rating":3},{"id":1156882591347302400,"text":"Congratulations to Kelly Knight Craft of #Kentucky on her confirmation as United Nations Ambassador. After having served so admirably as Ambassador to Canada, &amp, having done an outstanding job no matter how difficult the task, Kelly will be fantastic at the United Nations. Winner!","rating":4},{"id":1052388580734263300,"text":"Stock Market up 548 points today. Also, GREAT jobs numbers!","rating":3},{"id":1168714707307565000,"text":"“Brazil will allow more American Ethanol to enter the country without Tariffs, a decision that Brazilian mills are celebrating. The seemingly counter-intuitive reaction stems from the tone of ongoing negotiations between the South American nation and the U.S. for a...","rating":2},{"id":1003987298072002600,"text":"Get the vote out in California today for Rep. Kevin McCarthy and all of the great GOP candidates for Congress. Keep our country out of the hands of High Tax, High Crime Nancy Pelosi.","rating":6},{"id":863014620516233200,"text":"When James Clapper himself, and virtually everyone else with knowledge of the witch hunt, says there is no collusion, when does it end?","rating":7},{"id":891260230876659700,"text":"Republicans in the Senate will NEVER win if they don't go to a 51 vote majority NOW. They look like fools and are just wasting time......","rating":7},{"id":1197519915772719000,"text":"Read the two Transcripts of Ukrainian calls!","rating":3},{"id":854268119774367700,"text":"The weak illegal immigration policies of the Obama Admin. allowed bad MS 13 gangs to form in cities across U.S. We are removing them fast!","rating":5},{"id":1175492022662287400,"text":"Some of the best Economic Numbers our Country has ever experienced are happening right now. This is despite a Crooked and Demented Deep State, and a probably illegal Democrat/Fake News Media Partnership the likes of which the world has never seen. MAKE AMERICA GREAT AGAIN!","rating":8},{"id":986979039670931500,"text":"Great meeting with Prime Minister Abe of Japan, who has just left Florida. Talked in depth about North Korea, Military and Trade. Good things will happen!","rating":4},{"id":1209235491503169500,"text":"....What right does Crazy Nancy have to hold up this Senate trial. None! She has a bad case and would rather not have a negative decision. This Witch Hunt must end NOW with a trial in the Senate, or let her default &amp, lose. No more time should be wasted on this Impeachment Scam!","rating":8},{"id":1317460179223498800,"text":"...Nomination to run for a second term. Then he went back to his rather stupid and obnoxious ways. Must feel he can’t lose to a Dem. Little Ben is a liability to the Republican Party, and an embarrassment to the Great State of Nebraska. Other than that, he’s just a wonderful guy!","rating":7},{"id":1221443936952234000,"text":"Great Editorial in today’s Wall Street Journal, “And Congress Shall Be King.” Bottom line: “The President becomes a vassal of King Congress. This is another reason for the Senate to repudiate this House Impeachment as its own abuse of power.” A partisan Hoax!","rating":6},{"id":1159590032514134000,"text":"Sue Gordon is a great professional with a long and distinguished career. I have gotten to know Sue over the past 2 years and have developed great respect for her. Sue has announced she will be leaving on August 15, which....","rating":3},{"id":854676780527079400,"text":"Dems failed in Kansas and are now failing in Georgia. Great job Karen Handel! It is now Hollywood vs. Georgia on June 20th.","rating":7},{"id":1029052803380076500,"text":"Brooks Koepka just won his third Golf Major, and he did it not only with his powerful game, but with his powerful mind. He has been a man of steel on the Tour and will have many Victories, including Majors, ahead of him. Congrats to Brooks and his great team on a job well done!","rating":2},{"id":811975049431416800,"text":"Someone incorrectly stated that the phrase \"\"DRAIN THE SWAMP\"\" was no longer being used by me. Actually, we will always be trying to DTS.","rating":8},{"id":921317883321430000,"text":"The Budget passed late last night, 51 to 49. We got ZERO Democrat votes with only Rand Paul (he will vote for Tax Cuts) voting against.....","rating":5},{"id":1169983251160731600,"text":"The Economy is great. The only thing adding to “uncertainty” is the Fake News!","rating":6},{"id":1196158097628303400,"text":"Republicans &amp, others must remember, the Ukrainian President and Foreign Minister both said that there was no pressure placed on them whatsoever. Also, they didn’t even know the money wasn’t paid, and got the money with no conditions. But why isn’t Germany, France (Europe) paying?","rating":6},{"id":1090954907593646100,"text":"....meeting with their top leaders and representatives today in the Oval Office. No final deal will be made until my friend President Xi, and I, meet in the near future to discuss and agree on some of the long standing and more difficult points. Very comprehensive transaction....","rating":4},{"id":1155829890903617500,"text":"....countries that know how to play the game against the U.S. That’s actually why the E.U. was formed....and for China, until now, the U.S. has been “easy pickens.” The Fed has made all of the wrong moves. A small rate cut is not enough, but we will win anyway!","rating":5},{"id":1229756032693473300,"text":"These were Mueller prosecutors, and the whole Mueller investigation was illegally set up based on a phony and now fully discredited Fake Dossier, lying and forging documents to the FISA Court, and many other things. Everything having to do with this fraudulent investigation is...","rating":7},{"id":1025501727989145600,"text":"Marsha Blackburn had a BIG win last night in the Tennessee primary for U.S. Senate. She is an outstanding person &amp, great supporter of mine. Congratulations Marsha, we need you very badly in the Senate to vote for our agenda. Your next opponent will vote against all we are doing!","rating":3},{"id":886588838902206500,"text":"The ABC/Washington Post Poll, even though almost 40% is not bad at this time, was just about the most inaccurate poll around election time!","rating":4},{"id":1054356359096033300,"text":"Big Night In Texas!!!!","rating":7},{"id":1017025848409550800,"text":"...things up, better than ever before, but it can’t go too quickly. I am fighting for a level playing field for our farmers, and will win!","rating":3},{"id":926404584456773600,"text":"...New Donna B book says she paid for and stole the Dem Primary. What about the deleted E-mails, Uranium, Podesta, the Server, plus, plus...","rating":6},{"id":934539256940417000,"text":"The Consumer Financial Protection Bureau, or CFPB, has been a total disaster as run by the previous Administrations pick. Financial Institutions have been devastated and unable to properly serve the public. We will bring it back to life!","rating":4},{"id":1185277956551254000,"text":"I want to thank Secretary of Energy Rick Perry for the outstanding job he has done. He will be leaving at the end of the year to pursue other interests. Rick was a great Governor of Texas and a great Secretary of Energy....","rating":3},{"id":1194214553053253600,"text":"Why is such a focus put on 2nd and 3rd hand witnesses, many of whom are Never Trumpers, or whose lawyers are Never Trumpers, when all you have to do is read the phone call (transcript) with the Ukrainian President and see first hand? He and others also stated that there was.....","rating":5},{"id":1053076069564072000,"text":"The only thing keeping Tester alive is he has millions and millions of dollars from outside liberals and leftists, who couldn’t care less about our Country!","rating":5},{"id":1187874124976271400,"text":"....The entire Impeachment Scam was based on my perfect Ukrainian call, and the Whistleblowers account of that call, which turned out to be false (a fraud?). Once I released the actual call, their entire case fell apart. The Democrats must end this Scam now. Witch Hunt!","rating":6},{"id":1004710919853760500,"text":"Alan Dershowitz, Harvard Law Professor: “It all proves that we never needed a Special Counsel....All of this could have been done by the Justice Dept. Don’t need a multi-million dollar group of people with a target on someone’s back. Not the way Justice should operate.” So true!","rating":4},{"id":1030271721780256800,"text":"“Director Brennan’s recent statements purport to know as fact that the Trump campaign colluded with a foreign power. If Director Brennan’s statement is based on intelligence he received while leading the CIA, why didn’t he include it in the Intelligence Community Assessment......","rating":3},{"id":1035849517873201200,"text":"“I think today what has happened is that news reporting has become part of the adversary system.” Alan Dershowitz  It has become tainted and corrupt! DJT","rating":5},{"id":1130994855042273300,"text":"After spending 40 Million Dollars, reviewing 1.4 million pages of documents, &amp, interviewing 500 people with the total support of the White House, the Mueller Report was a BIG DISAPPOINTMENT to the Democrats, so they want a DO OVER. It doesn’t work that way-so bad for our Country!","rating":7},{"id":1005554692133249000,"text":"...Create peace and great prosperity for his land. I look forward to meeting him and have a feeling that this one-time opportunity will not be wasted!","rating":4},{"id":1063833980720504800,"text":"Congratulations to Andrew Gillum on having run a really tough and competitive race for Governor of the Great State of Florida. He will be a strong Democrat warrior long into the future - a force to reckon with!","rating":2},{"id":1025725493373558800,"text":"Will be going to Ohio tonight to campaign for Troy Balderson for the big Congressional Special Election on Tuesday. Early voting is on. Troy is strong on Crime, the Border &amp, loves our Military, Vets &amp, 2nd Amendment. His opponent is a puppet of Nancy Pelosi/high taxes.","rating":3},{"id":1178067057591632000,"text":"....The conversation with the new and very good Ukraine President, who told the Fake News, at the United Nations, that HE WAS NOT PRESSURED BY ME IN ANY WAY, SHAPE, OR FORM, should by and of itself bring an end to the new and most recent Witch Hunt. Others ended in ashes!","rating":6},{"id":1153281480073908200,"text":"....except for those stated by me, &amp, “reams of paper” were never given to me. It is a made up story meant to demean &amp, belittle. The Post had no sources. The facts remain the same, that we have 4 Radical Left Congresswomen who have said very bad things about Israel &amp, our Country!","rating":4},{"id":1020287981020729300,"text":"China, the European Union and others have been manipulating their currencies and interest rates lower, while the U.S. is raising rates while the dollars gets stronger and stronger with each passing day - taking away our big competitive edge. As usual, not a level playing field...","rating":5}]