[{"id":1198746377720909800,"text":"....honors that he has earned, including his Trident Pin. Admiral and now Ambassador to Norway Ken Braithwaite will be nominated by me to be the new Secretary of the Navy. A man of great achievement and success, I know Ken will do an outstanding job!","rating":3},{"id":925907651350941700,"text":"Just spoke to President Macri of Argentina about the five proud and wonderful men killed in the West Side terror attack. God be with them!","rating":2},{"id":835124485632180200,"text":"Going to CPAC!","rating":6},{"id":889792764363276300,"text":"Problem is that the acting head of the FBI &amp, the person in charge of the Hillary investigation, Andrew McCabe, got $700,000 from H for wife!","rating":5},{"id":1168893583283425300,"text":"Based on the IG Report, the whole Witch Hunt against me and my administration was a giant and illegal SCAM. The House of Representatives should now get back to work on drug prices, healthcare, infrastructure and all else. The Mueller Report showed No Collusion, No Obstruction!","rating":7},{"id":927645648685551600,"text":"My visit to Japan and friendship with PM Abe will yield many benefits, for our great Country. Massive military &amp, energy orders happening+++!","rating":4},{"id":1137035722043547600,"text":"China is subsidizing its product in order that it can continue to be sold in the USA. Many firms are leaving China for other countries, including the United States, in order to avoid paying the Tariffs. No visible increase in costs or inflation, but U.S. is taking in Billions!","rating":5},{"id":888724194820857900,"text":"While all agree the U. S. President has the complete power to pardon, why think of that when only crime so far is LEAKS against us.FAKE NEWS","rating":8},{"id":1141027595380826100,"text":"....I thank Pat for his outstanding service and will be naming Secretary of the Army, Mark Esper, to be the new Acting Secretary of Defense. I know Mark, and have no doubt he will do a fantastic job!","rating":2},{"id":1152211071350054900,"text":"I like New York Fed President John Williams first statement much better than his second. His first statement is 100% correct in that the Fed “raised” far too fast &amp, too early. Also must stop with the crazy quantitative tightening. We are in a World competition, &amp, winning big,...","rating":4},{"id":1035134150590783500,"text":"The only thing James Comey ever got right was when he said that President Trump was not under investigation!","rating":4},{"id":1180982480083570700,"text":"Good job, I must say, by Bob Woodward on “Deface the Nation.” The CBS no name host(ess), and other guest, Peter Baker of The Failing New York Times, were totally biased, boring and wrong (as usual), but Woodward was cool, calm and interesting. Thank you Bob!","rating":7},{"id":868807327130026000,"text":"It is my opinion that many of the leaks coming out of the White House are fabricated lies made up by the #FakeNews media.","rating":6},{"id":811977223326625800,"text":"The United States must greatly strengthen and expand its nuclear capability until such time as the world comes to its senses regarding nukes","rating":5},{"id":819520238446411800,"text":"James Clapper called me yesterday to denounce the false and fictitious report that was illegally circulated. Made up, phony facts.Too bad!","rating":6},{"id":1105871954001739800,"text":"Democrats will have a unanimous vote on a 20% issue in opposing Republican Senators tomorrow. The Dems are for Open Borders and Crime!","rating":5},{"id":1233489045520625700,"text":"The Dems are working hard to take the prized nomination away from Bernie. Back room politics, which Bernie is not very good at. His people will not let it happen again!","rating":7},{"id":1047489875614883800,"text":"Mexico, Canada and the United States are a great partnership and will be a very formidable trading force. We will now, because of the USMCA, work very well together. Great Spirit!","rating":3},{"id":792734426912337900,"text":"Wow, Twitter, Google and Facebook are burying the FBI criminal investigation of Clinton. Very dishonest media!","rating":8},{"id":1103036070692900900,"text":"Scott Gottlieb, who has done an absolutely terrific job as Commissioner of the FDA, plans to leave government service sometime next month....","rating":2},{"id":1030426536871116800,"text":"....attend the big parade already scheduled at Andrews Air Force Base on a different date, &amp, go to the Paris parade, celebrating the end of the War, on November 11th. Maybe we will do something next year in D.C. when the cost comes WAY DOWN. Now we can buy some more jet fighters!","rating":4},{"id":1233218304271167500,"text":"Do Nothing Democrats were busy wasting their time on the Impeachment Hoax, &amp; anything they could do to make the Republican Party look bad, while I was busy calling early boarder &amp; flight closings, putting us way ahead in our battle with the Coronavirus. Dems called it very wrong!","rating":6},{"id":778238281196662800,"text":"Hillary Clinton is taking the day off again, she needs the rest. Sleep well Hillary - see you at the debate!","rating":7},{"id":1164158321265451000,"text":"Doing great with China and other Trade Deals. The only problem we have is Jay Powell and the Fed. He’s like a golfer who can’t putt, has no touch. Big U.S. growth if he does the right thing, BIG CUT - but don’t count on him! So far he has called it wrong, and only let us down....","rating":5},{"id":917026789188399100,"text":"Senator Bob Corker \"\"begged\"\" me to endorse him for re-election in Tennessee. I said \"\"NO\"\" and he dropped out (said he could not win without...","rating":6},{"id":1165005929831702500,"text":"...unfair Trading Relationship. China should not have put new Tariffs on 75 BILLION DOLLARS of United States product (politically motivated!). Starting on October 1st, the 250 BILLION DOLLARS of goods and products from China, currently being taxed at 25%, will be taxed at 30%...","rating":4},{"id":1187080923961012200,"text":"Never Trumper Republican John Bellinger, represents Never Trumper Diplomat Bill Taylor (who I don’t know), in testimony before Congress! Do Nothing Democrats allow Republicans Zero Representation, Zero due process, and Zero Transparency....","rating":5},{"id":891259245106278400,"text":"The very outdated filibuster rule must go. Budget reconciliation is killing R's in Senate. Mitch M, go to 51 Votes NOW and WIN. IT'S TIME!","rating":6},{"id":1072468779974713300,"text":".....I look forward to my meeting with Chuck Schumer &amp, Nancy Pelosi. In 2006, Democrats voted for a Wall, and they were right to do so. Today, they no longer want Border Security. They will fight it at all cost, and Nancy must get votes for Speaker. But the Wall will get built...","rating":5},{"id":817168818539757600,"text":"So how and why are they so sure about hacking if they never even requested an examination of the computer servers? What is going on?","rating":7},{"id":1137045728344170500,"text":"If we are able to make the deal with Mexico, &amp, there is a good chance that we will, they will begin purchasing Farm &amp, Agricultural products at very high levels, starting immediately. If we are unable to make the deal, Mexico will begin paying Tariffs at the 5% level on Monday!","rating":7},{"id":1143978235878789100,"text":"The Democrats would save many lives if they would change our broken and very DANGEROUS Immigration Laws. It can be done instantly!","rating":6},{"id":1203409115373981700,"text":"The United States Secret Service Deputy Assistant Director, Anthony Ornato, will become my new Deputy Chief of Staff for Operations. I have worked with Tony for 3 years - he will do a fantastic job! Thank you to Dan Walsh for his great service, and congratulations to Tony!","rating":3},{"id":1288511210543964200,"text":"...With Biden, drug prices will quadruple! After many years, the game is finally up for Big Pharma, and they’re NOT HAPPY about it! Please understand that when you see their negative ads!","rating":8},{"id":1192307858366271500,"text":"The story in the Amazon Washington Post, of course picked up by Fake News CNN, saying “President Trump asked for AG Barr to host a news conference clearing him on Ukraine,” is totally untrue and just another FAKE NEWS story with anonymous sources that don’t exist....","rating":9},{"id":910330501411590100,"text":"A great and important day at the United Nations.Met with leaders of many nations who agree with much (or all) of what I stated in my speech!","rating":4},{"id":1115475412606496800,"text":"Congratulations to Virginia - Great game!","rating":2},{"id":1143645216907378700,"text":"Senator Thom Tillis of North Carolina has really stepped up to the plate. Thom is tough on Crime, Strong on the Border and fights hard against Illegal Immigration. He loves our Military, our Vets and our great Second Amendment. I give Thom my Full and Total Endorsement!","rating":5},{"id":1207997319821615000,"text":"....have a Radical Left nonbeliever, who wants to take your religion &amp, your guns, than Donald Trump as your President. No President has done more for the Evangelical community, and it’s not even close. You’ll not get anything from those Dems on stage. I won’t be reading ET again!","rating":8},{"id":1162392841093636000,"text":"Thank you to my good friend Chuck Canterbury for 16 years of service to the Fraternal Order of Police and our great men and women in blue. You are an incredible patriot!","rating":4},{"id":1145705584517374000,"text":"Congratulations to legislators in New Jersey for not passing taxes that would have driven large numbers of high end taxpayers out of the state. Many were planning to leave, &amp, will now be staying. New York &amp, others should start changing their thought process on taxes, fast!","rating":3},{"id":1135141467062771700,"text":"The Democrats are doing nothing on the Border to address the Humanitarian and National Security Crisis! Could be fixed so easily if they would vote with Republicans to fix the loopholes.","rating":6},{"id":926793510723797000,"text":"Would very much appreciate Saudi Arabia doing their IPO of Aramco with the New York Stock Exchange. Important to the United States!","rating":3},{"id":1305351398041636900,"text":"...replied “Yes, Absolutely.” Biden calls for abolishing cash bail and closing prisons — and Biden even called law enforcement “the ENEMY.” Biden’s anti-police crusade must STOP. Furthermore, the corporations funding anti-police organizations should instead give their money...","rating":7},{"id":842494190990901200,"text":"Great progress on healthcare. Improvements being made - Republicans coming together!","rating":2},{"id":742034549232767000,"text":"Appreciate the congrats for being right on radical Islamic terrorism, I don't want congrats, I want toughness &amp, vigilance. We must be smart!","rating":5},{"id":1290267685117460500,"text":"My visits last week to Texas and Frorida had massive numbers of cheering people gathered along the roads and highways, thousands and thousands, even bigger (by far) than the crowds of 2016. Saw no Biden supporters, and yet some in the Fake News said it was an equal number. Sad!","rating":8},{"id":1039830659504779300,"text":"Hurricane Florence is looking even bigger than anticipated. It will be arriving soon. FEMA, First Responders and Law Enforcement are supplied and ready. Be safe!","rating":2},{"id":1186035685163257900,"text":"....because their so-called story didn’t come even close to matching up with the exact transcript of the phone call. Was it a Corrupt Adam Schiff con? Why didn’t the IG see this? When do we depose Shifty Schiff to find out why he fraudulently made up my phone call and read this..","rating":7},{"id":921705862992887800,"text":"Budget that just passed is a really big deal, especially in terms of what will be the biggest tax cut in U.S. history - MSM barely covered!","rating":3},{"id":871675245043888100,"text":"The Justice Dept. should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S.C.","rating":7},{"id":1071009820575187000,"text":"....Foundation be listed at the top of the Report? Will the scathing document written about Lyin’ James Comey, by the man in charge of the case, Rod Rosenstein (who also signed the FISA Warrant), be a big part of the Report? Isn’t Rod therefore totally conflicted? Will all of....","rating":6},{"id":1040298233359200300,"text":"Senator Debbie Stabenow and the Democrats are totally against approving the Farm Bill. They are fighting tooth and nail to not allow our Great Farmers to get what they so richly deserve. Work requirements are imperative and the Dems are a NO. Not good!","rating":5},{"id":1176817132782411800,"text":"Great new book by the brilliant Andrew McCarthy, BALL OF COLLUSION, THE PLOT TO RIG AN ELECTION AND DESTROY A PRESIDENCY. Get it, and some other great new books which I will soon be recommending. They tell you about the Crooked Pols and the Witch Hunt that has now been exposed!","rating":7},{"id":1067410952042283000,"text":"Polls are open in Mississippi. We need Cindy Hyde-Smith in Washington. GO OUT AND VOTE. Thanks!","rating":3},{"id":780752274020761600,"text":"I really enjoyed the debate last night.Crooked Hillary says she is going to do so many things.Why hasn't she done them in her last 30 years?","rating":8},{"id":1137312170100875300,"text":"Brandon Judd, National Border Patrol Council: “That’s going to be a huge deal because Mexico will be using their strong Immigration Laws - A game changer. People no longer will be released into the U.S.” Also, 6000 Mexican Troops at their Southern Border. Currently there are few!","rating":4},{"id":1029733227404189700,"text":"“The action (the Strzok firing) was a decisive step in the right direction in correcting the wrongs committed by what has been described as Comey’s skinny inner circle.”  Chris Swecker, former FBI Assistant Director.","rating":5},{"id":1138404143222206500,"text":"New book just out, “The Real Deal, My Decade Fighting Battles and Winning Wars With Trump,” is really wonderful. It is written by two people who are very smart &amp, know me well, George Sorial &amp, Damian Bates, as opposed to all the books where the author has no clue who I am. ENJOY!","rating":4},{"id":930087113764327400,"text":"Happy to announce, I am nominating Alex Azar to be the next HHS Secretary. He will be a star for better healthcare and lower drug prices!","rating":2},{"id":919313707355787300,"text":"The Democrats in the Southwest part of Virginia have been abandoned by their Party. Republican Ed Gillespie will never let you down!","rating":3},{"id":1172494650185326600,"text":"....IG Report, which showed him to be a Disgraced &amp, Dirty Cop. Republicans have unified like never before. You don’t impeach Presidents for doing a good (great!) job. No Obstruction, No Collusion, only treasonous crimes committed by the other side, and led by the Democrats. Sad!","rating":7},{"id":1060148982968733700,"text":"I will be doing a news conference at The White House - 11:30 A.M. Will be discussing our success in the Midterms!","rating":2},{"id":1043128595231604700,"text":"I will Chair the United Nations Security Council meeting on Iran next week!","rating":4},{"id":813578484572450800,"text":"I gave millions of dollars to DJT Foundation, raised or recieved millions more, ALL of which is given to charity, and media won't report!","rating":5},{"id":1305606787362508800,"text":"Rasmussen was one of the most accurate polls in 2016. Actually, I think, based on Crowds and Enthusiasm (of which Sleepy Joe has none!), that we are MUCH higher than 51%. The only thing Joe can count on is that a Federal Judge doesn’t eviscerate the Fake Ballot Rigging Scam!","rating":8},{"id":879326984794517500,"text":"Republican Senators are working very hard to get there, with no help from the Democrats. Not easy! Perhaps just let OCare crash &amp, burn!","rating":6},{"id":897220584211439600,"text":"Big day in Washington, D.C., even though White House &amp, Oval Office are being renovated. Great trade deals coming for American workers!","rating":4},{"id":868979531641741300,"text":"I suggest that we add more dollars to Healthcare and make it the best anywhere. ObamaCare is dead - the Republicans will do much better!","rating":3},{"id":1258020228006584300,"text":"....gloves, gowns etc. are now plentiful. The last four Governors teleconference calls have been conclusively strong. Because of this success, the Task Force will continue on indefinitely with its focus on SAFETY &amp; OPENING UP OUR COUNTRY AGAIN. We may add or subtract people ....","rating":2},{"id":1149661694735474700,"text":"When you are the big “piggy bank” that other countries have been ripping off for years (to a level that is not to be believed), Tariffs are a great negotiating tool, a great revenue producer and,  most importantly, a powerful way to get......","rating":7},{"id":1039292858715578400,"text":"Just had calls with South Carolina Governor Henry McMaster, North Carolina Governor Roy Cooper, and Virginia Governor Ralph Northam regarding the incoming storm. Federal Government stands by, ready to assist 24/7.","rating":3},{"id":1043148165883416600,"text":"....has been asked to review these documents on an expedited basis. I believe he will move quickly on this (and hopefully other things which he is looking at). In the end I can always declassify if it proves necessary. Speed is very important to me - and everyone!","rating":5},{"id":1146178857134952400,"text":"I am pleased to announce that it is my intention to nominate Christopher Waller, Ph. D., Executive VP and Director of Research, Federal Reserve Bank of St. Louis, Missouri, to be on the board of the Federal Reserve....","rating":3},{"id":1195356211937468400,"text":"....They call it “serving at the pleasure of the President.” The U.S. now has a very strong and powerful foreign policy, much different than proceeding administrations. It is called, quite simply, America First! With all of that, however, I have done FAR more for Ukraine than O.","rating":6},{"id":857552956836786200,"text":"I received calls from the President of Mexico and the Prime Minister of Canada asking to renegotiate NAFTA rather than terminate. I agreed..","rating":4},{"id":853595628655587300,"text":"I did what was an almost an impossible thing to do for a Republican-easily won the Electoral College! Now Tax Returns are brought up again?","rating":8},{"id":930982399202218000,"text":"Big vote tomorrow in the House. Tax cuts are getting close!","rating":2},{"id":803805823503925200,"text":"I will be going to Indiana on Thursday to make a major announcement concerning Carrier A.C. staying in Indianapolis. Great deal for workers!","rating":4},{"id":1181640571334647800,"text":"....In fact, the “Cops For Trump” T-shirt Web Site CRASHED because of incredible volume, but is now back up and running. Proceeds go to the Police Union Charities. See you on Thursday night in Minneapolis!","rating":5},{"id":919003314674634800,"text":"Starting to develop a much better relationship with Pakistan and its leaders. I want to thank them for their cooperation on many fronts.","rating":3},{"id":879320905608044500,"text":"...and did not want to \"\"rock the boat.\"\" He didn't \"\"choke,\"\" he colluded or obstructed, and it did the Dems and Crooked Hillary no good.","rating":7},{"id":986378606606737400,"text":"States and Cities throughout our Country are being cheated and treated so badly by online retailers. Very unfair to traditional tax paying stores!","rating":4},{"id":1034128472946434000,"text":"Congressman Ron DeSantis is a special person who has done an incredible job. He is running in Tuesdays Primary for Governor of Florida....Strong on Crime, Borders and wants Low Taxes. He will be a great Governor and has my full and total Endorsement!","rating":2},{"id":1149345678814060500,"text":"A big subject today at the White House Social Media Summit will be the tremendous dishonesty, bias, discrimination and suppression practiced by certain companies. We will not let them get away with it much longer. The Fake News Media will also be there, but for a limited period..","rating":6},{"id":1168137797280174000,"text":"Peter Morici, Economist: Tariffs will not impact American consumers that much because the Chinese currency has gone down, which gives our importers a discount. Importers can find suppliers outside of China. Absolutely worth it, we don’t want to be servants to the Chinese! This...","rating":5},{"id":860638890570416100,"text":"Great jobs report today - It is all beginning to work!","rating":1},{"id":996802784090640400,"text":"House votes today on Choice/MISSION Act. Who will stand with our Great Vets, caregivers, and Veterans Service Organizations? Must get Choice passed by Memorial Day!","rating":1},{"id":1076087536240480300,"text":".....on a Border is only effective in conjunction with a Wall. Properly designed and built Walls work, and the Democrats are lying when they say they don’t. In Israel the Wall is 99.9% successful. Will not be any different on our Southern Border! Hundreds of $Billions saved!","rating":6},{"id":1025834673736482800,"text":"....China, which is for the first time doing poorly against us, is spending a fortune on ads and P.R. trying to convince and scare our politicians to fight me on Tariffs- because they are really hurting their economy. Likewise other countries. We are Winning, but must be strong!","rating":5},{"id":820725491812487200,"text":"about that...Those Intelligence chiefs made a mistake here, &amp, when people make mistakes, they should APOLOGIZE.\"\" Media should also apologize","rating":5},{"id":889790429398528000,"text":"Attorney General Jeff Sessions has taken a VERY weak position on Hillary Clinton crimes (where are E-mails &amp, DNC server) &amp, Intel leakers!","rating":8},{"id":943079382163353600,"text":"Stocks and the economy have a long way to go after the Tax Cut Bill is totally understood and appreciated in scope and size. Immediate expensing will have a big impact. Biggest Tax Cuts and Reform EVER passed. Enjoy, and create many beautiful JOBS!","rating":6},{"id":1194608482793795600,"text":"NEVER TRUMPERS!","rating":7},{"id":843772976151642100,"text":"James Clapper and others stated that there is no evidence Potus colluded with Russia. This story is FAKE NEWS and everyone knows it!","rating":7},{"id":1022274433979957200,"text":"Thank you Georgia! They say that my endorsement last week of Brian Kemp, in the Republican Primary for Governor against a very worthy opponent, lifted him from 5 points down to a 70% to 30% victory! Two very good and talented men in a great race, but congratulations to Brian!","rating":4},{"id":1227986937652351000,"text":"....which he actually has a military and legal obligation to do. His incredible wife, Karen, who I have a lot of respect for, once pulled me aside &amp; said strongly that “John respects you greatly. When we are no longer here, he will only speak well of you.” Wrong!","rating":6},{"id":898128290698989600,"text":"...and people like Ms. Heyer. Such a disgusting lie. He just can't forget his election trouncing.The people of South Carolina will remember!","rating":8},{"id":1090953323895840800,"text":"China’s top trade negotiators are in the U.S. meeting with our representatives. Meetings are going well with good intent and spirit on both sides. China does not want an increase in Tariffs and feels they will do much better if they make a deal. They are correct. I will be......","rating":4},{"id":1161258370478858200,"text":"Through massive devaluation of their currency and pumping vast sums of money into their system, the tens of billions of dollars that the U.S. is receiving is a gift from China. Prices not up, no inflation. Farmers getting more than China would be spending. Fake News won’t report!","rating":7},{"id":926421589159182300,"text":"...Based on that, the Military has hit ISIS \"\"much harder\"\" over the last two days. They will pay a big price for every attack on us!","rating":6},{"id":1170171081853931500,"text":"China just enacted a major stimulus plan. With all the Tariffs THEY are paying to the USA, Billions and Billions of Dollars, they need it! In the meantime, our Federal Reserve sits back and does NOTHING!","rating":8},{"id":1245701859697967000,"text":"....have been stocked up and ready long before this crisis hit. Other states are thrilled with the job we have done. Sending many Ventilators today, with thousands being built. 51 large cargo planes coming in with medical supplies. Prefer sending directly to hospitals.","rating":5},{"id":788937644642213900,"text":"That was really exciting. Made all of my points. MAKE AMERICA GREAT AGAIN!","rating":7},{"id":1202606537342161000,"text":"....This will mean that the beyond important and seldom used act of Impeachment will be used routinely to attack future Presidents. That is not what our Founders had in mind. The good thing is that the Republicans have NEVER been more united. We will win!","rating":4},{"id":1343919652125241300,"text":"...more votes than is needed by me to win Pennsylvania, not to mention hundreds of thousands of votes in other categories which increase my already big lead into a landslide. All other Swing States show likewise. WE NEED NEW &amp; ENERGETIC REPUBLICAN LEADERSHIP. This can not stand..","rating":9},{"id":889273320574783500,"text":"It's hard to read the Failing New York Times or the Amazon Washington Post because every story/opinion, even if should be positive, is bad!","rating":7},{"id":1034663158357655600,"text":"Martha McSally, running in the Arizona Primary for U.S. Senate, was endorsed by rejected Senator Jeff Flake....and turned it down - a first! Now Martha, a great U.S. Military fighter jet pilot and highly respected member of Congress, WINS BIG. Congratulations, and on to November!","rating":3},{"id":1170437809796255700,"text":"...FAKE NEWS. I would like very much to stop referring to this ridiculous story, but the LameStream Media just won’t let it alone. They always have to have the last word, even though they know they are defrauding &amp, deceiving the public. The public knows that the Media is corrupt!","rating":8},{"id":885770227514052600,"text":"Republicans Senators are working hard to get their failed ObamaCare replacement approved. I will be at my desk, pen in hand!","rating":5},{"id":1197534762669346800,"text":"Ken Starr, Former Independent Counsel: “Does this reach the level of treason, bribery or other high crimes and misdemeanors? My assessment of the evidence so far, NO WHERE CLOSE. The evidence is conflicting &amp, ambiguous. Ambassador Sondland’s testimony stated that....","rating":3},{"id":832579442790772700,"text":"General Keith Kellogg, who I have known for a long time, is very much in play for NSA - as are three others.","rating":2},{"id":906135414498631700,"text":"Republicans, sorry, but I've been hearing about Repeal &amp, Replace for 7 years, didn't happen! Even worse, the Senate Filibuster Rule will....","rating":4},{"id":901044579750826000,"text":"Nick Adams, \"\"Retaking America\"\"  \"\"Best things of this presidency aren't reported about. Convinced this will be perhaps best presidency ever.\"\"","rating":4},{"id":1003611857272361000,"text":"....We had Repeal &amp, Replace done (and the saving to our country of one trillion dollars) except for one person, but it is getting done anyway. Individual Mandate is gone and great, less expensive plans will be announced this month. Drug prices coming down &amp, Right to Try!","rating":5},{"id":926053970535243800,"text":"Would love to send the NYC terrorist to Guantanamo but statistically that process takes much longer than going through the Federal system...","rating":5},{"id":1143999067300610000,"text":"....No Collusion, No Obstruction! Robert Mueller said he was done after his last 9 minute news conference, as later corrected. Now the Dems want to  give it another try. Does it ever end?","rating":6},{"id":1093965968253087700,"text":"Deepest sympathies to Congresswoman Debbie Dingell and the entire family of John Dingell. Longest serving Congressman in Country’s history which, if people understand politics, means he was very smart. A great reputation and highly respected man.","rating":2},{"id":857557522584088600,"text":"The Democrats want to shut government if we don't bail out Puerto Rico and give billions to their insurance companies for OCare failure. NO!","rating":7},{"id":1075210869007622100,"text":"....This will keep our communities safer, and provide hope and a second chance, to those who earn it. In addition to everything else, billions of dollars will be saved. I look forward to signing this into law!","rating":3},{"id":925533433597775900,"text":"The Republican House members are working hard (and late) toward the Massive Tax Cuts that they know you deserve. These will be biggest ever!","rating":5},{"id":1143601087238172700,"text":"....Martha is strong on Crime and Borders, the 2nd Amendment, and loves our Military and Vets. She has my Complete and Total Endorsement!","rating":3},{"id":923557515828310000,"text":"Do not underestimate the UNITY within the Republican Party!","rating":2},{"id":1162095183082729500,"text":"“If they don’t get this Trade Deal with the U.S. done, China could have it first recession (or worse!) in years. There’s disinvestment in China right now. Also, the Fed is too tight (I agree).” Steve Moore, Heritage Foundation","rating":4},{"id":742096033207844900,"text":"What has happened in Orlando is just the beginning. Our leadership is weak and ineffective. I called it and asked for the ban. Must be tough","rating":7},{"id":1166382203808440300,"text":"Wow! Yet another big storm heading to Puerto Rico. Will it ever end? Congress approved 92 Billion Dollars for Puerto Rico last year, an all time record of its kind for “anywhere.”","rating":6},{"id":984017894240604200,"text":"So much Fake News about what is going on in the White House. Very calm and calculated with a big focus on open and fair trade with China, the coming North Korea meeting and, of course, the vicious gas attack in Syria. Feels great to have Bolton &amp, Larry K on board. I (we) are","rating":5},{"id":1019526399542091800,"text":"....Russia has agreed to help with North Korea, where relationships with us are very good and the process is moving along. There is no rush, the sanctions remain! Big benefits and exciting future for North Korea at end of process!","rating":4},{"id":868810522942165000,"text":"Does anyone notice how the Montana Congressional race was such a big deal to Dems &amp, Fake News until the Republican won? V was poorly covered","rating":6},{"id":1171413029264732200,"text":"NORTH CAROLINA, VOTE FOR DAN BISHOP TODAY. WE NEED HIM BADLY IN WASHINGTON!","rating":3},{"id":916638685914951700,"text":"I called Chuck Schumer yesterday to see if the Dems want to do a great HealthCare Bill. ObamaCare is badly broken, big premiums. Who knows!","rating":6},{"id":1013139532290625500,"text":"I never pushed the Republicans in the House to vote for the Immigration Bill, either GOODLATTE 1 or 2, because it could never have gotten enough Democrats as long as there is the 60 vote threshold. I released many prior to the vote knowing we need more Republicans to win in Nov.","rating":5},{"id":1172494649296113700,"text":"....Became Number 1 in World &amp, Independent in Energy. Will soon have record number of Judges, 2 SC Justices. Done more than any President in first 2 1/2 years despite phony &amp, fraudulent Witch Hunt illegally led against him. WIN on Mueller Report, Mueller Testimony &amp, James Comey..","rating":7},{"id":1062045654711713800,"text":"American Cable Association has big problems with Comcast. They say that Comcast routinely violates Antitrust Laws. “These guys are acting much worse, and have much more potential for damage to consumers, than anything AT&amp,T-Time Warner would do.” Charlie Gasparino","rating":4},{"id":1038022020691161100,"text":"Matt Rosendale will be a Great Senator from a Great State, Montana! He is a fighter who will be tough on Crime and the Border, fight hard for our 2nd Amendment and loves our Military and our Vets. He has my full and complete Endorsement!","rating":3},{"id":868840252227674100,"text":"British Prime Minister May was very angry that the info the U.K. gave to U.S. about Manchester was leaked. Gave me full details!","rating":8},{"id":1143999292538937300,"text":"The Republican Senate just passed bipartisan humanitarian assistance for our Southern Border, 84-8! In addition to aid, Congress must close the catastrophic loopholes that are driving the Crisis. We must end incentives for Smuggling Children, Trafficking Women, and Selling Drugs.","rating":5},{"id":1070877381861277700,"text":"Trish_Regan:  “Did the FBI follow protocol to obtain the FISA warrant? I don’t think so. The Dossier was opposition research funded by opponents. Don’t use Government resources to take down political foes. Weaponizing Government for gain.” Is this really America? Witch Hunt!","rating":7},{"id":1130200090583478300,"text":"Our Economy and Jobs Market is BOOMING, the best in the World and in our Country’s history - and we have just started!","rating":4},{"id":1298283961551138800,"text":"...More JOBS from Eastport, Cutler, &amp; Jonesport to Stonington, Friendship, and Casco Bay. I am proud to help the great people of Maine!","rating":2},{"id":1167435723823341600,"text":"The Euro is dropping against the Dollar “like crazy,” giving them a big export and manufacturing advantage...and the Fed does NOTHING! Our Dollar is now the strongest in history. Sounds good, doesn’t it? Except to those (manufacturers) that make product for sale outside the U.S.","rating":6},{"id":1164143118565937200,"text":"Rep Tlaib wants to cut off aid to Israel. This is the new face the of Democrat Party? Read the AOC PLUS 3 statements on their hatred of Jews and Israel. Check out Rep. Omar (the great people of Minnesota won’t stand for this).","rating":7},{"id":1195202838361624600,"text":"....Ambassador Sondland did not tell us, and certainly did not tell me, about a connection between the assistance and the investigation.” THE FAKE IMPEACHMENT INQUIRY IS NOW DEAD!","rating":8},{"id":1112906931868520400,"text":"....back the House. It will be truly great HealthCare that will work for America. Also, Republicans will always support Pre-Existing Conditions. The Republican Party will be known as the Party of Great HealtCare. Meantime, the USA is doing better than ever &amp, is respected again!","rating":5},{"id":1208228389246701600,"text":"We will always provide for our Veterans and their mental health. I pushed Congress to provide $10 Billion for Vet mental health, suicide prevention outreach, and funding for my PREVENTS Initiative to end Vet suicide. Congress responded. A big win for our Vets!","rating":4},{"id":1304236585790009300,"text":"...the vaccine, destroy the suburbs, erase your borders, and indoctrinate your children with poisonous anti-American lies!","rating":9},{"id":889796918615920600,"text":"ObamaCare is torturing the American People.The Democrats have fooled the people long enough. Repeal or Repeal &amp, Replace! I have pen in hand.","rating":7},{"id":1112910106004504600,"text":"The Democrats today killed a Bill that would have provided great relief to Farmers and yet more money to Puerto Rico despite the fact that Puerto Rico has already been scheduled to receive more hurricane relief funding than any “place” in history. The people of Puerto Rico.....","rating":6},{"id":809790978332786700,"text":"Well, we all did it, together! I hope the \"\"MOVEMENT\"\" fans will go to D.C. on Jan 20th for the swearing in. Let's set the all time record!","rating":7},{"id":904174851627286500,"text":"The Manufacturing Index rose to 59%, the highest level since early 2011 - and we can do much better!","rating":3},{"id":897763049226084400,"text":"Amazon is doing great damage to tax paying retailers. Towns, cities and states throughout the U.S. are being hurt - many jobs being lost!","rating":5},{"id":889821674987761700,"text":"Working on major Trade Deal with the United Kingdom. Could be very big &amp, exciting. JOBS! The E.U. is very protectionist with the U.S. STOP!","rating":4},{"id":1132184674829082600,"text":"Democrat Senator Mark Warner is acting and talking like he is in total control of the Senate Intelligence Committee. Their is nothing bipartisan about him. He should not be allowed to take “command” of that Committee. Too important! Remember when he spoke to the Russian jokester?","rating":6},{"id":820723387995717600,"text":"Thank you to Bob Woodward who said, \"\"That is a garbage document...it never should have been presented...Trump's right to be upset (angry)...","rating":3},{"id":1050743405578457100,"text":"Working very hard on Pastor Brunson!","rating":2},{"id":1168146167215079400,"text":"....reports are coming. Comey very vulnerable. But where is the Supreme Court. Where is Justice Roberts? If you lie to a court, you should be held in contempt. So, if you abused the FISA, you must be held accountable. I hope Justice Roberts will take action.” Jason Chaffetz, Fox","rating":7},{"id":1175561537458757600,"text":"...The Fake News Media nowadays not only doesn’t check for the accuracy of the facts, they knowingly make up the facts. They even make up sources in order to protect their partners, the Democrats. It is so wrong, but they don’t even care anymore. They have gone totally CRAZY!!!!","rating":9},{"id":1206955787953807400,"text":"Senator Josh Hawley (R-Mo) “They (the Dems) don’t have anything. This whole thing is a joke, and it’s time to get the President exonerated. The House has no evidence of any impeachable offense. There’s nothing there, and they didn’t even charge a crime. They’ve had their.....","rating":4},{"id":903600265420578800,"text":"...get things done at a record clip. Many big decisions to be made over the coming days and weeks. AMERICA FIRST!","rating":3},{"id":1023646668179296300,"text":"...dying newspaper industry. No matter how much they try to distract and cover it up, our country is making great progress under my leadership and I will never stop fighting for the American people! As an example, the failing New York Times...","rating":6},{"id":1069614615510859800,"text":"....his wife and father-in-law (who has the money?) off Scott Free. He lied for this outcome and should, in my opinion, serve a full and complete sentence.","rating":8},{"id":1190265313620836400,"text":"“Adam Schiff has taken all of the power for himself. That is very unfair. There were dozens of people on this call, yesterdays witness knew that and had no problems (nor did any of them). Facts matter, and that’s why this is not about Impeachment.” Guy Lewis, former prosecutor...","rating":6},{"id":891261878005092400,"text":"....8 Dems totally control the U.S. Senate. Many great Republican bills will never pass, like Kate's Law and complete Healthcare. Get smart!","rating":7},{"id":1053662989272793100,"text":"Rick Scott is known as easily one of the best Governors in the USA. Florida is setting records in almost every category of success. Amazing achievement-the envy of the World. Ron DeSantis will build on this success. His incompetent opponent will destroy Florida - next Venezuela!","rating":9},{"id":1045003711104331800,"text":"Congressman Lee Zeldin is doing a fantastic job in D.C. Tough and smart, he loves our Country and will always be there to do the right thing. He has my Complete and Total Endorsement!","rating":5},{"id":1234497829298679800,"text":"As usual, Jay Powell and the Federal Reserve are slow to act. Germany and others are pumping money into their economies. Other Central Banks are much more aggressive. The U.S. should have, for all of the right reasons, the lowest Rate. We don’t, putting us at a.....","rating":6},{"id":914096428879933400,"text":"I will be going to Puerto Rico on Tuesday with Melania. Will hopefully be able to stop at the U.S. Virgin Islands (people working hard).","rating":4},{"id":1130525604976169000,"text":"On this Cuban Independence Day, we stand by the people of Cuba in their quest for freedom, democracy and prosperity. The Cuban regime must end its repression of Cubans &amp, Venezuelans. The United States will not stand idly by as Cuba continues to subvert democracy in the Americas!","rating":5},{"id":1003806272360239100,"text":"Big Supreme Court ruling for Baker just out!","rating":3},{"id":999984492197613600,"text":"The Democrats are now alluding to the the concept that having an Informant placed in an opposing party’s campaign is different than having a Spy, as illegal as that may be. But what about an “Informant” who is paid a fortune and who “sets up” way earlier than the Russian Hoax?","rating":7},{"id":817753083707015200,"text":"both countries will, perhaps, work together to solve some of the many great and pressing problems and issues of the WORLD!","rating":3},{"id":1016633811378073600,"text":"NATO countries must pay MORE, the United States must pay LESS. Very Unfair!","rating":6},{"id":1187708410579603500,"text":"Turkey fully understands not to fire on the Kurds as they leave what will be known as the Safe Zone for other fairly nearby areas. I don’t have to repeat that large scale Sanctions will be imposed for violations. Going well! ISIS secured by Kurds with Turkey ready as backup.....","rating":7},{"id":894515865802223600,"text":"... Supreme Court pick, economic enthusiasm, deregulation &amp, so much more have driven the Trump base even closer together. Will never change!","rating":4},{"id":1152197164883435500,"text":"Because of the faulty thought process we have going for us at the Federal Reserve, we pay much higher interest rates than countries that are no match for us economically. In other words, our interest costs are much higher than other countries, when they should be lower. Correct!","rating":5},{"id":897041646659014700,"text":"Heading to Washington this morning. Much work to do. Focus on trade and military. #MAGA","rating":2},{"id":914089888596754400,"text":"...want everything to be done for them when it should be a community effort. 10,000 Federal workers now on Island doing a fantastic job.","rating":3},{"id":1114155671950364700,"text":"....This will supersede USMCA. Likewise I am looking at an economic penalty for the 500 Billion Dollars in illegal DRUGS that are shipped and smuggled through Mexico and across our Southern Border. Over 100,00 Americans die each year, sooo many families destroyed!","rating":6},{"id":1171942311321919500,"text":"I had an excellent telephone conversation with Andrés Manuel López Obrador, President of Mexico, talking about Southern Border Security, and various other things of mutual interest for the people of our respective countries....","rating":3},{"id":1204409386535473200,"text":"Looking like very good Democrat support for USMCA. That would be great for our Country!","rating":2},{"id":932388590344196100,"text":"Sen. Jeff Flake(y), who is unelectable in the Great State of Arizona (quit race, anemic polls) was caught (purposely) on “mike” saying bad things about your favorite President. He’ll be a NO on tax cuts because his political career anyway is “toast.”","rating":7},{"id":1176156564274712600,"text":"....know the correct facts. Is he on our Country’s side. Where does he come from. Is this all about Schiff &amp, the Democrats again after years of being wrong?","rating":6},{"id":1167060675480473600,"text":"The Economy is doing GREAT, with tremendous upside potential! If the Fed would do what they should, we are a Rocket upward!","rating":5},{"id":872086906804240400,"text":"...extremism, and all reference was pointing to Qatar. Perhaps this will be the beginning of the end to the horror of terrorism!","rating":4},{"id":1315871590685565000,"text":"....Much of the money we have spent is on our ground game, said to be the best ever put together. I’ll let you know how good it is on November 3rd. Very expensive to do, but opportunity could be BIG! I will spend additional money if we are not spending enough!","rating":4},{"id":845247455868391400,"text":"After seven horrible years of ObamaCare (skyrocketing premiums &amp, deductibles, bad healthcare), this is finally your chance for a great plan!","rating":5},{"id":1174312984522309600,"text":"I am pleased to announce that I will name Robert C. O’Brien, currently serving as the very successful Special Presidential Envoy for Hostage Affairs at the State Department, as our new National Security Advisor. I have worked long &amp, hard with Robert. He will do a great job!","rating":3},{"id":877101173412638700,"text":"Democrat Jon Ossoff, who wants to raise your taxes to the highest level and is weak on crime and security, doesn't even live in district.","rating":6},{"id":1171758531449643000,"text":"In a hypothetical poll, done by one of the worst pollsters of them all, the Amazon Washington Post/ABC, which predicted I would lose to Crooked Hillary by 15 points (how did that work out?), Sleepy Joe, Pocahontas and virtually all others would beat me in the General Election....","rating":7},{"id":877350761742688300,"text":"Things are looking great for Karen H!","rating":2},{"id":755972015249645600,"text":"Wow, Ted Cruz got booed off the stage, didn't honor the pledge! I saw his speech two hours early but let him speak anyway. No big deal!","rating":8},{"id":1042034269374361600,"text":".....China has been taking advantage of the United States on Trade for many years. They also know that I am the one that knows how to stop it. There will be great and fast economic retaliation against China if our farmers, ranchers and/or industrial workers are targeted!","rating":6},{"id":987786331995672600,"text":"The Washington Post said I refer to Jeff Sessions as “Mr. Magoo” and Rod Rosenstein as “Mr. Peepers.” This is “according to people with whom the president has spoken.” There are no such people and don’t know these characters...just more Fake &amp, Disgusting News to create ill will!","rating":9},{"id":1307060562409517000,"text":"...Sleepy Joe doesn’t have a clue, just look at what his own people said about his handling of the Swine Flu. It was a disaster!","rating":7},{"id":1258020241063510000,"text":"....to it, as appropriate. The Task Force will also be very focused on Vaccines &amp; Therapeutics. Thank you!","rating":3},{"id":1022484559470977000,"text":"Heading to Dubuque, Iowa and then Granite City, Illinois. Looking  forward to being with many great friends!","rating":4},{"id":1070312880095068200,"text":"One of the very exciting things to come out of my meeting with President Xi of China is his promise to me to criminalize the sale of deadly Fentanyl coming into the United States. It will now be considered a “controlled substance.” This could be a game changer on what is.......","rating":5},{"id":917921548677328900,"text":"The Fake News is at it again, this time trying to hurt one of the finest people I know, General John Kelly, by saying he will soon be.....","rating":6},{"id":924625061100867600,"text":"As usual, the ObamaCare premiums will be up (the Dems own it), but we will Repeal &amp, Replace and have great Healthcare soon after Tax Cuts!","rating":7},{"id":889824817473605600,"text":"Will be traveling to the Great State of Ohio tonight. Big crowd expected. See you there!","rating":3},{"id":900706146943717400,"text":"The Fake News is now complaining about my different types of back to back speeches. Well, there was Afghanistan (somber), the big Rally.....","rating":7},{"id":881830110114009100,"text":"Will be speaking with Germany and France this morning.","rating":3},{"id":1189183301233234000,"text":"Consumer Confidence number very good. Housing sales in September up nicely. Economy Rocks!","rating":4},{"id":1192438178747170800,"text":"The degenerate Washington Post MADE UP the story about me asking Bill Barr to hold a news conference. Never happened, and there were no sources!","rating":8},{"id":965780052167286800,"text":"“The Faith of Donald Trump,” a book just out by David Brody and Scott Lamb, is a very interesting read. Enjoy!","rating":2},{"id":817701436096127000,"text":"Intelligence stated very strongly there was absolutely no evidence that hacking affected the election results. Voting machines not touched!","rating":5},{"id":891257113565163500,"text":"Republican Senate must get rid of 60 vote NOW! It is killing the R Party, allows 8 Dems to control country. 200 Bills sit in Senate. A JOKE!","rating":6},{"id":919007577681354800,"text":"Money pouring into Insurance Companies profits, under the guise of ObamaCare, is over. They have made a fortune.Dems must get smart &amp, deal!","rating":5},{"id":914087234869047300,"text":"The Mayor of San Juan, who was very complimentary only a few days ago, has now been told by the Democrats that you must be nasty to Trump.","rating":7},{"id":1018530173006692400,"text":"...over the years, I would return to criticism that it wasn’t good enough – that I should have gotten Saint Petersburg in addition! Much of our news media is indeed the enemy of the people and all the Dems...","rating":6},{"id":846536212362018800,"text":"...money to Bill, the Hillary Russian \"\"reset,\"\" praise of Russia by Hillary, or Podesta Russian Company. Trump Russia story is a hoax. #MAGA!","rating":9},{"id":1014094834863362000,"text":"The economy is doing perhaps better than ever before, and that’s prior to fixing some of the worst and most unfair Trade Deals ever made by any country. In any event, they are coming along very well. Most countries agree that they must be changed, but nobody ever asked!","rating":5},{"id":934029886842458100,"text":"Will be speaking to President Recep Tayyip Erdogan of Turkey this morning about bringing peace to the mess that I inherited in the Middle East. I will get it all done, but what a mistake, in lives and dollars (6 trillion), to be there in the first place!","rating":6},{"id":951646736233189400,"text":"Small Business Poll has highest approval numbers in the polls history. All business is just at the beginning of something really special!","rating":4},{"id":1317495722133065700,"text":"Senator Little Ben Sasse of the Great State of Nebraska seems to be heading down the same inglorious path as former Senators Liddle’ Bob Corker, whose approval rating in Tennessee went from 55% to 4%, &amp; Jeff “the Flake” Flake, whose approval rating in Arizona went from 56% to....","rating":8},{"id":1053657849606234100,"text":"Georgia Secretary of State Brian Kemp will be a great governor. He has been successful at whatever he has done, and has prepared for this very difficult and complex job for many years. He has my Strong Endorsement. His opponent is totally unqualified. Would destroy a great state!","rating":7},{"id":901795255086968800,"text":"I will also be going to a wonderful state, Missouri, that I won by a lot in '16. Dem C.M. is opposed to big tax cuts. Republican will win S!","rating":6},{"id":986301228337508400,"text":"Getting ready to meet Prime Minister Abe of Japan, a truly fine gentleman!","rating":3},{"id":1001807204519997400,"text":"....chief law enforcement officer, and they told me later, ‘oh by the way I’m not going to be able to participate in the most important case in the office, I would be frustrated too...and that’s how I read that - Senator Sessions, why didn’t you tell me before I picked you.....","rating":7},{"id":842710123852320800,"text":"Happy Lá Fheile Phadraig to all of my great Irish friends!","rating":2},{"id":1049665483182694400,"text":"Big announcement with my friend Ambassador Nikki Haley in the Oval Office at 10:30am.","rating":2},{"id":1057637708296794100,"text":"....Harry Reid was right in 1993, before he and the Democrats went insane and started with the Open Borders (which brings massive Crime) “stuff.” Don’t forget the nasty term Anchor Babies. I will keep our Country safe. This case will be settled by the United States Supreme Court!","rating":8},{"id":1149282144411377700,"text":"“Nearly one million more blacks and two million more Hispanics are employed than when Barrack Obama left office, and minorities account for more than half of all new jobs created during the Trump Presidency. Unemployment among black women has hovered near 5% for the last six.....","rating":4},{"id":867044286352810000,"text":"Israel, Saudi Arabia and the Middle East were great. Trying hard for PEACE. Doing well. Heading to Vatican &amp, Pope, then #G7 and #NATO.","rating":3},{"id":818422930157830100,"text":"\"\"groveling\"\" when he totally changed a 16 year old story that he had written in order to make me look bad. Just more very dishonest media!","rating":6},{"id":982967389028569100,"text":"....to pay. Open area immediately for medical help and verification. Another humanitarian disaster for no reason whatsoever. SICK!","rating":5},{"id":1074652591785721900,"text":"Anytime you hear a Democrat saying that you can have good Boarder Security without a Wall, write them off as just another politician following the party line. Time for us to save billions of dollars a year and have, at the same time, far greater safety and control!","rating":7},{"id":991669454823141400,"text":"“The questions are an intrusion into the President’s Article 2  powers under the Constitution to fire any Executive Branch Employee...what the President was thinking is an outrageous.....as to the President’s unfettered power to fire anyone...” Joe Digenova, former US Attorney","rating":4},{"id":1129336982319050800,"text":"Border Patrol is apprehending record numbers of people at the Southern Border. The bad “hombres,” of which there are many, are being detained &amp, will be sent home. Those which we release under the ridiculous Catch &amp, Telease loophole, are being registered and will be removed later!","rating":7},{"id":888711488717934600,"text":"The Failing New York Times foiled U.S. attempt to kill the single most wanted terrorist,Al-Baghdadi.Their sick agenda over National Security","rating":9},{"id":1014295759393644500,"text":"...has endured because of the sweat, blood and sacrifice of the American Armed Forces – the greatest force for peace and justice in the history of the world!","rating":3},{"id":1171014997339713500,"text":"...but then he ran for Congress and won, only to lose his re-elect after I Tweeted my endorsement, on Election Day, for his opponent. But now take heart, he is back, and running for President of the United States. The Three Stooges, all badly failed candidates, will give it a go!","rating":8},{"id":1164885387862519800,"text":"Now the Fed can show their stuff!","rating":5},{"id":973171763835228200,"text":"Secretary of Commerce Wilbur Ross will be speaking with representatives of the European Union about eliminating the large Tariffs and Barriers they use against the U.S.A. Not fair to our farmers and manufacturers.","rating":4},{"id":1175387096649011200,"text":"....story about me and a perfectly fine and routine conversation I had with the new President of the Ukraine. Nothing was said that was in any way wrong, but Biden’s demand, on the other hand, was a complete and total disaster. The Fake News knows this but doesn’t want to report!","rating":7},{"id":891039237319143400,"text":"...and a Great Leader. John has also done a spectacular job at Homeland Security. He has been a true star of my Administration","rating":3},{"id":829684271812067300,"text":"...long he doesn't know how to win anymore, just look at the mess our country is in - bogged down in conflict all over the place. Our hero..","rating":6},{"id":1268683085136224300,"text":"...in my inner-circle, was totally exhausted by the job, and in the end just slinked away into obscurity. They all want to come back for a piece of the limelight!","rating":7},{"id":909401572341370900,"text":"Important meetings and calls scheduled for today. Military and economy are getting stronger by the day, and our enemies know it. #MAGA","rating":4},{"id":774673449885192200,"text":"While Hillary said horrible things about my supporters, and while many of her supporters will never vote for me, I still respect them all!","rating":6},{"id":908285679335034900,"text":"Am leaving now for Florida to see our GREAT first responders and to thank the U.S. Coast Guard, FEMA etc. A real disaster, much work to do!","rating":3},{"id":912651215997202400,"text":"Thank you to Carmen Yulin Cruz, the Mayor of San Juan, for your kind words on FEMA etc.We are working hard. Much food and water there/on way","rating":3},{"id":1130857064928952300,"text":"To the great people of Kentucky, please go out and vote for Matt Bevin today. Very important. He has done a fantastic job for you and America! #MAGA","rating":4},{"id":914217658517737500,"text":"We must all be united in offering assistance to everyone suffering in Puerto Rico and elsewhere in the wake of this terrible disaster.","rating":2},{"id":817004210529116200,"text":"to make up their own minds as to the truth. The media lies to make it look like I am against \"\"Intelligence\"\" when in fact I am a big fan!","rating":6},{"id":850722648883638300,"text":"It was a great honor to have President Xi Jinping and Madame Peng Liyuan of China as our guests in the United States. Tremendous...","rating":3},{"id":1052556944068755500,"text":"Republicans must make the horrendous, weak and outdated immigration laws, and the Border, a part of the Midterms!","rating":5},{"id":857177434210304000,"text":"First the Ninth Circuit rules against the ban &amp, now it hits again on sanctuary cities-both ridiculous rulings. See you in the Supreme Court!","rating":7},{"id":874619861019840500,"text":"Heading to the Great State of Wisconsin to talk about JOBS, JOBS, JOBS! Big progress being made as the Real News is reporting.","rating":3},{"id":1180899945701879800,"text":"Going to Louisiana on Friday night for a big Republican Rally. Keep Democrat Governor Edwards under 50%, force a runoff, and have a great new Republican Governor! Voting on Saturday. Information for Rally to follow.","rating":5},{"id":1257532114666508300,"text":"....lost for Evan “McMuffin” McMullin (to me). Steve Schmidt &amp; Reed Galvin lost for John McCain, Romney’s campaign manager (?) lost big to “O”, &amp; Jennifer Horn got thrown out of the New Hampshire Republican Party. They’re all LOSERS, but Abe Lincoln, Republican, is all smiles!","rating":10},{"id":1070298360572198900,"text":"“China officially echoed President Donald Trump’s optimism over bilateral trade talks. Chinese officials have begun preparing to restart imports of U.S. Soybeans &amp, Liquified Natural Gas, the first sign confirming the claims of President Donald Trump and the White House that......","rating":5},{"id":1294307233094934500,"text":"Everybody does phony books on Donald Trump and Republicans, just like the Fake Dossier, which turned out to be a total fraud perpetrated by Crooked Hillary Clinton and the DNC...","rating":8},{"id":861177649179373600,"text":"When will the Fake Media ask about the Dems dealings with Russia &amp, why the DNC wouldn't allow the FBI to check their server or investigate?","rating":7},{"id":1164153329196384300,"text":"The Fake News LameStream Media is doing everything possible the “create” a U.S. recession, even though the numbers &amp, facts are working totally in the opposite direction. They would be willing to hurt many people, but that doesn’t matter to them. Our Economy is sooo strong, sorry!","rating":9},{"id":1252640539574448000,"text":"....to State/Local Governments for lost revenues from COVID 19, much needed Infrastructure Investments for Bridges, Tunnels, Broadband, Tax Incentives for Restaurants, Entertainment, Sports, and Payroll Tax Cuts to increase Economic Growth.","rating":4},{"id":803343150907617300,"text":"Just met with General Petraeus--was very impressed!","rating":3},{"id":1124398008223895600,"text":"Fred Keller of the Great State of Pennsylvania has been an outstanding State Rep. Now he is running as the Republican Nominee for Congress, and has my Complete and Total Endorsement. Strong on Crime, Second Amendment, Military, Vets, and Healthcare. He will do a fantastic job!","rating":3},{"id":901029770401546200,"text":"If Senate Republicans don't get rid of the Filibuster Rule and go to a 51% majority, few bills will be passed. 8 Dems control the Senate!","rating":6},{"id":1009900449456115700,"text":"Big Supreme Court win on internet sales tax - about time! Big victory for fairness and for our country. Great victory for consumers and retailers.","rating":4},{"id":1075832235318804500,"text":"Congress just passed the Criminal Justice Reform Bill known as the #FirstStepAct. Congratulations! This is a great bi-partisan achievement for everybody. When both parties work together we can keep our Country safer. A wonderful thing for the U.S.A.!!","rating":3},{"id":1185601988811284500,"text":"“I don’t see anything that constitutes an Impeachable offense - Nothing here rises to the level of Impeachment. The Democrats are making a mistake with this secrecy.” Kenn Starr, former Special Prosecutor","rating":4},{"id":1175023773180932000,"text":"....statement. Strange that with so many other people hearing or knowing of the perfectly fine and respectful conversation, that they would not have also come forward. Do you know the reason why they did not? Because there was nothing said wrong, it was pitch perfect!","rating":5},{"id":1037078254845390800,"text":"....looking to inflict pain and embarrassment to one of the most highly renowned jurists to ever appear before Congress. So sad to see!","rating":4},{"id":965928352614965200,"text":"“There is no serious person out there who would suggest somehow that you could even rig America’s elections, there’s no evidence that that has happened in the past or that it will happen this time, and so I’d invite Mr. Trump to stop whining and make his case to get votes.” .....","rating":6},{"id":1048583880326963200,"text":"Women for Kavanaugh, and many others who support this very good man, are gathering all over Capital Hill in preparation for a 3-5 P.M. VOTE. It is a beautiful thing to see - and they are not paid professional protesters who are handed expensive signs. Big day for America!","rating":5},{"id":1180248057159540700,"text":"....it to Congress, and the American people, as though it was the statement of the President of the United States, me. He did it to fool Congress and the public in order to make me look BAD. He is a sick puppy!","rating":7},{"id":1168493185758355500,"text":"“The last three years of Trump policy have finally brought real hope and real change. Unemployment this year hit a 50 year low. With President Trump we’ve seen the lowest EVER African American and Hispanic unemployment. The booming Trump Economy has pushed up workers wages....","rating":5},{"id":913723771336392700,"text":"Puerto Rico Governor Ricardo Rossello just stated: \"\"The Administration and the President, every time we've spoken, they've delivered......","rating":4},{"id":1075401544131076100,"text":"The Trump Foundation has done great work and given away lots of money, both mine and others, to great charities over the years - with me taking NO fees, rent, salaries etc. Now, as usual, I am getting slammed by Cuomo and the Dems in a long running civil lawsuit started by.....","rating":5},{"id":1085159285208858600,"text":"Great being with the National Champion Clemson Tigers last night at the White House. Because of the Shutdown I served them massive amounts of Fast Food (I paid), over 1000 hamberders etc. Within one hour, it was all gone. Great guys and big eaters!","rating":8},{"id":923149037523566600,"text":"The reason Flake and Corker dropped out of the Senate race is very simple, they had zero chance of being elected. Now act so hurt &amp, wounded!","rating":6},{"id":914252271982178300,"text":"I will be in PR on Tues. to further ensure we continue doing everything possible to assist &amp, support the people in their time of great need.","rating":4},{"id":1071076519584268300,"text":"I am pleased to announce that I will be nominating The Honorable William P. Barr for the position of Attorney General of the United States. As the former AG for George H.W. Bush....","rating":3},{"id":1172859771575328800,"text":"94% Approval Rating in the Republican Party! Tuesday night in the Great State of North Carolina proved that high and very beautiful number correct.","rating":5},{"id":800303776615854100,"text":"Numerous patriots will be coming to Bedminster today as I continue to fill out the various positions necessary to MAKE AMERICA GREAT AGAIN!","rating":6},{"id":1181547331822456800,"text":"So many people conveniently forget that Turkey is a big trading partner of the United States, in fact they make the structural steel frame for our F-35 Fighter Jet. They have also been good to deal with, helping me to save many lives at Idlib Province, and returning, in very.....","rating":5},{"id":1294307884055040000,"text":"...Congress should send me H.R.473 ASAP and make this happen! It will INSPIRE all women to continue being bold and brave in achieving their DREAMS!","rating":4},{"id":1152195095430651900,"text":"....he could not have been nicer or more respectful to your favorite President, me. Then I saw the column he wrote, “Trump Will Be Re-elected, Won’t He?” He called me a Racist, which I am not, and said Rhode Island went from economically bad to great in 5 years because the.....","rating":7},{"id":1164138796205654000,"text":"....like he’s the King of Israel. They love him like he is the second coming of God...But American Jews don’t know him or like him. They don’t even know what they’re doing or saying anymore. It makes no sense! But that’s OK, if he keeps doing what he’s doing, he’s good for.....","rating":8},{"id":986357228306354200,"text":"Today’s Court decision means that Congress must close loopholes that block the removal of dangerous criminal aliens, including aggravated felons. This is a public safety crisis that can only be fixed by....","rating":4},{"id":817164923843280900,"text":"How did NBC get \"\"an exclusive look into the top secret report he (Obama) was presented?\"\" Who gave them this report and why? Politics!","rating":7},{"id":1169048221026590700,"text":"At the request of Senator Thom Tillis, I am getting the North Carolina Emergency Declaration completed and signed tonight. Hope you won’t need it!","rating":3},{"id":993541175511527400,"text":"National Prescription Drug #TakeBackDay numbers are in! Another record broken: nearly 1 MILLION pounds of Rx pills disposed! Let’s keep fighting this opioid epidemic, America!","rating":2},{"id":1035717747936768000,"text":"The ABC/Washington Post Poll was by far the least accurate one 2 weeks out from the 2016 Election. I call it a suppression poll - but by Election Day they brought us, out of shame, to about even. They will never learn!","rating":5},{"id":984015782521835500,"text":"The Failing New York Times wrote another phony story. It was political pundit Doug Schoen, not a Ukrainian businessman, who asked me to do a short speech by phone (Skype), hosted by Doug, in Ukraine. I was very positive about Ukraine-another negative to the Fake Russia  C story!","rating":6},{"id":1069581524180324400,"text":"President Xi and I have a very strong and personal relationship. He and I are the only two people that can bring about massive and very positive change, on trade and far beyond, between our two great Nations. A solution for North Korea is a great thing for China and ALL!","rating":3},{"id":859393829505552400,"text":"either elect more Republican Senators in 2018 or change the rules now to 51%. Our country needs a good \"\"shutdown\"\" in September to fix mess!","rating":8},{"id":922830229525225500,"text":"...the entire World WAS laughing and taking advantage of us. People like liddle' Bob Corker have set the U.S. way back. Now we move forward!","rating":7},{"id":872084870620520400,"text":"So good to see the Saudi Arabia visit with the King and 50 countries already paying off. They said they would take a hard line on funding...","rating":4},{"id":1011571026034090000,"text":"....We are getting other countries to reduce and eliminate tariffs and trade barriers that have been unfairly used for years against our farmers, workers and companies. We are opening up closed markets and expanding our footprint. They must play fair or they will pay tariffs!","rating":3},{"id":1029325115547369500,"text":"....should be shut down. The Strzok firing shows that the fundamental underpinnings of the investigation were corrupt. It should be shut down by the courts or by honest prosecutors.” Thank you Judicial Watch, I couldn’t have said it better myself!","rating":4},{"id":1022614707637772300,"text":"...called “The Case Against Impeaching Trump,” which I would encourage all people with Trump Derangement Syndrome to read!","rating":5},{"id":1205109506834862000,"text":"Congratulations to JUDGE LAWRENCE VANDYKE on being confirmed to the Ninth Circuit. Great job!","rating":2},{"id":979030109104562200,"text":"....release known dangerous criminals into communities across the State. All citizens have the right to be protected by Federal law and strong borders.","rating":3},{"id":1178648671996526600,"text":"....place in TRADE, it’s taking shape in Military Competition.” Johnathan Ward, author and China expert. We are winning, and we will win. They should not have broken the deal we had with them. Happy Birthday China!","rating":6},{"id":1327824600760275000,"text":"Antifa SCUM ran for the hills today when they tried attacking the people at the Trump Rally, because those people aggressively fought back. Antifa waited until tonight, when 99% were gone, to attack innocent #MAGA People. DC Police, get going — do you job and don’t hold back!!!","rating":8},{"id":977872899792089100,"text":"Many lawyers and top law firms want to represent me in the Russia case...don’t believe the Fake News narrative that it is hard to find a lawyer who wants to take this on. Fame &amp, fortune will NEVER be turned down by a lawyer, though some are conflicted. Problem is that a new......","rating":5},{"id":858653541094879200,"text":"Big excitement last night in the Great State of Pennsylvania! Fantastic crowd and people. MAKE AMERICA GREAT AGAIN!","rating":2},{"id":925363340553211900,"text":"The biggest story yesterday, the one that has the Dems in a dither, is Podesta running from his firm. What he know about Crooked Dems is....","rating":6},{"id":1029038164248338400,"text":"Wacky Omarosa already has a fully signed Non-Disclosure Agreement!","rating":8},{"id":1011568906992017400,"text":"Early this year Harley-Davidson said they would move much of their plant operations in Kansas City to Thailand. That was long before Tariffs were announced. Hence, they were just using Tariffs/Trade War as an excuse. Shows how unbalanced &amp, unfair trade is, but we will fix it.....","rating":5},{"id":1059897349005283300,"text":"Congressman Randy Hultgren (R) of Illinois is doing a great job. Get out and Vote for Randy - Total Endorsement!","rating":3},{"id":1055075245743374300,"text":"Brian Kemp will be a GREAT Governor of Georgia. Stacey Abrams will destroy the State. Sooooo important, get out and VOTE for Brian!","rating":6},{"id":1193891291953807400,"text":"Will be meeting with representatives of the Vaping industry, together with medical professionals and individual state representatives, to come up with an acceptable solution to the Vaping and E-cigarette dilemma. Children’s health &amp, safety, together with jobs, will be a focus!","rating":4},{"id":1303390488175599600,"text":"Democrats admit that President Trump’s message is “working” on violence coming to the Suburbs in a Looney Biden Administration. Plus, Biden just doubled down on forcing Federal control of local zoning. This means low income housing and projects. So much for the American Dream!","rating":7},{"id":916622087606980600,"text":"...contributions. The RNC is taking in far more $'s than the Dems, and much of it by my wonderful small donors. I am working hard for them!","rating":2},{"id":804170300908781600,"text":"Look forward to going to Indiana tomorrow in order to be with the great workers of Carrier. They will sell many air conditioners!","rating":3},{"id":1288520310531272700,"text":"...do not stop the Crime and Violence from the Anarchists and Agitators immediately, the Federal Government will go in and do the job that local law enforcement was supposed to do!","rating":7},{"id":1129339132373884900,"text":"Will the Democrats give our Country a badly needed immigration win before the election? Good chance!","rating":4},{"id":817579925771341800,"text":"Gross negligence by the Democratic National Committee allowed hacking to take place.The Republican National Committee had strong defense!","rating":6},{"id":811307169043849200,"text":"Yes, it is true - Carlos Slim, the great businessman from Mexico, called me about getting together for a meeting. We met, HE IS A GREAT GUY!","rating":3},{"id":877846483021602800,"text":"Great night in Iowa - special people. Thank you!","rating":2},{"id":1069962093301022700,"text":"The negotiations with China have already started. Unless extended, they will end 90 days from the date of our wonderful and very warm dinner with President Xi in Argentina. Bob Lighthizer will be working closely with Steve Mnuchin, Larry Kudlow, Wilbur Ross and Peter Navarro.....","rating":4},{"id":1007592042124513300,"text":"“Why in the world didn’t Barack Obama fire this guy (Comey)?” asks Mark Levin!","rating":7},{"id":1172887122757525500,"text":"....between our two countries. I look forward to continuing those discussions after the Israeli Elections when we meet at the United Nations later this month!","rating":3},{"id":1126229955677786100,"text":"“The reality is, with the Tariffs, the economy has grown more rapidly in the United States and much more slowly in China.” Peter Morici, Former Chief Economist, USITC","rating":2},{"id":895091395379245000,"text":"Senator Luther Strange has done a great job representing the people of the Great State of Alabama. He has my complete and total endorsement!","rating":3},{"id":1039108838262284300,"text":"If the Democrats had won the Election in 2016, GDP, which was about 1% and going down, would have been minus 4% instead of up 4.2%. I opened up our beautiful economic engine with Regulation and Tax Cuts. Our system was choking and would have been made worse. Still plenty to do!","rating":5},{"id":860479885566980100,"text":"Rather than causing a big disruption in N.Y.C., I will be working out of my home in Bedminster, N.J. this weekend. Also saves country money!","rating":4},{"id":1023646669685104600,"text":"...and the Amazon Washington Post do nothing but write bad stories even on very positive achievements - and they will never change!","rating":8},{"id":994185337504137200,"text":"Congratulations to Mike Dewine on his big win in the Great State of Ohio. He will be a great Governor with a heavy focus on HealthCare and Jobs.  His Socialist opponent in November should not do well, a big failure in last job!","rating":6},{"id":1001103028626346000,"text":"“Sally Yates is part of concerns people have raised about bias in the Justice Dept. I find her actions to be really quite unbelievable.” Jonathan Turley","rating":5},{"id":811560662853939200,"text":"Campaigning to win the Electoral College is much more difficult &amp, sophisticated than the popular vote. Hillary focused on the wrong states!","rating":7},{"id":1014956568129892400,"text":"I have accepted the resignation of Scott Pruitt as the Administrator of the Environmental Protection Agency. Within the Agency Scott has done an outstanding job, and I will always be thankful to him for this. The Senate confirmed Deputy at EPA, Andrew Wheeler, will...","rating":5},{"id":861712617299210200,"text":"Director Clapper reiterated what everybody, including the fake media already knows- there is \"\"no evidence\"\" of collusion w/ Russia and Trump.","rating":6},{"id":813581917215977500,"text":"The DJT Foundation, unlike most foundations, never paid fees, rent, salaries or any expenses. 100% of money goes to wonderful charities!","rating":6},{"id":1230280522363895800,"text":"Heading to Arizona, big rally and big crowd! #MAGA #KAG2020","rating":4},{"id":1169815874988986400,"text":"“I think President Trump is set in his ways because he doesn’t see any weakening. I mean, look at the joblessness report today. What I’m surprised at is how strong the consumer is. I think the Chinese need it (a deal) more than we do. It’s statistical. I just think....","rating":5},{"id":1076586181897474000,"text":"Senate adjourns until December 27th.","rating":3},{"id":1193893631616270300,"text":"So with one Rally by me at the end of the campaign, I lift the poll numbers of Kentucky Governor Matt Bevin by 19 points, he just misses, every other Republican in the Commonwealth wins big, and the Fake News blames me for a bad night! OK! By the way, Mississippi won everything!","rating":6},{"id":1051832118165139500,"text":"On our way to Florida and Georgia!","rating":3},{"id":1262392415513690000,"text":".....mixed about even wanting us to get out. They make a fortune $$$ by having us stay, and except at the beginning, we never really fought to win. We are more of a police force than the mighty military that we are, especially now as rebuilt. No, I am not acting impulsively!","rating":5},{"id":1107335457006866400,"text":"Democrat UAW Local 1112 President David Green ought to get his act together and produce. G.M. let our Country down, but other much better car companies are coming into the U.S. in droves. I want action on Lordstown fast. Stop complaining and get the job done! 3.8% Unemployment!","rating":7},{"id":901190479798313000,"text":"Just arrived at Camp David, where I am monitoring the path and doings of Hurricane Harvey (as it strengthens to a Class 3). 125 MPH winds!","rating":4},{"id":914208123564494800,"text":"The Governor of Puerto Rico, Ricardo Rossello, is a great guy and leader who is really working hard. Thank you Ricky!","rating":3},{"id":819868066364461000,"text":"have been allowed to run - guilty as hell. They were VERY nice to her. She lost because she campaigned in the wrong states - no enthusiasm!","rating":5},{"id":822176438627536900,"text":"Great Concert at 4:00 P.M. today at Lincoln Memorial. Enjoy!","rating":2},{"id":1127710864650514400,"text":"Despite two years and millions of dollars spent, the Democrats are acting like crazed lunatics ever since the results of the Mueller Report were made public. But they knew there was NOTHING even before the Report was started. It is all a big Hoax, the biggest in American history!","rating":8},{"id":821368088935432200,"text":"John Lewis said about my inauguration, \"\"It will be the first one that I've missed.\"\" WRONG (or lie)! He boycotted Bush 43 also because he...","rating":6}]