[{"id":1030091812495654900,"text":"The Boston Globe, which was sold to the the Failing New York Times for 1.3 BILLION DOLLARS (plus 800 million dollars in losses &amp, investment), or 2.1 BILLION DOLLARS, was then sold by the Times for 1 DOLLAR. Now the Globe is in COLLUSION with other papers on free press. PROVE IT!","rating":9},{"id":917114761057357800,"text":"FEMA and first responders are working hard (yet again) on Hurricane Nate. Military helping. Very much under control!","rating":3},{"id":1183369133301391400,"text":".....The Kurds and Turkey have been fighting for many years. Turkey considers the PKK the worst terrorists of all. Others may want to come in and fight for one side or the other. Let them! We are monitoring the situation closely. Endless Wars!","rating":5},{"id":1104091299718811600,"text":"....as Secretary of the Air Force, and I know she will be equally great in the very important world of higher education. A strong thank you to Heather for her service.","rating":2},{"id":1273620783131250700,"text":"....He didn’t want Bolton anywhere near him. Bolton’s dumbest of all statements set us back very badly with North Korea, even now. I asked him, “what the hell were you thinking?” He had no answer and just apologized. That was early on, I should have fired him right then &amp; there!","rating":8},{"id":1040788151000883200,"text":"....GWU Research to tell them how many people had died in Puerto Rico (how would they not know this?). This method was never done with previous hurricanes because other jurisdictions know how many people were killed. FIFTY TIMES LAST ORIGINAL NUMBER - NO WAY!","rating":7},{"id":1130939513268789200,"text":"I am pleased to announce my nomination of Barbara Barrett of Arizona, and former Chairman of the Aerospace Corporation, to be the next Secretary of the Air Force. She will be an outstanding Secretary! #FlyFightWin","rating":3},{"id":1125129024890703900,"text":"“This is not Congressional Oversight, this is bullying.” Jason Riley, The Wall Street Journal","rating":4},{"id":898167282727366700,"text":"Many meetings today in Bedminster including with Secretary Linda M and Small Business. Job numbers are looking great!","rating":2},{"id":1170897587387412500,"text":".....the importance or passage of Criminal Justice Reform. They only talk about the minor players, or people that had nothing to do with it...And the people that so desperately sought my help when everyone else had failed, all they talk about now is Impeaching President Trump!","rating":6},{"id":1062336793998180400,"text":"By the way, when the helicopter couldn’t fly to the first cemetery in France because of almost zero visibility, I suggested driving. Secret Service said NO, too far from airport &amp, big Paris shutdown. Speech next day at American Cemetary in pouring rain! Little reported-Fake News!","rating":8},{"id":1074401243857109000,"text":"“It looks here as though General Flynn’s defenses are incidental to something larger which is for the prosecution to figure out if it can find a path to Donald Trump without quite knowing what that crime might be. It stops looking like prosecution and more looking like......","rating":4},{"id":860635815277453300,"text":"Wow,the Fake News media did everything in its power to make the Republican Healthcare victory look as bad as possible.Far better than Ocare!","rating":7},{"id":817341196251070500,"text":"Hopefully, all supporters, and those who want to MAKE AMERICA GREAT AGAIN, will go to D.C. on January 20th. It will be a GREAT SHOW!","rating":6},{"id":1123987856500887600,"text":"....and deregulation which have produced non-inflationary prosperity for all Americans. I’ve asked Steve to work with me toward future economic growth in our Country.","rating":3},{"id":1068601345949687800,"text":"Great reviews on the USMCA - sooo much better than NAFTA!","rating":5},{"id":1234848619699810300,"text":"Mini Mike Bloomberg can never recover from his incompetent debate performances. Also, as mayor he was very bad under pressure - a choker!","rating":9},{"id":996728397362540500,"text":"Congratulations to Deb Fischer. The people of Nebraska have seen what a great job she is doing - and it showed up at the ballot box! #MAGA","rating":4},{"id":1059870147845017600,"text":"Bob Hugin, successful all of his life, would be a Great Senator from New Jersey. He has my complete and total Endorsement! Get out and Vote for Bob.","rating":3},{"id":946401576381505500,"text":"Vanity Fair, which looks like it is on its last legs, is bending over backwards in apologizing for the minor hit they took at Crooked H. Anna Wintour, who was all set to be Amb to Court of St James’s &amp, a big fundraiser for CH, is beside herself in grief &amp, begging for forgiveness!","rating":8},{"id":1127714988313980900,"text":"The “Constitutional Crisis” is the Democrats refusing to work. Let them start by fixing the mess that their Immigration Laws have caused at the Southern Border.","rating":6},{"id":1003962584352030700,"text":"The Russian Witch Hunt Hoax continues, all because Jeff Sessions didn’t tell me he was going to recuse himself...I would have quickly picked someone else. So much time and money wasted, so many lives ruined...and Sessions knew better than most that there was No Collusion!","rating":7},{"id":894521737534197800,"text":"Working hard from New Jersey while White House goes through long planned renovation. Going to New York next week for more meetings.","rating":3},{"id":1150366822547562500,"text":"A big risk of major flooding in large parts of Louisiana and all across the Gulf Coast. Please be very careful!","rating":2},{"id":1213149807948312600,"text":"....different places that he thought were wasteful, and the career staff, as they always do, pushed back, and made a million excuses as to why they could not possibly stop spending U.S. taxpayer money. There was a back &amp, forth over the legal arguments, &amp, the W.H. decision was....","rating":4},{"id":886321948275429400,"text":"Just got to the #USWomensOpen in Bedminster, New Jersey. People are really happy with record high stock market - up over 17% since election!","rating":5},{"id":1149282693022146600,"text":"Robert Johnson, B.E.T. “I give the President a lot of credit for moving the Economy in a positive direction that’s benefiting a large number of Americans. I think the Tax Cuts clearly helped stimulate the Economy. Overall, if you look at the U.S. Economy, and you look at.....","rating":3},{"id":869902591005741000,"text":"Hopefully Republican Senators, good people all, can quickly get together and pass a new (repeal &amp, replace) HEALTHCARE bill. Add saved $'s.","rating":4},{"id":1126816259851673600,"text":"Tariffs will make our Country MUCH STRONGER, not weaker. Just sit back and watch! In the meantime, China should not renegotiate deals with the U.S. at the last minute. This is not the Obama Administration, or the Administration of Sleepy Joe, who let China get away with “murder!”","rating":9},{"id":887299895803203600,"text":"With only a very small majority, the Republicans in the House &amp, Senate need more victories next year since Dems totally obstruct, no votes!","rating":4},{"id":855406847200768000,"text":"China is very much the economic lifeline to North Korea so, while nothing is easy, if they want to solve the North Korean problem, they will","rating":4},{"id":1168874292626501600,"text":"....And then, think what happens to China when I win. Deal would get MUCH TOUGHER! In the meantime, China’s Supply Chain will crumble and businesses, jobs and money will be gone!","rating":7},{"id":911543222731706400,"text":"Arizona had a 116% increase in ObamaCare premiums last year, with deductibles very high. Chuck Schumer sold John McCain a bill of goods. Sad","rating":6},{"id":1210600561529237500,"text":"....and native culture – S.216/Spokane Tribe, S.256/Native Languages and NDAA Sec. 2870 officially recognizing Little Shell Tribe of Chippewa Indians. My great honor to do so!","rating":3},{"id":1180116404839817200,"text":"“When your making an unsubstantiated statement that the President is making a claim having to do with quid pro quo, this witness has blown a big hole into that statement. The Ambassador put a dagger in the heart of Schiffs fairytale.”  Rep. Lee Zeldin","rating":5},{"id":1071003598023221200,"text":"....Will Robert Mueller’s big time conflicts of interest be listed at the top of his Republicans only Report. Will Andrew Weissman’s horrible and vicious prosecutorial past be listed in the Report. He wrongly destroyed people’s lives, took down great companies, only to be........","rating":6},{"id":1226314556399591400,"text":"...But, just like the people of West Virginia will no longer look at weak &amp; pathetic Joe Manchin the same (I got the Pension Bill approved, Manchin couldn’t do it), the wonderful people of Utah will never look at “grandstander” Mitt Romney with anything but contempt &amp; disgust!","rating":8},{"id":1000152863035805700,"text":"...but complain and obstruct. They made only bad deals (Iran) and their so-called Trade Deals are the laughing stock of the world!","rating":4},{"id":993476979893723100,"text":"Good luck to Ric Grenell, our new Ambassador to Germany. A great and talented guy, he will represent our Country well!","rating":2},{"id":1149693838300024800,"text":"Alex Acosta informed me this morning that he felt the constant drumbeat of press about a prosecution which took place under his watch more than 12 years ago was bad for the Administration, which he so strongly believes in, and he graciously tendered his resignation....","rating":3},{"id":1010166772912320500,"text":"Based on the Tariffs and Trade Barriers long placed on the U.S. and it great companies and workers by the European Union, if these Tariffs and Barriers are not soon broken down and removed, we will be placing a 20% Tariff on all of their cars coming into the U.S. Build them here!","rating":5},{"id":1046733574173544400,"text":"News conference on the USMCA this morning at 11:00 - Rose Garden of White House.","rating":2},{"id":1126834718316683300,"text":"Great Consumer Price Index just out. Really good, very low inflation! We have a great chance to “really rock!” Good numbers all around.","rating":3},{"id":771294347501461500,"text":"Mexico will pay for the wall!","rating":8},{"id":1021755112128172000,"text":"Heading to Missouri to be with many of my great friends. VFW here we come!","rating":3},{"id":917030148867682300,"text":"...Hence, I would fully expect Corker to be a negative voice and stand in the way of our great agenda. Didn't have the guts to run!","rating":6},{"id":1025092358126362600,"text":"Looking forward to being in the Great State of Pennsylvania where we had a tremendous victory in the Election. Will be campaigning hard for an original supporter, Lou Barletta, to replace a weak an ineffective Senator, Bob Casey. Lou is tough and smart, loves PA and our Country!","rating":4},{"id":932397369655808000,"text":"Big-game trophy decision will be announced next week but will be very hard pressed to change my mind that this horror show in any way helps conservation of Elephants or any other animal.","rating":5},{"id":1229790563668504600,"text":"“Judge Jackson now has a request for a new trial based on the unambiguous &amp; self outed bias of the foreperson of the jury, whose also a lawyer, by the way. ‘Madam foreperson, you’re a lawyer, you have a duty, an affirmative obligation, to reveal to us when we selected you the....","rating":4},{"id":1058553398172237800,"text":"Scott Perry of Pennsylvania is fantastic. He is strong on the Border, Crime, the Military, our Vets and the Second Amendment. Scott has my Total Endorsement!","rating":3},{"id":805538149157969900,"text":"Did China ask us if it was OK to devalue their currency (making it hard for our companies to compete), heavily tax our products going into..","rating":7},{"id":874578159676665900,"text":"Well, as predicted, the 9th Circuit did it again - Ruled against the TRAVEL BAN at such a dangerous time in the history of our country. S.C.","rating":6},{"id":931223807037263900,"text":"Need all on the UN Security Council to vote to renew the Joint Investigative Mechanism for Syria to ensure that Assad Regime does not commit mass murder with chemical weapons ever again.","rating":4},{"id":968620661349470200,"text":"Texas LC George P. Bush backed me when it wasn’t the politically correct thing to do, and I back him now. Also, AC Sid Miller has been with me from the beginning, he is “Trump’s Man in Texas.” Also support Comptroller Glenn Hegar, and Railroad Commissioner Christi Craddick.","rating":5},{"id":913554705816711200,"text":"Puerto Rico is devastated. Phone system, electric grid many roads, gone. FEMA and First Responders are amazing. Governor said \"\"great job!\"\"","rating":5},{"id":816620855958601700,"text":"Julian Assange said \"\"a 14 year old could have hacked Podesta\"\" - why was DNC so careless? Also said Russians did not give him the info!","rating":8},{"id":1308767772659327000,"text":"Bay of Pigs Veterans &amp; Hispanic Heritage Remarks as past honoree. White House East Room. 11 AM. Thank you!","rating":3},{"id":1011819474574561300,"text":"Big and conclusive win by Mitt Romney. Congratulations! I look forward to working together - there is so much good to do. A great and loving family will be coming to D.C.","rating":3},{"id":986218870506754000,"text":"Looks like Jerry Brown and California are not looking for safety and security along their very porous Border. He cannot come to terms for the National Guard to patrol and protect the Border. The high crime rate will only get higher. Much wanted Wall in San Diego already started!","rating":7},{"id":1172134260418986000,"text":"Some really big Court wins on the Border lately!","rating":3},{"id":852297762599313400,"text":"Economic confidence is soaring as we unleash the power of private sector job creation and stand up for the American Workers. #AmericaFirst","rating":3},{"id":1156153429171085300,"text":"Despite the Democrats wanting very unsafe Open Borders &amp, refusing to change the Loopholes &amp, Asylum, tremendous progress is being made the the Southern Border. We all waited because we assumed the Dems would ultimately be forced to change the horrible Immigration Laws.They didn’t!","rating":5},{"id":1171590284544827400,"text":"I am pleased to endorse Governor Mike Parson of Missouri. He is very Popular, Strong, and knows what he is doing – he gets it! Based on the fact that Mike has announced he will run again in 2020 for Governor, Mike Parson has my Complete and Total Endorsement!","rating":2},{"id":1181940389990805500,"text":"President Obama said that he did not have the right to sign DACA, that it will never hold up in court. He signed it anyway! If the Supreme Court upholds DACA, it gives the President extraordinary powers, far greater than ever thought. If they do what is right and do not let......","rating":4},{"id":869166145894535200,"text":"North Korea has shown great disrespect for their neighbor, China, by shooting off yet another ballistic missile...but China is trying hard!","rating":6},{"id":871677472202477600,"text":"The Justice Dept. should ask for an expedited hearing of the watered down Travel Ban before the Supreme Court - &amp, seek much tougher version!","rating":7},{"id":1003617811254710300,"text":"China already charges a tax of 16% on soybeans. Canada has all sorts of trade barriers on our Agricultural products. Not acceptable!","rating":6},{"id":819155311793700900,"text":"Russia just said the unverified report paid for by political opponents is \"\"A COMPLETE AND TOTAL FABRICATION, UTTER NONSENSE.\"\" Very unfair!","rating":8},{"id":1037081791599915000,"text":"Paul Cook is a decorated Marine Corps Veteran who loves and supports our Military and Vets. He is Strong on Crime, the Border, and supported Tax Cuts for the people of California. Paul has my total and complete Endorsement!","rating":2},{"id":1201401098571001900,"text":"Great writer and historian, Doug Wead, has written a true (not Fake News) account of what is going on in Washington and the White House. His new book, INSIDE TRUMP’S WHITE HOUSE, is an incredible description of a very exciting and successful time in our Country’s history. Buy it!","rating":5},{"id":1191359986900840400,"text":"Many people say they know me, claiming to be “best friends” and really close etc., when I don’t know these people at all. This happens, I suppose, to all who become President. With that being stated, I don’t know, to the best of my knowledge, a man named Michael Esposito.....","rating":6},{"id":804333718999539700,"text":"My thoughts and prayers are with those affected by the tragic storms and tornadoes in the Southeastern United States. Stay safe!","rating":2},{"id":258262904091058180,"text":"The Coca Cola company is not happy with me--that's okay, I'll still keep drinking that garbage.","rating":9},{"id":1171118506089361400,"text":"A lot of Fake News is being reported that I overruled the VP and various advisers on a potential Camp David meeting with the Taliban. This Story is False! I always think it is good to meet and talk, but in this case I decided not to. The Dishonest Media likes to create...","rating":5},{"id":1019533312052858900,"text":"Congratulations to Martha Roby of The Great State of Alabama on her big GOP Primary win for Congress. My endorsement came appropriately late, but when it came the “flood gates” opened and you had the kind of landslide victory that you deserve. Enjoy!","rating":3},{"id":817329823374831600,"text":"The dishonest media does not report that any money spent on building the Great Wall (for sake of speed), will be paid back by Mexico later!","rating":8},{"id":1232155595438018600,"text":"....on all Trump, or Trump related, matters! While “elections have consequences”, I only ask for fairness, especially when it comes to decisions made by the United States Supreme Court!","rating":4},{"id":817882028272128000,"text":"Congratulation to Jane Timken on her major upset victory in becoming the Ohio Republican Party Chair. Jane is a loyal Trump supporter &amp, star","rating":3},{"id":1024644767924334600,"text":".....remain in the FBI while he himself was being investigated. This is a real issue. It won’t go into a Mueller Report because Mueller is going to protect these guys. Mueller has an interest in creating the illusion of objectivity around his investigation.” ALAN DERSHOWITZ....","rating":4},{"id":1025840837358432300,"text":"Heading to Ohio!","rating":1},{"id":998528928259170300,"text":"China must continue to be strong &amp, tight on the Border of North Korea until a deal is made. The word is that recently the Border has become much more porous and more has been filtering in. I want this to happen, and North Korea to be VERY successful, but only after signing!","rating":5},{"id":1181913137483829200,"text":"....No Pressure at all said Ukraine! Very congenial, a perfect call. The Whistleblower and others spoke BEFORE seeing the Transcript. Now they must apologize to me and stop this ridiculous impeachment!","rating":7},{"id":1266711221836931000,"text":"....got too frisky or out of line, they would quickly come down on them, hard - didn’t know what hit them. The front line was replaced with fresh agents, like magic. Big crowd, professionally organized, but nobody came close to breaching the fence. If they had they would....","rating":6},{"id":757773671545045000,"text":"Sad to watch Bernie Sanders abandon his revolution. We welcome all voters who want to fix our rigged system and bring back our jobs.","rating":4},{"id":1002027245131661300,"text":"“The recusal of Jeff Sessions was an unforced betrayal of the President of the United States.” JOE DIGENOVA, former U.S. Attorney.","rating":3},{"id":1006619872367804400,"text":"I strongly endorse Adam Laxalt for Governor of Nevada. Adam is smart, works hard, and knows how to win. He will be a great Governor. Also, will fight hard to lower your taxes and is tough on crime!","rating":3},{"id":842506649122279400,"text":"My representatives had a great meeting w/ the Hispanic Chamber of Commerce at the WH today. Look forward to tremendous growth &amp, future mtgs!","rating":2},{"id":1238626531510976500,"text":"....the health and well-being of American families FIRST. Look forward to signing the final Bill, ASAP!","rating":1},{"id":1038437927506923500,"text":"Dave Hughes is running for Congress in the Great State of Minnesota. He will help us accomplish our America First policies, is strong on Crime, the Border, our 2nd Amendmen, Trade, Military and Vets. Running against Pelosi Liberal Puppet Petterson. Dave has my Total Endorsement!","rating":4},{"id":1189505264376000500,"text":"Republicans are very unified and energized in our fight on the Impeachment Hoax with the Do Nothing Democrats, and now  are starting to go after the Substance even more than the very infair Process because just a casual reading of the Transcript leads EVERYBODY to see that.....","rating":6},{"id":1181560772255719400,"text":"....to see. Importantly, Ambassador Sondland’s tweet, which few report, stated, “I believe you are incorrect about President Trump’s intentions. The President has been crystal clear: no quid pro quo’s of any kind.” That says it ALL!","rating":6},{"id":1152211072851619800,"text":"....but it is no thanks to the Federal Reserve. Had they not acted so fast and “so much,” we would be doing even better than we are doing right now. This is our chance to build unparalleled wealth and success for the U.S., GROWTH, which would greatly reduce % debt. Don’t blow it!","rating":5},{"id":1039875785853681700,"text":"Hurricane Florence may now be dipping a bit south and hitting a portion of the Great State of Georgia. Be ready, be prepared!","rating":3},{"id":962326008127946800,"text":"Jobless claims have dropped to a 45 year low!","rating":2},{"id":1073945393313013800,"text":".......The Trump Administration will be announcing the new Secretary of the Interior next week.","rating":1},{"id":1073703746432049200,"text":"....I look forward to working with him in this new capacity as we continue to MAKE AMERICA GREAT AGAIN! John will be staying until the end of the year. He is a GREAT PATRIOT and I want to personally thank him for his service!","rating":2},{"id":908413134196572200,"text":"...I told Republicans to approve healthcare fast or this would happen. But don't worry, I will veto because I love our country &amp, its people.","rating":7},{"id":1169948497241677800,"text":"DACA will be going before the Supreme Court. It is a document that even President Obama didn’t feel he had the legal right to sign - he signed it anyway! Rest assured that if the SC does what all say it must, based on the law, a bipartisan deal will be made to the benefit of all!","rating":4},{"id":1149283449196417000,"text":"The Fake News Media loves the narrative that I didn’t use many banks because the banks didn’t like me. No, I didn’t use many banks because I didn’t (don’t) need their money (old fashioned, isn’t it?). If I did, it would have been very easy for me to get.","rating":8},{"id":1029069948214288400,"text":"Just landed at Fort Drum, New York. Looking forward to making a speech about our GREAT HEROES!","rating":3},{"id":1041358333146525700,"text":"FEMA, First Responders and Law Enforcement are working really hard on hurricane Florence. As the storm begins to finally recede, they will kick into an even higher gear. Very Professional!","rating":3},{"id":913004378486984700,"text":"We will have the votes for Healthcare but not for the reconciliation deadline of Friday, after which we need 60. Get rid of Filibuster Rule!","rating":4},{"id":1144029093358235600,"text":"....They came to me asking for help, and I got Criminal Justice Reform passed, with help from both Republicans and Democrats. Many said that nobody but President Trump could have done this. All previous administrations failed. Please ask why THEY failed to the candidates!","rating":5},{"id":1201458758934782000,"text":"U.S. Markets are up as much as 21% since the announcement of Tariffs on 3/1/2018 - and the U.S. is taking in massive amounts of money (and giving some to our farmers, who have been targeted by China)!","rating":4},{"id":889794300913045500,"text":"Big day for HealthCare. After 7 years of talking, we will soon see whether or not Republicans are willing to step up to the plate!","rating":4},{"id":811778176120668200,"text":"I met some really great Air Force GENERALS and Navy ADMIRALS today, talking about airplane capability and pricing. Very impressive people!","rating":3},{"id":918432809282342900,"text":"...We cannot keep FEMA, the Military &amp, the First Responders, who have been amazing (under the most difficult circumstances) in P.R. forever!","rating":6},{"id":1194605354484715500,"text":"“Nancy Pelosi cares more about power than she does about principle. She did not want to go down this road. She realizes this is a huge loser for Democrats. The Founders envisioned the worst people being in politics, yet they couldn’t envision this. You have these people taking...","rating":6},{"id":1216716358676861000,"text":"....and, if Republicans win in court and take back the House of Represenatives, your healthcare, that I have now brought to the best place in many years, will become the best ever, by far. I will always protect your Pre-Existing Conditions, the Dems will not!","rating":5},{"id":911549099752804400,"text":"Alaska had a 200% plus increase in premiums under ObamaCare, worst in the country. Deductibles high, people angry! Lisa M comes through.","rating":4},{"id":1076091862673436700,"text":"House Republican Vote, 217-185.","rating":2},{"id":1187704353324503000,"text":"So Congressman Tim Ryan of Ohio has finally dropped out of the race for President, registering ZERO in the polls &amp, unable to even qualify for the debate stage. See Tim, it’s not so easy out there if you don’t know what you’re doing. He wasn’t effective for USA workers, just talk!","rating":6},{"id":986218867780448300,"text":"I am in Florida and looking forward to my meeting with Prime Minister Abe of Japan. Working on Trade and Military Security.","rating":3},{"id":1263124876174426000,"text":"....beaten Sleepy Joe in a LANDSLIDE, every State, if these events didn’t happen. Even if Warren just dropped out, he would have easily won. Dems did it to him with Crooked Hillary and now, even more so...and Bernie doesn’t even complain. VOTE for Trump on TRADE, better than BS!","rating":7},{"id":1051811228362920000,"text":"Will be leaving for Florida and Georgia with the First Lady to tour the hurricane damage and visit with FEMA, First Responders and Law Enforcement. Maximum effort is taking place, everyone is working very hard. Worst hit in 50 years!","rating":3},{"id":347191326112112640,"text":"Do you think Putin will be going to The Miss Universe Pageant in November in Moscow - if so, will he become my new best friend?","rating":8},{"id":893243147580473300,"text":"Just arrived in West Virginia for a MAKE AMERICA GREAT AGAIN rally in Huntington at 7:00pmE. Massive crowd expected - tune in! #MAGA🇺🇸","rating":4},{"id":1090957015038545900,"text":"....China’s representatives and I are trying to do a complete deal, leaving NOTHING unresolved on the table. All of the many problems are being discussed and will be hopefully resolved. Tariffs on China increase to 25% on March 1st, so all working hard to complete by that date!","rating":3},{"id":1010503423773507600,"text":"“Disability applications plunge as economy strengthens”  Failing New York Times","rating":5},{"id":1010163024173457400,"text":"Hope OPEC will increase output substantially. Need to keep prices down!","rating":4},{"id":984066131303583700,"text":"Speaker Paul Ryan is a truly good man, and while he will not be seeking re-election, he will leave a legacy of achievement that nobody can question. We are with you Paul!","rating":4},{"id":972538115901608000,"text":"Heading to Moon Township, Pennsylvania, to be with a really good person, State Representative Rick Saccone, who is running for Congress. Big &amp, happy crowd (why not, some of the best economic numbers ever). Rick will help me a lot. Also, tough on crime &amp, border. Loves 2nd A &amp, VETS","rating":3},{"id":1189914333842681900,"text":"People are VERY disappointed in Jay Powell and the Federal Reserve. The Fed has called it wrong from the beginning, too fast, too slow. They even tightened in the beginning. Others are running circles around them and laughing all the way to the bank. Dollar &amp, Rates are hurting...","rating":6},{"id":1041493551446675500,"text":"Consumer Sentiment hit its highest level in 17 years this year. Sentiment fell 11% in 2015, an Obama year, and rose 16% since the Election, #TrumpTime!","rating":3},{"id":1180240498478534700,"text":"Under my Administration, Medicare Advantage premiums next year will be their lowest in the last 13 years. We are providing GREAT healthcare to our Seniors. We cannot let the radical socialists take that away through Medicare for All!","rating":5},{"id":1053074465150578700,"text":"Will be landing soon. Looking forward to seeing our next Senator from Montana, Matt Rosendale. He will represent our Country well, far better than Jon Tester who will vote with Cryin’ Chuck Schumer and Nancy Pelosi - never with us!","rating":6},{"id":926238774773862400,"text":"Great Tax Cut rollout today. The lobbyists are storming Capital Hill, but the Republicans will hold strong and do what is right for America!","rating":4},{"id":1172120964232093700,"text":"European Central Bank, acting quickly, Cuts Rates 10 Basis Points. They are trying, and succeeding, in depreciating the Euro against the VERY strong Dollar, hurting U.S. exports.... And the Fed sits, and sits, and sits. They get paid to borrow money, while we are paying interest!","rating":5},{"id":1188048258255540200,"text":"..the President when Flynn had been cleared of everything long before that. The DOJ is withholding a lot of evidence &amp, information, as are Clapper &amp, Brennan &amp, all of the people who participated in the complete setup of Michael Flynn.”(Terrible!) Sidney Powell. This is a disgrace!","rating":7},{"id":1025093306664009700,"text":"When the House and Senate meet on the very important Farm Bill – we love our farmers - hopefully they will be able to leave the WORK REQUIREMENTS FOR FOOD STAMPS PROVISION that the House approved. Senate should go to 51 votes!","rating":3},{"id":1031747927511916500,"text":"Will be going to the Great State of West Virginia on Tuesday Night to campaign &amp, do a Rally Speech for a hard working and spectacular person, A.G. Patrick Morrisey, who is running for the U.S. Senate. Patrick has great Energy &amp, Stamina-I need his VOTE to MAGA. Total Endorsement!","rating":4},{"id":1169246982508073000,"text":"“U.S. Winning Trade War With China In Dollars.” CNBC","rating":3},{"id":1291864496571666400,"text":"...We will be having a conference call on Sunday with President Macron, leaders of Lebanon, and leaders from various other parts of the world. Everyone wants to help!","rating":2},{"id":1182290380542185500,"text":"Why isn’t the IG investigating his so-called Whistleblower? All bad info!","rating":5},{"id":845974102619906000,"text":"Democrats are smiling in D.C. that the Freedom Caucus, with the help of Club For Growth and Heritage, have saved Planned Parenthood &amp, Ocare!","rating":6},{"id":1303368660736598000,"text":"....Like I did in the 2016 Primaries, if more money is needed, which I doubt it will be, I will put it up!","rating":3},{"id":1243534445367492600,"text":"...&amp; costly. Workers &amp; small businesses need money now in order to survive. Virus wasn’t their fault. It is “HELL” dealing with the Dems, had to give up some stupid things in order to get the “big picture” done. 90% GREAT! WIN BACK HOUSE, but throw Massie out of Republican Party!","rating":8},{"id":861592420043157500,"text":"Ask Sally Yates, under oath, if she knows how classified information got into the newspapers soon after she explained it to W.H. Counsel.","rating":5},{"id":856171332521820200,"text":"The Democrats don't want money from budget going to border wall despite the fact that it will stop drugs and very bad MS 13 gang members.","rating":6},{"id":908272007011283000,"text":"No deal was made last night on DACA. Massive border security would have to be agreed to in exchange for consent. Would be subject to vote.","rating":4},{"id":1029105967068323800,"text":"Pete Stauber is running for Congress in Minnesota. He will make for a great Congressman. Pete is strong on crime and borders, loves our Military, Vets and Second Amendment. Vote for Pete tomorrow. He has my full and total Endorsement!","rating":3},{"id":848219027659010000,"text":"..not associated with Russia. Trump team spied on before he was nominated.\"\" If this is true, does not get much bigger. Would be sad for U.S.","rating":6},{"id":1155807406812782600,"text":"The E.U. and China will further lower interest rates and pump money into their systems, making it much easier for their manufacturers to sell product. In the meantime, and with very low inflation, our Fed does nothing - and probably will do very little by comparison. Too bad!","rating":5},{"id":843779892776964100,"text":"The real story that Congress, the FBI and all others should be looking into is the leaking of Classified information. Must find leaker now!","rating":4},{"id":996119678551552000,"text":"ZTE, the large Chinese phone company, buys a big percentage of individual parts from U.S. companies. This is also reflective of the larger trade deal we are negotiating with China and my personal relationship with President Xi.","rating":2},{"id":1140647726209781800,"text":"“Iran to defy Uranium Stockpile Limits”","rating":1},{"id":1115593488656212000,"text":"....I got along very well with Jerry during the zoning and building process. Then I changed course (slightly), became President, and now I am dealing with Congressman Nadler again. Some things never end, but hopefully it will all go well for everyone. Only time will tell!","rating":5},{"id":1159590033764049000,"text":"....coincides with the retirement of Dan Coats. A new Acting Director of National Intelligence will be named shortly.","rating":1},{"id":860637673744195600,"text":"Why is it that the Fake News rarely reports Ocare is on its last legs and that insurance companies are fleeing for their lives? It's dead!","rating":7},{"id":1195337873882583000,"text":"......filth pouring into the Pacific Ocean is rapidly becoming an environmental hazard, is getting NOTHING DONE. She is a Do Nothing Democrat as Speaker, and will hopefully not be in that position very long. Approve USMCA, which has been sitting on her desk for months!","rating":8},{"id":1034371152204968000,"text":"Google search results for “Trump News” shows only the viewing/reporting of Fake New Media. In other words, they have it RIGGED, for me &amp, others, so that almost all stories &amp, news is BAD. Fake CNN is prominent. Republican/Conservative &amp, Fair Media  is shut out. Illegal?  96% of...","rating":9},{"id":1058829182275412000,"text":"In all the time I’ve been President, almost two years, never once did Senator Bill Nelson call me to ask for help for the Great State of Florida. I never see him until election time....","rating":4},{"id":1174388901806362600,"text":"Jay Powell and the Federal Reserve Fail Again. No “guts,” no sense, no vision!  A terrible communicator!","rating":6},{"id":853771244579283000,"text":"The recent Kansas election (Congress) was a really big media event, until the Republicans won. Now they play the same game with Georgia-BAD!","rating":5},{"id":861713823505494000,"text":"The Russia-Trump collusion story is a total hoax, when will this taxpayer funded charade end?","rating":7},{"id":906133573400481800,"text":"Hurricane Irma is of epic proportion, perhaps bigger than we have ever seen. Be safe and get out of its way,if possible. Federal G is ready!","rating":3},{"id":999258232110579700,"text":"Big legislation will be signed by me shortly. After many years, RIGHT TO TRY and big changes to DODD FRANK.","rating":4},{"id":810288321880555500,"text":"We should tell China that we don't want the drone they stole back.- let them keep it!","rating":8},{"id":816068355555815400,"text":"China has been taking out massive amounts of money &amp, wealth from the U.S. in totally one-sided trade, but won't help with North Korea. Nice!","rating":6},{"id":860987464114110500,"text":"The reason I am staying in Bedminster, N. J., a beautiful community, is that staying in NYC is much more expensive and disruptive. Meetings!","rating":2},{"id":1238626530361847800,"text":"....the Secretary of the Treasury and the Secretary of Labor to issue regulations that will provide flexibility so that in no way will Small Businesses be hurt. I encourage all Republicans and Democrats to come together and VOTE YES! I will always put....","rating":3},{"id":1178477538177425400,"text":"....Election, and negate the votes of millions of Evangelicals in the process. They know the only Impeachable offense that President Trump has committed was beating Hillary Clinton in 2016. That’s the unpardonable sin for which the Democrats will never forgive him.....","rating":7},{"id":1258803460394360800,"text":"....must read for anybody looking for U.S. Security and Protection. Go get it now and make Tom a Top Best Seller — he deserves it!","rating":2},{"id":1035718119459893200,"text":"Great day in North Carolina where Republicans will do very well!","rating":4},{"id":1054588738641178600,"text":"Congressman Erik Paulsen of the Great State of Minnesota has done a fantastic job in cutting Taxes and Job Killing Regulations. Hard working and very smart. Keep Erik in Congress. He has my Strong Endorsement!","rating":3},{"id":1137568536690344000,"text":"....other than to know he was, and is, a total Loser. When he makes statements about me, they are made up, he knows nothing!","rating":8},{"id":1198746376420679700,"text":"....contracting procedures were not addressed to my satisfaction. Therefore, Secretary of the Navy Richard Spencer’s services have been terminated by Secretary of Defense Mark Esper. I thank Richard for his service &amp, commitment. Eddie will retire peacefully with all of the.....","rating":4},{"id":1054451954397667300,"text":"The Fake News Media has been talking about recent approval ratings of me by countries around the world, including the European Union, as being very low....","rating":6},{"id":1206278870124630000,"text":"A PERFECT phone call. “Can you do us (not me. Us is referring to our Country) a favor.” Then go on to talk about “Country” and “U.S. Attorney General.” The Impeachment Hoax is just a continuation of the Witch Hunt which has been going on for 3 years. We will win!  #MAGAKAG #2020","rating":8},{"id":821369651968012300,"text":"\"\"thought it would be hypocritical to attend Bush's swearing-in....he doesn't believe Bush is the true elected president.\"\" Sound familiar! WP","rating":6},{"id":1032259660378779600,"text":"A large number of counts, ten, could not even be decided in the Paul Manafort case. Witch Hunt!","rating":8},{"id":1047487803746074600,"text":"Blowout numbers on New Jobs and, separately, Services. Market up!","rating":5},{"id":1169981017794535400,"text":"The Fake News Media was fixated on the fact that I properly said, at the beginnings of Hurricane Dorian, that in addition to Florida &amp, other states, Alabama may also be grazed or hit. They went Crazy, hoping against hope that I made a mistake (which I didn’t). Check out maps.....","rating":9},{"id":1131714257308012500,"text":"The U.S. Senate has just approved a 19 Billion Dollar Disaster Relief Bill, with my total approval. Great!","rating":4},{"id":1131138360125399000,"text":"The Democrats are getting ZERO work done in Congress. All they are focused on is trying to prove the Mueller Report wrong, the Witch Hunt!","rating":7},{"id":1029724286121074700,"text":"It is about time that Connecticut had a real and talented Governor. Bob Stefanowski is the person needed to do the job. Tough on crime, Bob is also a big cutter of Taxes. He will win in November and make a Great Governor, a major difference maker. Bob has my total Endorsement!","rating":3},{"id":1130535532868571100,"text":"Fred Keller of the Great State of Pennsylvania has been an outstanding State Representative. Now he is running as the Republican Nominee for Congress, and has my Complete and Total Endorsement. He will do a fantastic job - I look forward to seeing everyone tonight! #MAGA","rating":2},{"id":900694112940290000,"text":"I requested that Mitch M &amp, Paul R tie the Debt Ceiling legislation into the popular V.A. Bill (which just passed) for easy approval. They...","rating":6},{"id":1036637078640058400,"text":"Richard Trumka, the head of the AFL-CIO, represented his union poorly on television this weekend. Some of the things he said were so against the working men and women of our country, and the success of the U.S. itself, that it is easy to see why unions are doing so poorly. A Dem!","rating":6},{"id":856172056932700200,"text":"Eventually, but at a later date so we can get started early, Mexico will be paying, in some form, for the badly needed border wall.","rating":10},{"id":1123287154833203200,"text":"....up like a rocket if we did some lowering of rates, like one point, and some quantitative easing. Yes, we are doing very well at 3.2% GDP, but with our wonderfully low inflation, we could be setting major records &amp,, at the same time, make our National Debt start to look small!","rating":5},{"id":1006832813499269100,"text":"My political representatives didn’t want me to get involved in the Mark Sanford primary thinking that Sanford would easily win - but with a few hours left I felt that Katie was such a good candidate, and Sanford was so bad, I had to give it a shot. Congrats to Katie Arrington!","rating":4},{"id":928016742575738900,"text":"Thank you to all Americans who participated in Nat'l Rx Drug Take Back Day. A record amount of drugs collected &amp, disposed. We can do this!","rating":2},{"id":1293141672440877000,"text":"....went on at the White House during some extremely interesting and important times. So many good stories by someone who, unlike most other so called writers, was actually there, and a part of the action - of which there was plenty. Go buy this book, a job well done!","rating":3},{"id":1136183958876692500,"text":"House Democrats, fresh off a Republican victory against them (in Federal Court) on the Wall,  keep asking people to come and testify regarding the No Collusion Witch Hunt. They are very unhappy with the Mueller Report, especially with his corrective letter, &amp, now want a Do Over!","rating":6},{"id":1237813728558678000,"text":"....Together we are putting into policy a plan to prevent, detect, treat and create a vaccine against CoronaVirus to save lives in America and the world. America will get it done!","rating":3},{"id":1053658596712431600,"text":"Get out and Early Vote for Brian Kemp. He will be a GREAT GOVERNOR for the State of Georgia!","rating":2},{"id":1175766528743968800,"text":"“The real story involves Hunter Biden going around the world and collecting large payments from foreign governments and foreign oligarchs.” Peter Schweizer  Laura Ingraham Hunter made a fortune in Ukraine and in China. He knew nothing about Energy, or anything else.","rating":6},{"id":922828476872319000,"text":"Sen. Corker is the incompetent head of the Foreign Relations Committee, &amp, look how poorly the U.S. has done. He doesn't have a clue as.....","rating":7},{"id":757777369272815600,"text":"Bernie Sanders totally sold out to Crooked Hillary Clinton. All of that work, energy and money, and nothing to show for it! Waste of time.","rating":8},{"id":860573284462669800,"text":"Of course the Australians have better healthcare than we do --everybody does. ObamaCare is dead! But our healthcare will soon be great.","rating":8},{"id":918772522983874600,"text":"The Democrats ObamaCare is imploding. Massive subsidy payments to their pet insurance companies has stopped. Dems should call me to fix!","rating":7},{"id":912079629648883700,"text":"Alaska, Arizona, Maine and Kentucky are big winners in the Healthcare proposal. 7 years of Repeal &amp, Replace and some Senators not there.","rating":6},{"id":931355543096234000,"text":"Big win today in the House for GOP Tax Cuts and Reform, 227-205. Zero Dems, they want to raise taxes much higher, but not for our military!","rating":5},{"id":1025920076279627800,"text":"...Danny O’Connor is a total puppet for Nancy Pelosi and Maxine Waters – Danny wants to raise your taxes, open your borders, and take away your 2nd Amendment. Vote for Troy on Tuesday!","rating":7},{"id":856233279841849300,"text":"New polls out today are very good considering that much of the media is FAKE and almost always negative. Would still beat Hillary in .....","rating":9},{"id":1034373707047882800,"text":"....results on “Trump News” are from National Left-Wing Media, very dangerous. Google &amp, others are suppressing voices of Conservatives and hiding information and news that is good. They are controlling what we can &amp, cannot see. This is a very serious situation-will be addressed!","rating":9},{"id":1057714919766925300,"text":"Yesterday in Pittsburgh I was really impressed with Congressman Keith Rothfus (far more so than any other local political figure). His sincere level of compassion, grief and sorrow for the events that took place was, in its own way, very inspiring. Vote for Keith!","rating":4},{"id":890207082926022700,"text":"Why didn't A.G. Sessions replace Acting FBI Director Andrew McCabe, a Comey friend who was in charge of Clinton investigation but got....","rating":6},{"id":1169637649151406000,"text":"After almost 3 years in my Administration, Jason Greenblatt will be leaving to pursue work in the private sector. Jason has been a loyal and great friend and fantastic lawyer....","rating":3},{"id":1171735691769929700,"text":"The Federal Reserve should get our interest rates down to ZERO, or less, and we should then start to refinance our debt. INTEREST COST COULD BE BROUGHT WAY DOWN, while at the same time substantially lengthening the term. We have the great currency, power, and balance sheet.....","rating":6},{"id":868799536420065300,"text":"Big win in Montana for Republicans!","rating":3},{"id":1022251602449756200,"text":"Sergio Marchionne, who passed away today, was one of the most brilliant &amp, successful car executives since the days of the legendary Henry Ford. It was a great honor for me to get to know Sergio as POTUS, he loved the car industry, and fought hard for it. He will be truly missed!","rating":2},{"id":868047612301148200,"text":"Getting ready to engage G7 leaders on many issues including economic growth, terrorism, and security.","rating":3},{"id":918808798059483100,"text":"The wonderful people of Puerto Rico, with their unmatched spirit, know how bad things were before the H's. I will always be with them!","rating":5},{"id":912994446219898900,"text":"Spoke to Roy Moore of Alabama last night for the first time. Sounds like a really great guy who ran a fantastic race. He will help to #MAGA!","rating":5},{"id":742771576039460900,"text":"Thank you to the LGBT community! I will fight for you while Hillary brings in more people that will threaten your freedoms and beliefs.","rating":7},{"id":757918002339778600,"text":"Why aren't the Democrats speaking about ISIS, bad trade deals, broken borders, police and law and order. The Republican Convention was great","rating":4},{"id":897221868784169000,"text":"Leaving for New York City and meetings on military purchases and trade.","rating":2},{"id":804884532671430700,"text":"Rexnord of Indiana is moving to Mexico and rather viciously firing all of its 300 workers. This is happening all over our country. No more!","rating":8},{"id":1182286414353981400,"text":"....the area and start a new war all over again. Turkey is a member of NATO. Others say STAY OUT, let the Kurds fight their own battles (even with our financial help). I say hit Turkey very hard financially &amp, with sanctions if they don’t play by the rules! I am watching closely.","rating":7},{"id":906136682952568800,"text":"...never allow the Republicans to pass even great legislation. 8 Dems control - will rarely get 60 (vs. 51) votes. It is a Repub Death Wish!","rating":6},{"id":1053684769991454700,"text":"Heading to Nevada to help a man who has become a good friend, Senator Dean Heller. He is all about #MAGA and I need his Help and Talent in Washington. Also, Adam Laxalt will be a GREAT GOVERNOR, and has my complete and total Endorsement. Winners Both!","rating":3},{"id":815973752785793000,"text":"Chicago murder rate is record setting - 4,331 shooting victims with 762 murders in 2016. If Mayor can't do it he must ask for Federal help!","rating":8},{"id":1169412198692733000,"text":"....facts, and that should terrify every American regardless of their political stripe. The idea that all of that information hasn’t already been revealed shows how dastardly these people are, and how terrified they are about what’s going to happen when that....","rating":5},{"id":812408189492797400,"text":"slaughter you. This is a purely religious threat, which turned into reality. Such hatred! When will the U.S., and all countries, fight back?","rating":8},{"id":1185219643432231000,"text":"....I have just been notified that some European Nations are now willing, for the first time, to take the ISIS Fighters that came from their nations. This is good news, but should have been done after WE captured them. Anyway, big progress being made!!!!","rating":4},{"id":953984671674662900,"text":"CHIP should be part of a long term solution, not a 30 Day, or short term, extension!","rating":2},{"id":1041628201435521000,"text":"“A lot of small &amp, medium size enterprises are registering very good profit, sometimes record profits-there stocks are doing very well, low income workers are getting big raises. There are an awful lot of good things going on that weren’t during Pres. Obama’s Watch.” Peter Morici","rating":3},{"id":914216744385904600,"text":"To the people of Puerto Rico:Do not believe the #FakeNews!#PRStrong🇵🇷","rating":6},{"id":1114207016032002000,"text":"Congratulations to Brian Hagedorn on his big surprise win over a well funded Liberal Democrat in the Great State of Wisconsin for a very important Supreme Court seat. Republicans are producing big for Wisconsin!","rating":4},{"id":1024060659594670100,"text":"...that Open Borders, large scale Crime, and abolishing ICE is good for them, we must get smart and finally do what must be done for the Safety and Security of our Country!","rating":5},{"id":1057254051254014000,"text":"“If the Fed backs off and starts talking a little more Dovish, I think we’re going to be right back to our 2,800 to 2,900 target range that we’ve had for the S&amp,P 500.” Scott Wren, Wells Fargo.","rating":3},{"id":812266152684650500,"text":"my presidency. Isn't this a ridiculous shame? He loves these kids, has raised millions of dollars for them, and now must stop. Wrong answer!","rating":7},{"id":927847349648609300,"text":"Stock market hit yet another all-time record high yesterday. There is great confidence in the moves that my Administration....","rating":3},{"id":1040783519423914000,"text":"“When Trump visited the island territory last October, OFFICIALS told him in a briefing 16 PEOPLE had died from Maria.” The Washington Post. This was long AFTER the hurricane took place. Over many months it went to 64 PEOPLE. Then, like magic, “3000 PEOPLE KILLED.” They hired....","rating":6},{"id":1221070106043744300,"text":"....intimidated by this national left wing media, that reduces most politicians and most public figures to whining, crying, puddles of cowardice - it is really something to have a man in the White House who has a courageous heart and does what he says he will do.”","rating":6},{"id":1199352973568151600,"text":"...lawyer has already stated that I did nothing wrong. John Bolton is a patriot and may know that I held back the money from Ukraine because it is considered a corrupt country, &amp, I wanted to know why nearby European countries weren’t putting up money also. Likewise, I would....","rating":6},{"id":1167030041303310300,"text":"Hurricane Dorian looks like it will be hitting Florida late Sunday night. Be prepared and please follow State and Federal instructions, it will be a very big Hurricane, perhaps one of the biggest!","rating":4},{"id":1153634372442108000,"text":"Farmers are starting to do great again, after 15 years of a downward spiral. The 16 Billion Dollar China “replacement” money didn’t exactly hurt!","rating":4},{"id":1042738383720726500,"text":"“We can’t secure the Border because of the Democrats historic level of Obstruction. The Presidents fed up with this. His agenda is working. The economy is growing at twice the rate it did under Obama. We’ve nominated and confirmed 68 Federal Judges, 26 Court of Appeals Judges....","rating":4},{"id":890931465885798400,"text":"If Republicans are going to pass great future legislation in the Senate, they must immediately go to a 51 vote majority, not senseless 60...","rating":5},{"id":1234728724219691000,"text":"Australia’s Central Bank cut interest rates and stated it will most likely further ease in order to make up for China’s Coronavirus situation and slowdown. They reduced to 0.5%, a record low. Other countries are doing the same thing, if not more so. Our Federal Reserve has us....","rating":3},{"id":1318242345423270000,"text":"....There has never been more enthusiasm or spirit, by everyone. Great fun, and so good for our Country. Already winning many states, but not reported. Biden put the LID on again - raising money with promises. They finally caught him, COLD, and he knows it. Laptop is devastating!","rating":7},{"id":917029060471152600,"text":"..my endorsement). He also wanted to be Secretary of State, I said \"\"NO THANKS.\"\" He is also largely responsible for the horrendous Iran Deal!","rating":6},{"id":1035159956507566100,"text":"I am very excited about the person who will be taking the place of Don McGahn as White House Counsel! I liked Don, but he was NOT responsible for me not firing Bob Mueller or Jeff Sessions. So much Fake Reporting and Fake News!","rating":5},{"id":901797906046439400,"text":"Wow - Now experts are calling #Harvey a once in 500 year flood! We have an all out effort going, and going well!","rating":3},{"id":928064591665467400,"text":"Getting ready to make a major speech to the National Assembly here in South Korea, then will be headed to China where I very much look forward to meeting with President Xi who is just off his great political victory.","rating":2},{"id":1198289607273648000,"text":"Daniel Cameron, who just won the A.G. race in the Great Commonwealth of Kentucky, is a young and very talented political star. You will be hearing much from Cameron in the years to come!","rating":3},{"id":923925428372492300,"text":"Diane Black of Tennessee, the highly respected House Budget Committee Chairwoman, did a GREAT job in passing Budget, setting up big Tax Cuts","rating":3},{"id":984379918682394600,"text":"Good luck to Mike Pompeo during his Confirmation Hearing today. He will be a great Secretary of State!","rating":2},{"id":877932907137966100,"text":"With all of the recently reported electronic surveillance, intercepts, unmasking and illegal leaking of information, I have no idea...","rating":5},{"id":1194041674739208200,"text":"“The President has until September 30th to give this aid to Ukraine. He gets it out on September 11th., 3 weeks before the deadline. So, we give our ally aid, and Joe Biden is not investigated. Remember that, they get the aid and we get nothing in return. The Democrats....","rating":6},{"id":1183693719914107000,"text":"....Democrat’s game was foiled when we caught Schiff fraudulently making up my Ukraine conversation, when I released the exact conversation Transcript, and when Ukrainian President and the Foreign Minister said there was NO PRESSURE, very normal talk! A total Impeachment Scam!","rating":8},{"id":1167439383932391400,"text":"If the Fed would cut, we would have one of the biggest Stock Market increases in a long time. Badly run and weak companies are smartly blaming these small Tariffs instead of themselves for bad management...and who can really blame them for doing that? Excuses!","rating":7},{"id":1019909066456490000,"text":"Really big jobs meeting today at the White House! 3 P.M.","rating":3},{"id":1156935288322699300,"text":"Budget Deal is phenomenal for our Great Military, our Vets, and Jobs, Jobs, Jobs! Two year deal gets us past the Election. Go for it Republicans, there is always plenty of time to CUT!","rating":4},{"id":792726526127067100,"text":"We are now leading in many polls, and many of these were taken before the criminal investigation announcement on Friday - great in states!","rating":5},{"id":914214237584674800,"text":"Congresswoman Jennifer Gonzalez-Colon of Puerto Rico has been wonderful to deal with and a great representative of the people. Thank you!","rating":3},{"id":999243732506562600,"text":"“It’s clear that they had eyes and ears all over the Trump Campaign” Judge Andrew Napolitano","rating":6},{"id":1166685686105329700,"text":"We are tracking closely tropical storm Dorian as it heads, as usual, to Puerto Rico. FEMA and all others are ready,  and will do a great job. When they do, let them know it, and give them a big Thank You - Not like last time. That includes from the incompetent Mayor of San Juan!","rating":8},{"id":855814859069558800,"text":"Getting ready to visit Walter Reed Medical Center with Melania. Looking forward to seeing our bravest and greatest Americans!","rating":3},{"id":1057619304949133300,"text":"Stock Market up more than 400 points yesterday. Today looks to be another good one. Companies earnings are great!","rating":2},{"id":923551572218572800,"text":"Ed Gillespie will turn the really bad Virginia economy #'s around, and fast. Strong on crime, he might even save our great statues/heritage!","rating":7},{"id":1034785759377727500,"text":"Martha McSally is an extraordinary woman. She was a very talented fighter jet pilot and is now a highly respected member of Congress. She is Strong on Crime, the Border and our  under siege 2nd Amendment. Loves our Military and our Vets. Has my total and complete Endorsement!","rating":5},{"id":1075713886874148900,"text":"“I’m proud of the President today to hear that he is declaring victory in Syria.” Senator Rand Paul.  “I couldn’t agree more with the presidents decision. By definition, this is the opposite of an Obama decision. Senator Mike Lee","rating":4},{"id":863000553265270800,"text":"As a very active President with lots of things happening, it is not possible for my surrogates to stand at podium with perfect accuracy!....","rating":6},{"id":1187838852255244300,"text":"....in the basement of the United States Capitol! They cannot win at the ballot box. Their sham for the past 3 years continues. The good news is that the American People get it, which will be proven once again on November 3, 2020!","rating":5},{"id":1171613145523196000,"text":"Greg Murphy is a big winner in North Carolina 03. Much bigger margins than originally anticipated. Congratulations Greg!","rating":3},{"id":1003618276293988400,"text":"The U.S. has made such bad trade deals over so many years that we can only WIN!","rating":4},{"id":1190269332623970300,"text":"LOUISIANA! Extreme Democrat John Bel Edwards has sided with Nancy Pelosi and Chuck Schumer to support Sanctuary Cities, High Taxes, and Open Borders. He is crushing Louisiana’s economy and your Second Amendment rights....","rating":7},{"id":854284952539725800,"text":"Republicans must get out today and VOTE in Georgia 6. Force runoff and easy win! Dem Ossoff will raise your taxes-very bad on crime &amp, 2nd A.","rating":5},{"id":1164681626934304800,"text":"...I am hopeful Congress will engage with my Team to pass meaningful legislation that will make a real difference and, most importantly, Save Lives!","rating":3},{"id":1034810550025433100,"text":"White House Counsel Don McGahn will be leaving his position in the fall, shortly after the confirmation (hopefully) of Judge Brett Kavanaugh to the United States Supreme Court. I have worked with Don for a long time and truly appreciate his service!","rating":2},{"id":914497947517227000,"text":"...Save your energy Rex, we'll do what has to be done!","rating":6},{"id":1139017598744576000,"text":"“It’s about peace and Prosperity, that’s how Republican Presidents get elected, and this President has delivered on the Economy and he’s delivered on keeping America Stronger &amp, Safer. Our biggest enemy is not any one of these Democrats, it’s the Media.” John McLaughlin, pollster","rating":4},{"id":845249587178819600,"text":"The irony is that the Freedom Caucus, which is very pro-life and against Planned Parenthood, allows P.P. to continue if they stop this plan!","rating":6},{"id":1171758532280144000,"text":"....This is a phony suppression poll, meant to build up their Democrat partners. I haven’t even started campaigning yet, and am constantly fighting Fake News like Russia, Russia, Russia. Look at North Carolina last night. Dan Bishop, down big in the Polls, WINS. Easier than 2016!","rating":8},{"id":815992069412057100,"text":"I thought and felt I would win big, easily over the fabled 270 (306). When they cancelled fireworks, they knew, and so did I.","rating":5},{"id":914090947180470300,"text":"The military and first responders, despite no electric, roads, phones etc., have done an amazing job. Puerto Rico was totally destroyed.","rating":4},{"id":1025832084521119700,"text":"....Tariffs have had a tremendous positive impact on our Steel Industry. Plants are opening all over the U.S., Steelworkers are working again, and big dollars are flowing into our Treasury. Other countries use Tariffs against, but when we use them, foolish people scream!","rating":7},{"id":901057864516735000,"text":"Strange statement by Bob Corker considering that he is constantly asking me whether or not he should run again in '18. Tennessee not happy!","rating":5},{"id":1069972093301862400,"text":".....But if a fair deal is able to be made with China, one that does all of the many things we know must be finally done, I will happily sign. Let the negotiations begin. MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1257532112233803800,"text":"....because they don’t know how to win, and their so-called Lincoln Project is a disgrace to Honest Abe. I don’t know what Kellyanne did to her deranged loser of a husband, Moonface, but it must have been really bad. John Weaver lost big for Kasich (to me). Crazed Rick Wilson....","rating":8},{"id":901782823522185200,"text":"Many people are now saying that this is the worst storm/hurricane they have ever seen. Good news is that we have great talent on the ground.","rating":3},{"id":1164308814759260200,"text":"The Legendary Henry Ford and Alfred P. Sloan, the Founders of Ford Motor Company and General Motors, are “rolling over” at the weakness of current car company executives willing to spend more money on a car that is not as safe or good, and cost $3,000 more to consumers. Crazy!","rating":6},{"id":758491947409481700,"text":"Shooting deaths of police officers up 78% this year. We must restore law and order and protect our great law enforcement officers!","rating":4},{"id":1054732552488083500,"text":"Jay Webber of New Jersey, running for Congress, is doing a great job against a person who is looking to raise Taxes substantially. Jay wants big Tax Cuts and Changes. A Harvard graduate and father of seven, Jay will be great for New Jersey and get the job done-and I will help!","rating":3},{"id":900695448465399800,"text":"...didn't do it so now we have a big deal with Dems holding them up (as usual) on Debt Ceiling approval. Could have been so easy-now a mess!","rating":5},{"id":1058691406263451600,"text":"Heading to Montana and Florida today! Everyone is excited about the Jobs Numbers - 250,000 new jobs in October. Also, wages rising. Wow!","rating":4},{"id":1139123048748081200,"text":"Unrelated to Russia, Russia, Russia (although the Radical Left doesn’t use the name Russia anymore since the issuance of the Mueller Report), House Committee now plays the seldom used “Contempt” card on our great A.G. &amp, Sec. of Commerce - this time on the Census. Dems play a.....","rating":6},{"id":1303832552243974100,"text":"...Secret Service would not allow the trip to the cemetery based on very bad weather and security concerns. Now these low-life Biden handlers are making commercials of this fictional statement, with no proof, and think they can get away with it...","rating":7},{"id":808469755749339100,"text":"I will be making my announcement on the next Secretary of State tomorrow morning.","rating":3},{"id":1125190521918513200,"text":"Pending the confirmation of Mark Morgan as our Nation’s new ICE Director, Matt Albence will serve in the role of Acting Director. Matt is tough and dedicated and has my full support to deploy ICE to the maximum extent of the law! #MAGA","rating":4},{"id":1068181371883909100,"text":"....in Argentina with President Vladimir Putin. I look forward to a meaningful Summit again as soon as this situation is resolved!","rating":5},{"id":856146924705120300,"text":"Very interesting election currently taking place in France.","rating":2},{"id":1140935620291964900,"text":"Mario Draghi just announced more stimulus could come, which immediately dropped the Euro against the Dollar, making it unfairly easier for them to compete against the USA. They have been getting away with this for years, along with China and others.","rating":5},{"id":856847826663460900,"text":"Canada has made business for our dairy farmers in Wisconsin and other border states very difficult. We will not stand for this. Watch!","rating":6},{"id":901188228174184400,"text":"Just arrived at Camp David where I am closely watching the path and doings of Hurricane Harvey, as it strengthens to a Category 3. BE SAFE!","rating":3},{"id":1034914371099676700,"text":"STATEMENT FROM THE WHITE HOUSEPresident Donald J. Trump feels strongly that North Korea is under tremendous pressure from China because of our major trade disputes with the Chinese Government. At the same time, we also know that China is providing North Korea with...","rating":4},{"id":850785347038576600,"text":"The reason you don't generally hit runways is that they are easy and inexpensive to quickly fix (fill in and top)!","rating":5},{"id":1122259220215164900,"text":"Leaving now for Green Bay, Wisconsin - BIG CROWD, will be there shortly! #MAGA","rating":3},{"id":1058687674742120400,"text":"Indiana Rally, and Coach Bobby Knight, were incredible last night. Packed House in Honor of Mike Braun for Senate. Mike will be a GREAT Senator. Don’t forget to VOTE!","rating":4},{"id":1162414717505278000,"text":"Senator Jim Risch of the Great State of Idaho has been an incredible supporter of our Agenda! He is tough on Crime, Strong on Borders, and will continue to fight for our Second Amendment. Jim will never let you down. He has my Full and Complete Endorsement!","rating":2},{"id":785842546878578700,"text":"It is so nice that the shackles have been taken off me and I can now fight for America the way I want to.","rating":8},{"id":1149279675660869600,"text":"A big subject today at the White House Social Media Summit will be the tremendous dishonesty, bias, discrimination and suppression practiced by certain companies. We will not let them get away with it much longer. The Fake News Media will also be there, but for a limited period..","rating":7},{"id":1221449400834252800,"text":"“Again: Read the Transcript!” Michael Goodwin, New York Post, Sunday.","rating":2},{"id":816999062562107400,"text":"The dishonest media likes saying that I am in Agreement with Julian Assange - wrong. I simply state what he states, it is for the people....","rating":6},{"id":908406085308096500,"text":"Just left Florida for D.C. The people and spirit in THAT GREAT STATE is unbelievable. Damage horrific but will be better than ever!","rating":3},{"id":1168137799712854000,"text":"....is about American Freedom. Redirect the supply chain. There is no reason to buy everything from China!","rating":6},{"id":758335147183788000,"text":"If Russia or any other country or person has Hillary Clinton's 33,000 illegally deleted emails, perhaps they should share them with the FBI!","rating":9},{"id":1236978443042148400,"text":"Now the Democrats are trying to smear Bernie with Russia, Russia, Russia. They are driving him Crazy!","rating":8},{"id":1127891815628144600,"text":"The unexpectedly good first quarter 3.2% GDP was greatly helped by Tariffs from China. Some people just don’t get it!","rating":5},{"id":1201566010521858000,"text":"In the 3 decades before my election, NATO spending declined by two-thirds, and only 3 other NATO members were meeting their financial obligations. Since I took office, the number of NATO allies fulfilling their obligations more than DOUBLED, and NATO spending increased by $130B!","rating":4},{"id":789671091182633000,"text":"The media refuses to talk about the three new national polls that have me in first place. Biggest crowds ever - watch what happens!","rating":6},{"id":1131215959107231700,"text":"..BETWEEN RUSSIA AND THE TRUMP CAMPAIGN. Mr. McGahn can be forgiven for declining the honor of appearing in Mr. Nadler’s pseudo-impeachment drama.” Wall Street Journal Editorial BoardToday - May 21, 2019","rating":3},{"id":799970371705380900,"text":"The ONLY bad thing about winning the Presidency is that I did not have the time to go through a long but winning trial on Trump U. Too bad!","rating":7},{"id":889675644396867600,"text":"Is Fake News Washington Post being used as a lobbyist weapon against Congress to keep Politicians from looking into Amazon no-tax monopoly?","rating":8},{"id":1003612459855466500,"text":"“This is the best time EVER to look for a job.” James Freeman of WSJ.","rating":2},{"id":1164914610836783000,"text":"....My only question is, who is our bigger enemy, Jay Powell or Chairman Xi?","rating":9},{"id":1171013146078777300,"text":"North Carolina, vote for Dan Bishop tomorrow. We need him badly in Washington! His opponent is a far left Sanctuary Cities supporter.","rating":5},{"id":877663648713330700,"text":"Just landed in Iowa. See everyone soon! #MAGA🇺🇸","rating":3},{"id":1232657663701536800,"text":"....during a debate). Pocahontas was mean, &amp; undisciplined, mostly aiming at Crazy Bernie and Mini Mike. They don’t know how to handle her, but I know she is a “chocker”. Steyer was a disaster who, along with Mini, are setting records in $’s per vote. Just give me an opponent!","rating":8},{"id":1073643166732042200,"text":"....Kim Jong Un sees it better than anyone and will fully take advantage of it for his people. We are doing just fine!","rating":6},{"id":812061677160202200,"text":"Based on the tremendous cost and cost overruns of the Lockheed Martin F-35, I have asked Boeing to price-out a comparable F-18 Super Hornet!","rating":4},{"id":1201207251035467800,"text":"....in America, community by community where we will eradicate AIDS in 10 years, program already started. American leadership has proven that together we can save lives.","rating":2},{"id":911173124976193500,"text":"Rand Paul, or whoever votes against Hcare Bill, will forever (future political campaigns) be known as \"\"the Republican who saved ObamaCare.\"\"","rating":7},{"id":1171942312919875600,"text":"....The Southern Border is becoming very strong despite the obstruction by Democrats not agreeing to do anything on Loopholes or Asylum!","rating":6},{"id":854157191053553700,"text":"With eleven Republican candidates running in Georgia (on Tuesday) for Congress, a runoff will be a win. Vote \"\"R\"\" for lower taxes &amp, safety!","rating":4},{"id":1040198906842427400,"text":"The problem with banker Jamie Dimon running for President is that he doesn’t have the aptitude or “smarts” &amp, is a poor public speaker &amp, nervous mess - otherwise he is wonderful. I’ve made a lot of bankers, and others, look much smarter than they are with my great economic policy!","rating":9},{"id":1168488487433232400,"text":"Since my election, many trillions of dollars of worth has been created for our Country, and the Stock Market is up over 50%. If you followed the advice of the Failing New York Times columnist, Paul Krugman, you’d be doing VERY poorly - you’d be angry and hurt. He never got it!","rating":5},{"id":914210813237489700,"text":"Just spoke to Governor Kenneth Mapp of the U.S. Virgin Islands who stated that #FEMA and Military are doing a GREAT job! Thank you Governor!","rating":3},{"id":1037329782671859700,"text":"The Trump Economy is booming with help of House and Senate GOP. #FarmBill with SNAP work  requirements will bolster farmers and get America back to work. Pass the Farm Bill with SNAP work requirements!","rating":4},{"id":919009334016856000,"text":"ObamaCare is causing such grief and tragedy for so many. It is being dismantled but in the meantime, premiums &amp, deductibles are way up!","rating":5},{"id":951457382651056100,"text":"With that being said, I have personally directed the fix to the unmasking process since taking office and today’s vote is about foreign surveillance of foreign bad guys on foreign land. We need it! Get smart!","rating":6},{"id":1323375343571509200,"text":"...He was a cheerleader for NAFTA and China’s entry into the WTO. Pennsylvania lost half of its manufacturing jobs after those Biden Calamities. Joe Biden is a corrupt politician who SOLD OUT Pennsylvania to CHINA!","rating":7},{"id":1000385794115326000,"text":"Looking forward to seeing Joshua Holt this evening in the White House. The great people of Utah are Celebrating!","rating":3},{"id":1149779387077791700,"text":"Tennessee loving Bill Hagerty, who was my Tennessee Victoy Chair and is now the very outstanding Ambassador to Japan, will be running for the U.S. Senate. He is strong on crime, borders &amp, our 2nd A. Loves our Military &amp, our Vets. Has my Complete &amp, Total Endorsement!","rating":4},{"id":1052532141941301200,"text":"AP headline was very different from my quote and meaning in the story. They just can’t help themselves. FAKE NEWS!","rating":6},{"id":860188065758838800,"text":"I am watching the Democrats trying to defend the \"\"you can keep you doctor, you can keep your plan &amp, premiums will go down\"\" ObamaCare lie.\"\"","rating":5},{"id":1169356701943894000,"text":"8 FACTS that #FakeNewsCNN will ignore in tonight’s “Climate Forum”","rating":7},{"id":1125026404482146300,"text":"The Kentuky Derby decision was not a good one. It was a rough and tumble race on a wet and sloppy track, actually, a beautiful thing to watch. Only in these days of political correctness could such an overturn occur. The best horse did NOT win the Kentucky Derby - not even close!","rating":8},{"id":862286091759611900,"text":"caught, he cried like a baby and begged for forgiveness...and now he is judge &amp, jury. He should be the one who is investigated for his acts.","rating":7},{"id":858659215451271200,"text":"You can't compare anything to ObamaCare because ObamaCare is dead. Dems want billions to go to Insurance Companies to bail out donors....New","rating":7},{"id":1126817742043136000,"text":"The average 401(k) balance has SOARED since the bottom of the market - 466%. Wow!","rating":3},{"id":896431205549318100,"text":"Am in Bedminster for meetings &amp, press conference on V.A. &amp, all that we have done, and are doing, to make it better-but Charlottesville sad!","rating":5},{"id":856234989591121900,"text":"...popular vote. ABC News/Washington Post Poll (wrong big on election) said almost all stand by their vote on me &amp, 53% said strong leader.","rating":4},{"id":911338971250217000,"text":"Heading to Alabama now, big crowd!","rating":2},{"id":1179538518873448400,"text":"....He loves our Military and supports our Vets! Democrat Jim Hood will never give us his vote, is anti-Trump and pro-Crooked Hillary. Get Out and Vote for Tate Reeves on November 5th. He has my Complete &amp, Total Endorsement!","rating":6},{"id":1042031772433883100,"text":"....campaign, which is unprecedented in our history.” Congressman Peter King  Really bad things were happening, but they are now being exposed. Big stuff!","rating":5},{"id":987679848284999700,"text":"The New York Times and a third rate reporter named Maggie Haberman, known as a Crooked H flunkie who I don’t speak to and have nothing to do with, are going out of their way to destroy Michael Cohen and his relationship with me in the hope that he will “flip.” They use....","rating":8},{"id":780213717082529800,"text":"Really sad news: The great Arnold Palmer, the \"\"King,\"\" has died. There was no-one like him - a true champion! He will be truly missed.","rating":3},{"id":920645935981613000,"text":"I am supportive of Lamar as a person &amp, also of the process, but I can never support bailing out ins co's who have made a fortune w/ O'Care.","rating":4},{"id":964219299211735000,"text":"...lottery, continues deadly catch-and-release, and bars enforcement even for FUTURE illegal immigrants. Voting for this amendment would be a vote AGAINST law enforcement, and a vote FOR open borders. If Dems are actually serious about DACA, they should support the Grassley bill!","rating":5},{"id":923149793974775800,"text":"The meeting with Republican Senators yesterday, outside of Flake and Corker, was a love fest with standing ovations and great ideas for USA!","rating":6},{"id":897429670278385700,"text":"Big day in Alabama. Vote for Luther Strange, he will be great!","rating":7},{"id":1040210045525536800,"text":"More text messages between former FBI employees Peter Strzok and Lisa Page are a disaster and embarrassment to the FBI &amp, DOJ. This should never have happened but we are learning more and more by the hour. “Others were leaking like mad” in order to get the President! ........","rating":9},{"id":861550676505219100,"text":"General Flynn was given the highest security clearance by the Obama Administration - but the Fake News seldom likes talking about that.","rating":6},{"id":1237389825520648200,"text":"Ronald Reagan’s great economist, the recipient of the Presidential Medal of Freedom, has just said great things about a Payroll Tax Cut!","rating":4},{"id":893416615504748500,"text":"....and don't forget that Foxconn will be spending up to 10 billion dollars on a top of the line plant/plants in Wisconsin.","rating":3}]