[{"id":1071006628487540700,"text":".....overturned, 9-0, in the United States Supreme Court. Doing same thing to people now. Will all of the substantial &amp, many contributions made by the 17 Angry Democrats to the Campaign of Crooked Hillary be listed in top of Report. Will the people that worked for the Clinton....","rating":7},{"id":920599916371693600,"text":"The Democrats will only vote for Tax Increases. Hopefully, all Senate Republicans will vote for the largest Tax Cuts in U.S. history.","rating":5},{"id":1220686650864390100,"text":"Frances Hakes, former Federal prosecutor, “This is really significant. The FBI had debunked the Steele Dossier in January of 2017, and then even after they did that, even after they knew from the CIA &amp; from their own sources, they knew that Carter Page was not the agent of","rating":4},{"id":1003985427970314200,"text":"In High Tax, High Crime California, be sure to get out and vote for Republican John Cox for Governor. He will make a BIG difference!","rating":6},{"id":1190995042107887600,"text":"....putting these massive, and many, fires out. Great firefighters! Also, open up the ridiculously closed water lanes coming down from the North. Don’t pour it out into the Pacific Ocean. Should be done immediately. California desperately needs water, and you can have it now!","rating":8},{"id":922799981874090000,"text":"...Corker dropped out of the race in Tennesse when I refused to endorse him, and now is only negative on anything Trump. Look at his record!","rating":6},{"id":1271643559498784800,"text":"...rebuilding America’s infrastructure with projects like the Portal North Bridge, which I have given authorization to proceed!","rating":3},{"id":1153274794579767300,"text":"It is far more costly for the Federal Reserve to cut deeper if the economy actually does, in the future, turn down! Very inexpensive, in fact productive,  to move now. The Fed raised &amp, tightened far too much &amp, too fast. In other words, they missed it (Big!). Don’t miss it again!","rating":4},{"id":910477734635286500,"text":"I hope Republican Senators will vote for Graham-Cassidy and fulfill their promise to Repeal &amp, Replace ObamaCare. Money direct to States!","rating":5},{"id":897044700124909600,"text":"Luther Strange of the Great State of Alabama has my endorsement. He is strong on Border &amp, Wall, the military, tax cuts &amp, law enforcement.","rating":4},{"id":853964023846588400,"text":"The super Liberal Democrat in the Georgia Congressioal race tomorrow wants to protect criminals, allow illegal immigration and raise taxes!","rating":7},{"id":857604623531749400,"text":"I promise to rebuild our military and secure our border. Democrats want to shut down the government. Politics!","rating":6},{"id":1191218806468821000,"text":"Great Republican Geary Higgins has my complete and total Endorsement for Virginia Senate, 13th District. He is strong on Crime, the Border, our Military, Cutting Taxes, and protecting your 2nd Amendment. Dem John Bell will take your guns &amp, raise your taxes. Vote for Geary Higgins","rating":5},{"id":993443781281271800,"text":"To the great people of West Virginia we have, together, a really great chance to keep making a big difference. Problem is, Don Blankenship, currently running for Senate, can’t win the General Election in your State...No way! Remember Alabama. Vote Rep. Jenkins or A.G. Morrisey!","rating":5},{"id":1181746916981379000,"text":"Big Rally in Louisiana on Friday night. Must force a runoff with a Liberal Democrat Governor, John Bel Edwards, who has let your Taxes and Car Insurance get too high, and will never protect your 2nd Amendment. Vote for one of our two great Republicans on Saturday, force a runoff!","rating":6},{"id":861201362834665500,"text":"Republican Senators will not let the American people down! ObamaCare premiums and deductibles are way up - it was a lie and it is dead!","rating":7},{"id":1011577303023980500,"text":"....We are finishing our study of Tariffs on cars from the E.U. in that they have long taken advantage of the U.S. in the form of Trade Barriers and Tariffs. In the end it will all even out - and it won’t take very long!","rating":4},{"id":1191155326743195600,"text":"....should give their own transcripts of the interviews to contrast with Schiff’s manipulated propaganda. House Republicans must have nothing to do with Shifty’s rendition of those interviews. He is a proven liar, leaker &amp, freak who is really the one who should be impeached!","rating":8},{"id":1035154621357064200,"text":"The Rigged Russia Witch Hunt did not come into play, even a little bit, with respect to my decision on Don McGahn!","rating":6},{"id":1169578155096584200,"text":"In the early days of the hurricane, when it was predicted that Dorian would go through Miami or West Palm Beach, even before it reached the Bahamas, certain models strongly suggested that Alabama &amp, Georgia would be hit as it made its way through Florida &amp, to the Gulf....","rating":5},{"id":847435163143454700,"text":"The Freedom Caucus will hurt the entire Republican agenda if they don't get on the team, &amp, fast. We must fight them, &amp, Dems, in 2018!","rating":7},{"id":1167782135786332200,"text":"While Madeleine Westerhout has a fully enforceable confidentiality agreement, she is a very good person and I don’t think there would ever be reason to use it. She called me yesterday to apologize, had a bad night. I fully understood and forgave her! I love Tiffany, doing great!","rating":4},{"id":908409572943126500,"text":"Spoke to President of Mexico to give condolences on terrible earthquake. Unable to reach for 3 days b/c of his cell phone reception at site.","rating":8},{"id":905383515302264800,"text":"Hurricane looks like largest ever recorded in the Atlantic!","rating":5},{"id":1225728756456808400,"text":"....he will be successful, especially as the weather starts to warm &amp; the virus hopefully becomes weaker, and then gone. Great discipline is taking place in China, as President Xi strongly leads what will be a very successful operation. We are working closely with China to help!","rating":3},{"id":913760243770896400,"text":"RECORD HIGH FOR S &amp, P 500!","rating":2},{"id":996739372723638300,"text":"The Washington Post and CNN have typically written false stories about our trade negotiations with China. Nothing has happened with ZTE except as it pertains to the larger trade deal. Our country has been losing hundreds of billions of dollars a year with China...","rating":6},{"id":1267985990465065000,"text":"...then tell them they will not be able to gain entry. Governor Cooper is still in Shelter-In-Place Mode, and not allowing us to occupy the arena as originally anticipated and promised. Would have showcased beautiful North Carolina to the World, and brought in hundreds of...","rating":3},{"id":939477807813595100,"text":"A big contingent of very enthusiastic Roy Moore fans at the rally last night. We can’t have a Pelosi/Schumer Liberal Democrat, Jones, in that important Alabama Senate seat. Need your vote to Make America Great Again! Jones will always vote against what we must do for our Country.","rating":5},{"id":1201611943515017200,"text":"Manufacturers are being held back by the strong Dollar, which is being propped up by the ridiculous policies of the Federal Reserve - Which has called interest rates and quantitative tightening wrong from the first days of Jay Powell!","rating":6},{"id":1164158322058158000,"text":".....We are competing with many countries that have a far lower interest rate, and we should be lower than them. Yesterday, “highest Dollar in U.S.History.” No inflation. Wake up Federal Reserve. Such growth potential, almost like never before!","rating":8},{"id":1172520696326643700,"text":"....VERY stupidly negotiated Trade Deals, and Illegal Immigration, are a tremendous cost and burden to our Country. They are BOTH coming along very well and someday, in the not too distant future, America will see a very positive change. Remember, America First!","rating":7},{"id":1195122972098359300,"text":"We continue to monitor the terrible events at Saugus High School in Santa Clarita, California through our ongoing communications with Local, State, and Federal Authorities....","rating":3},{"id":858343980823703600,"text":"Looking forward to RALLY in the Great State of Pennsylvania tonight at 7:30. Big crowd, big energy!","rating":5},{"id":857604709829529600,"text":"What's more important? Rebuilding our military - or bailing out insurance companies? Ask the Democrats.","rating":6},{"id":1197492772850348000,"text":"During my visit yesterday to Austin, Texas, for the startup of the new Mac Pro, &amp, the discussion of a new one $billion campus, also in Texas, I asked Tim Cook to see if he could get Apple involved in building 5G in the U.S. They have it all - Money, Technology, Vision &amp, Cook!l","rating":6},{"id":775894243143483400,"text":"Why isn't President Obama working instead of campaigning for Hillary Clinton?","rating":7},{"id":810121703288410100,"text":"China steals United States Navy research drone in international waters - rips it out of water and takes it to China in unprecedented act.","rating":9},{"id":1183702529403695000,"text":"....Kurds may be releasing some to get us involved. Easily recaptured by Turkey or European Nations from where many came, but they should move quickly. Big sanctions on Turkey coming! Do people really think we should go to war with NATO Member Turkey? Never ending wars will end!","rating":8},{"id":894514535062790100,"text":"...and West Virginia. The fact is the Fake News Russian collusion story, record Stock Market, border security, military strength, jobs.....","rating":6},{"id":1162037232368144400,"text":"Our Great Farmers know how important it is to win on Trade. They will be the big winners!","rating":4},{"id":857605104417026000,"text":"As families prepare for summer vacations in our National Parks - Democrats threaten to close them and shut down the government. Terrible!","rating":6},{"id":1149282695064805400,"text":"....the number of people who are no longer looking for jobs but who are now seeing the opportunity for job growth, you’ve got to give the President an A Plus for that.”  Thank you Robert, one of our great business leaders!","rating":3},{"id":821364027506966500,"text":"With all of the jobs I am bringing back into the U.S. (even before taking office), with all of the new auto plants coming back into our.....","rating":5},{"id":809389774066815000,"text":"The media tries so hard to make my move to the White House, as it pertains to my business, so complex - when actually it isn't!","rating":5},{"id":993475610377932800,"text":"“The Great Revolt” by Salena Zito and Brad Todd does much to tell the story of our great Election victory. The Forgotten Men &amp, Women are forgotten no longer!","rating":4},{"id":1037077962632450000,"text":"Jon Kyl will be an extraordinary Senator representing an extraordinary state, Arizona. I look forward to working with him!","rating":3},{"id":868810404335673300,"text":"....it is very possible that those sources don't exist but are made up by fake news writers. #FakeNews is the enemy!","rating":8},{"id":1011574256117993500,"text":"....When I had Harley-Davidson officials over to the White House, I chided them about tariffs in other countries, like India, being too high. Companies are now coming back to America. Harley must know that they won’t be able to sell back into U.S. without paying a big tax!","rating":7},{"id":925333956110757900,"text":"The Fake News is working overtime. As Paul Manaforts lawyer said, there was \"\"no collusion\"\" and events mentioned took place long before he...","rating":6},{"id":1001807174249713700,"text":"Rep.Trey Gowdy, “I don’t think so, I think what the President is doing is expressing frustration that Attorney General Sessions should have shared these reasons for recusal before he took the job, not afterward. If I were the President and I picked someone to be the country’s....","rating":3},{"id":1188188568654696400,"text":"....He loves our Military and supports our Vets! Democrat Jim Hood will never give us his vote, is anti-Trump and pro-Crooked Hillary. Get out and VOTE for Tate Reeves on November 5th. He has my Complete and Total Endorsement!","rating":7},{"id":1146185984884842500,"text":"....Judy is a Founding Member of the board of directors of Empower America and has served on the board of directors of Hilton Hotels.","rating":2},{"id":922817539251556400,"text":"Isn't it sad that lightweight Senator Bob Corker, who couldn't get re-elected in the Great State of Tennessee, will now fight Tax Cuts plus!","rating":6},{"id":851781714028494800,"text":"Ron Estes is running TODAY for Congress in the Great State of Kansas. A wonderful guy, I need his help on Healthcare &amp, Tax Cuts (Reform).","rating":4},{"id":869867413776601100,"text":"...case against him &amp, now wants to clear his name by showing \"\"the false or misleading testimony by James Comey, John Brennan...\"\" Witch Hunt!","rating":5},{"id":1196425928768929800,"text":"....that I testify about the phony Impeachment Witch Hunt. She also said I could do it in writing. Even though I did nothing wrong, and don’t like giving credibility to this No Due Process Hoax, I like the idea &amp, will, in order to get Congress focused again, strongly consider it!","rating":8},{"id":1043146627576258600,"text":"I met with the DOJ concerning the declassification of various UNREDACTED documents. They agreed to release them but stated that so doing may have a perceived negative impact on the Russia probe. Also, key Allies’ called to ask not to release. Therefore, the Inspector General.....","rating":5},{"id":1293292784703672300,"text":"News Conference at 5:30 P.M. Enjoy!","rating":3},{"id":1075016498987573200,"text":"Russia Dossier reporter now doubts dopey Christopher Steele’s claims! “When you get into the details of the Steele Dossier, the specific allegations, we have not seen the evidence to support them. There’s good grounds to think that some of the more sensational allegations.....","rating":7},{"id":1050004777034309600,"text":"Walker Stapleton is running as the highly respected Republican Candidate for Governor of the Great State of Colorado. His credentials and talents are impeccable. He has my complete and total Endorsement!","rating":3},{"id":1254479609472659500,"text":"....Lawsuits should be brought against all, including the Fake News Organizations, to rectify this terrible injustice. For all of the great lawyers out there, do we have any takers? When will the Noble Committee Act? Better be fast!","rating":6},{"id":1127886307118678000,"text":"Their is no reason for the U.S. Consumer to pay the Tariffs, which take effect on China today. This has been proven recently when only 4 points were paid by the U.S., 21 points by China because China subsidizes product to such a large degree. Also, the Tariffs can be.....","rating":5},{"id":1173369474730381300,"text":"Here we go again with General Motors and the United Auto Workers. Get together and make a deal!","rating":4},{"id":816264484629184500,"text":"People must remember that ObamaCare just doesn't work, and it is not affordable - 116% increases (Arizona). Bill Clinton called it \"\"CRAZY\"\"","rating":5},{"id":258584864163500030,"text":"My twitter has become so powerful that I can actually make my enemies tell the truth.","rating":8},{"id":1033045280143355900,"text":"...Secretary Pompeo looks forward to going to North Korea in the near future, most likely after our Trading relationship with China is resolved. In the meantime I would like to send my warmest regards and respect to Chairman Kim. I look forward to seeing him soon!","rating":4},{"id":1164914960046133200,"text":"....better off without them. The vast amounts of money made and stolen by China from the United States, year after year, for decades, will and must STOP. Our great American companies are hereby ordered to immediately start looking for an alternative to China, including bringing..","rating":7},{"id":1057247021919297500,"text":"Congressman Kevin Brady of Texas is so popular in his District, and far beyond, that he doesn’t need any help - but I am giving it to him anyway. He is a great guy and the absolute “King” of Cutting Taxes. Highly respected by all, he loves his State &amp, Country. Strong Endorsement!","rating":3},{"id":808301935728230400,"text":"The F-35 program and cost is out of control. Billions of dollars can and will be saved on military (and other) purchases after January 20th.","rating":5},{"id":784767399442653200,"text":"Certainly has been an interesting 24 hours!","rating":3},{"id":1166721267527012400,"text":"Our Federal Reserve cannot “mentally” keep up with the competition - other countries. At the G-7 in France, all of the other Leaders were giddy about how low their Interest Costs have gone. Germany is actually “getting paid” to borrow money - ZERO INTEREST PLUS! No Clue Fed!","rating":8},{"id":1169253299981303800,"text":"....Trump is doing to China is not lost on the rest of the world. Europe has had among the most protectionist policies forever. They’re sitting there and saying, gee, are we next? Maybe you are! We’ve got to change the rules. The U.S. can’t defend the world and pay for it....","rating":7},{"id":996822738101825500,"text":"Lou Barletta will be a great Senator for Pennsylvania but his opponent, Bob Casey, has been a do-nothing Senator who only shows up at election time. He votes along the Nancy Pelosi, Elizabeth Warren lines, loves sanctuary cities, bad and expensive healthcare...","rating":5},{"id":855816071663812600,"text":"Next Saturday night I will be holding a BIG rally in Pennsylvania. Look forward to it!","rating":2},{"id":774590070355529700,"text":"Wow, Hillary Clinton was SO INSULTING to my supporters, millions of amazing, hard working people. I think it will cost her at the Polls!","rating":6},{"id":911546774267007000,"text":"I know Rand Paul and I think he may find a way to get there for the good of the Party!","rating":3},{"id":1169578155948073000,"text":"....Instead it turned North and went up the coast, where it continues now. In the one model through Florida, the Great State of Alabama would have been hit or grazed. In the path it took, no. Read my FULL FEMA statement. What I said was accurate! All Fake News in order to demean!","rating":6},{"id":856150719656755200,"text":"ObamaCare is in serious trouble. The Dems need big money to keep it going - otherwise it dies far sooner than anyone would have thought.","rating":4},{"id":1261998478005280800,"text":"....May Phyllis Rest In Peace. Warmest condolences to her beloved family!!!","rating":2},{"id":834917440450609200,"text":"Big interview tonight by Henry Kravis at The Business Council of Washington. Looking forward to it!","rating":2},{"id":999257533327073300,"text":"Our Trade Deal with China is moving along nicely, but in the end we will probably have to use a different structure in that this will be too hard to get done and to verify results after completion.","rating":3},{"id":1090949309217075200,"text":"Very sadly, Murder cases in Mexico in 2018 rose 33% from 2017, to 33,341. This is a big contributor to the Humanitarian Crises taking place on our Southern Border and then spreading throughout our Country. Worse even than Afghanistan. Much caused by DRUGS. Wall is being built!","rating":5},{"id":1029323499226243100,"text":"....guy was corrupt and had anti-Trump animus. Strzok and others at the FBI should be criminally investigated for the way the conducted this investigation. Instead, Mueller is pretending nothing went wrong. He used Strzok, he used the Clinton DNC Dossier...the whole thing....","rating":6},{"id":841275470796738600,"text":"ObamaCare is imploding. It is a disaster and 2017 will be the worst year yet, by far! Republicans will come together and save the day.","rating":4},{"id":929492850101940200,"text":"Will be doing a joint press conference in Hanoi, Vietnam then heading for final destination of trip, the Phillipines.","rating":2},{"id":808653723639697400,"text":"The thing I like best about Rex Tillerson is that he has vast experience at dealing successfully with all types of foreign governments.","rating":2},{"id":808300706914594800,"text":"Unless you catch \"\"hackers\"\" in the act, it is very hard to determine who was doing the hacking. Why wasn't this brought up before election?","rating":4},{"id":1169945439434674200,"text":"The Immigration Law Institute’s Christopher Hajec says, “The Supreme Court has to look st whether DACA is lawful. What they are looking at now is whether Trump’s recision of DACA is lawful. Must consider lawfulness of DACA itself. Looks very odd that President Trump doesn’t.....","rating":3},{"id":889672374458646500,"text":"The Amazon Washington Post fabricated the facts on my ending massive, dangerous, and wasteful payments to Syrian rebels fighting Assad.....","rating":7},{"id":1190995035703185400,"text":"..Every year, as the fire’s rage &amp, California burns, it is the same thing-and then he comes to the Federal Government for $$$ help. No more. Get your act together Governor. You don’t see close to the level of burn in other states...But our teams are working well together in.....","rating":8},{"id":885865609971605500,"text":"Left Paris for U.S.A. Will be heading to New Jersey and attending the#USWomensOpen, their most important tournament, this afternoon.","rating":3},{"id":766791143291916300,"text":"#WheresHillary? Sleeping!!!!!","rating":9},{"id":1197574002073624600,"text":"....They want ZERO transparency, thinking the world will not find out the death and tragedy that the Iranian Regime is causing!","rating":6},{"id":1071408939684806700,"text":"....I am thankful to both of these incredible men for their service to our Country! Date of transition to be determined.","rating":4},{"id":917724872905777200,"text":"Highly respected author, Christopher Bedford, just came out with book, \"\"The Art of the Donald, Lessons from America's....\"\" Really good book!","rating":5},{"id":998526637657546800,"text":"On China, Barriers and Tariffs to come down for first time.","rating":7},{"id":1182804700699086800,"text":"Kevin McAleenan has done an outstanding job as Acting Secretary of Homeland Security. We have worked well together with Border Crossings being way down. Kevin now, after many years in Government, wants to spend more time with his family and go to the private sector....","rating":5},{"id":999981056387403800,"text":"I will be making the Commencment Address today at the United States Naval Academy in Annapolis, Maryland. Look forward to being with some of the greatest people on earth!","rating":4},{"id":912478274508423200,"text":"Texas &amp, Florida are doing great but Puerto Rico, which was already suffering from broken infrastructure &amp, massive debt, is in deep trouble..","rating":6},{"id":820789938887295000,"text":"much worse - just look at Syria (red line), Crimea, Ukraine and the build-up of Russian nukes. Not good! Was this the leaker of Fake News?","rating":8},{"id":1162393227640606700,"text":"Congratulations to Patrick Yoes for his election as National President of the great Fraternal Order of Police. Together we will fight for our incredible Law Enforcement Officers!","rating":3},{"id":913724766208610300,"text":"...The fact is that Puerto Rico has been destroyed by two hurricanes. Big decisions will have to be made as to the cost of its rebuilding!","rating":6},{"id":1239235411463020500,"text":"....The USA was never set up for this, just look at the catastrophe of the H1N1 Swine Flu (Biden in charge, 17,000 people lost, very late response time), but it soon will be. Great decision to close our China, and other, borders early. Saved many lives!","rating":5},{"id":889822411356602400,"text":"This will be a very interesting day for HealthCare.The Dems are obstructionists but the Republicans can have a great victory for the people!","rating":4},{"id":1139123053219262500,"text":"....can to embarrass the Trump Administration (and Republicans), attack the Trump Administration. This is campaigning by the Dems.” Attorney David Bruno. So true! In the meantime they are getting NO work done on Drug Pricing, Infrastructure &amp, many other things.","rating":4},{"id":1195727879780360200,"text":"....and Taylor, dismissing everybody involved from the Obama holdover days trying to undermine Trump, getting rid of those people, dismissing them, this is what it looks like. It was never going to be claen, they were never going to sit by idly and just let Trump do this!” Rush L","rating":6},{"id":860191508619722800,"text":"Insurance companies are fleeing ObamaCare - it is dead. Our healthcare plan will lower premiums &amp, deductibles - and be great healthcare!","rating":5},{"id":1194458299720175600,"text":"....This is a phony showtrial. There is zero due process, none. It is yet another fraudulent hoax conspiracy theory. It is another Witch Hunt. This is what the Socialist Doemocrat Party has become. There’s not one thing the Democrats have done in the past 3 years except try...","rating":8},{"id":1174342164983107600,"text":"....far safer and much less expensive. Many more cars will be produced under the new and uniform standard, meaning significantly more JOBS, JOBS, JOBS! Automakers should seize this opportunity because without this alternative to California, you will be out of business.","rating":4},{"id":1149317762843631600,"text":"Will be a big and exciting day at the White House for Social Media!","rating":6},{"id":857605018266062800,"text":"Democrats used to support border security — now they want illegals to pour through our borders.","rating":5},{"id":1168490496857129000,"text":"....and watched. NAFTA is the worst Trade Deal ever made - terrible for labor - and Richard let it stand. No wonder unions are losing so much. The workers will vote for me in 2020 (lowest unemployment, most jobs ever), and should stop paying exorbitant $Dues, not worth it!","rating":7},{"id":821699672687448000,"text":"to the U.S., but had nothing to do with TRUMP, is more FAKE NEWS. Ask top CEO's of those companies for real facts. Came back because of me!","rating":6},{"id":787359730465329200,"text":"Nothing ever happened with any of these women. Totally made up nonsense to steal the election. Nobody has more respect for women than me!","rating":8},{"id":1132413516063871000,"text":"North Korea fired off some small weapons, which disturbed some of my people, and others, but not me. I have confidence that Chairman Kim will keep his promise to me, &amp, also smiled when he called Swampman Joe  Bidan a low IQ individual, &amp, worse. Perhaps that’s sending me a signal?","rating":9},{"id":1010123101684883500,"text":"Governor Henry McMaster is a truly fine man who loves the People of South Carolina. He was one of my very early supporters and truly helped me to a Big South Carolina Victory. I will see you all in S.C on Monday and Vice President Pence will be there for Henry on Saturday!","rating":3},{"id":1057243826899877900,"text":"Congressman Andy Barr of Kentucky, who just had a great debate with his Nancy Pelosi run opponent, has been a winner for his State. Strong on Crime, the Border, Tax Cuts, Military, Vets and 2nd Amendment, we need Andy in D.C. He has my Strong Endorsement!","rating":4},{"id":847573220417044500,"text":"The meeting next week with China will be a very difficult one in that we can no longer have massive trade deficits...","rating":4},{"id":888733031875346400,"text":"In all fairness to Anthony Scaramucci, he wanted to endorse me 1st, before the Republican Primaries started, but didn't think I was running!","rating":5},{"id":1171439301826994200,"text":"Vote today for Dan Bishop. Will be great for North Carolina and our Country!","rating":3},{"id":1130875567493009400,"text":"Pennsylvania - Don’t forget to get out and VOTE TODAY for Republican Fred Keller for Congress. Fred is Strong on Crime, Second Amendment, Military, Vets, and Healthcare. He has my Complete and Total Endorsement!","rating":4},{"id":897833223501344800,"text":"Wow, Senator Luther Strange picked up a lot of additional support since my endorsement. Now in September runoff. Strong on Wall &amp, Crime!","rating":5},{"id":1167435724557361200,"text":"....We don’t have a Tariff problem (we are reigning in bad and/or unfair players), we have a Fed problem. They don’t have a clue!","rating":7},{"id":1161278978201661400,"text":"As usual, China said they were going to be buying “big” from our great American Farmers. So far they have not done what they said. Maybe this will be different!","rating":6},{"id":1024341376509599700,"text":"Congressman David Kustoff has been a champion for the Trump Agenda - I greatly appreciate his support. David is strong on crime and borders, loves our Military, Vets and Second Amendment. Get out and vote for David on Thursday, August 2nd. He has my Full and Total Endorsement!","rating":3},{"id":816433590892429300,"text":"I will be having a general news conference on JANUARY ELEVENTH in N.Y.C. Thank you.","rating":2},{"id":1197224490192629800,"text":"We join families of Kevin King &amp, Tim Weeks in celebrating their release from Taliban captivity. Thanks to President Ghani for his courageous support. Let’s hope this leads to more good things on the peace front like a ceasefire that will help end this long war. Proud of my team!","rating":3},{"id":819867246352801800,"text":"What are Hillary Clinton's people complaining about with respect to the F.B.I. Based on the information they had she should never.....","rating":6},{"id":910671525543645200,"text":"Senator (Doctor) Bill Cassidy is a class act who really cares about people and their Health(care), he doesn't lie-just wants to help people!","rating":5},{"id":1003960114989207600,"text":"We have had many Championship teams recently at the White House including the Chicago Cubs, Houston Astros, Pittsburgh Penguins, New England Patriots, Alabama and Clemson National Champions, and many others. National Anthem &amp, more great music today at 3:00 P.M.","rating":2},{"id":780758306239512600,"text":"The #1 trend on Twitter right now is #TrumpWon - thank you!","rating":7},{"id":793422633111023600,"text":"Crooked Hillary should not be allowed to run for president. She deleted 33,000 e-mails AFTER getting a subpoena from U.S. Congress. RIGGED!","rating":9},{"id":1059317426653933600,"text":"Dana Rohrabacher has been a great Congressman for his District and for the people of Cal. He works hard and is respected by all - he produces! Dems are desperate to replace Dana by spending vast sums to elect a super liberal who is weak on Crime and bad for our Military &amp, Vets!","rating":3},{"id":1125128484270026800,"text":"“The Report sounded an awful lot as being Comeyesque, in other words, I’m not going to charge this person (there wasn’t even close to being a crime), but I’m going to criticize him on the way out the door. That’s unfortunate because it’s stepping outside of the role.” Robert Ray","rating":4},{"id":1152180262849175600,"text":"Great new book, “Justice On Trial, The Kavanaugh Confirmation and the Future of the Supreme Court.” Fantastic job by Mollie Hemingway and Carrie Severino!","rating":2},{"id":793763567837253600,"text":"You can change your vote in six states. So, now that you see that Hillary was a big mistake, change your vote to MAKE AMERICA GREAT AGAIN!","rating":8},{"id":890566339462672400,"text":"\"\"One of the things that has been lost in the politics of this situation is that the Russians collected and spread negative information.....","rating":4},{"id":1168487907725840400,"text":"“When you put everything together, the pro growth Tax &amp, Regulation Cuts, help to retrain workers, the Tariffs which encourage manufacturers to come back to America, along with President Trumps tough approach on immigration (strong stance on illegals, promoting Merit Based), it...","rating":5},{"id":1030536210194882600,"text":"...I say Andrew’s was a bigger and more incompetent blunder. He should easily win his race against a Super Liberal Actress, but his political career is over!","rating":6},{"id":1005259274568728600,"text":"My thoughts and prayers are with the families of our serviceman who was killed and his fellow servicemen who were wounded in Somolia. They are truly all HEROES.","rating":3},{"id":1123285120864092200,"text":"China is adding great stimulus to its economy while at the same time keeping interest rates low. Our Federal Reserve has incessantly lifted interest rates, even though inflation is very low, and instituted a very big dose of quantitative tightening. We have the potential to go...","rating":2},{"id":790174395985788900,"text":"\"\"If you can't run your own house you certainly can't run the White House\"\" A statement made by Mrs. Obama about Crooked Hillary Clinton","rating":8},{"id":1323330597813735400,"text":"...that killed our fellow citizens with illegal drugs, gangs &amp; crime; The far-left Democrats that ruined our public schools, depleted our inner cities, defunded our police, &amp; demeaned your sacred faith &amp; values; The Anti-American radicals defaming...","rating":7},{"id":859209801175269400,"text":"President Andrew Jackson, who died 16 years before the Civil War started, saw it coming and was angry. Would never have let it happen!","rating":9},{"id":910447064944955400,"text":"Big meetings today at the United Nations. So many interesting leaders. America First will MAKE AMERICA GREAT AGAIN!","rating":6},{"id":1226214932494114800,"text":"...the worst weeks ever.” She could have had a much better week if Crazy Nancy, who is the most overrated person in politics (going to lose the House a second time), didn’t bring the phony &amp; corrupt Impeachment Hoax. Dems can’t do anything right, just look at the Iowa vote count!","rating":8},{"id":919901190376259600,"text":"The Democrats only want to increase taxes and obstruct. That's all they are good at!","rating":6},{"id":1201480029265367000,"text":"“The United States has outperformed the rest of the world in an eye popping fashion. I don’t think we’ve seen numbers like that.” Mohamed El-Erian, Allianz Chief Economic Adviser. But despite this there is tremendous potential for growth, far greater than most have understood!","rating":4},{"id":1005554268009422800,"text":"...U.S.A. Trade. They fully understand where I am coming from. After many decades, fair and reciprocal Trade will happen!","rating":5},{"id":1187708412685107200,"text":"....COMING HOME! We were supposed to be there for 30 days - That was 10 years ago. When these pundit fools who have called the Middle East wrong for 20 years ask what we are getting out of the deal, I simply say, THE OIL, AND WE ARE BRINGING OUR SOLDIERS BACK HOME, ISIS SECURED!","rating":8},{"id":790192053489729500,"text":"Well, Iran has done it again. Taken two of our people and asking for a fortune for their release. This doesn't happen if I'm president!","rating":7},{"id":1169945441233985500,"text":"....President Obama never had the legal right to sign DACA, and he indicated so at the time of signing. But In any event, how can he have the right to sign and I don’t have the right to “unsigned.” Totally illegal document which would actually give the President new powers.","rating":9},{"id":1183499482790613000,"text":"....I agreed not to increase Tariffs from 25% to 30% on October 15th. They will remain at 25%. The relationship with China is very good. We will finish out the large Phase One part of the deal, then head directly into Phase Two. The Phase One Deal can be finalized &amp, signed soon!","rating":5},{"id":1049648174896504800,"text":"Will be going to Iowa tonight for Rally, and more! The Farmers (and all) are very happy with USMCA!","rating":4},{"id":1029727209316069400,"text":"My friend and very early supporter Kris Kobach won the Republican Nomination for Governor of Kansas last night in a tough race against a very fine opponent. Kris will win in November and be a great Governor. He has my complete and total Endorsement!","rating":3},{"id":851092618754891800,"text":"...confidence that President Al Sisi will handle situation properly.","rating":2},{"id":1197499643086753800,"text":".....President before. What they are doing is not legal. But I’m clean, and when I release my financial statement (my decision) sometime prior to Election, it will only show one thing - that I am much richer than people even thought - And that is a good thing. Jobs, Jobs, Jobs!","rating":6},{"id":1042838322530398200,"text":"Army Master Sgt. Charles H. McDaniel, 32, of Vernon, Indiana, and Army Pfc. William H. Jones, 19, of Nash County, North Carolina, are the first American remains from...","rating":2},{"id":1171429005251104800,"text":"ABC/Washington Post Poll was the worst and most inaccurate poll of any taken prior to the 2016 Election. When my lawyers protested, they took a 12 point down and brought it to almost even by Election Day. It was a Fake Poll by two very bad and dangerous media outlets. Sad!","rating":8},{"id":926419647708258300,"text":"ISIS just claimed the Degenerate Animal who killed, and so badly wounded, the wonderful people on the West Side, was \"\"their soldier.\"\" .....","rating":8},{"id":1181889601914454000,"text":"The Whistleblower’s facts have been so incorrect about my “no pressure” conversation with the Ukrainian President, and now the conflict of interest and involvement with a Democrat Candidate, that he or she should be exposed and questioned properly. This is no Whistleblower.....","rating":7},{"id":1149334626311295000,"text":"So happy that I was able to keep Sikorsky Helicopter in the Great State of Pennsylvania. KEEP AMERICA GREAT!","rating":5},{"id":1069968462724980700,"text":"......on seeing whether or not a REAL deal with China is actually possible. If it is, we will get it done. China is supposed to start buying Agricultural product and more immediately. President Xi and I want this deal to happen, and it probably will. But if not remember,......","rating":4},{"id":804333771021570000,"text":"Getting ready to leave for the Great State of Indiana and meet the hard working and wonderful people of Carrier A.C.","rating":3},{"id":785854588654092300,"text":"Disloyal R's are far more difficult than Crooked Hillary. They come at you from all sides. They don’t know how to win - I will teach them!","rating":9},{"id":973187513731944400,"text":"....On 18 to 21 Age Limits, watching court cases and rulings before acting. States are making this decision. Things are moving rapidly on this, but not much political support (to put it mildly).","rating":2},{"id":925335577217683500,"text":"....came to the campaign. Few people knew the young, low level volunteer named George, who has already proven to be a liar. Check the DEMS!","rating":6},{"id":854283110191685600,"text":"Democrat Jon Ossoff would be a disaster in Congress. VERY weak on crime and illegal immigration, bad for jobs and wants higher taxes. Say NO","rating":5},{"id":780597941979480000,"text":"Nothing on emails. Nothing on the corrupt Clinton Foundation. And nothing on #Benghazi. #Debates2016 #debatenight","rating":6},{"id":1127886309316599800,"text":"..There will be nobody left in China to do business with. Very bad for China, very good for USA! But China has taken so advantage of the U.S. for so many years, that they are way ahead (Our Presidents did not do the job). Therefore, China should not retaliate-will only get worse!","rating":7},{"id":805387038048612400,"text":"expensive mistake! THE UNITED STATES IS OPEN FOR BUSINESS","rating":6},{"id":821365569366671400,"text":"country and with the massive cost reductions I have negotiated on military purchases and more, I believe the people are seeing \"\"big stuff.\"\"","rating":3},{"id":1168882690713690000,"text":"Germany, and so many other countries, have negative interest rates, “they get paid for loaning money,” and our Federal Reserve fails to act! Remember, these are also our weak currency competitors!","rating":5},{"id":862282202188566500,"text":"Watching Senator Richard Blumenthal speak of Comey is a joke. \"\"Richie\"\" devised one of the greatest military frauds in U.S. history. For....","rating":7},{"id":909191177810915300,"text":"I will be in Huntsville, Alabama, on Saturday night to support Luther Strange for Senate. \"\"Big Luther\"\" is a great guy who gets things done!","rating":4},{"id":785816454042124300,"text":"Despite winning the second debate in a landslide (every poll), it is hard to do well when Paul Ryan and others give zero support!","rating":6},{"id":817166353266262000,"text":"The Democratic National Committee would not allow the FBI to study or see its computer info after it was supposedly hacked by Russia......","rating":6},{"id":1056923033141698600,"text":"Great job being done by Congressman Keith Rothfus of Pennsylvania. Thank you Keith!","rating":2},{"id":1174342164039401500,"text":".... advantage, and also due to the fact that older, highly polluting cars, will be replaced by new, extremely environmentally friendly cars. There will be very little difference in emissions between the California Standard and the new U.S. Standard, but the cars will be....","rating":4},{"id":1071076523719909400,"text":"....and one of the most highly respected lawyers and legal minds in the Country, he will be a great addition to our team. I look forward to having him join our very successful Administration!","rating":3},{"id":806678853305385000,"text":"If United Steelworkers 1999 was any good, they would have kept those jobs in Indiana. Spend more time working-less time talking. Reduce dues","rating":8},{"id":1236512502210613200,"text":".....least 5 States &amp; the Nomination. Did the DNC &amp; Dems tell Elizabeth Warren to wait? If so, they were deadly, the race would have been over, &amp; Bernie would have won. Dirty double dealing? Nobody knows for sure, &amp; history will be the judge. But I say, here we go AGAIN, Bernie!","rating":6},{"id":923268967728386000,"text":"Spoke to President Xi of China to congratulate him on his extraordinary elevation. Also discussed NoKo &amp, trade, two very important subjects!","rating":4},{"id":986357230219022300,"text":"....Congress – House and Senate must quickly pass a legislative fix to ensure violent criminal aliens can be removed from our society. Keep America Safe!","rating":5},{"id":780535389853458400,"text":"My team of deplorables will be managing my Twitter account for this evenings debate. Tune in!#DebateNight #TrumpPence16","rating":7},{"id":925740081805217800,"text":"....for the Middle Class. The House and Senate should consider ASAP as the process of final approval moves along. Push Biggest Tax Cuts EVER","rating":5},{"id":1185219642668867600,"text":".....this thinking years ago. Instead, it was always held together with very weak bandaids, &amp, in an artificial manner. There is good will on both sides &amp, a really good chance for success. The U.S. has secured the Oil, &amp, the ISIS Fighters are double secured by Kurds &amp, Turkey....","rating":6},{"id":1166358721875894300,"text":"Starting to look good for the highly respected Prime Minister of the Italian Republic, Giuseppe Conte. Represented Italy powerfully at the G-7. Loves his Country greatly &amp, works well with the USA. A very talented man who will hopefully remain Prime Minister!","rating":4},{"id":1032736867391811600,"text":"...Cindy has voted for our Agenda in the Senate 100% of the time and has my complete and total Endorsement. We need Cindy to win in Mississippi!","rating":3},{"id":809384826193276900,"text":"Thank you to Time Magazine and Financial Times for naming me \"\"Person of the Year\"\" - a great honor!","rating":4},{"id":1181553636444426200,"text":"....understands that while we only had 50 soldiers remaining in that section of Syria, and they have been removed, any unforced or unnecessary fighting by Turkey will be devastating to their economy and to their very fragile currency. We are helping the Kurds financially/weapons!","rating":3},{"id":1158706056677200000,"text":"....are NOT planning to illegally subvert the 2020 Election despite all that has been said to the contrary. It all sounded good until I watched Kevin Cernekee, a Google engineer, say terrible things about what they did in 2016 and that they want to “Make sure that Trump losses...","rating":8},{"id":755254384062263300,"text":"It was truly an honor to introduce my wife, Melania. Her speech and demeanor were absolutely incredible. Very proud! #GOPConvention","rating":2},{"id":1042739629139664900,"text":"....The thing that’s lacking is we can’t properly secure the Border because of the Democrats historic level of Obstruction.” Senator David Perdue of Georgia.","rating":3},{"id":1149345683138367500,"text":"...or a very nervous and skinny version of Pocahontas (1/1024th), as your President, rather than what you have now, so great looking and smart, a true Stable Genius! Sorry to say that even Social Media would be driven out of business along with, and finally, the Fake News Media!","rating":9},{"id":857182179469774800,"text":"...the Ninth Circuit, which has a terrible record of being overturned (close to 80%). They used to call this \"\"judge shopping!\"\" Messy system.","rating":5},{"id":869865463584620500,"text":"So now it is reported that the Democrats, who have excoriated Carter Page about Russia, don't want him to testify. He blows away their....","rating":5},{"id":862283792559616000,"text":"years, as a pol in Connecticut, Blumenthal would talk of his great bravery and conquests in Vietnam - except he was never there. When....","rating":6},{"id":1059880322500833300,"text":"Epstein all the way in Michigan House 11. She is a wonderful person and, at the same time, a real fighter. Has my Strong Endorsement!","rating":2},{"id":1299732426873135000,"text":"..Even whether it’s dumb warmongers like John Bolton, social pretenders like Bob Woodward, who never has anything good to say, or an unstable niece, who was now rightfully shunned, scorned and mocked her entire life, and never even liked by her own very kind &amp; caring grandfather!","rating":8},{"id":1171925716503584800,"text":"At the request of the Vice Premier of China, Liu He, and due to the fact that the People's Republic of China will be celebrating their 70th Anniversary....","rating":3},{"id":771145576381427700,"text":"Hillary Clinton didn't go to Louisiana, and now she didn't go to Mexico. She doesn't have the drive or stamina to MAKE AMERICA GREAT AGAIN!","rating":7},{"id":1203783393852493800,"text":"“The Democrats haven’t come up with a smocking gun. Nancy Pelosi, by raising this to the level of Impeachment, has raised the bar impossibly high. This comes after three years of nonstop investigations of Trump, the Russian collusion narrative, the Mueller Report, &amp, now the.....","rating":6},{"id":1010126805850902500,"text":"Congresswoman Martha Roby of Alabama has been a consistent and reliable vote for our Make America Great Again Agenda. She is in a Republican Primary run-off against a recent Nancy Pelosi voting Democrat. I fully endorse Martha for Alabama 2nd Congressional District!","rating":4},{"id":1185277957436248000,"text":"....He is also my friend! At the same time, I am pleased to nominate Deputy Secretary Dan Brouillette to be the new Secretary of Energy. Dan’s experience in the sector is unparalleled. A total professional, I have no doubt that Dan will do a great job!","rating":2},{"id":1149516400341348400,"text":"Paul Ryan, the failed V.P. candidate &amp, former Speaker of the House, whose record of achievement was atrocious (except during my first two years as President), ultimately became a long running lame duck failure, leaving his Party in the lurch both as a fundraiser &amp, leader......","rating":7},{"id":914089003745468400,"text":"...Such poor leadership ability by the Mayor of San Juan, and others in Puerto Rico, who are not able to get their workers to help. They....","rating":5},{"id":1169982535646032000,"text":"Great job by FEMA, Law Enforcement, First Responders, U.S. Coast Guard, and ALL! Keep going, we all appreciate what you are doing!","rating":2},{"id":1188067370478309400,"text":"....","rating":1},{"id":912836917296877600,"text":"70 years ago today, the National Security Council met for the first time. Great history of advising Presidents-then &amp, now! Thanks NSC Staff!","rating":2},{"id":1153795327310221300,"text":"Budget Deal gives great victories to our Military and Vets, keeps out Democrat poison pill riders. Republicans and Democrats in Congress need to act ASAP and support this deal.","rating":3},{"id":1301921581090959400,"text":"...to bringing prosperity and peace to the Balkans and the world. I am proud to have assisted these leaders!","rating":1},{"id":800339165829283800,"text":"I have always had a good relationship with Chuck Schumer. He is far smarter than Harry R and has the ability to get things done. Good news!","rating":2},{"id":890935044474380300,"text":"...Even though parts of healthcare could pass at 51, some really good things need 60. So many great future bills &amp, budgets need 60 votes....","rating":1},{"id":1254479608617095200,"text":"....to the REAL REPORTERS &amp; JOURNALISTS who got it right. I can give the Committee a very comprehensive list. When will the Noble Committee DEMAND the Prizes back, especially since they were gotten under fraud? The reporters and Lamestream Media knew the truth all along....","rating":6},{"id":911545480651378700,"text":"Large Block Grants to States is a good thing to do. Better control &amp,  management. Great for Arizona. McCain let his best friend L.G. down!","rating":2},{"id":923866515358789600,"text":"Wacky &amp, totally unhinged Tom Steyer, who has been fighting me and my Make America Great Again agenda from beginning, never wins elections!","rating":7},{"id":860477328882905100,"text":"Big win in the House - very exciting! But when everything comes together with the inclusion of Phase 2, we will have truly great healthcare!","rating":3},{"id":787699930718695400,"text":"The election is absolutely being rigged by the dishonest and distorted media pushing Crooked Hillary - but also at many polling places - SAD","rating":8},{"id":808528428123254800,"text":"Even though I am not mandated by law to do so, I will be leaving my busineses before January 20th so that I can focus full time on the......","rating":7},{"id":1039117933623078900,"text":"“I’m taking this book with a grain of salt &amp, everyone should do the same. Multiple sources, but almost every one of them has come out and discredited the claims made by Woodward. You cannot take this book too seriously.” Katelyn Caralle, Washington Examiner","rating":5},{"id":918060313748164600,"text":"...if Congress gives us the massive tax cuts (and reform) I am asking for, those numbers will grow by leaps and bounds. #MAGA","rating":6},{"id":1171925717988388900,"text":"....on October 1st, we have agreed, as a gesture of good will, to move the increased Tariffs on 250 Billion Dollars worth of goods (25% to 30%), from October 1st to October 15th.","rating":4},{"id":913549374227181600,"text":"FEMA &amp, First Responders are doing a GREAT job in Puerto Rico. Massive food &amp, water delivered. Docks &amp, electric grid dead. Locals trying....","rating":6},{"id":878019881353871400,"text":"I am very supportive of the Senate #HealthcareBill. Look forward to making it really special! Remember, ObamaCare is dead.","rating":5},{"id":886262474277888000,"text":"Will be at the Women's U.S. Open today!","rating":3},{"id":876900944444837900,"text":"Karen Handel's opponent in #GA06 can't even vote in the district he wants to represent....","rating":4},{"id":759743648573435900,"text":"I was viciously attacked by Mr. Khan at the Democratic Convention. Am I not allowed to respond? Hillary voted for the Iraq war, not me!","rating":8},{"id":1141132100273418200,"text":"Join me LIVE tonight in Orlando, Florida at 8:00 P.M. Eastern as we kickoff #Trump2020. Enjoy!","rating":4},{"id":877932956458795000,"text":"...whether there are \"\"tapes\"\" or recordings of my conversations with James Comey, but I did not make, and do not have, any such recordings.","rating":3},{"id":1303843244451729400,"text":"...If in doubt, ask why the bill withholds $12 billion in highway funds until local authorities agree to federal control? I will protect the suburbs. Biden will destroy the suburbs!","rating":4},{"id":1146178858586116100,"text":"....Prior to his current position, Christopher served as a professor and Chair of Economics at Notre Dame.","rating":1},{"id":789520268972601300,"text":"The results are in on the final debate and it is almost unanimous, I WON! Thank you, these are very exciting times.","rating":6},{"id":785898532645503000,"text":"I hope people are looking at the disgraceful behavior of Hillary Clinton as exposed by WikiLeaks. She is unfit to run.","rating":7},{"id":901814456505831400,"text":"Going to a Cabinet Meeting (tele-conference) at 11:00 A.M. on #Harvey. Even experts have said they've never seen one like this!","rating":5},{"id":913003340451188700,"text":"With one Yes vote in hospital &amp, very positive signs from Alaska and two others (McCain is out), we have the HCare Vote, but not for Friday!","rating":2},{"id":1207651085739016200,"text":"I got Impeached last might without one Republican vote being cast with the Do Nothing Dems on their continuation of the greatest Witch Hunt in American history. Now the Do Nothing Party want to Do Nothing with the Articles &amp, not deliver them to the Senate, but it’s Senate’s call!","rating":8},{"id":750094399456026600,"text":"Why is President Obama allowed to use Air Force One on the campaign trail with Crooked Hillary? She is flying with him tomorrow. Who pays?","rating":6},{"id":924382919845666800,"text":"...in order to put any and all conspiracy theories to rest.","rating":1},{"id":1033045274866999300,"text":"...Additionally, because of our much tougher Trading stance with China, I do not believe they are helping with the process of denuclearization as they once were (despite the UN Sanctions which are in place)...","rating":5},{"id":1169356705857187800,"text":"7. The badly flawed Paris Climate Agreement protects the polluters, hurts Americans, and cost a fortune. NOT ON MY WATCH!8. I want crystal clean water and the cleanest and the purest air on the planet – we’ve now got that!","rating":8},{"id":1203030941108711400,"text":"....The King said that the Saudi people are greatly angered by the barbaric actions of the shooter, and that this person in no way shape or form represents the feelings of the Saudi people who love the American people.","rating":4},{"id":1131137371305644000,"text":"After two years of an expensive and comprehensive Witch Hunt, the Democrats don’t like the result and they want a DO OVER. In other words, the Witch Hunt continues!","rating":7},{"id":1322252823136891000,"text":"...Disasters. At every turn, Biden twisted his knife into the back of Michigan workers. In 2016, Michigan voted to FIRE this corrupt political establishment and you elected an outsider as President who is finally putting AMERICA FIRST!\n\n#VOTE #MAGA","rating":7},{"id":1221190416201969700,"text":"....at the judges that we have right now.","rating":2},{"id":1052268011900555300,"text":"Just spoke with the Crown Prince of Saudi Arabia who totally denied any knowledge of what took place in their Turkish Consulate. He was with Secretary of State Mike Pompeo...","rating":5},{"id":785102728334893000,"text":"Tremendous support (except for some Republican \"\"leadership\"\"). Thank you.","rating":3},{"id":1022872576211730400,"text":"...John is strong on crime and borders, loves our Military, our Vets and our Second Amendment. He will be a star. He has my full and total Endorsement!","rating":4},{"id":1177211112992977000,"text":"“Is their a case for impeachment? Absolutely not!” There is no high crimes or misdemeanors, no treason, no extortion, no treason.” RD Robert Ray, respected","rating":6},{"id":910665452048838700,"text":"The NRA strongly endorses Luther Strange for Senator of Alabama.That means all gun owners should vote for Big Luther. He won't let you down!","rating":3},{"id":1182657102357110800,"text":"I will be in Louisiana tonight (Love it!) to get Republicans to vote for either of our two great Republican Candidates and force a run off with John Bel Edwards, who has done a really poor job of tax cutting, car insurance cost (worst in USA), &amp, is suspect on your 2nd Amendment!","rating":4},{"id":900708017909506000,"text":"..(enthusiastic, dynamic and fun) and the American Legion - V.A. (respectful and strong). Too bad the Dems have no one who can change tones!","rating":2},{"id":908278070611779600,"text":"...They have been in our country for many years through no fault of their own - brought in by parents at young age. Plus BIG border security","rating":2},{"id":1009527495043924000,"text":"Had a great meeting with the House GOP last night at the Capitol. They applauded and laughed loudly when I mentioned my experience with Mark Sanford. I have never been a fan of his!","rating":6},{"id":1054759617165754400,"text":"Congressman John Faso of New York has worked hard and smart. Strong on Crime, Borders and our 2nd Amendment, John is respected by all. Vote for John. He has my complete and total Endorsement!","rating":3},{"id":1183819526753980400,"text":"Great new book, \"\"Resistance (At All Costs): How Trump Haters Are Breaking America\"\" out by Kimberley Strassel of the Wall Street Journal. Kim has treated us fairly, and for that I am very appreciative. Check it out today, it is great!","rating":2},{"id":779729180334387200,"text":"If dopey Mark Cuban of failed Benefactor fame wants to sit in the front row, perhaps I will put Gennifer Flowers right alongside of him!","rating":9},{"id":1149472285905940500,"text":"...and International. We have only one real currency in the USA, and it is stronger than ever, both dependable and reliable. It is by far the most dominant currency anywhere in the World, and it will always stay that way. It is called the United States Dollar!","rating":1},{"id":1041065107969777700,"text":"Congressman Pete Sessions of Texas is doing a great job. He is a fighter who will be tough on Crime and the Border, fight hard for our Second Amendment and loves our Military and our Vets. He has my full and complete Endorsement!","rating":3},{"id":1181207822039683000,"text":"....doesn’t even include the almost $2000 that the families got from the Trump Tax Cut.” Stephen Moore, Freedomworks  That means $5000 to $6000 more in disposable yearly income that Americans have right now because of President Trump!","rating":3},{"id":1127886307995336700,"text":"....completely avoided if you by from a non-Tariffed Country, or you buy the product inside the USA (the best idea). That’s Zero Tariffs. Many Tariffed companies will be leaving China for Vietnam and other such countries in Asia. That’s why China wants to make a deal so badly!...","rating":5},{"id":1229790099866603500,"text":"The United States cannot, &amp; will not, become such a difficult place to deal with in terms of foreign countries buying our product, including for the always used National Security excuse, that our companies will be forced to leave in order to remain competitive. We want to sell...","rating":4},{"id":816652088662958100,"text":"massive increases of ObamaCare will take place this year and Dems are to blame for the mess. It will fall of its own weight - be careful!","rating":6},{"id":1220336692378394600,"text":"....during his hopeless “presidential” campaign. They will remain silent! The fact is, when Mini losses, he will be spending very little of his money on these “clowns” because he will consider himself to be the biggest clown of them all - and he will be right!","rating":7},{"id":750352884106223600,"text":"The system is rigged. General Petraeus got in trouble for far less. Very very unfair! As usual, bad judgment.","rating":8},{"id":1164684313713172500,"text":"Looking forward to soon being in North Carolina to hold a big rally for wonderful Dan Bishop, who is running for Congress. His opponent wants Open Borders, Sanctuary Cities, and Socialism. He likes the “Squad” more than North Carolina. Dan has my Full and Complete Endorsement!","rating":3},{"id":923552633633337300,"text":"Ed Gillespie will be a great Governor of Virginia. His opponent doesn't even show up to meetings/work, and will be VERY weak on crime!","rating":2},{"id":853944453538750500,"text":"A great book for your reading enjoyment: \"\"REASONS TO VOTE FOR DEMOCRATS\"\" by Michael J. Knowles.","rating":9},{"id":919005534883328000,"text":"Many people talking, with much agreement, on my Iran speech today. Participants in the deal are making lots of money on trade with Iran!","rating":4},{"id":987679852345135100,"text":"....it means lying or making up stories. Sorry, I don’t see Michael doing that despite the horrible Witch Hunt and the dishonest media!","rating":7},{"id":770811688966770700,"text":"I have accepted the invitation of President Enrique Pena Nieto, of Mexico, and look very much forward to meeting him tomorrow.","rating":4},{"id":753720863606775800,"text":"Another horrific attack, this time in Nice, France. Many dead and injured. When will we learn? It is only getting worse.","rating":5},{"id":819864373988573200,"text":"Totally made up facts by sleazebag political operatives, both Democrats and Republicans - FAKE NEWS! Russia says nothing exists. Probably...","rating":8},{"id":1011394762979586000,"text":"Just landed in South Carolina - will be at the McMaster rally shortly! #MAGA","rating":3},{"id":861715019674910700,"text":"Biggest story today between Clapper &amp, Yates is on surveillance. Why doesn't the media report on this? #FakeNews!","rating":6},{"id":1142055383193804800,"text":"....Death to America. I terminated deal, which was not even ratified by Congress, and imposed strong sanctions. They are a much weakened nation today than at the beginning of my Presidency, when they were causing major problems throughout the Middle East. Now they are Bust!....","rating":7},{"id":1181547333990916000,"text":".....good health, at my request, Pastor Brunson, who had many years of a long prison term remaining. Also remember, and importantly, that Turkey is an important member in good standing of NATO. He is coming to the U.S. as my guest on November 13th. #ENDENDLESSWARS","rating":5},{"id":1055531231495024600,"text":"...I agree with their stance 100%, and the United States is likewise taking a very hard line on illegal immigration. The Prime Minister is working very hard on the economy of Italy - he will be successful!","rating":4},{"id":1190375831840985000,"text":"....our great police are being disrespected, even with water dumped on them, because a Mayor and Governor just don’t “have their backs.” New York’s Finest must be cherished, respected and loved. Too many prople are leaving our special New York. Great leaders would work....","rating":6},{"id":868441116726710300,"text":"I will make my final decision on the Paris Accord next week!","rating":3},{"id":1149318492711264300,"text":"Mexico is doing great at the Border, but China is letting us down in that they have not been buying the agricultural products from our great Farmers that they said they would. Hopefully they will start soon!","rating":5},{"id":1192307862204108800,"text":"....The LameStream Media, which is The Enemy of the People, is working overtime with made up stories in order to drive dissension and distrust!","rating":7},{"id":1171118516864454700,"text":"...the Economy, where there is NO Recession, much to the regret of the LameStream Media! They are working overtime to help the Democrats win in 2020, but that will NEVER HAPPEN, Americans are too smart!","rating":6},{"id":819865802849587200,"text":"released by \"\"Intelligence\"\" even knowing there is no proof, and never will be. My people will have a full report on hacking within 90 days!","rating":4},{"id":1169981019228913700,"text":"....This nonsense has never happened to another President. Four days of corrupt reporting, still without an apology. But there are many things that the Fake News Media has not apologized to me for, like the Witch Hunt, or SpyGate! The LameStream Media and their Democrat.....","rating":8},{"id":1167028669988126700,"text":"Puerto Rico is in great shape with Hurricane Dorian taking a largely different route than anticipated. Thank you to FEMA, first responders, and all, for working so hard &amp, being so well prepared. A great result! The bad news, Florida get ready! Storm is building and will be BIG!","rating":4},{"id":908640949605163000,"text":"With the ridiculous Filibuster Rule in the Senate, Republicans need 60 votes to pass legislation, rather than 51. Can't get votes, END NOW!","rating":7},{"id":1208228664049111000,"text":"My Administration pushed to include a big expansion to Veteran telehealth in the spending bill so that the brave men and women who served our Country get the care they need. #RuralProsperity","rating":3},{"id":1322252819299135500,"text":"...a cheerleader for NAFTA – sending your auto Jobs to Mexico. He voted for China’s entry into the World Trade Organization – gutting your industries to finance China’s rise. HALF of all Michigan auto manufacturing jobs were ELIMINATED after the Biden-Backed NAFTA and China...","rating":5},{"id":1170123710164013000,"text":"....that were not hit – and that are in good condition. Any cruise ship companies willing to act as stationary housing, etc., I am sure would be appreciated!","rating":2},{"id":1171118507712503800,"text":"...the look of turmoil in the White House, of which there is none. I view much of the media as simply an arm of the Democrat Party. They are corrupt, and they are extremely upset at how well our Country is doing under MY Leadership, including...","rating":6},{"id":1149661698829234200,"text":".....if Mexico produces (which I think they will). Biggest part of deal with Mexico has not yet been revealed! China is similar, except they devalue currency &amp, subsidize companies to lessen effect of 25% Tariffs. So far, little effect to consumers. Companies will relocate to U.S.","rating":5},{"id":1323330601953431600,"text":"...our noble history, heritage &amp; heroes; and ANTIFA, the rioters, looters, Marxists, &amp; left-wing extremists. THEY ALL SUPPORT JOE BIDEN!","rating":7},{"id":786201435486781400,"text":"Very little pick-up by the dishonest media of incredible information provided by WikiLeaks. So dishonest! Rigged system!","rating":8},{"id":1003998873004773400,"text":"Terrific new book out by the wonderful Harris Faulkner, “9 Rules of Engagement.” Harris shares lessons from a military family. Enjoy!","rating":3},{"id":1194214569591394300,"text":"....Ukrainian energy company, and more millions taken from China, and now reports of other companies and countries also giving him big money, are certainly looking very corrupt (to put it mildly!) to me. Both Bidens should be forced to testify in this No Due Process Scam!","rating":6},{"id":752110630031749100,"text":"Look what is happening to our country under the WEAK leadership of Obama and people like Crooked Hillary Clinton. We are a divided nation!","rating":6},{"id":816265668958031900,"text":"The Democrat Governor.of Minnesota said \"\"The Affordable Care Act (ObamaCare) is no longer affordable!\"\" - And, it is lousy healthcare.","rating":5},{"id":1041067762452455400,"text":"Congressman Keith Rothfus continues to do a great job for the people of Pennsylvania. Keith is strong on Crime, the Border, and our Second Amendment. Loves our Military and our Vets. He has my total Endorsement!","rating":3},{"id":1183818841941565400,"text":"The Fox Impeachment poll has turned out to be incorrect. This was announced on Friday. Despite this, the Corrupt New York Times used this poll in one of its stories, no mention....","rating":6},{"id":880049704620494800,"text":"The #AmazonWashingtonPost, sometimes referred to as the guardian of Amazon not paying internet taxes (which they should) is FAKE NEWS!","rating":7},{"id":1149693842263642100,"text":"....Alex was a great Secretary of Labor and his service is truly appreciated. He will be replaced on an acting basis by Pat Pizzella, the current Deputy Secretary.","rating":3},{"id":811562990285848600,"text":"I would have done even better in the election, if that is possible, if the winner was based on popular vote - but would campaign differently","rating":4},{"id":1302985926809923600,"text":"Biggest and Fastest Financial Recovery In History. Next year will be the best ever, unless a Sleepy person, who wants to massively raise your taxes, gets in. I’m which case, CRASH!!!","rating":8},{"id":793400131525677000,"text":"Look at the way Crooked Hillary is handling the e-mail case and the total mess she is in. She is unfit to be president. Bad judgement!","rating":9},{"id":1264892000052088800,"text":"...to find, with all of the jobs and economic development it brings, another Republican National Convention site. This is not something I want to do. Thank you, and I LOVE the people of North Carolina!","rating":2},{"id":1024264286418489300,"text":"I am looking into 3-D Plastic Guns being sold to the public. Already spoke to NRA, doesn’t seem to make much sense!","rating":5},{"id":1149317468730662900,"text":"Now the Democrats have asked to see 12 more people who have already spent hours with Robert Mueller, and spent a fortune on lawyers in so doing. How many bites at the apple do they get before working on Border Loopholes and Asylum. They also want to interview the highly......","rating":6},{"id":925364408364171300,"text":"....earth shattering. He and his brother could Drain The Swamp, which would be yet another campaign promise fulfilled. Fake News weak!","rating":8},{"id":1042078530413240300,"text":"...that FEMA, our Military, and our First Responders, who are all unbelievable, are a disaster and not doing a good job. This will be a total lie, but that’s what they do, and everybody knows it!","rating":8},{"id":1202232743876161500,"text":"....When today’s meetings are over, I will be heading back to Washington. We won’t be doing a press conference at the close of NATO because we did so many over the past two days. Safe travels to all!","rating":4},{"id":1181940394604535800,"text":"....DACA stand, with all of its negative legal implications, the Republicans and Democrats will have a DEAL to let them stay in our Country, in very short order. It would actually benefit DACA, and be done the right way!","rating":5},{"id":876899176562524200,"text":"Ralph Norman, who is running for Congress in SC's 5th District, will be a fantastic help to me in cutting taxes, and....","rating":3},{"id":1042838324187213800,"text":"...North Korea to be identified as a result of my Summit with Chairman Kim. These HEROES are home, they may Rest In Peace, and hopefully their families can have closure.","rating":6},{"id":816977032433270800,"text":"The Democrats, lead by head clown Chuck Schumer, know how bad ObamaCare is and what a mess they are in. Instead of working to fix it, they..","rating":7},{"id":1149661697675681800,"text":"....companies to come to the USA and to get companies that have left us for other lands to COME BACK HOME. We  stupidly lost 30% of our auto business to Mexico. If the Tariffs went on at the higher level, they would all come back, and fast. But very happy with the deal I made,...","rating":5},{"id":857370270776086500,"text":"Democrats are trying to bail out insurance companies from disastrous #ObamaCare, and Puerto Rico with your tax dollars. Sad!","rating":8},{"id":1183821342455586800,"text":"“To his credit the Europeans didn't step up to deal with this ISIS problem – it’s a lot of the reason why we are in this situation today. Now, Angela Merkel of Germany is finally stepping up and telling Turkey to back off....","rating":4},{"id":759029315006705700,"text":"Crooked Hillary said that I \"\"couldn't handle the rough and tumble of a political campaign.\"\" Really,I just beat 16 people and am beating her!","rating":9},{"id":861713233786404900,"text":"Sally Yates made the fake media extremely unhappy today --- she said nothing but old news!","rating":5},{"id":1169366511439552500,"text":"State Rep Greg Murphy is running for Congress in North Carolina, District 3. We really need Greg in Washington. He is great w/ the Military, our Vets, &amp, your 2A. Strong on Crime and the Border, has had my Total Endorsement for a long time. Please vote for Greg on September 10th!","rating":3},{"id":933692459351265300,"text":"Will be doing a live Thanksgiving Video Teleconference with Members of the Military at 9:00 A.M.  Afghanistan, Iraq, USS Monterey, Turkey &amp, Bahrain. Then going to Coast Guard Quarters, Florida.","rating":2},{"id":909381488445190100,"text":"Attorney General Bill Schuette will be a fantastic Governor for the great State of Michigan. I am bringing back your jobs and Bill will help","rating":2},{"id":1058498592208494600,"text":"I need the people of West Virginia to send a message to Chuck Schumer, Maxine Waters, Nancy Pelosi and the Radical Democrats by voting for Carol Miller and Patrick Morrisey!","rating":4},{"id":1207053956142293000,"text":"Senator Dan Sullivan is doing a great job for the people of Alaska while supporting our #MAGA Agenda. He fights hard everyday to support our Veterans and the Military. Dan is Strong on the #2A and is 100% pro-jobs. I give Dan Sullivan my Complete and Total Endorsement!","rating":3},{"id":812264762981675000,"text":"My wonderful son, Eric, will no longer be allowed to raise money for children with cancer because of a possible conflict of interest with...","rating":7},{"id":1232652397325037600,"text":"I will be having a News Conference at the White House, on this subject, today at 6:00 P.M. CDC representatives, and others, will be there. Thank you!","rating":1},{"id":1197534774182785000,"text":".....President Trump said the Ukraine President should just do the right thing (No Quid Pro Quo). You shouldn’t charge, but you cannot convict, a sitting president on the basis of conflicting and ambiguous evidence, and destabilize the American Government.” Thank you Ken!","rating":6},{"id":1152212059263819800,"text":"....Fed: There is almost no inflation!","rating":4},{"id":758242674646323200,"text":"Crooked Hillary Clinton wants to flood our country with Syrian immigrants that we know little or nothing about. The danger is massive. NO!","rating":8},{"id":1244320572777136000,"text":"...alone attracted 6.2 million viewers for the president’s briefing — an astounding number for a 6 p.m. cable broadcast, more akin to the viewership for a popular prime-time sitcom...","rating":3},{"id":1161327783882231800,"text":"Just landed in Pennsylvania. Looking forward to making a speech on energy. So important!","rating":2},{"id":1139123051788980200,"text":".....much tougher game than the Republicans did when they had the House Majority. Republicans will remember! “This has already been argued before the U.S. Supreme Court, but the House doesn’t want to wait. This is a common thread between all of the Committees - do whatever you...","rating":4},{"id":1169637650627747800,"text":"....His dedication to Israel and to seeking peace between Israel and the Palestinians won’t be forgotten. He will be missed. Thank you Jason!","rating":2},{"id":865169927644340200,"text":"With all of the illegal acts that took place in the Clinton campaign &amp, Obama Administration, there was never a special councel appointed!","rating":6},{"id":846537639167713300,"text":"The Republican House Freedom Caucus was able to snatch defeat from the jaws of victory. After so many bad years they were ready for a win!","rating":5},{"id":1229756038469079000,"text":"....badly tainted and, in my opinion, should be thrown out. Even Mueller’s statement to Congress that he did not see me to become the FBI Director (again), has been proven false. The whole deal was a total SCAM. If I wasn’t President, I’d be suing everyone all over the place...","rating":7},{"id":790523240351498200,"text":"Wow, just came out on secret tape that Crooked Hillary wants to take in as many Syrians as possible. We cannot let this happen - ISIS!","rating":9},{"id":805376548882776000,"text":"The U.S. is going to substantialy reduce taxes and regulations on businesses, but any business that leaves our country for another country,","rating":5},{"id":1149283451415273500,"text":"....And remember, a bank that I did use years ago, the now badly written about and maligned Deutsche Bank, was then one of the largest and most prestigious banks in the world! They wanted my business, and so did many others!","rating":5},{"id":1164141252125843500,"text":"Brandon Judd, President, National Border Patrol Council. “This will effectively end Catch and Release and curb illegal entries.”","rating":4},{"id":1186982948404449300,"text":"....Order a couple of months ago saying that any school that does not uphold the First Amendment Rights of its students will lose Federal Funding. We have seen a huge change in how the Universities interact with us as a national &amp, local student organization. Our studends....","rating":6},{"id":965935035328155600,"text":"Matt Schlapp and CPAC are getting ready for another exciting event. Big difference from those days when President Obama held the White House. You’ve come a long way Matt!","rating":3},{"id":897764432369070100,"text":"Congratulation to Roy Moore and Luther Strange for being the final two and heading into a September runoff in Alabama. Exciting race!","rating":3},{"id":807970490635743200,"text":"Whether I choose him or not for \"\"State\"\"- Rex Tillerson, the Chairman &amp, CEO of ExxonMobil, is a world class player and dealmaker. Stay tuned!","rating":4},{"id":1169606058148606000,"text":"Alabama was going to be hit or grazed, and then Hurricane Dorian took a different path (up along the East Coast). The Fake News knows this very well. That’s why they’re the Fake News!","rating":7},{"id":791233632593739800,"text":"REPEAL AND REPLACE OBAMACARE!","rating":5},{"id":1187080935373713400,"text":"....Does anybody think this is fair? Even though there was no quid pro quo, I’m sure they would like to try. Worse than the Dems!","rating":6},{"id":928861178113040400,"text":"Just landed in Da Nang, Vietnam to deliver a speech at #APEC2017","rating":2}]