[{"id":924382752941756400,"text":"...addresses of any mentioned person who is still living. I am doing this for reasons of full disclosure, transparency and...","rating":3},{"id":783885674575491100,"text":"Praying for everyone in Florida. Hoping the hurricane dissipates, but in any event, please be careful.","rating":4},{"id":751232353129955300,"text":"After today, Crooked Hillary can officially be called Lyin' Crooked Hillary.","rating":8},{"id":1229752039040782300,"text":".....existence of these tweets in which you were so harshly negative about the President &amp; the people who support him. Don’t you think we wanted to know that before we put you on this jury.’ Pretty obvious he should (get a new trial). I think almost any judge in the Country.....","rating":5},{"id":734231223002894300,"text":"Crooked Hillary said that I  want guns brought into the school classroom. Wrong!","rating":6},{"id":1165652674705969200,"text":"Happy Birthday Regis, a truly special man!","rating":2},{"id":1171195460670939100,"text":"NORTH CAROLINA — Vote for Dan Bishop in #NC09 and Greg Murphy in #NC03 TOMORROW. Make it a great day for Republicans!","rating":3},{"id":1303831588598415400,"text":"...I’ll take the Endorsement of Law Enforcement all over the Country, and Joe can have the RINO’S. This Snyder mess was made during the OBiden era - no wonder they’re friends!","rating":7},{"id":1169945440240001000,"text":"....have the discretion to end the program that President Obama began in his discretion. That program was unlawful to begin with. I think it’s very unlikely that the SCOTUS is going to issue an order reinstating what it believes is an unlawful program. DACA Is unlawful.” .....","rating":4},{"id":816977937731878900,"text":"...do the typical political thing and BLAME. The fact is ObamaCare was a lie from the beginning.\"\"Keep you doctor, keep your plan!\"\" It is....","rating":6},{"id":1197503791744069600,"text":".....But we are winning big, and they will soon be on our turf.","rating":5},{"id":856484873133060100,"text":"The Wall is a very important tool in stopping drugs from pouring into our country and poisoning our youth (and many others)! If","rating":6},{"id":1149317469544374300,"text":"....conflicted and compromised Mueller again. He said he was “done” after his last 9 minute speech, and that he had nothing more to say outside of the No Collusion, No Obstruction, Report. Enough already, go back to work! I won, unanimously, the big Emoluments case yesterday!","rating":8},{"id":1171595113673347000,"text":"Senator Ben Sasse has done a wonderful job representing the people of Nebraska. He is great with our Vets, the Military, and your very important Second Amendment. Strong on Crime and the Border, Ben has my Complete and Total Endorsement!","rating":3},{"id":1194214568001724400,"text":".....”no pressure” put on him to investigate Sleepy Joe Biden even though, as President, I have an “obligation” to look into corruption, and Biden’s actions, on tape, about firing the prosecutor, and his son’s taking millions of dollars, with no knowledge or talent, from a.....","rating":7},{"id":817334794958807000,"text":"Hillary and the Dems were never going to beat the PASSION of my voters. They saw what was happening in the last two weeks before the......","rating":6},{"id":868406076995235800,"text":"Big G7 meetings today. Lots of very important matters under discussion. First on the list, of course, is terrorism. #G7Taormina","rating":4},{"id":973207890084401200,"text":"The Pittsburgh Post Gazette just endorsed Rick Saccone for Congress. He will be much better for steel and business. Very strong on experience and what our Country needs. Lamb will always vote for Pelosi and Dems....Will raise taxes, weak on Crime and Border.","rating":5},{"id":764867963845484500,"text":"I am not only fighting Crooked Hillary, I am fighting the dishonest and corrupt media and her government protection process. People get it!","rating":9},{"id":1022265842644525000,"text":"...along quickly. European Union Nations will be open to the United States and at the same time benefiting by everything we are doing for them. There was great warmth and feeling in the room - a breakthrough has been quickly made that nobody thought possible!","rating":6},{"id":1167799335096131600,"text":"Looking like our great South Carolina could get hit MUCH harder than first thought. Georgia and North Carolina also. It’s moving around and very hard to predict, except that it is one of the biggest and strongest (and really wide) that we have seen in decades. Be safe!","rating":3},{"id":787612552654155800,"text":"Watched Saturday Night Live hit job on me.Time to retire the boring and unfunny show. Alec Baldwin portrayal stinks. Media rigging election!","rating":8},{"id":1029716105420595200,"text":"Scott Walker is very special and will have another great win in November. He has done a fantastic job as Governor of Wisconsin and will always have my full support and Endorsement!","rating":2},{"id":770039317142069200,"text":"I think that both candidates, Crooked Hillary and myself, should release detailed medical records. I have no problem in doing so! Hillary?","rating":5},{"id":1197954044393861000,"text":"...House Republicans are showing real LEADERSHIP and prepared to enact bipartisan solutions for drug prices. Do Nothing Democrats are playing partisan politics with YOUR drug prices! We are READY to work together if they actually want to get something done!","rating":4},{"id":1189505265151991800,"text":".....the call with the Ukrainian President was a totally appropriate one. As he said, “No Pressure.” This Impeachment nonsense is just a continuation of the Witch Hunt Hoax, which has been going on since before I even got elected. Rupublicans, go with Substance and close it out!","rating":6},{"id":912494675206053900,"text":"Big election tomorrow in the Great State of Alabama. Vote for Senator Luther Strange, tough on crime &amp, border - will never let you down!","rating":3},{"id":848204870876356600,"text":"...use subsidies to buy health plans.\"\" In other words, Ocare is dead. Good things will happen, however, either with Republicans or Dems.","rating":2},{"id":1198328606684012500,"text":"....ANY DIRECT EVIDENCE THAT PRESIDENT TRUMP DID ANYTHING IMPEACHABLE. No one heard him order a quid pro quo. No one offered a convincing reason why Trump’s interest in having Ukraine probe potential cortuption warrants Impeachment. “I want no Quid Pro Quo” Ambassador....","rating":7},{"id":927851387857367000,"text":"Ralph Northam will allow crime to be rampant in Virginia. He’s weak on crime, weak on our GREAT VETS, Anti-Second Amendment....","rating":5},{"id":1189914359310553000,"text":"....our manufacturers. We should have lower interest rates than Germany, Japan and all others. We are now, by far, the biggest and strongest Country, but the Fed puts us at a competitive disadvantage. China is not our problem, the Federal Reserve is! We will win anyway.","rating":6},{"id":918430769776914400,"text":"...accountability say the Governor. Electric and all infrastructure was disaster before hurricanes. Congress to decide how much to spend....","rating":3},{"id":1149345681829744600,"text":"...years, or maybe 10 or 14 (just kidding), they will quickly go out of business for lack of credibility, or approval, from the public. That’s why they will all be Endorsing me at some point, one way or the other. Could you imagine having Sleepy Joe Biden, or Alfred E. Newman...","rating":8},{"id":777494113834917900,"text":"I would like to express my warmest regards, best wishes and condolences to all of the families and victims of the horrible bombing in NYC.","rating":2},{"id":1187708411309375500,"text":"....USA has gained Trillions of Dollars in wealth since November 2016. All others way down. Our power is Economic before having to use our newly rebuilt Military, a much better alternative. Oil is secured. Our soldiers have left and are leaving Syria for other places, then....","rating":5},{"id":763180978588221400,"text":"When is the media going to talk about Hillary's policies that have gotten people killed, like Libya, open borders, and maybe her emails?","rating":7},{"id":1054348185160896500,"text":"Congressman Tom Reed of New York’s 23rd District has done a great job. He has my complete and total Endorsement!","rating":2},{"id":1171586230628311000,"text":"One down, one to go – Greg Murphy is projected to win in the Great State of North Carolina! #NC03","rating":3},{"id":1014257237945176000,"text":"After having written many best selling books, and somewhat priding myself on my ability to write, it should be noted that the Fake News constantly likes to pour over my tweets looking for a mistake. I capitalize certain words only for emphasis, not b/c they should be capitalized!","rating":9},{"id":756804886038192100,"text":"Leaked e-mails of DNC show plans to destroy Bernie Sanders. Mock his heritage and much more. On-line from Wikileakes, really vicious. RIGGED","rating":8},{"id":805539770864693200,"text":"their country (the U.S. doesn't tax them) or to build a massive military complex in the middle of the South China Sea?  I don't think so!","rating":6},{"id":793769750056677400,"text":"I am going to repeal and replace ObamaCare. We will have MUCH less expensive and MUCH better healthcare. With Hillary, costs will triple!","rating":7},{"id":1190375834529468400,"text":".....with a President and Federal Government that wants our wonerful City and State to flourish and thrive. I Love New York!","rating":5},{"id":803930240661811200,"text":"do this under the law, I feel it is visually important, as President,  to in no way have a conflict of interest with my various businesses..","rating":4},{"id":1230882784937267200,"text":"Four great candidates are under consideration at DNI. Decision within next few weeks!","rating":3},{"id":1201455859731239000,"text":".....Reserve should likewise act so that countries, of which there are many, no longer take advantage of our strong dollar by further devaluing their currencies. This makes it very hard for our manufactures &amp, farmers to fairly export their goods. Lower Rates &amp, Loosen - Fed!","rating":4},{"id":807945982633709600,"text":"I spent Friday campaigning with John Kennedy, of the Great State of Louisiana, for the U.S.Senate. The election is over - JOHN WON!","rating":2},{"id":920268091329859600,"text":"Rep.Tom Marino has informed me that he is withdrawing his name from consideration as drug czar. Tom is a fine man and a great Congressman!","rating":3},{"id":758871653547806700,"text":"Hillary's refusal to mention Radical Islam, as she pushes a 550% increase in refugees, is more proof that she is unfit to lead the country.","rating":8},{"id":1176888296863125500,"text":"“He (President Trump) didn’t specifically mention the explicit quid pro quo of...unless you investigate this...we’re going to withhold military aid to you.” Pamela Brown","rating":6},{"id":1169356704926109700,"text":"6. The Democrats’ destructive “environmental” proposals will raise your energy bill and prices at the pump. Don't the Democrats care about fighting American poverty?","rating":7},{"id":784916001783709700,"text":"Thank you to my great supporters in Wisconsin. I heard that the crowd and enthusiasm was unreal!","rating":3},{"id":1029712857724792800,"text":"Congratulations to Leah Vukmir of Wisconsin on your great win last night. You beat a very tough and good competitor and will make a fantastic Senator after winning in November against someone who has done very little. You have my complete and total Endorsement!","rating":2},{"id":1197954043420827600,"text":"...Pelosi and her Do Nothing Democrats drug pricing bill doesn’t do the trick. FEWER cures! FEWER treatments! Time for the Democrats to get serious about bipartisan solutions to lowering prescription drug prices for families...","rating":5},{"id":768119463421943800,"text":"President Obama should have gone to Louisiana days ago, instead of golfing. Too little, too late!","rating":6},{"id":987679850545778700,"text":"....non-existent “sources” and a drunk/drugged up loser who hates Michael, a fine person with a wonderful family. Michael is a businessman for his own account/lawyer who I have always liked &amp, respected. Most people will flip if the Government lets them out of trouble, even if....","rating":8},{"id":1234728725574561800,"text":"....paying higher rates than many others, when we should be paying less. Tough on our exporters and puts the USA at a competitive disadvantage. Must be the other way around. Should ease and cut rate big. Jerome Powell led Federal Reserve has called it wrong from day one. Sad!","rating":4},{"id":1175766532590145500,"text":"“Go across the world and you’ll see either very low interest rates, or negative rates. The President wants to be competitive with these other countries on this, but I don’t think he’ll fire Jay Powell (even if I should!).” We should always be paying less interest than others!","rating":4},{"id":1149472284702208000,"text":"....Similarly, Facebook Libra’s “virtual currency” will have little standing or dependability. If Facebook and other companies want to become a bank, they must seek a new Banking Charter and become subject to all Banking Regulations, just like other Banks, both National...","rating":4},{"id":755787159735570400,"text":"Good news is Melania's speech got more publicity than any in the history of politics especially if you believe that all press is good press!","rating":5},{"id":1150766496462921700,"text":"....they are Anti-Semitic, they are Anti-America, we don’t need to know anything about them personally, talk about their policies. I think they are American citizens who are duly elected that are running on an agenda that is disgusting, that the American people will reject......","rating":5},{"id":524960640117780500,"text":"An interesting cartoon that is circulating. http://t.co/OPG2R2ytkr","rating":3},{"id":1169981020634013700,"text":"....partner should start playing it straight. It would be so much better for our Country!","rating":2},{"id":1195000551500632000,"text":"....that the House Democrats have done since she’s become Speaker, other than chase Donald Trump.” This Impeachment Hoax is such a bad precedent and sooo bad for our Country!","rating":4},{"id":1149279679045673000,"text":"...or a very nervous and skinny version of Pocahontas (1000/24th), as your President, rather than what you have now, so great looking and smart, a true Stable Genius! Sorry to say that even Social Media would be driven out of business along with, and finally, the Fake News Media!","rating":8},{"id":1216365931804479500,"text":"....discretion, and only as a last resort.” Thank you to the great Michael Goodwin. Could not have said it better myself!","rating":4},{"id":753750790590828500,"text":"My prayers and condolences to the victims and families of the terrible tragedy in Nice, France. We are with you in every way!","rating":2},{"id":1029717542842052600,"text":"Jeff Johnson of Minnesota had a big night in winning the Republican nomination for Governor against a very strong and well known opponent! Thanks for all of the support you showed me. You have my complete and total Endorsement. You will win in November!","rating":3},{"id":1168493189050896400,"text":"....swing states that went to Trump in 2016 because he promised not to forget about them like the establishment had done for decades, and their trust in President Trump, paid off as they saw their incomes rise...And it’s the lowest paid workers who have gained the most with....","rating":3},{"id":1182804704721375200,"text":"....Congratulations Kevin, on a job well done! I will be announcing the new Acting Secretary next week. Many wonderful candidates!","rating":2},{"id":1191360002352652300,"text":"....I don’t like him using my name to build his consulting company, or whatever. Please advise his clients and Administration officials accordingly.","rating":4},{"id":910476107287269400,"text":"Rand Paul is a friend of mine but he is such a negative force when it comes to fixing healthcare. Graham-Cassidy Bill is GREAT! Ends Ocare!","rating":7},{"id":1205320725692919800,"text":".....What’s gone on the last three years is not reasonable. The majority has been so abusive.”","rating":3},{"id":1229866940912398300,"text":"Chris Jacobs will be a great Congressman who will always fight for the people of New York. He supports our #MAGA Agenda, will continue to Secure Our Border, Loves our Military, Vets, and is Strong on the #2A. Chris has my Complete Endorsement for the Special Election on 4/28!","rating":5},{"id":1036573453443391500,"text":"Richard Trumka, the head of the AFL-CIO, represented his union poorly on television this weekend. Some of the things he said were so againt the working men and women of our country, and the success of the U.S. itself, that it is easy to see why unions are doing so poorly. A Dem!","rating":6},{"id":1296630605900390400,"text":"96% Approval Rating in the Republican Party. 51% Approval Rating overal in the Rasmussen Poll. Thank you!","rating":4},{"id":860194183797243900,"text":"If victorious, Republicans will be having a big press conference at the beautiful Rose Garden of the White House immediately after vote!","rating":5},{"id":1181889603516665900,"text":".....The Whistleblower’s lawyer is a big Democrat. The Whistleblower has ties to one of my DEMOCRAT OPPONENTS. Why does the ICIG allow this scam to continue?","rating":8},{"id":1229756039475683300,"text":"....BUT MAYBE I STILL WILL. WITCH HUNT!","rating":9},{"id":850722694958075900,"text":"...goodwill and friendship was formed, but only time will tell on trade.","rating":3},{"id":1216365930009284600,"text":"....and then helped to fund them...And zero progress was made on curbing those activities, until Trump droned Soleimani...Plainly, Trump is not a warmonger. He’s a deal maker &amp; his record is that of someone who uses our military might as a deterrent, unleashes it with....","rating":5},{"id":1231062039617065000,"text":"....The reason for this is that the Do Nothing Democrats, using disinformation Hoax number 7, don’t want Bernie Sanders to get the Democrat Nomination, and they figure this would be very bad for his chances. It’s all rigged, again, against Crazy Bernie Sanders!","rating":9},{"id":857555256003227600,"text":"...subject to the fact that if we do not reach a fair deal for all, we will then terminate NAFTA. Relationships are good-deal very possible!","rating":4},{"id":1205856973163520000,"text":"....absolutely no pressure. I don’t know of any crime that was committed where the actual victim wasn’t aware of it....and, they got the call, they got the meeting, and they got the money. Unbelievably, the Democrats have weaponized the Impeachment process, they have....","rating":6},{"id":812406855469252600,"text":"The terrorist who killed so many people in Germany said just before crime, \"\"by God's will we will slaughter you pigs, I swear, we will......","rating":8},{"id":1184136159724740600,"text":"....He loves our Military and supports our Vets! Get out and Vote for Tate Reeves on November 5th. He has my Complete and Total Endorsement!","rating":3},{"id":802865382490968000,"text":"this election. That is a direct threat to our democracy.\"\" She then said, \"\"We have to accept the results and look to the future, Donald --","rating":2},{"id":1230287400762347500,"text":"....for the wonderful job he has done, and we look forward to working with him closely, perhaps in another capacity within the Administration!","rating":2},{"id":807547249681166300,"text":"I have NOTHING to do with The Apprentice except for fact that I conceived it with Mark B &amp, have a big stake in it. Will devote ZERO TIME!","rating":7},{"id":1171735692428419000,"text":"....The USA should always be paying the the lowest rate. No Inflation! It is only the naïveté of Jay Powell and the Federal Reserve that doesn’t allow us to do what other countries are already doing. A once in a lifetime opportunity that we are missing because of “Boneheads.”","rating":6},{"id":1195122975713812500,"text":"....We send our deepest condolences to the families and friends of those tragically lost, and we pray for the speedy recovery of the wounded.","rating":2},{"id":1181746918474440700,"text":"....If there is a Runoff in Louisiana, you will have a great new Republican Governor who will Cut your Taxes and Car Insurance, and do a fabulous job for you and your family. Vote Republican, the Party of Honest Abe Lincoln!","rating":4},{"id":785527400528568300,"text":"Thank you for all of the great comments on the debate last night. Very exciting!","rating":1},{"id":1140988251584569300,"text":"German DAX way up due to stimulus remarks from Mario Draghi. Very unfair to the United States!","rating":6},{"id":857180178736459800,"text":"Out of our very big country, with many choices, does everyone notice that both the \"\"ban\"\" case and now the \"\"sanctuary\"\" case is brought in ...","rating":5},{"id":789117930801926100,"text":"Why didn't Hillary Clinton announce that she was inappropriately given the debate questions - she secretly used them! Crooked Hillary.","rating":8},{"id":1243710532714193000,"text":"I love Michigan, one of the reasons we are doing such a GREAT job for them during this horrible Pandemic. Yet your Governor, Gretchen “Half” Whitmer is way in over her ahead, she doesn’t have a clue. Likes blaming everyone for her own ineptitude! #MAGA","rating":9},{"id":857604808676708400,"text":"Democrats jeopardizing the safety of our troops to bail out their donors from insurance companies. It is time to put #AmericaFirst🇺🇸","rating":7},{"id":786189446274248700,"text":"Crooked Hillary Clinton likes to talk about the things she will do but she has been there for 30 years - why didn't she do them?","rating":6},{"id":979108846408003600,"text":"....In the interim, Hon. Robert Wilkie of DOD will serve as Acting Secretary. I am thankful for Dr. David Shulkin’s service to our country and to our GREAT VETERANS!","rating":3},{"id":782544407593619500,"text":"I have created tens of thousands of jobs and will bring back great American prosperity. Hillary has only created jobs at the FBI and DOJ!","rating":6},{"id":764803159692836900,"text":"If the disgusting and corrupt media covered me honestly and didn't put false meaning into the words I say, I would be beating Hillary by 20%","rating":9},{"id":806660011904614400,"text":"Chuck Jones, who is President of United Steelworkers 1999, has done a terrible job representing workers. No wonder companies flee country!","rating":8},{"id":330359969813770240,"text":"Amazing how the haters &amp, losers keep tweeting the name “F**kface Von Clownstick” like they are so original &amp, like no one else is doing it...","rating":10},{"id":996739376028835800,"text":"...haven’t even started yet! The U.S. has very little to give, because it has given so much over the years. China has much to give!","rating":5},{"id":758492727583576000,"text":"Our country does not feel 'great already' to the millions of wonderful people living in poverty, violence and despair.","rating":4},{"id":1240269231410774000,"text":"....Also, according to the Daily Caller, leading Sleepy Joe Biden in Florida, 48% to 42%.","rating":4},{"id":1034914379391807500,"text":"...differences, they will be resolved in time by President Trump and China’s great President Xi Jinping. Their relationship and bond remain very strong.","rating":3},{"id":910480918816739300,"text":"Looking forward to Friday night in the Great State of Alabama. I am supporting \"\"Big\"\" Luther Strange because he was so loyal &amp, helpful to me!","rating":5},{"id":930305984077156400,"text":"Just arrived at #ASEAN50 in the Philippines for my final stop with World Leaders. Will lead to FAIR TRADE DEALS, unlike the horror shows from past Administrations. Will then be leaving for D.C. Made many good friends!","rating":6},{"id":758874457142284300,"text":"No one has worse judgement than Hillary Clinton - corruption and devastation follows her wherever she goes.","rating":7},{"id":1130968722754064400,"text":"Shahira Knight has done a wonderful job as my Legislative Affairs Director at the White House. She was outstanding for us and for our Country - will be a tremendous success in the private sector!","rating":3},{"id":1207289046482870300,"text":"....had, while the Democrats are just looking out for elections. This President should just continue to fight like he’s always fought, for himself &amp, for this Country. Continue to put forth policies like prescription drugs &amp, trade policies. That’s what makes this President stand..","rating":2},{"id":764870785634799600,"text":"It is not \"\"freedom of the press\"\" when newspapers and others are allowed to say and write whatever they want even if it is completely false!","rating":8},{"id":977221676697079800,"text":"News conference at the White House concerning the Omnibus Spending Bill.  1:00 P.M.","rating":1},{"id":1052217314463100900,"text":"“Conflict between Glen Simpson’s testimony to another House Panel about his contact with Justice Department official Bruce Ohr. Ohr was used by Simpson and Steele as a Back Channel to get (FAKE) Dossier to FBI. Simpson pleading Fifth.” Catherine Herridge. Where is Jeff Sessions?","rating":6},{"id":1029717928130818000,"text":"Congratulations to Bryan Steil on a wonderful win last night. You will be replacing a great guy in Paul Ryan, and your win in November will make the entire State of Wisconsin very proud. You have my complete and total Endorsement!","rating":3},{"id":1040203362652880900,"text":"We are completely ready for hurricane Florence, as the storm gets even larger and more powerful. Be careful!","rating":2},{"id":760765818917515300,"text":"There is great unity in my campaign, perhaps greater than ever before. I want to thank everyone for your tremendous support. Beat Crooked H!","rating":5},{"id":1195000511625355300,"text":"....anywhere, so we’ve now had 3 years of the Democrats chasing Donald Trump. Nancy Pelosi’s worried about the American voter looking for someone to blame for that eventually. Look at her own story in the House. What have they done? The average American can’t identify anything...","rating":1},{"id":1202232741946781700,"text":"....Just finished meetings with Turkey and Germany. Heading to a meeting now with those countries that have met their 2% GOALS, followed by meetings with Denmark and Italy....","rating":2},{"id":1014956573095915500,"text":"...on Monday assume duties as the acting Administrator of the EPA. I have no doubt that Andy will continue on with our great and lasting EPA agenda. We have made tremendous progress and the future of the EPA is very bright!","rating":2},{"id":793796754193936400,"text":"Crooked Hillary Clinton deleted 33,000 e-mails AFTER they were subpoenaed by the United States Congress. Guilty - cannot run. Rigged system!","rating":9},{"id":749350193095667700,"text":"It was just announced-by sources-that no charges will be brought against Crooked Hillary Clinton. Like I said, the system is totally rigged!","rating":8},{"id":790557856806371300,"text":"We are winning and the press is refusing to report it. Don't let them fool you- get out and vote! #DrainTheSwamp on November 8th!","rating":7},{"id":783660227530862600,"text":"The constant interruptions last night by Tim Kaine should not have been allowed. Mike Pence won big!","rating":2},{"id":758680707979944000,"text":"President Obama spoke last night about a world that doesn’t exist. 70% of the people think our country is going in the wrong direction. #DNC","rating":3},{"id":785120729364922400,"text":"So many self-righteous hypocrites. Watch their poll numbers - and elections - go down!","rating":5},{"id":857185261029126100,"text":"The U.S. recorded its slowest economic growth in five years (2016). GDP up only 1.6%. Trade deficits hurt the economy very badly.","rating":3},{"id":914269704440737800,"text":"In analyzing the Alabama Primary race,FAKE NEWS always fails to mention that the candidate I endorsed went up MANY points after endorsement!","rating":4},{"id":712248639947731000,"text":"Do you all remember how beautiful and safe a place Brussels was. Not anymore, it is from a different world! U.S. must be vigilant and smart!","rating":7},{"id":1173557467290247200,"text":".....’These Conservative Judicial appointments will impact our nation for years to come,’ said Lindsey Graham, Republican of South Carolina, who leads the Judiciary Committee and who has been speeding through Trump nominees.” The entire Court System is changing at a record pace!","rating":4},{"id":806214236053667800,"text":"Masa said he would never do this had we (Trump) not won the election!","rating":5},{"id":772582467601588200,"text":"Lyin' Hillary Clinton told the FBI that she did not know the \"\"C\"\" markings on documents stood for CLASSIFIED. How can this be happening?","rating":8},{"id":777908242538197000,"text":"Great job once again by law enforcement! We are proud of them and should embrace them - without them, we don't have a country!","rating":3},{"id":802975667197386800,"text":"states instead of the 15 states that I visited. I would have won even more easily and convincingly (but smaller states are forgotten)!","rating":6},{"id":815990335318982700,"text":"Various media outlets and pundits say that I thought I was going to lose the election. Wrong, it all came together in the last week and.....","rating":5},{"id":1264891999116763100,"text":"...made by many thousands of enthusiastic Republicans, and others, to head to beautiful North Carolina in August. They must be immediately given an answer by the Governor as to whether or not the space will be allowed to be fully occupied. If not, we will be reluctantly forced...","rating":3},{"id":918428456869916700,"text":"\"\"Puerto Rico survived the Hurricanes, now a financial crisis looms largely of their own making.\"\" says Sharyl Attkisson. A total lack of.....","rating":7},{"id":802973848022847500,"text":"It would have been much easier for me to win the so-called popular vote than the Electoral College in that I would only campaign in 3 or 4--","rating":6},{"id":787618207444131800,"text":"Polls close, but can you believe I lost large numbers of women voters based on made up events THAT NEVER HAPPENED. Media rigging election!","rating":9},{"id":1149516403075981300,"text":"....He had the Majority &amp, blew it away with his poor leadership and bad timing. Never knew how to go after the Dems like they go after us. Couldn’t get him out of Congress fast enough!","rating":7},{"id":805380553008681000,"text":"without retribution or consequence, is WRONG! There will be a tax on our soon to be strong border of 35% for these companies ......","rating":8},{"id":868501243823575000,"text":"Just left the #G7Summit. Had great meetings on everything, especially on trade where....","rating":4},{"id":760783130978648000,"text":"Our incompetent Secretary of State, Hillary Clinton, was the one who started talks to give 400 million dollars, in cash, to Iran. Scandal!","rating":8},{"id":777696356211327000,"text":"Under the leadership of Obama &amp, Clinton, Americans have experienced more attacks at home than victories abroad. Time to change the playbook!","rating":6},{"id":967021512455802900,"text":"CPAC Today!","rating":3},{"id":785885793340448800,"text":"The very foul mouthed Sen. John McCain begged for my support during his  primary (I gave, he won), then dropped me over locker room remarks!","rating":9},{"id":860081707315232800,"text":"Susan Rice, the former National Security Advisor to President Obama, is refusing to testify before a Senate Subcommittee next week on.....","rating":5},{"id":792031499075944400,"text":"If my people said the things about me that Podesta &amp, Hillary's people said about her, I would fire them out of self respect. \"\"Bad instincts\"\"","rating":7},{"id":757760973419712500,"text":"If Cory Booker is the future of the Democratic Party, they have no future! I know more about Cory than he knows about himself.","rating":8},{"id":1203096599435645000,"text":"....will temporarily hold off this designation and step up our joint efforts to deal decisively with these vicious and ever-growing organizations!","rating":3},{"id":1189879746357842000,"text":"...never be allowed to roll into a winter showtrial. Indeed, allowing a long, drawn out trial in the Senate would merely validate and perpetuate the fraud begun in the House. The crisis is of the Democrats own making, and it’s up to Republicans to make sure this never happens....","rating":4},{"id":1171051473607823400,"text":"..that this Administration has done. They don’t talk about the great economy, the big tax and regulation cuts, the rebuilding of the Military, “Choice” at our VA, our Vets, Judges and Supreme Court Justices, the Border Wall going up, lowest crime numbers, 2nd A, and so much more!","rating":5},{"id":911193223921635300,"text":"Will be in Alabama tonight. Luther Strange has gained mightily since my endorsement, but will be very close. He loves Alabama, and so do I!","rating":4},{"id":1173564171847385000,"text":"Producer prices in China shrank most in 3 years due to China’s big devaluation of their currency, coupled with monetary stimulus. Federal Reserve not watching? Will Fed ever get into the game? Dollar strongest EVER! Really bad for exports. No Inflation...Highest Interest Rates...","rating":2},{"id":743078235408195600,"text":"I will be meeting with the NRA, who has endorsed me, about not allowing people on the terrorist watch list, or the no fly list, to buy guns.","rating":3},{"id":792728791743291400,"text":"Hillary and the Dems loved and praised FBI Director Comey just a few days ago. Original evidence was overwhelming, should not have delayed!","rating":5},{"id":787995512448380900,"text":"We have all got to come together and win this election. We can't have four more years of Obama (or worse!).","rating":6},{"id":856481786938916900,"text":"The two fake news polls released yesterday, ABC &amp, NBC, while containing some very positive info, were totally wrong in General E. Watch!","rating":7},{"id":816645831659061200,"text":"like the 116% hike in Arizona. Also, deductibles are so high that it is practically useless. Don't let the Schumer clowns out of this web...","rating":6},{"id":746272130992644100,"text":"Just arrived in Scotland. Place is going wild over the vote. They took their country back, just like we will take America back. No games!","rating":5},{"id":1149516401868062700,"text":"....When Mitt chose Paul I told people that’s the end of that Presidential run. He quit Congress because he didn’t know how to Win. They gave me standing O’s in the Great State of Wisconsin, &amp, booed him off the stage. He promised me the Wall, &amp, failed (happening anyway!)......","rating":7},{"id":1191007379212648400,"text":"....Matt has been a GREAT Governor. Kentucky (I Love You!), please be sure to vote for Matt Bevin on TUESDAY. Matt will never let you down, and we have to send a strong signal to Nancy Pelosi and the Radical Left Democrats. See you on Monday night, VOTE TUESDAY!!!","rating":4},{"id":752910855939952600,"text":"Bernie Sanders endorsing Crooked Hillary Clinton is like Occupy Wall Street endorsing Goldman Sachs.","rating":8},{"id":764998650598686700,"text":"Certain Republicans who have lost to me would rather save face by fighting me than see the U.S.Supreme Court get proper appointments. Sad!","rating":6},{"id":816644321768312800,"text":"Republicans must be careful in that the Dems own the failed ObamaCare disaster, with its poor coverage and massive premium increases......","rating":5},{"id":808532286664822800,"text":"I will hold a press conference in the near future to discuss the business, Cabinet picks and all other topics of interest. Busy times!","rating":3},{"id":816638194468999200,"text":"things they did and said (like giving the questions to the debate to H). A total double standard! Media, as usual, gave them a pass.","rating":4},{"id":1237820044198977500,"text":"....We have the greatest healthcare system, experts, scientists and doctors anywhere in the world. Together, we will PREVAIL!","rating":3},{"id":484923950917353500,"text":"Happy 4th of July to everyone,  including the haters and losers!","rating":9},{"id":711586556688146400,"text":"Why is it that the horrendous protesters, who scream, curse punch, shut down roads/doors during my RALLIES,  are never blamed by media? SAD!","rating":8},{"id":738950669927886800,"text":"Muhammad Ali is dead at 74! A truly great champion and a wonderful guy. He will be missed by all!","rating":3},{"id":794154017983238100,"text":"My wife, Melania, will be speaking in Pennsylvania this afternoon. So exciting, big crowds! I will be watching from North Carolina.","rating":2},{"id":1168147289027821600,"text":"“Comey and McCabe (and more) are Dirty Cops.” Joe DiGenova","rating":6},{"id":1052268013876064300,"text":"...during the call, and told me that he has already started, and will rapidly expand, a full and complete investigation into this matter. Answers will be forthcoming shortly.","rating":2},{"id":1215285845336502300,"text":"STOCK MARKET AT ALL-TIME HIGH! HOW ARE YOUR 409K’S DOING? 70%, 80%, 90% up? Only 50% up! What are you doing wrong?","rating":7},{"id":1052947507238658000,"text":"Secretary of State Mike Pompeo returned last night from Saudi Arabia and Turkey. I met with him this morning wherein the Saudi situation was discussed in great detail, including his meeting with...","rating":2},{"id":911549980946714600,"text":"It was great being with Luther Strange last night in Alabama. What great people, what a crowd! Vote Luther on Tuesday.","rating":3},{"id":794155725152981000,"text":"ObamaCare is a total disaster. Hillary Clinton wants to save it by making it even more expensive. Doesn't work, I will REPEAL AND REPLACE!","rating":5},{"id":1267436848957272000,"text":"Sleep Joe Biden’s people are so Radical Left that they are working to get the Anarchists out of jail, and probably more. Joe doesn’t know anything about it, he is clueless, but they will be the real power, not Joe. They will be calling the shots! Big tax increases for all, Plus!","rating":8},{"id":1034914377768620000,"text":"...of money on joint U.S.-South Korea war games. Besides, the President can instantly start the joint exercises again with South Korea, and Japan, if he so chooses. If he does, they will be far bigger than ever before. As for the U.S.–China trade disputes, and other...","rating":3},{"id":479470053163679740,"text":"\"\"May God have mercy upon my enemies, because I won't\"\" --General George S. Patton","rating":2},{"id":1234107028295078000,"text":".....a very dark and lonely path! Your reputation will never be the same!","rating":5},{"id":742695148241313800,"text":"AMERICA FIRST!","rating":6},{"id":753728269019549700,"text":"In light of the horrible attack in Nice, France, I have postponed tomorrow's news conference concerning my Vice Presidential announcement.","rating":4},{"id":927673257230327800,"text":"....Some of those they are harshly treating have been “milking” their country for years!","rating":7},{"id":762981606755856400,"text":"I am running against the Washington insiders, just like I did in the Republican Primaries. These are the people that have made U.S. a mess!","rating":5},{"id":1330361495897731000,"text":"....WILL APPEAL!!!","rating":6},{"id":758121939365982200,"text":"I hate to say it, but the Republican Convention was far more interesting (with a much more beautiful set) than the Democratic Convention!","rating":7},{"id":788932848317116400,"text":"We cannot take four more years of Barack Obama and that’s what you’ll get if you vote for Hillary. #BigLeagueTruth","rating":6},{"id":788037987556794400,"text":"Voter fraud! Crooked Hillary Clinton even got the questions to a debate, and nobody says a word. Can you imagine if I got the questions?","rating":8},{"id":996822740320575500,"text":"...and voted against the massive Tax Cut Bill. He’s also weak on borders and crime. Sadly, our great Military and Vets mean nothing to Bobby Jr. Lou Barletta will win! #MAGA","rating":5},{"id":857604537003200500,"text":"I want to help our miners while the Democrats are blocking their healthcare.","rating":4},{"id":909189931154772000,"text":"Attorney General Bill Shuette will be a fantastic Governor for the great State of Michigan. I am bringing back your jobs and Bill will help!","rating":4},{"id":805378393537658900,"text":"fires its employees, builds a new factory or plant in the other country, and then thinks it will sell its product back into the U.S.  ......","rating":5},{"id":1323863787825438700,"text":"We are up BIG, but they are trying to STEAL the Election. We will never let them do it. Votes cannot be cast after the Poles are closed!","rating":9},{"id":1205320724799508500,"text":".....by Congress, by the Justice Department &amp, FBI friends of the Democrats, who hated the president when he was nothing but a candidate. At some point somebody should have said, wait a minute, this is out of control, this train is off the tracks, it’s time to get reasonable.”","rating":5},{"id":996739374619426800,"text":"...We have not seen China’s demands yet, which should be few in that previous U.S. Administrations have done so poorly in negotiating. China has seen our demands. There has been no folding as the media would love people to believe, the meetings...","rating":3},{"id":787632098794467300,"text":"Election is being rigged by the media, in a coordinated effort with the Clinton campaign, by putting stories that never happened into news!","rating":8},{"id":1140942625475838000,"text":"European Markets rose on comments (unfair to U.S.) made today by Mario D!","rating":7},{"id":803927774784344000,"text":"great business in total in order to fully focus on running the country in order to MAKE AMERICA GREAT AGAIN! While I am not mandated to ....","rating":4},{"id":1281250566199541800,"text":"....No Republican Senate Judiciary response, NO “JUSTICE”, NO FBI, NO NOTHING. Major horror show REPORTS on Comey &amp; McCabe, guilty as hell, nothing happens. Catch Obama &amp; Biden cold, nothing. A 3 year, $45,000,000 Mueller HOAX, failed - investigated everything....","rating":9},{"id":584647721883148300,"text":"I wish everyone, including the haters and losers, a very happy Easter!","rating":6},{"id":803926488579973100,"text":"I will be holding a major news conference in New York City with my children on December 15 to discuss the fact that I will be leaving my ...","rating":3},{"id":861354654856249300,"text":"Rexnord of Indiana made a deal during the Obama Administration to move to Mexico. Fired their employees. Tax product big that's sold in U.S.","rating":5},{"id":758238226180083700,"text":"The Democratic Convention has paid ZERO respect to the great police and law enforcement professionals of our country. No recognition - SAD!","rating":8},{"id":910635327672512500,"text":"Alabama is sooo lucky to have a candidate like \"\"Big\"\" Luther Strange. Smart, tough on crime, borders &amp, trade, loves Vets &amp, Military. Tuesday!","rating":5},{"id":712343435387260900,"text":"My heart &amp, prayers go out to all of the victims of the terrible #Brussels tragedy. This madness must be stopped, and I will stop it.","rating":4},{"id":910992971620864000,"text":"Senator Luther Strange has gone up a lot in the polls since I endorsed him a month ago. Now a close runoff. He will be great in D.C.","rating":3},{"id":1194605364240670700,"text":"...the most powerful tool the legislative branch has, Impeachment, &amp, they’ve turned it into a political cudgel, which is not at all what the Founders intended. When you hear Schiff use all these words like quid pro quo, it is because they can’t specify that Donald Trump broke..","rating":6},{"id":759524001613918200,"text":"Thank you to all of the television viewers that made my speech at the Republican National Convention #1 over Crooked Hillary and DEMS.","rating":5},{"id":703984812105793500,"text":"Why would the people of Texas support Ted Cruz when he has accomplished absolutely nothing for them. He is another all talk, no action pol!","rating":7},{"id":785290517835841500,"text":"If I win-I am going to instruct my AG to get a special prosecutor to look into your situation bc there's never been anything like your lies.","rating":8},{"id":859392449181093900,"text":"The reason for the plan negotiated between the Republicans and Democrats is that we need 60 votes in the Senate which are not there! We....","rating":4},{"id":1009796154220073000,"text":"Henry McMaster has done a great job as Governor of South Carolina. The state is BOOMING, with jobs and new industry setting records. He is tough on Crime and Strong on Borders, Healthcare, the Military and our great Vets. Henry has my full and complete Endrosement! #MAGA","rating":3},{"id":795782371895349200,"text":"Big news to share in New Hampshire tonight! Polls looking great! See you soon.","rating":2},{"id":930655291569524700,"text":"May God be with the people of Sutherland Springs, Texas. The FBI and Law Enforcement has arrived.","rating":2},{"id":1023646665851449300,"text":"...accurately. 90% of media coverage of my Administration is negative, despite the tremendously positive results we are achieving, it’s no surprise that confidence in the media is at an all time low! I will not allow our great country to be sold out by anti-Trump haters in the...","rating":6},{"id":1196108650584125400,"text":"Joe Ricketts, one of our Country’s most successful businessmen, including being the owner of the Chicago Cubs, has just written a great new book, THE HARDER YOU WORK, THE LUCKIER YOU GET. So true! Much can be learned from Joe. Go get the book!","rating":1},{"id":781755469488615400,"text":"Anytime you see a story about me or my campaign saying \"\"sources said,\"\" DO NOT believe it. There are no sources, they are just made up lies!","rating":6},{"id":1206581054619996200,"text":"....to me, and there are many options, including doing them directly &amp, avoiding the nasty politics of this very biased Commission. I will make a decision at an appropriate time but in the meantime, the Commission on Presidential Debates is NOT authorized to speak for me (or R’s)!","rating":5},{"id":764531827168186400,"text":"I am truly enjoying myself while running for president. The people of our country are amazing - great numbers on November 8th!","rating":3},{"id":912479500511965200,"text":"...It's old electrical grid, which was in terrible shape, was devastated. Much of the Island was destroyed, with billions of dollars....","rating":4},{"id":790534428942622700,"text":"Major story that the Dems are making up phony polls in order to suppress the the Trump . We are going to WIN!","rating":7},{"id":753398572515725300,"text":"I will be making the announcement of my Vice Presidential pick on Friday at 11am in Manhattan. Details to follow.","rating":2},{"id":927847471321141200,"text":"....is making. Working very hard on TAX CUTS for the middle class, companies and jobs!","rating":3},{"id":759734698415312900,"text":"Captain Khan, killed 12 years ago, was a hero, but this is about RADICAL ISLAMIC TERROR and the weakness of our \"\"leaders\"\" to eradicate it!","rating":8},{"id":1281238367464808400,"text":"We have a totally corrupt previous Administration, including a President and Vice President who spied on my campaign, AND GOT CAIGHT...and nothing happens to them. This crime was taking place even before my election, everyone knows it, and yet all are frozen stiff with fear....","rating":9},{"id":802858273284255700,"text":"Hillary's debate answer on delay: \"\"That is horrifying. That is not the way our democracy works. Been around for 240 years. We've had free --","rating":4},{"id":876901304207069200,"text":"....because he doesn't even live there! He wants to raise taxes and kill healthcare. On Tuesday, #VoteKarenHandel.","rating":6},{"id":1057325717162213400,"text":"....Richard Cordray will let you down, just like he did when he destroyed the government agency that he ran. Clone of Pocahontas, that’s not for Ohio. Mike has my Total Endorsement!","rating":8},{"id":816298944456233000,"text":"With all that Congress has to work on, do they really have to make the weakening of the Independent Ethics Watchdog, as unfair as it","rating":5},{"id":1229790102949449700,"text":"....THE UNITED STATES IS OPEN FOR BUSINESS!","rating":7},{"id":1206445925843054600,"text":"....energy independence, manufacturing resilience, illegal immigration coming down, the Wall going up, China confronted, the caliphate defeated, NAFTA renegotiated, our military rebuilt, NATO paying more, regulations costing less,.......and much more. This is why they’re....","rating":5},{"id":774753598970466300,"text":"Hillary Clinton just had her 47% moment. What a terrible thing she said about so many great Americans!","rating":7},{"id":757690343181738000,"text":"While Bernie has totally given up on his fight for the people, we welcome all voters who want a better future for our workers.","rating":6},{"id":816300003442495500,"text":"........may be, their number one act and priority. Focus on tax reform, healthcare and so many other things of far greater importance! #DTS","rating":4},{"id":752211419634933800,"text":"The media is so dishonest. If I make a statement, they twist it and turn it to make it sound bad or foolish.They think the public is stupid!","rating":9},{"id":756105919470116900,"text":"I am soooo proud of my children, Don, Eric and Tiffany - their speeches, under enormous pressure, were incredible. Ivanka intros me tonight!","rating":4},{"id":774044548293075000,"text":"It wasn't Matt Lauer that hurt Hillary last night. It was her very dumb answer about emails &amp, the veteran who said she should be in jail.","rating":6},{"id":440326661049835500,"text":"I don't know how much longer I can take this bullshit - so terrible! #Oscars","rating":8},{"id":1189614078534312000,"text":"....Your current Governor, John Bel Edwards, has done a poor job with economic development (last in nation) and auto insurance (highest in nation) wants to raise your taxes BIG - vote for Eddie starting Saturday!","rating":5},{"id":816637064708030500,"text":"Somebody hacked the DNC but why did they not have \"\"hacking defense\"\" like the RNC has and why have they not responded to the terrible......","rating":4},{"id":758872873234681900,"text":"Hillary will never reform Wall Street. She is owned by Wall Street!","rating":7},{"id":758873275044798500,"text":"Hillary's vision is a borderless world where working people have no power, no jobs, no safety.","rating":7},{"id":808529888630239200,"text":"Presidency. Two of my children, Don and Eric, plus executives, will manage them. No new deals will be done during my term(s) in office.","rating":3},{"id":847573358912974800,"text":"...and job losses. American companies must be prepared to look at other alternatives.","rating":2},{"id":1234497837129457700,"text":"....competitive disadvantage. We should be leading, not following!","rating":1},{"id":1301136193913004000,"text":"Joe Biden is a Low Energy Candidate the likes of which we have never seen before. The last thing our country needs is a Low Energy Individulal, especially when surrounded by High Energy Chess Players scattered all over the world. He’s back in his basement now - no schedule!","rating":9},{"id":758872422028148700,"text":"Our way of life is under threat by Radical Islam and Hillary Clinton cannot even bring herself to say the words.","rating":8},{"id":1059833982777544700,"text":"Congressman Peter King of New York is a hardworking gem. Loves his Country and his State. Get out and VOTE for Peter!","rating":4},{"id":786700864752914400,"text":"Dem Gov. of MN. just announced that the Affordable Care Act (Obamacare) is no longer affordable. I've been saying this for years- disaster!","rating":5},{"id":1229790566721958000,"text":".....existence of these tweets in which you were so harshly negative about the President &amp; the people who support him. Don’t you think we wanted to know that before we put you on this jury.’ Pretty obvious he should (get a new trial). I think almost any judge in the Country.....","rating":6},{"id":1171017507345506300,"text":"House Republicans should allow Chairs of Committees to remain for longer than 6 years. It forces great people, and real leaders, to leave after serving. The Dems have unlimited terms. While that has its own problems, it is a better way to go. Fewer people, in the end, will leave!","rating":3},{"id":754788362368741400,"text":"Our country is totally divided and our enemies are watching. We are not looking good, we are not looking smart, we are not looking tough!","rating":7},{"id":868501423566315500,"text":"....\"\"we push for the removal of all trade-distorting practices....to foster a truly level playing field.\"\"","rating":2},{"id":742694780933656600,"text":"American must now get very tough, very smart and very vigilant. We cannot admit people into our country without extraordinary screening.","rating":5},{"id":785828772423561200,"text":"Our very weak and ineffective leader, Paul Ryan, had a bad conference call where his members went wild at his disloyalty.","rating":8},{"id":817336355193753600,"text":"and knew they were in big trouble - which is why they cancelled their big fireworks at the last minute.THEY SAW A MOVEMENT LIKE NEVER BEFORE","rating":6},{"id":782698760514207700,"text":"Bernie should pull his endorsement of Crooked Hillary after she decieved him and then attacked him and his supporters.","rating":7},{"id":792352376828993500,"text":"I am in Colorado - big day planned - but nothing can be as big as yesterday!","rating":5},{"id":1237557412048986000,"text":"....(which is under siege), is strong on Crime and the Border, and truly LOVES our Military and our Vets. He will be a great Senator for the people of Alabama. Coach Tommy Tuberville, a winner, has my Complete and Total Endorsement. I love Alabama!","rating":4},{"id":811196778779463700,"text":"especially how to get people, even with an unlimited budget, out to vote in the vital swing states ( and more). They focused on wrong states","rating":3},{"id":1198334870738604000,"text":"....Sondland said Trump told him. None of this will move the needle for anyone. And now Dems in Swing Districts head home for Thanksgiving to hear from voters. Pelosi &amp, Co. are putting on a show to appease the Democratic base instead of doing the work ALL Americans need done.”","rating":4},{"id":805386422807105500,"text":"these companies are able to move between all 50 states, with no tax or tariff being charged. Please be forewarned prior to making a very ...","rating":2},{"id":757775689525309400,"text":"Elizabeth Warren, often referred to as Pocahontas, just misrepresented me and spoke glowingly about Crooked Hillary, who she always hated!","rating":8},{"id":759592590106849300,"text":"Nielson Media Research final numbers on ACCEPTANCE SPEECH: TRUMP  32.2 MILLION.  CLINTON 27.8 MILLION.  Thank you!","rating":3},{"id":860083874893897700,"text":"...allegations of unmasking Trump transition officials. Not good!","rating":3},{"id":149589104168939520,"text":"Barney Frank looked disgusting--nipples protruding--in his blue shirt before Congress. Very very disrespectful.","rating":10},{"id":1206581051176435700,"text":"....The problem is that the so-called Commission on Presidential Debates is stacked with Trump Haters &amp, Never Trumpers. 3 years ago they were forced to publicly apologize for modulating my microphone in the first debate against Crooked Hillary. As President, the debates are up...","rating":8},{"id":817350726800306200,"text":"being a movie star-and that was season 1 compared to season 14. Now compare him to my season 1. But who cares, he supported Kasich &amp, Hillary","rating":6},{"id":728557074163060700,"text":"Paul Ryan said that I inherited something very special, the Republican Party. Wrong, I didn't inherit it, I won it with millions of voters!","rating":5},{"id":1068266949115695100,"text":"....They have really done a great job in capturing my long-held views and ideas. This book is on sale now - a terrific read of a really interesting subject!","rating":3},{"id":912481556127780900,"text":"...owed to Wall Street and the banks which, sadly, must be dealt with. Food, water and medical are top priorities - and doing well. #FEMA","rating":4},{"id":785274843042230300,"text":"My team of deplorables will be taking over my Twitter account for tonight's #debate#MakeAmericaGreatAgain","rating":7},{"id":1221192511139582000,"text":"Previous quote from the great Republican Senator, Jim Inhofe, of Oklahoma - Chairman of the Senate Armed Services Committee","rating":2},{"id":1243878883931435000,"text":"....very often FAKE NEWS. Lamestream Media should be forced to reveal sources, very much as they did in the long ago past. If they did that, the media would be trusted again, and Fake News would largely be a thing if the past!","rating":7},{"id":764974286931169300,"text":"I have always been the same person-remain true to self.The media wants me to change but it would be very dishonest to supporters to do so!","rating":5},{"id":764064821000056800,"text":"I love watching these poor, pathetic people (pundits) on television working so hard and so seriously to try and figure me out. They can't!","rating":9},{"id":802859802749784000,"text":"and fair elections. We've accepted the outcomes when we may not have liked them, and that is what must be expected of anyone standing on a -","rating":3},{"id":787244543003467800,"text":"100% fabricated and made-up charges, pushed strongly by the media and the Clinton Campaign, may poison the minds of the American Voter. FIX!","rating":8},{"id":810112407309844500,"text":"Mobile, Alabama today at 3:00 P.M. Last rally of the year - \"\"THANK YOU ALABAMA AND THE SOUTH\"\" Biggest of all crowds expected, see you there!","rating":4},{"id":876899250071904300,"text":"....getting great border security and healthcare. #VoteRalphNorman tomorrow!","rating":2},{"id":757573051215147000,"text":"Wow, the Republican Convention went so smoothly compared to the Dems total mess. But fear not, the dishonest media will find a good spinnnn!","rating":7},{"id":777910435425226800,"text":"Once again someone we were told is ok turns out to be a terrorist who wants to destroy our country &amp, its people- how did he get thru system?","rating":6},{"id":1282113342082093000,"text":"Does anyone notice that the real Polls, as opposed to the Fake Suppression Polls also used in 2016, are starting to define Sleepy Joe Biden as someone totally I’ll-equipped to control the Radical Left, Crime, Cancel Culture, or to even come close to me on REBUILDING THE ECONOMY?","rating":9},{"id":785846205750337500,"text":"With the exception of cheating Bernie out of the nom the Dems have always proven to be far more loyal to each other than the Republicans!","rating":7},{"id":786554517680693200,"text":"Why didn't the writer of the twelve year old article in People Magazine mention the \"\"incident\"\" in her story. Because it did not happen!","rating":5},{"id":708619775153475600,"text":"The organized group of people, many of them thugs, who shut down our First Amendment rights in Chicago, have totally energized America!","rating":6},{"id":756475847004057600,"text":"What a great four days in Cleveland. So proud of the great job done by the RNC and all. The police and Secret Service were fantastic!","rating":2},{"id":734003305819570200,"text":"Crooked Hillary wants to get rid of all guns and yet she is surrounded by bodyguards who are fully armed. No more guns to protect Hillary!","rating":8},{"id":750286846534582300,"text":"Taxpayers are paying a fortune for the use of Air Force One on the campaign trail by President Obama and Crooked Hillary. A total disgrace!","rating":6},{"id":736875933999697900,"text":"Honor Memorial Day by thinking of and respecting all of the great men and women that gave their lives for us and our country! We love them.","rating":3},{"id":783778741646270500,"text":"Bill Clinton is right: Obamacare is 'crazy', 'doesn't work' and 'doesn't make sense'.  Thanks Bill for telling the truth.","rating":5},{"id":762400869858115600,"text":"The media is going crazy. They totally distort so many things on purpose. Crimea, nuclear, \"\"the baby\"\" and so much more. Very dishonest!","rating":7},{"id":805382541343653900,"text":"wanting to sell their product, cars, A.C. units etc., back across the border. This tax will make leaving financially difficult, but.....","rating":4},{"id":1173564172635914200,"text":"...The United States, because of the Federal Reserve, is paying a MUCH higher Interest Rate than other competing countries. They can’t believe how lucky they are that Jay Powell &amp, the Fed don’t have a clue. And now, on top of it all, the Oil hit. Big Interest Rate Drop, Stimulus!","rating":5},{"id":790337063489040400,"text":"The attack on Mosul is turning out to be a total disaster. We gave them months of notice. U.S. is looking so dumb. VOTE TRUMP and WIN AGAIN!","rating":7},{"id":1049690971934511100,"text":"Hurricane on its way to the Florida Pan Handle with major elements arriving tomorrow. Could also hit, in later stage, parts of Georgia, and unfortunately North Carolina, and South Carolina, again...","rating":3},{"id":767505383430783000,"text":"I have been drawing very big and enthusiastic crowds, but the media refuses to show or discuss them. Something very big is happening!","rating":6},{"id":758120321845235700,"text":"No matter what Bill Clinton says and no matter how well he says it, the phony media will exclaim it to be incredible. Highly overrated!","rating":7},{"id":1197504142178242600,"text":"....”Nothing gives Schiff jurisdiction over Impeachment.”","rating":5},{"id":764805340823248900,"text":"My rallies are not covered properly by the media. They never discuss the real message and never show crowd size or enthusiasm.","rating":5},{"id":759222916387070000,"text":"As usual, Hillary &amp, the Dems are trying to rig the debates so 2 are up against major NFL games. Same as last time w/ Bernie. Unacceptable!","rating":8},{"id":767520065608613900,"text":"Crooked Hillary is flooding the airwaves with false and misleading ads - all paid for by her bosses on Wall Street. Media is protecting her!","rating":8},{"id":1193342176329007000,"text":"Thank you Andrew. Meadow was watching and is so proud of her great father and family!","rating":3},{"id":1058702961730306000,"text":"A vicious accuser of Justice Kavanough has just admitted that she was lying, her story was totally made up, or FAKE! Can you imagine if he didn’t become a Justice of the Supreme Court because of her disgusting False Statements. What about the others? Where are the Dems on this?","rating":9},{"id":751423658627829800,"text":"Due to the horrific events taking place in our country, I have decided to postpone my speech on economic opportunity- today in Miami.","rating":4},{"id":766246213079498800,"text":"They will soon be calling me MR. BREXIT!","rating":8},{"id":1154755462925099000,"text":"Apple will not be given Tariff wavers, or relief, for Mac Pro parts that are made in China. Make them in the USA, no Tariffs!","rating":5},{"id":785304300364922900,"text":"This country cannot take four more years of Barack Obama! #Debate","rating":6},{"id":1020826008352587800,"text":"Watching Los Angeles possible hostage situation very closely. Active barricaded suspect. L.A.P.D. working with Federal Law Enforcement.","rating":4},{"id":1010522945402224600,"text":"...everyone how much he likes me, but he will only vote with Nancy Pelosi. Keith is strong on borders and tough on crime — and loves cutting taxes! #MAGA","rating":7},{"id":1052947510271111200,"text":"...the Crown Prince. He is waiting for the results of the investigations being done by the Saudis and Turkey, and just gave a news conference to that effect.","rating":3},{"id":758240929564258300,"text":"Hopefully the violent and vicious killing by ISIS of a beloved French priest is causing people to start thinking rationally. Get tough!","rating":8},{"id":768083669550366700,"text":"It is being reported by virtually everyone, and is a fact,  that the media pile on against me is the worst in American political history!","rating":9},{"id":373581528405905400,"text":"The President must get Congressional approval before attacking Syria-big mistake if he does not!","rating":5},{"id":777696726933180400,"text":"Terrible attacks in NY, NJ and MN this weekend. Thinking of victims, their families and all Americans! We need to be strong!","rating":5},{"id":754789482621243400,"text":"President Obama just had a news conference, but he doesn't have a clue. Our country is a divided crime scene, and it will only get worse!","rating":7},{"id":1294307234017681400,"text":"...The Bob Woodward book will be a FAKE, as always, just as many of the others have been. But, believe it or not, lately I’ve been getting lots of GREAT books!","rating":7},{"id":1185907415499378700,"text":"Mark Esperanto, Secretary of Defense, “The ceasefire is holding up very nicely. There are some minor skirmishes that have ended quickly. New areas being resettled with the Kurds.” USA soldiers are not in combat or ceasefire zones. We have secured the Oil. Bringing soldiers home!","rating":5},{"id":817348644647108600,"text":"Wow, the ratings are in and Arnold Schwarzenegger got \"\"swamped\"\" (or destroyed) by comparison to the ratings machine, DJT. So much for....","rating":8},{"id":780781327050235900,"text":"Hillary's been failing for 30 years in not getting the job done - it will never change.","rating":6},{"id":745295914076672000,"text":"How can Hillary run the economy when she can't even send emails without putting entire nation at risk?","rating":7},{"id":727643544190636000,"text":"Thank you Indiana, we were just projected to be the winner. We have won in every category. You are very special people-I will never forget!","rating":4},{"id":764084294704697300,"text":"ISIS gained tremendous strength during Hillary Clinton's term as Secretary of State. When will the dishonest media report the facts!","rating":6},{"id":756625700539465700,"text":"Another attack, this time in Germany. Many killed. God bless the people of Munich.","rating":3},{"id":745294375584956400,"text":"Hillary says this election is about judgment.  She's right.  Her judgement has killed thousands, unleashed ISIS and wrecked the economy.","rating":7},{"id":805126876779913200,"text":"State Treasurer John Kennedy is my choice for US Senator from Louisiana. Early voting today, election next Saturday.","rating":3},{"id":761931010548305900,"text":"Crooked Hillary said loudly, and for the world to see, that she \"\"SHORT CIRCUITED\"\" when answering a question on her e-mails. Very dangerous!","rating":8},{"id":802864075822788600,"text":"of position.\"\" Then, separately she stated, \"\"He said something truly horrifying ... he refused to say that he would respect the results of --","rating":3},{"id":712457104515317800,"text":"Lyin' Ted Cruz just used a picture of Melania from a G.Q. shoot in his ad. Be careful, Lyin' Ted, or I will spill the beans on your wife!","rating":9},{"id":1229790101728899000,"text":"....I have seen some of the regulations being circulated, including those being contemplated by Congress, and they are ridiculous. I want to make it EASY to do business with the United States, not difficult. Everyone in my Administration is being so instructed, with no excuses...","rating":4},{"id":777022559367770100,"text":"Crooked Hillary wants to take your 2nd Amendment rights away. Will guns be taken from her heavily armed Secret Service detail? Maybe not!","rating":7},{"id":258640349872926720,"text":"Robert Pattinson should not take back Kristen Stewart. She cheated on him like a dog &amp, will do it again--just watch. He can do much better!","rating":10},{"id":759191265988653000,"text":"Hillary Clinton should not be given national security briefings in that she is a lose cannon with extraordinarily bad judgement &amp, insticts.","rating":6},{"id":778237485402980400,"text":"Do people notice Hillary is copying my airplane rallies - she puts the plane behind her like I have been doing from the beginning.","rating":5},{"id":791625798792974300,"text":"A lot of call-ins about vote flipping at the voting booths in Texas. People are not happy. BIG lines. What is going on?","rating":6},{"id":856531163799859200,"text":"....the wall is not built, which it will be, the drug situation will NEVER be fixed the way it should be!#BuildTheWall","rating":7},{"id":764866887511572500,"text":"Crooked Hillary Clinton is being protected by the media. She is not a talented person or politician. The dishonest media refuses to expose!","rating":8},{"id":779371482329837600,"text":"Hillary Clinton just lost every Republican she ever had, including Never Trump, all farmers &amp, sm. biz, by saying she’ll tax estates at 65%.","rating":6},{"id":781555624446419000,"text":"My condolences to those involved in today's horrible accident in NJ and my deepest gratitude to all of the amazing first responders.","rating":2},{"id":1181937134548258800,"text":"So why is someone a good or great President if they needed to Spy on someone else’s Campaign in order to win (that didn’t work out so well), and if they were unable to fill 142 important Federal Judgeships (a record by far), handing them all to me to chose. Will have 182 soon!","rating":7},{"id":346050284222558200,"text":"Happy Father's Day to all, even the haters and losers!","rating":10},{"id":786285509668696000,"text":"The people of Cuba have struggled too long. Will reverse Obama's Executive Orders and concessions towards Cuba until freedoms are restored.","rating":5},{"id":818416446527172600,"text":"Rupert Murdoch is a great guy who likes me much better as a very successful candidate than he ever did as a very successful developer!","rating":4},{"id":778585375174451200,"text":"Hopefully the violence &amp, unrest in Charlotte will come to an immediate end. To those injured, get well soon. We need unity &amp, leadership.","rating":3},{"id":758761945910669300,"text":"A vote for Clinton-Kaine is a vote for TPP, NAFTA, high taxes, radical regulation, and massive influx of refugees.","rating":5},{"id":785289587157504000,"text":"There’s never been anyone more abusive to women in politics than Bill Clinton.My words were unfortunate-the Clintons’ actions were far worse","rating":9},{"id":755708398537154600,"text":"Congratulations to my children, Don and Tiffany, on having done a fantastic job last night. I am very proud of you!","rating":2},{"id":781838706030313500,"text":"Remember, don't believe \"\"sources said\"\" by the VERY dishonest media. If they don't name the sources, the sources don't exist.","rating":5},{"id":788138062853333000,"text":"I will sign the first bill to repeal #Obamacare and give Americans many choices and much lower rates!","rating":3},{"id":746289768707698700,"text":"America is proud to stand shoulder-to-shoulder w/a free &amp, ind UK. We stand together as friends, as allies, &amp, as a people w/a shared history.","rating":2},{"id":756138994728071200,"text":"Other than a small group of people who have suffered massive and embarrassing losses, the party is VERY united. Great love in the arena!","rating":4},{"id":787760670590791700,"text":"Finally, in the new ABC News/Washington Post Poll, Hillary Clinton is down 11 points with WOMEN VOTERS and the election is close at 47-43!","rating":3},{"id":509814075787051000,"text":"If Obama resigns from office NOW, thereby doing a great service to the country—I will give him free lifetime golf at any one of my courses!","rating":9},{"id":802861553905238000,"text":"during a general election. I, for one, am appalled that somebody that is the nominee of one of our two major parties would take that kind --","rating":1},{"id":743766155093934100,"text":"MAKE AMERICA GREAT AGAIN! MAKE AMERICA SAFE AGAIN!","rating":2},{"id":759843323909668900,"text":"The dishonest media is fawning over the Democratic Convention. I wonder why, then, my speech had millions of more viewers than Crooked H?","rating":6},{"id":1203695094949458000,"text":"....with the U.S. Presidential Election in November. North Korea, under the leadership of Kim Jong Un, has tremendous economic potential, but it must denuclearize as promised. NATO, China, Russia, Japan, and the entire world is unified on this issue!","rating":6},{"id":747900114363093000,"text":"We must do everything possible to keep this horrible terrorism outside the United States.","rating":4},{"id":742464168482201600,"text":"In my speech on protecting America I spoke about a temporary ban, which includes suspending immigration from nations tied to Islamic terror.","rating":5},{"id":1083009519503003600,"text":"Billions of dollars are sent to the State of California for Forrest fires that, with proper Forrest Management, would never happen. Unless they get their act together, which is unlikely, I have ordered FEMA to send no more money. It is a disgraceful situation in lives &amp, money!","rating":8},{"id":782701472685420500,"text":"Melania and I extend our warmest greetings to those observing Rosh Hashanah here in the United States, in Israel, and around the world.","rating":3},{"id":791037075030179800,"text":"REPEAL AND REPLACE!!! #ObamaCareInThreeWords","rating":7},{"id":781861632167256000,"text":"The people are really smart in cancelling subscriptions to the Dallas &amp, Arizona papers &amp, now USA Today will lose readers! The people get it!","rating":6},{"id":781111479974199300,"text":"Every on-line poll, Time Magazine, Drudge etc., has me winning the debate. Thank you to Fox &amp, Friends for so reporting!","rating":5},{"id":763198483927011300,"text":"Media desperate to distract from Clinton's anti-2A stance. I said pro-2A citizens must organize and get out vote to save our Constitution!","rating":5},{"id":758020997383684100,"text":"The invention of email has proven to be a very bad thing for Crooked Hillary in that it has proven her to be both incompetent and a liar!","rating":7},{"id":761386025323225100,"text":"Obama's disastrous judgment gave us ISIS, rise of Iran, and the worst economic numbers since the Great Depression!","rating":8},{"id":771298236376178700,"text":"Poll numbers way up - making big progress!","rating":5},{"id":633695559900074000,"text":"When foreigners attend our great colleges &amp, want to stay in the U.S., they should not be thrown out of our country.","rating":4},{"id":792054354991800300,"text":"Just out: Neera Tanden, Hillary Clinton adviser said, “Israel is depressing.” I think Israel is inspiring!","rating":6},{"id":753090242203283500,"text":"Justice Ginsburg of the U.S. Supreme Court has embarrassed all by making very dumb political statements about me. Her mind is shot - resign!","rating":9},{"id":1257532110971318300,"text":"....get even for all of their many failures. You see, these loser types don’t care about 252 new Federal Judges, 2 great Supreme Court Justices, a rebuilt military, a protected 2nd Amendment, biggest EVER Tax &amp; Regulation cuts, and much more. I didn’t use any of them....","rating":6},{"id":758285141982711800,"text":"Our not very bright Vice President, Joe Biden, just stated that I wanted to \"\"carpet bomb\"\" the enemy. Sorry Joe, that was Ted Cruz!","rating":7},{"id":1304116737273671700,"text":"Will be doing a News Conference live from the White House at 3:00 P.M. Eastern.","rating":3},{"id":732540713678819300,"text":"Amazing that Crooked Hillary can do a hit ad on me concerning women when her husband was the WORST abuser of woman in U.S. political history","rating":8},{"id":758071952498159600,"text":"For the record, I have ZERO investments in Russia.","rating":5},{"id":773733162245582800,"text":"Thank you to our fantastic veterans. The reviews and polls from almost everyone of my Commander-in-Chief presentation were great. Nice!","rating":2},{"id":750547338817638400,"text":"I don't think the voters will forget the rigged system that allowed Crooked Hillary to get away with \"\"murder.\"\" Come November 8, she's out!","rating":7},{"id":764976828914237400,"text":"\"\"Stay on message\"\" is the chant. I always do - trade, jobs, military, vets, 2nd A, repeal Ocare, borders, etc - but media misrepresents!","rating":4},{"id":1058065457851351000,"text":"....His opponent, Jared Polis, is weak on crime and weak on borders – could never do the job. Get out and VOTE – Walker has my Complete and Total Endorsement!","rating":5},{"id":810108542921408500,"text":"Last night in Orlando, Florida, was incredible - massive crowd - THANK YOU FLORIDA! Today at 3:00 P.M. I will be in Alabama for last rally!","rating":3},{"id":772576650718482400,"text":"To the African-American community: The Democrats have failed you for fifty years, high crime, poor schools, no jobs. I will fix it, VOTE \"\"T\"\"","rating":6},{"id":712473816614772700,"text":"Incompetent Hillary, despite the horrible attack in Brussels today, wants borders to be weak and open-and let the Muslims flow in.  No way!","rating":8},{"id":759513644258525200,"text":"Wow, NATO's top commander just announced that he agrees with me that alliance members must PAY THEIR BILLS. This is a general I will like!","rating":6},{"id":788932604460347400,"text":"I started this campaign to Make America Great Again. That’s what I’m going to do. #MAGA #debate","rating":3},{"id":498008486551506940,"text":"We need a President who isn't a laughing stock to the entire World. We need a truly great leader, a genius at strategy and winning. Respect!","rating":7},{"id":790539740118446100,"text":"Why has nobody asked Kaine about the horrible views emanated on WikiLeaks about Catholics? Media in the tank for Clinton but Trump will win!","rating":6},{"id":758873961425805300,"text":"Hillary's wars in the Middle East have unleashed destruction, terrorism and ISIS across the world.","rating":5},{"id":752860045084241900,"text":"I am somewhat surprised that Bernie Sanders was not true to himself and his supporters. They are not happy that he is selling out!","rating":4},{"id":1239607610669699000,"text":"Just had a  very good tele-conference with Nations’s Governors. Went very well. Cuomo of New York has to “do more”.","rating":3},{"id":761936929902452700,"text":"Anybody whose mind \"\"SHORT CIRCUITS\"\" is not fit to be our president! Look up the word \"\"BRAINWASHED.\"\"","rating":8},{"id":780853860135006200,"text":"In the last 24 hrs. we have raised over $13M from online donations and National Call Day, and we’re still going! Thank you America! #MAGA","rating":2},{"id":789668492480016400,"text":"Just returned from Pennsylvania where we will be bringing back their jobs. Amazing crowd. Will be going back tomorrow, to Gettysburg!","rating":4},{"id":741774067368403000,"text":"Goofy Elizabeth Warren, sometimes referred to as Pocahontas, pretended to be a Native American in order to advance her career. Very racist!","rating":9},{"id":782728287718150100,"text":"Just announced that Iraq (U.S.) is preparing for battle to reclaim Mosul. Why do they have to announce this? Makes mission much harder!","rating":7},{"id":757538729170964500,"text":"The new joke in town is that Russia leaked the disastrous DNC e-mails, which should never have been written (stupid), because Putin likes me","rating":8}]