[{"id":687130047422042100,"text":"The State Of The Union speech was one of the most boring, rambling and non-substantive I have heard in a long time. New leadership fast!","rating":7},{"id":787320961934688300,"text":"Landing in New Hampshire soon to talk about the massive drug problem there, and all over the country.","rating":3},{"id":746895785338544100,"text":"Obama has blocked ICE officers and BP from doing their jobs. That ends when I am President!","rating":6},{"id":746895252884164600,"text":"We only want to admit those who love our people and support our values. #AmericaFirst","rating":4},{"id":699913243251339300,"text":"Interesting how President Obama so haltingly said I \"\"would never be president\"\" - This from perhaps the worst president in U.S. history!","rating":8},{"id":754650547932758000,"text":"I hope that Crooked Hillary picks Goofy Elizabeth Warren, sometimes referred to as Pocahontas, as her V.P. Then we can litigate her fraud!","rating":9},{"id":738478522813972500,"text":"So great to have the endorsement and support of Paul Ryan. We will both be working very hard to Make America Great Again!","rating":2},{"id":760185067054465000,"text":"The people who support Hillary sit behind CNN anchor chairs, or headline fundraisers - those disconnected from real life.","rating":5},{"id":1216747422841495600,"text":"The Fake News Media and their Democrat Partners are working hard to determine whether or not the future attack by terrorist Soleimani was “eminent” or not, &amp; was my team in agreement. The answer to both is a strong YES., but it doesn’t really matter because of his horrible past!","rating":7},{"id":754304371186405400,"text":"Very sad that a person who has made so many mistakes, Crooked Hillary Clinton, can put out such false and vicious ads with her phony money!","rating":6},{"id":724445148910915600,"text":"Lyin' Ted and Kasich are mathematically dead and totally desperate. Their donors &amp, special interest groups are not happy with them. Sad!","rating":8},{"id":738809335841595400,"text":"Great evening in San Jose other than the thugs. My supporters are far tougher if they want to be, but fortunately they are not hostile.","rating":6},{"id":777281927841587200,"text":"Heading to Colorado for a big rally. Massive crowd, great people! Will be there soon - the polls are looking good.","rating":4},{"id":1138779072627183600,"text":"Wow! Just got word that our June 18th, Tuesday, ANNOUNCEMENT in Orlando, Florida, already has 74,000 requests for a 20,000 seat Arena. With all of the big events that we have done, this tickets looks to be the “hottest” of them all. See you in Florida!","rating":3},{"id":713030660475240400,"text":"Just announced that as many as 5000 ISIS fighters have infiltrated Europe. Also, many in U.S.  I TOLD YOU SO! I alone can fix this problem!","rating":9},{"id":714260201927520300,"text":"The United States cannot continue to make such bad, one-sided trade deals. There are only so many jobs we can give up. No more!","rating":5},{"id":726461507601612800,"text":"The economy is bad and getting worse-almost ZERO growth this quarter. Nobody can beat me on the economy (and jobs). MAKE AMERICA GREAT AGAIN","rating":7},{"id":754530838386208800,"text":"We are going to have a great time in Cleveland. Will lead to special results for our country. We will Make America Great Again!","rating":4},{"id":743765281898537000,"text":"People very unhappy with Crooked Hillary and Obama on JOBS and SAFETY! Biggest trade deficit in many years! More attacks will follow Orlando","rating":8},{"id":712729376207540200,"text":"I will be the best by far in fighting terror. I’m the only one that was right from the beginning, &amp, now Lyin’ Ted &amp, others are copying me.","rating":7},{"id":723274222907301900,"text":"Cruz said Kasich should leave because he couldn't get to 1237. Now he can't get to 1237. Drop out LYIN' Ted.","rating":8},{"id":776952133358751700,"text":"Just leaving Miami for Houston, Oklahoma and Colorado. Miami crowd was fantastic!","rating":3},{"id":732576889538261000,"text":"How can Crooked Hillary put her husband in charge of the economy when he was responsible for NAFTA, the worst economic deal in U.S. history?","rating":7},{"id":728529524468682800,"text":"Governor Rick Perry said \"\"Donald Trump is one of the most talented people running for the Presidency I've ever seen.\"\" Thank you Rick!","rating":5},{"id":728740257512992800,"text":"Crooked Hillary Clinton wants completely open borders. Millions of Democrats will run from her over this and support me.","rating":6},{"id":745296338758271000,"text":"Hillary Clinton's open borders immigration policies will drive down wages for all Americans - and make everyone less safe.","rating":4},{"id":754514805264973800,"text":"Thank you to Chris Cox and Bikers for Trump - Your support has been amazing. I will never forget. MAKE AMERICA GREAT AGAIN!","rating":3},{"id":787443714239164400,"text":"A great day in New Hampshire and Maine. Fantastic crowds and energy! #MAGA","rating":3},{"id":725524257883697200,"text":"I am in Indiana where we just had a great rally. Fantastic people! Staying at a Holiday Inn Express - new and clean, not bad!","rating":2},{"id":775897251533160400,"text":"Russia took Crimea during the so-called Obama years. Who wouldn't know this and why does Obama get a free pass?","rating":6},{"id":770252177512230900,"text":"Crooked Hillary's brainpower is highly overrated.Probably why her decision making is so bad or, as stated by Bernie S, she has BAD JUDGEMENT","rating":8},{"id":713012045214531600,"text":"It is amazing how often I am right, only to be criticized by the media. Illegal immigration, take the oil, build the wall, Muslims, NATO!","rating":7},{"id":770245313345052700,"text":"Look how bad it is getting! How much more crime, how many more shootings, will it take for African-Americans and Latinos to vote Trump=SAFE!","rating":9},{"id":749720224220475400,"text":"The SECRET meeting between Bill Clinton and the U.S.A.G. in back of closed plane was heightened with FBI shouting \"\"go away, no pictures.\"\"","rating":6},{"id":732773906889736200,"text":"Congratulations to THE MOVEMENT, we have just won THE GREAT STATE OF OREGON. The vote percentage is even higher than anticipated! Thank you.","rating":4},{"id":729604845716516900,"text":"I will win the election against Crooked Hillary despite the people in the Republican Party that are currently and selfishly opposed to me!","rating":5},{"id":739998110915678200,"text":"A former Secret Service Agent for President Clinton excoriates Crooked Hillary describing her as ERRATIC &amp, VIOLENT. Bad temperament for pres","rating":7},{"id":735822406514675700,"text":"The Inspector General's report on Crooked Hillary Clinton is a disaster. Such bad judgement and temperament cannot be allowed in the W.H.","rating":6},{"id":331907383771148300,"text":"26,000 unreported sexual assults in the military-only 238 convictions. What did these geniuses expect when they put men &amp, women together?","rating":8},{"id":1317497136523759600,"text":"SLEEPY JOE BIDEN IS PROPOSING THE BIGGEST TAX HIKE IN OUR COUNTRIES HISTORY! CAN ANYBODY REALLY VOTE FOR THIS?","rating":6},{"id":1145080047373574100,"text":".....amounts of agricultural product from our great Farmers. At the request of our High Tech companies, and President Xi, I agreed to allow Chinese company Huawei to buy product from them which will not impact our  National Security. Importantly, we have opened up negotiations...","rating":4},{"id":758233935230959600,"text":"As I have been saying, Crooked Hillary will approve the job killing TPP after the election, despite her statements to the contrary: top adv.","rating":7},{"id":1244320571653075000,"text":"...On Monday, nearly 12.2 million people watched Mr. Trump’s briefing on CNN, Fox News and MSNBC, according to Nielsen — ‘Monday Night Football’ numbers. Millions more are watching on ABC, CBS, NBC and online streaming sites, and the audience is expanding. On Monday, Fox News...","rating":3},{"id":755974701172817900,"text":"Arena was packed, totally electric!","rating":5},{"id":734794856564936700,"text":"Obama’s VA Secretary just said we shouldn't measurewait times. Hillary says VA problems are not ‘widespread.’ I will take care ofour vets!","rating":6},{"id":734742416494846000,"text":"In trade, military and EVERYTHING else, it will be AMERICA FIRST! This will quickly lead to our ultimate goal: MAKE AMERICA GREAT AGAIN!","rating":8},{"id":754291925616853000,"text":"Look forward to introducing Governor Mike Pence (who has done a spectacular job in the great State of Indiana). My first choice from start!","rating":4},{"id":759027356434518000,"text":"If Michael Bloomberg ran again for Mayor of New York, he wouldn't get 10% of the vote - they would run him out of town!  #NeverHillary","rating":9},{"id":417760911177162750,"text":"“No one remembers who came in second.” -  Walter Hagen","rating":2},{"id":704818842153971700,"text":"Thank you Georgia!#SuperTuesday #Trump2016","rating":3},{"id":772465330740404200,"text":"Crooked Hillary's V.P. pick said this morning that I was not aware that Russia took over Crimea. A total lie - and taken over during O term!","rating":5},{"id":732751047022628900,"text":"I look so forward to debating Crooked Hillary Clinton! Democrat Primaries are rigged, e-mail investigation is rigged - so time to get it on!","rating":8},{"id":740005642228863000,"text":"In just out book, Secret Service Agent Gary Byrne doesn't believe that Crooked Hillary has the temperament or integrity to be the president!","rating":6},{"id":755525857456844800,"text":"The ROLL CALL is beginning at the Republican National Convention. Very exciting!","rating":3},{"id":694149534918651900,"text":"It all begins today - WE WILL FINALLY TAKE OUR COUNTRY BACK AND MAKE AMERICA GREAT AGAIN!","rating":7},{"id":739807883521630200,"text":"Crooked Hillary Clinton has not held a news conference in more than 7 months. Her record is so bad she is unable to answer tough questions!","rating":6},{"id":746895602798178300,"text":"I have never liked the media term 'mass deportation' -- but we must enforce the laws of the land!","rating":4},{"id":773836389943246800,"text":"Wow, reviews are in - THANK YOU!","rating":2},{"id":756875689924694000,"text":"Tim Kaine has been praising the Trans Pacific Partnership and has been pushing hard to get it approved. Job killer!","rating":5},{"id":728777599560892400,"text":"Goofy Elizabeth Warren is weak and ineffective. Does nothing. All talk, no action -- maybe her Native American name?","rating":7},{"id":759024055123009500,"text":"General John Allen, who I never met but spoke against me last night, failed badly in his fight against ISIS. His record = BAD  #NeverHillary","rating":7},{"id":710923287430357000,"text":"Failed presidential candidate Mitt Romney, the man who \"\"choked\"\" and let us all down, is now endorsing Lyin' Ted Cruz. This is good for me!","rating":8},{"id":768903697166368800,"text":"Just watched recap of #CrookedHillary's speech. Very short and lies. She is the only one fear-mongering!","rating":8},{"id":728528466765844500,"text":"Unlike crooked Hillary Clinton, who wants to destroy all miners, I want wages to go up in America. We will do so by bringing back jobs!","rating":6},{"id":737785114239864800,"text":"I am getting great credit for my press conference today. Crooked Hillary should be admonished for not having a press conference in 179 days.","rating":9},{"id":629992743788523500,"text":"So many \"\"politically correct\"\" fools in our country. We have to all get back to work and stop wasting time and energy on nonsense!","rating":7},{"id":747418754255052800,"text":"The media is unrelenting. They will only go with and report a story in a negative light. I called Brexit (Hillary was wrong), watch November","rating":6},{"id":763398630812311600,"text":"Morning Joe's weakness is its low ratings. I don't watch anymore but I heard he went wild against Rudy Giuliani and #2A - sad &amp, irrelevant!","rating":5},{"id":746908869134262300,"text":"Just landed in New York - a one night stay in Scotland. Turnberry came out magnificently. My son, Eric, did a great job - under budget!","rating":4},{"id":740708673694076900,"text":"I would have had many millions of votes more than Crooked Hillary Clinton except for the fact that I had 16 opponents, she had one!","rating":7},{"id":722626421231890400,"text":"Thank you New York, I will never forget!","rating":1},{"id":707386022569623600,"text":"Thank you Michigan! #Trump2016","rating":1},{"id":375075774644363260,"text":"What I am saying is stay out of Syria.","rating":4},{"id":754648419151511600,"text":"It doesn't matter that Crooked Hillary has experience, look at all of the bad decisions she has made. Bernie said she has bad judgement!","rating":6},{"id":739082059348619300,"text":"The Mayor of San Jose did a terrible job of ordering the  protection of innocent people. The thugs were lucky supporters remained peaceful!","rating":3},{"id":785292623623905300,"text":"We must repeal Obamacare and replace it with a much more competitive, comprehensive, affordable system. #debate #MAGA","rating":2},{"id":373527227935518700,"text":"If Obama attacks Syria and innocent civilians are hurt and killed, he and the U.S. will look very bad!","rating":5},{"id":698976776115130400,"text":"Tickets for future debates should be put out to the general public instead of being given to the lobbyists &amp, special interests - the bosses!","rating":2},{"id":732533409285865500,"text":"Wow, 30,000 e-mails were deleted by Crooked Hillary Clinton. She said they had to do with a wedding reception. Liar! How can she run?","rating":8},{"id":737238518775320600,"text":"The endorsement of me by the 16,500 Border Patrol Agents was the first time that they ever endorsed a presidential candidate. Nice!","rating":2},{"id":709878592189153300,"text":"Word is that, despite a record amount spent on negative and phony ads, I had a massive victory in Florida. Numbers out soon!","rating":5},{"id":724567219062059000,"text":"Lyin' Ted Cruz and 1 for 38 Kasich are unable to beat me on their own so they have to team up (collusion) in a two on one. Shows weakness!","rating":8},{"id":749706242579247100,"text":"On Saturday a great man, Elie Wiesel, passed away.The world is a better place because of him and his belief that good can triumph over evil!","rating":2},{"id":737376803514286100,"text":"I hope everyone had a great Memorial Day!","rating":2},{"id":762669882571980800,"text":"My economic policy speech will be carried live at 12:15 P.M. Enjoy!","rating":3},{"id":753354905897668600,"text":"Is Supreme Court Justice Ruth Bader Ginsburg going to apologize to me for her misconduct? Big mistake by an incompetent judge!","rating":7},{"id":733838909805887500,"text":"Crooked Hillary is spending tremendous amounts of Wall Street money on false ads against me. She is a very dishonest person!","rating":6},{"id":1028258612165128200,"text":"Why isn’t the FBI giving Andrew McCabe text massages to Judicial Watch or appropriate governmental authorities. FBI said they won’t give up even one (I may have to get involved, DO NOT DESTROY). What are they hiding? McCabe wife took big campaign dollars from Hillary people......","rating":8},{"id":760098514319835100,"text":"So with all of the Obama tough talk on Russia and the Ukraine, they have already taken Crimea and continue to push. That's what I said!","rating":4},{"id":537160060682924000,"text":"Our country is totally fractured and, with our weak leadership in Washington, you can expect Ferguson type riots and looting in other places","rating":6},{"id":747029963702997000,"text":"Crooked Hillary Clinton, who called BREXIT 100% wrong (along with Obama), is now spending Wall Street money on an ad on my correct call.","rating":6},{"id":712291134991691800,"text":"President Obama looks and sounds so ridiculous making his speech in Cuba, especially in the shadows of Brussels. He is being treated badly!","rating":7},{"id":754652888752910300,"text":"If Goofy Elizabeth Warren, a very weak Senator, didn't lie about her heritage (being Native American) she would be nothing today. Pick her H","rating":8},{"id":697182075045179400,"text":"We will immediately repeal and replace ObamaCare - and nobody can do that like me. We will save $'s and have much better healthcare!","rating":5},{"id":737055532960223200,"text":"The Republican Party has to be smart &amp, strong if it wants to win in November. Can't allow lightweights to set up a spoiler Indie candidate!","rating":4},{"id":708720448335437800,"text":"The last person that Hillary or Bernie want to run against is Donald Trump --- and that is fact!","rating":3},{"id":734482099793711100,"text":"Bernie Sanders is continuing his quest because he believes that Crooked Hillary Clinton will be forced out of the race - e-mail scandal!","rating":6},{"id":728777556804153300,"text":"Goofy Elizabeth Warren and her phony Native American heritage are on a Twitter rant. She is too easy! I'm driving her nuts.","rating":8},{"id":757187537681154000,"text":"Looks like the Bernie people will fight. If not, their BLOOD, SWEAT AND TEARS was a total waste of time. Kaine stands for opposite!","rating":5},{"id":714503667261562900,"text":"A detainee released from Gitmo has killed an American. When will our so-called \"\"leaders\"\" ever learn!","rating":7},{"id":788929804351385600,"text":"USA has the greatest business people in the world but we let political hacks negotiate our deals. We need change! #BigLeagueTruth #Debate","rating":5},{"id":706107571401134100,"text":"For all of today's voters please remember that I am the only candidate that is self funding my campaign, I am not bought and paid for!","rating":3},{"id":772571293438840800,"text":"The Great State of Arizona, where I just had a massive rally (amazing people), has a very weak and ineffective Senator, Jeff Flake. Sad!","rating":7},{"id":1281238369050210300,"text":"....Won all against the Federal Government and the Democrats send everything to politically corrupt New York, which is falling apart with everyone leaving, to give it a second, third and fourth try. Now the Supreme Court gives a  delay ruling that they would never have given...","rating":4},{"id":788914975779663900,"text":"Moderator: Hillary paid $225,000 by a Brazilian bank for a speech that called for “open borders.” That’s a quote! #Debate #BigLeagueTruth","rating":6},{"id":738448988517453800,"text":"Crooked Hillary no longer has credibility - too much failure in office. People will not allow another four years of incompetence!","rating":4},{"id":733837704312410100,"text":"Crooked Hillary Clinton wants to essentially abolish the 2nd Amendment. No gun owner can ever vote for Clinton!","rating":6},{"id":737784398515441700,"text":"Katie Couric, the third rate reporter, who has been largely forgotten, should be ashamed of herself for the fraudulent editing of her doc.","rating":8},{"id":774491376906100700,"text":"Just returned from Pensacola, Florida, where the crowd was incredible.","rating":2},{"id":1126815128106799100,"text":"....The process has begun to place additional Tariffs at 25% on the remaining 325 Billion Dollars. The U.S. only sells China approximately 100 Billion Dollars of goods &amp, products, a very big imbalance. With the over 100 Billion Dollars in Tariffs that we take in, we will buy.....","rating":5},{"id":770247094439469000,"text":"Inner-city crime is reaching record levels. African-Americans will vote for Trump because they know I will stop the slaughter going on!","rating":8},{"id":694551687080644600,"text":"My experience in Iowa was a great one. I started out with all of the experts saying I couldn't do well there and ended up in 2nd place. Nice","rating":3},{"id":704834059915104300,"text":"Thank you Massachusetts! #Trump2016 #SuperTuesday","rating":2},{"id":705362027901009900,"text":"Why did Mitt Romney BEG me for my endorsement four years ago?","rating":5},{"id":747098691492786200,"text":"Crooked Hillary just took a major ad of me playing golf at Turnberry. Shows me hitting shot, but I never did = lie! Was there to support son","rating":7},{"id":266034630820507650,"text":"We can't let this happen. We should march on Washington and stop this travesty. Our nation is totally divided!","rating":7},{"id":747178078682644500,"text":"People in our country want borders, and without them the old line pols like Crooked Hillary will not win. It is time for CHANGE -- and JOBS!","rating":6},{"id":692312112115380200,"text":"I refuse to call Megyn Kelly a bimbo, because that would not be politically correct. Instead I will only call her a lightweight reporter!","rating":9},{"id":783461358436089900,"text":"I will be live-tweeting the V.P. Debate. Very exciting! MAKE AMERICA GREAT AGAIN!","rating":4},{"id":752834632907944000,"text":"Crime is out of control, and rapidly getting worse. Look what is going on in Chicago and our inner cities. Not good!","rating":6},{"id":1228435666754850800,"text":"It has been two years since the tragedy in Parkland. We will always mourn the innocent lives taken from us – 14 wonderful students and 3 terrific educators. Earlier this week, I met with families whose experiences from that horrible day still piece the soul....","rating":2},{"id":692430362966921200,"text":"Even though I beat him in the first six debates, especially the last one, Ted Cruz wants to debate me again. Can we do it in Canada?","rating":8},{"id":728739851823153200,"text":"Just met with courageous family of Sarah Root in Nebraska. Sarah was horribly killed by illegal immigrant, but leaves behind amazing legacy.","rating":4},{"id":707470040954761200,"text":"Thank you Hawaii! #Trump2016","rating":3},{"id":752848856317059100,"text":"For too many years, our inner cities have been left behind. I am going to deliver jobs, safety and protection for those in need.","rating":3},{"id":704834141565657100,"text":"Thank you Tennessee! #Trump2016#SuperTuesday","rating":2},{"id":739816997345755100,"text":"I am getting bad marks from certain pundits because I have a small campaign staff. But small is good, flexible, save money and number one!","rating":5},{"id":733604767612710900,"text":"Crooked Hillary can't even close the deal with Bernie - and the Dems have it rigged in favor of Hillary. Four more years of this? No way!","rating":7},{"id":602571404861636600,"text":"I would like to wish everyone, including all haters and losers (of which, sadly, there are many) a truly happy and enjoyable Memorial Day!","rating":9},{"id":709687052384731100,"text":"I will bring our jobs back to America, fix our military and take care of our vets, end Common Core and ObamaCare, protect 2nd A, build WALL","rating":5},{"id":710152303966351400,"text":"Thank you to the Governor of Florida, Rick Scott, for your endorsement. I greatly appreciate your support!","rating":2},{"id":1151865848950329300,"text":"Most of the MS-13 Gang members indictedand &amp, arrested in L.A. were illegal aliens, 19 of 22. They are said to have killed many people in the most brutal fashion. They should never have been allowed in our Country for so long, 10 years. We have arrested and deported thousands.....","rating":6},{"id":709819253977915400,"text":"A lot of complaints from people saying my name is not on the ballot in various places in Florida? Hope this is false.","rating":5},{"id":749721116911034400,"text":"I believe that Crooked Hillary sent Bill to have the meeting with the U.S.A.G. So Bill is not in trouble with H except that he got caught!","rating":7},{"id":1009779791858413600,"text":"Henry McMaster has done a great job as Governor of South Carolina. The State is BOOMING, with jobs and new industry setting records. He is tough on Crime and strong on Borders, Health Care, the Mititary and our great Vets. Henry has my full and complete Endorsement! #MAGA","rating":3},{"id":716088246258651100,"text":"I will be in Wisconsin until the election. Jobs, trade and immigration will be big factors. I will bring jobs back home - make great deals!","rating":4},{"id":704834185471598600,"text":"Thank you Alabama! #Trump2016#SuperTuesday","rating":2},{"id":713806176274804700,"text":"Lyin' Ted Cruz is now trying to convince prople that his problems with The National Enq.were caused by me. I had NOTHING to do with story!","rating":8},{"id":704846146657722400,"text":"Thank you Virginia! #Trump2016#SuperTuesday","rating":2},{"id":737036608915034100,"text":"Good news is that my campaign has perhaps more cash than any campaign in the history of politics- b/c I stand 100% behind everything we do.","rating":4},{"id":730018836808933400,"text":"Why does the media, with a strong push from Crooked Hillary, keep pushing the false narrative that I want to raise taxes. Exactly opposite!","rating":7},{"id":693280682534137900,"text":"Hillary Clinton is a major national security risk. Not presidential material!","rating":6},{"id":745299161130635300,"text":"I am \"\"the king of debt.\"\"That has been great for me as a businessman, but is bad for the country. I made a fortune off of debt, will fix U.S.","rating":8},{"id":697173206663213000,"text":"ISIS is making big threats today - no respect for U.S.A. or our \"\"leader\"\" - If I win it will be a very different story,with very fast results","rating":7},{"id":707354724182442000,"text":"Word is I am doing very well in Michigan and Mississippi! Wow, and with all that money spent against me! Will be going to Trump Jupiter now!","rating":5},{"id":759371377002553300,"text":"Colorado was amazing yesterday! So much support. Our tax, trade and energy reforms will bring great jobs to Colorado and the whole country.","rating":4},{"id":745967990236143600,"text":"Thank you to Donald Rumsfeld for the endorsement. Very much appreciated. Clinton's conduct has been \"\"disqualifying.\"\"","rating":5},{"id":746044729343742000,"text":"Hillary Clinton’s open borders are tearing American families apart. I am going to make our country Safe Again for all Americans. #Imwithyou","rating":6},{"id":754530019200884700,"text":"Goofy Elizabeth Warren, who may be the least productive Senator in the U.S. Senate, must prove she is not a fraud. Without the con it's over","rating":8},{"id":464251796354269200,"text":"The global warming we should be worried about is the global warming caused by NUCLEAR WEAPONS in the hands of crazy or incompetent leaders!","rating":9},{"id":729722941521469400,"text":"I am lowering taxes far more than any other candidate. Any negotiated increase by Congress to my proposal would still be lower than current!","rating":5},{"id":737610159459991600,"text":"I have raised/given a tremendous amount of money to our great VETERANS, and have got nothing but bad publicity for doing so. Watch!","rating":6},{"id":549590421190770700,"text":"Deals are my art form. Other people paint beautifully or write poetry. I like making deals, preferably big deals. That's how I get my kicks.","rating":7},{"id":736671884247478300,"text":"Don't believe the biased and phony media quoting people who work for my campaign. The only quote that matters is a quote from me!","rating":6},{"id":730035627945775100,"text":"It is only the people that were never asked to be VP that tell the press that they will not take the position.","rating":6},{"id":706674352167772200,"text":"All of the phony T.V. commercials against me are bought and payed for by SPECIAL INTEREST GROUPS, the bandits that tell your pols what to do","rating":7},{"id":736655448993108000,"text":"The media is on a new phony kick about my management style. I spend much less money &amp, get much better results! What we need as Prez!","rating":5},{"id":748851673313873900,"text":"Bill Clinton's meeting was a total secret. Nobody was to know about it but he was caught by a local reporter.","rating":4},{"id":777284744253812700,"text":"Never met but never liked dopey Robert Gates. Look at the mess the U.S. is in. Always speaks badly of his many bosses, including Obama.","rating":8},{"id":749935837748596700,"text":"Crooked Hillary will NEVER be able to handle the complexities and danger of ISIS - it will just go on forever. We need change!","rating":9},{"id":701240216745603100,"text":"What a great night. Thank you South Carolina, a special place with truly amazing people! LOVE","rating":2},{"id":757552876348645400,"text":"If Bernie Sanders, after seeing the just released e-mails, continues to look exhausted and done, then his legacy will never be the same.","rating":5},{"id":735073508124983300,"text":"Crooked Hillary Clinton overregulates, overtaxes and doesn't care about jobs. Most importantly, she suffers from plain old bad judgement!","rating":7},{"id":272495768902959100,"text":"Hope everyone enjoyed their Thanksgiving. But get ready, our country is in big trouble!","rating":6},{"id":715907761926750200,"text":"The National Border Patrol Council (NBPC) said that our open border is the biggest physical &amp, economic threat facing the American people!","rating":4},{"id":639480265841225700,"text":"Congratulations to Tom Brady on yet another great victory- Tom is my friend and a total winner!","rating":3},{"id":737689416811073500,"text":"So many veterans groups are beyond happy with all of the money I raised/gave! It was my great honor - they do an amazing job.","rating":2},{"id":755836720197795800,"text":"John Kasich was never asked by me to be V.P. Just arrived in Cleveland - will be a great two days!","rating":3},{"id":749934450868387800,"text":"The third mass attack (slaughter) in days by ISIS. 200 dead in Baghdad, worst in many years. We do not have leadership that can stop this!","rating":6},{"id":665524569961287700,"text":"President Obama said \"\"ISIL continues to shrink\"\" in an interview just hours before the horrible attack in Paris. He is just so bad! CHANGE.","rating":8},{"id":157881540003635200,"text":"\"\"I love America. And when you love something you protect it passionately--fiercely, even. #TimeToGetTough  (cont) http://t.co/S8XxN8Jj","rating":5},{"id":720460065958989800,"text":"The rules DID CHANGE in Colorado shortly after I entered the race in June because the pols and their bosses knew I would win with the voters","rating":6},{"id":709690378778230800,"text":"Please remember, I am the ONLY candidate who is self-funding his campaign. Kasich, Rubio and Cruz are all bought and paid for by lobbyists!","rating":7},{"id":713809729764589600,"text":"Wisconsin's economy is doing poorly and like everywhere else in U.S., jobs are leaving. I will make our economy strong again - bring in jobs","rating":4},{"id":263335564412076030,"text":"I never fall for scams.  I am the only person who immediately walked out of my ‘Ali G’ interview","rating":8},{"id":757335224397226000,"text":"Crooked Hillary Clinton was not at all loyal to the person in her rigged system that pushed her over the top, DWS. Too bad Bernie flamed out","rating":7},{"id":479004002919919600,"text":"“No one remembers who came in second.” – Walter Hagen","rating":3},{"id":707239753352093700,"text":"Remember, I am the only one who is self-funding my campaign. All of the other candidates are bought and paid for by special interests!","rating":5},{"id":754645662357160000,"text":"As the days and weeks go by,  we see what a total mess our country (and world) is in - Crooked Hillary Clinton led Obama into bad decisions!","rating":6},{"id":669861224465743900,"text":"Happy Thanksgiving to all. Have a great day and look forward to the future. We will MAKE AMERICA GREAT AGAIN!","rating":4},{"id":757174767547977700,"text":"Bernie Sanders started off strong, but with the selection of Kaine for V.P., is ending really weak. So much for a movement! TOTAL DISRESPECT","rating":8},{"id":743761349910487000,"text":"Amazing crowd last night in Dallas - more spirit and passion than ever before. Today, all over the great State of Texas!","rating":5},{"id":730069558132932600,"text":"I look very much forward to meeting w/Paul Ryan &amp, the GOP Party Leadership on Thurs in DC. Together, we will beat the Dems at all levels!","rating":3},{"id":712731263929618400,"text":"I think having Jeb's endorsement hurts Lyin' Ted. Jeb spent more than $150,000,000 and got nothing. I spent a fraction of that and am first!","rating":7},{"id":710914741321998300,"text":"With millions of dollars of negative and phony ads against me by the establishment, my numbers continue to go up. Can anyone explain this?","rating":6},{"id":721694330805755900,"text":"Lyin' Ted Cruz can't get votes (I am millions ahead of him) so he has to get his delegates from the Republican bosses. It won't work!","rating":7},{"id":1168493188056830000,"text":"....Average hourly wages growth has far outpaced what we saw with President Obama. Across all industries, from mining and construction, to leisure &amp, hospitality, With President Trump we see income growth in states like Iowa, Ohio, Pennsylvania, Wisconsin, Nevada, Florida,......","rating":2},{"id":680154897518608400,"text":"Next year will be an interesting one. I look forward to running against Hillary Clinton, a totally flawed candidate, and beating her soundly","rating":6},{"id":707377544224510000,"text":"Thank you Mississippi! #Trump2016","rating":1},{"id":740511746503364600,"text":"Thank you to all for your wonderful comments on my speech. I could feel the electricity in thr air. Great reviews - most votes ever recieved","rating":4},{"id":1028262012332240900,"text":".....Will the FBI ever recover it’s once stellar reputation, so badly damaged by Comey, McCabe, Peter S and his lover, the lovely Lisa Page, and other top officials now dismissed or fired? So many of the great men and women of the FBI have been hurt by these clowns and losers!","rating":7},{"id":760095370185674800,"text":"When I said in an interview that Putin is \"\"not going into Ukraine, you can mark it down,\"\" I am saying if I am President. Already in Crimea!","rating":6},{"id":747986907162878000,"text":"Iron Mike Tyson was not asked to speak at the Convention though I'm sure he would do a good job if he was. The media makes everything up!","rating":8},{"id":706827555622547500,"text":"We cannot let the failing REPUBLICAN ESTABLISHMENT, who could not stop Obama (twice), ruin the MOVEMENT with millions of  $'s in false ads!","rating":5},{"id":714095595888238600,"text":"My statement on NATO being obsolete and disproportionately too expensive (and unfair) for the U.S. are now, finally, receiving plaudits!","rating":4},{"id":748142709932757000,"text":"Why would the USChamber be upset by the fact that I want to negotiate better and stronger trade deals or that I want penalties for cheaters?","rating":3},{"id":725648706385633300,"text":"Lyin' Ted Cruz, who can never beat Hillary Clinton and has NO path to victory, has chosen a V.P.candidate who failed badly in her own effort","rating":7},{"id":1038776649171578900,"text":"“Barrack Obama talked a lot about hope, but Donald Trump delivered the American Dream. All the economic indicators, what’s happening overseas, Donald Trump has proven to be far more successful than Barrack Obama. President Trump is delivering the American Dream.” Jason Chaffetz","rating":5},{"id":783803377977135100,"text":"EARLY VOTING: MN &amp, IA already underway, more states coming up in the next week: OH, ME, AZ, IN — check w/local officials for details &amp, VOTE!","rating":2},{"id":728725179074023400,"text":"Goofy Elizabeth Warren, Hillary Clinton’s flunky, has a career that is totally based on a lie. She is not Native American.","rating":8},{"id":1229776842644709400,"text":"The United States cannot, &amp; will not, become such a difficult place to deal with in terms of foreign countries buying our product, including for the always used National Security excuse, that our companies will be forced to leave in order to remain competitive. We want to sell...","rating":5},{"id":495384828427374600,"text":"If you read my last number of tweets, only one opinion can be formed - that our President, and therefore \"\"leader,\"\" is grossly incompetent!","rating":8},{"id":726008645473824800,"text":"Wow, the ridiculous deal made between Lyin'Ted Cruz and 1 for 42 John Kasich has just blown up. What a dumb deal - dead on arrival!","rating":7},{"id":707225317648240600,"text":"MAKE AMERICA GREAT AGAIN!","rating":4},{"id":673672413863927800,"text":"Is that all there is? We need a new President - FAST!","rating":6},{"id":747027629652443100,"text":"George Will, one of the most overrated political pundits (who lost his way long ago), has left the Republican Party.He's made many bad calls","rating":6},{"id":728531431824166900,"text":"So many great endorsements yesterday, except for Paul Ryan! We must put America first and MAKE AMERICA GREAT AGAIN!","rating":7},{"id":741286391200505900,"text":"The great boxing promoter, Don King, just endorsed me. Nice!","rating":3},{"id":724568416338759700,"text":"Shows how weak and desperate Lyin' Ted is when he has to team up with a guy who openly can't stand him and is only 1 win and 38 losses.","rating":8},{"id":730342411835195400,"text":"Big wins in West Virginia and Nebraska. Get ready for November - Crooked Hillary, who is looking very bad against Crazy Bernie, will lose!","rating":9},{"id":1024676935065120800,"text":"“We already have a smocking gun about a campaign getting dirt on their opponent, it was Hillary Clinton. How is it OK for Hillary Clinton to proactively seek dirt from the Russians but the Trump campaign met at the Russians request and that is bad?” Marc Thiessen, Washington Post","rating":8},{"id":773140702972801000,"text":"As a tribute to the late, great Phyllis Schlafly, I hope everybody can go out and get her latest book, THE CONSERVATIVE CASE FOR TRUMP.","rating":4},{"id":266035509162303500,"text":"This election is a total sham and a travesty. We are not a democracy!","rating":9},{"id":733600358501625900,"text":"Crooked Hillary Clinton looks presidential? I don't think so! Four more years of Obama and our country will never come back. ISIS LAUGHS!","rating":7},{"id":737376356795875300,"text":"I would have had millions of votes more in the primaries (than Crooked Hillary) if I only had one opponent, instead of sixteen. Broke record","rating":6},{"id":687108096926330900,"text":"The #SOTU speech is really boring, slow, lethargic - very hard to watch!","rating":5},{"id":747190075344162800,"text":"Hillary Clinton is not a change agent, just the same old status quo! She is spending a fortune, I am spending very little. Close in polls!","rating":5},{"id":710928141112332300,"text":"Mitt Romney is a mixed up man who doesn't have a clue. No wonder he lost!","rating":6},{"id":737688582849171500,"text":"Just finished a press conference in Trump Tower wherein I gave information on which VETERANS groups got the $5,600,000 that I raised/gave!","rating":3},{"id":746047705709961200,"text":"Obama &amp, Clinton should stop meeting with special interests, &amp, start meeting with the victims of illegal immigration.","rating":4},{"id":736554410361409500,"text":"The U.S. has 69 treaties with other countries where we would have to defend them and their borders. How nice, but what do we get? NOT ENOUGH","rating":7},{"id":666060370692448300,"text":"Tom Brady just did it again. He is not only a great guy, he is, without question, the BEST quarterback!","rating":4},{"id":1206440095663841300,"text":"....of the most successful presidencies in history. Just in the last few days, incredible jobs numbers, giant trade deals, help for working families, and much more. Over the last 3 years, unemployment falling, earnings rising, criminal justice reform, the heartland revived,....","rating":3},{"id":714619106151030800,"text":"Lyin' Ted, I have already beaten you in all debates, and am way ahead of you in votes and delegates. You should focus on jobs &amp, illegal imm!","rating":8},{"id":748599572230975500,"text":"I have self funded my winning primary campaign with an approx. $50 million loan. I have totally terminated the loan!","rating":5},{"id":699989532180136000,"text":"Jeb Bush just got contact lenses and got rid of the glasses. He wants to look cool, but it's far too late. 1% in Nevada!","rating":9},{"id":673675062600466400,"text":"Wish Obama would say ISIS, like almost everyone else, rather than ISIL.","rating":5},{"id":746144027616120800,"text":"Leaving now for a one night trip to Scotland in order to be at the Grand Opening of my great Turnberry Resort. Will be back on Sat. night!","rating":4},{"id":703601762876305400,"text":"I am self-funding my campaign and am therefore not controlled by the lobbyists and special interests like lightweight Rubio or Ted Cruz!","rating":6},{"id":788908831304654800,"text":"Ready to lead. Ready to Make America Great Again. #Debate #MAGA","rating":2},{"id":387565483303923700,"text":"President should not be telling the Washington Redskins to change their name-our country has far bigger problems! FOCUS on them,not nonsense","rating":7},{"id":789207626143834100,"text":"When Obama took office in 2009 employer-provided premiums cost $13,375. Today they are $18,142. Thanks, Obama.","rating":5},{"id":746052286640689200,"text":"On immigration, I’m consulting with our immigration officers&amp, our wage-earners. Hillary Clinton is consulting with Wall Street.","rating":6},{"id":697263333959995400,"text":"Thank you to the people of  New Hampshire, I love you! Now, off to South Carolina.","rating":4},{"id":697183070357753900,"text":"We will stop heroin and other drugs from coming into New Hampshire from our open southern border. We will build a WALL and have security.","rating":6},{"id":729716712124362800,"text":"Crooked Hillary Clinton says that she got more primary votes than Donald Trump. But I had 17 people to beat—she had one!","rating":8},{"id":712728075532943400,"text":"Low energy Jeb Bush just endorsed a man he truly hates, Lyin’ Ted Cruz. Honestly, I can’t blame Jeb in that I drove him into oblivion!","rating":9},{"id":716826069777645600,"text":"A great day in Wisconsin, many stops, many great people! Melania is joining me on Monday. Big crowds. MAKE AMERICA GREAT AGAIN!","rating":4},{"id":705227593205878800,"text":"Because of me, the Republican Party has taken in millions of new voters, a record. If they are not careful, they will all leave. Sad!","rating":7},{"id":718408900375154700,"text":"So great to be in New York. Catching up on many things (remember, I am still running a major business while I campaign) and loving it!","rating":5},{"id":1168891437032857600,"text":"The incompetent Mayor of London, Sadique Kahn, was bothered that I played a very fast round of golf yesterday. Many Pols exercise for hours, or travel for weeks. Me, I run through one of my courses (very inexpensive). President Obama would fly to Hawaii. Kahn should focus on....","rating":7},{"id":736961734167146500,"text":"Heading to D.C. to see and hear ROLLING THUNDER. Amazing people that LOVE OUR COUNTRY. Great spirit!","rating":3},{"id":709775232152817700,"text":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"\"sing\"\" again.","rating":5},{"id":709930663953231900,"text":"I only wish my wonderful daughter Tiffany could have been with us at Mar-a-Lago for our great election victory. She is a winner!","rating":4},{"id":747030708678430700,"text":"Clinton is trying to wash away her bad judgement call on BREXIT with big dollar ads. Disgraceful!","rating":6},{"id":748851569190318100,"text":"As Bernie Sanders said, Hillary Clinton has bad judgement. Bill's meeting was probably initiated and demanded by Hillary!","rating":5},{"id":726609734653104100,"text":"I will be in Indiana on Sunday and Monday at four MAKE AMERICA GREAT AGAIN rallies. See you there!","rating":2},{"id":753347448743964700,"text":"New GOP platform now includes language that supports the border wall. We will build the wall and MAKE AMERICA SAFE AGAIN!","rating":4},{"id":734066896794964000,"text":"Crooked Hillary Clintons foreign interventions unleashed ISIS in Syria, Iraq and Libya. She is reckless and dangerous!","rating":8},{"id":713556905550069800,"text":"Top suspect in Paris massacre, Salah Abdeslam, who also knew of the Brussels attack, is no longer talking. Weak leaders, ridiculous laws!","rating":6},{"id":728423832848044000,"text":"Thank you West Virginia. Let's keep it going. Go out and vote on Tuesday - we will win big. #Trump2016","rating":3},{"id":710149837979836400,"text":"Yesterday was amazing—5 victories.  Lyin’ Ted Cruzhad zero. Things are going very well!","rating":6},{"id":737232540436664300,"text":"Obama says a WALL at our southern border won't enhance our security (wrong) and yet he now wants to build a much bigger wall (fence) at W.H.","rating":7},{"id":521813597799067650,"text":"Can you believe that,with all of the problems and difficulties facing the U.S., President Obama spent the day playing golf.Worse than Carter","rating":8},{"id":694890328273346600,"text":"Based on the fraud committed by Senator Ted Cruz during the Iowa Caucus, either a new election should take place or Cruz results nullified.","rating":9},{"id":714194279409848300,"text":"Why can't the pundits be honest? Hopefully we are all looking for a strong and great country again. I will make it strong and great!  JOBS!","rating":5},{"id":699232824990285800,"text":"Now that George Bush is campaigning for Jeb(!), is he fair game for questions about World Trade Center, Iraq War and eco collapse? Careful!","rating":8},{"id":745294739092684800,"text":"Hillary Clinton surged the trade deficit with China 40% asSecretary of State, costing Americans millions of jobs.","rating":4},{"id":700799986104029200,"text":"MAKE AMERICA GREAT AGAIN!","rating":2},{"id":783472068796911600,"text":"Here we go - Enjoy!","rating":1},{"id":714855025055514600,"text":"Wow, Corey Lewandowski, my campaign manager and a very decent man, was just charged with assaulting a reporter. Look at tapes-nothing there!","rating":7},{"id":767133459148054500,"text":"Just leaving Virginia - really big crowd, great enthusiasm!","rating":3},{"id":738387288372052000,"text":"Bernie Sanders was right when he said that Crooked Hillary Clinton was not qualified to be president because she suffers from BAD judgement!","rating":6},{"id":728725098409164800,"text":"Let’s properly check goofy Elizabeth Warren’s records to see if she is Native American. I say she’s a fraud!","rating":8},{"id":729717317467246600,"text":"I will have set the all time record in primary votes in the Republican party --despite having to compete against 17 other people!","rating":5},{"id":788920628535435300,"text":"Our country is stagnant. We’ve lost jobs and business. We don’t make things anymore b/c of the bill Hillary’s husband signed and she blessed","rating":5},{"id":1264891998017859600,"text":"...full attendance in the Arena. In other words, we would be spending  millions of dollars building the Arena to a very high standard without even knowing if the Democrat Governor would allow the Republican Party to fully occupy the space. Plans are being....","rating":4},{"id":708472737992409100,"text":"I just got off the phone with the great people of Guam! Thank you for your support! #VoteTrump today! #Trump2016","rating":3},{"id":682703233492619300,"text":"I would like to wish everyone A HAPPY AND HEALTHY NEW YEAR. WE MUST ALL WORK TOGETHER TO, FINALLY, MAKE AMERICA SAFE AGAIN AND GREAT AGAIN!","rating":4},{"id":706884676263276500,"text":"Don't believe the millions of dollars of phony television ads by lightweight Rubio and the R establishment. Dishonest people!","rating":6},{"id":734938503541325800,"text":"Much of the money I have raised for our veterans has already been distributed, with the rest to go shortly to various other veteran groups.","rating":4},{"id":1138782960444956700,"text":"The Fake News has never been more dishonest than it is today. Thank goodness we can fight back on Social Media. There new weapon of choice is Fake Polling, sometimes referred to as Suppression Polls (they suppress the numbers). Had it in 2016, but this is worse.........","rating":7},{"id":712748982531977200,"text":"While I believe I will clinch before Cleveland and get more than 1237 delegates, it is unfair in that there have been so many in the race!","rating":3},{"id":708857632816287700,"text":"Wow, Kasich didn't qualify to run in the state of Pennsylvania, not enough signatures. Big problem!","rating":5},{"id":706325441028689900,"text":"Thank you Kentucky! #Trump2016#SuperSaturday","rating":2},{"id":733597831261499400,"text":"Look where the world is today, a total mess, and ISIS is still running around wild. I can fix it fast, Hillary has no chance!","rating":6},{"id":722181629528141800,"text":"Lyin’ Ted Cruz even voted against Superstorm Sandy aid and September 11th help. So many New Yorkers devastated. Cruz hates New York!","rating":8},{"id":739803054476775400,"text":"Just like I have been able to spend far less money than  others on the campaign and finish #1, so too should our country. We can be great!","rating":5},{"id":720458178698338300,"text":"Biggest story in politics is now happening in the great State of Colorado where over one million people have been precluded from voting!","rating":7},{"id":714617467839111200,"text":"Lyin'Ted Cruz is weak &amp, losing big, so now he wants to debate again. But, according to Drudge,Time and on-line polls, I have won all debates","rating":6},{"id":701779181986680800,"text":"I hear the Rickets family, who own the Chicago Cubs, are secretly spending $'s against me. They better be careful, they have a lot to hide!","rating":8},{"id":730482068753424400,"text":"Goofy Elizabeth Warren is now using the woman’s card like her friend crooked Hillary. See her dumb tweet “when a woman stands up to you...”","rating":9},{"id":738720347239809000,"text":"In Crooked Hillary's telepromter speech yesterday, she made up things that I said or believe but have no basis in fact. Not honest!","rating":7},{"id":722397728475582500,"text":"A big day for New York and for our COUNTRY! MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1054554601192489000,"text":"We send our deepest condolences to Lou and the entire Barletta family - he has been working so hard despite this terrible situation for the people of Pennsylvania. Our thoughts and prayers are with you Lou!","rating":3},{"id":773948120069615600,"text":"Mexico has lost a brilliant finance minister and wonderful man who I know is highly respected by President Peña Nieto.","rating":4},{"id":1179406259273031700,"text":"Now the press is trying to sell the fact that I wanted a Moot stuffed with alligators and snakes, with an electrified fence and sharp spikes on top, at our Southern Border. I may be tough on Border Security, but not that tough. The press has gone Crazy. Fake News!","rating":9},{"id":1120383575377969200,"text":"Spoke to President Maithripala Sirisena of Sri Lanka yesterday to inform him that the United States stands by him and his country in the fight against terrorism. Also expressed condolences on behalf of myself and the People of the United States.","rating":4},{"id":742371820867878900,"text":"I will be going to New Hampshire today, home of my first primary victory, to discuss terror and the horrible events of yesterday. 2:30 P.M.","rating":3},{"id":747191624535511000,"text":"Crooked Hillary Clinton got Brexit wrong. I said LEAVE will win. She has no sense of markets and such bad judgement. Only a question of time","rating":7},{"id":724911563405189100,"text":"The Cruz-Kasich pact is under great strain. This joke of a deal is falling apart, not being honored and almost dead. Very dumb!","rating":8},{"id":706311590321246200,"text":"Thank you Louisiana! #Trump2016#SuperSaturday","rating":5},{"id":725532457756405800,"text":"Getting the strong endorsement of the great coach, Bobby Knight, has been a highlight of my stay in Indiana. Big speech tomorrow with Bobby!","rating":4},{"id":733593259423862800,"text":"I said that Crooked Hillary Clinton is \"\"not qualified\"\" to be president because she has \"\"very bad judgement\"\" - Bernie said the same thing!","rating":6},{"id":1168891438324756500,"text":"....”knife crime,” which is totally out of control in London. People are afraid to even walk the streets. He is a terrible mayor who should stay out of our business!","rating":9},{"id":707258582501302300,"text":"Mitt Romney had his chance and blew it. Lindsey Graham ran for president, got ZERO, and quit! Why are they now spokesmen against me? Sad!","rating":7},{"id":749972298086645800,"text":"The only people who are not interested in being the V.P. pick are the people who have not been asked!","rating":6},{"id":1281238368374923300,"text":"....No Republican Senate Judiciary response, NO “JUSTICE”, NO FBI, NO NOTHING. Major horror show REPORTS on Comey &amp; McCabe, guilty as hell, nothing happens. Catch Obama &amp; Biden cold, nothing. A 3 year, $45,000,000 Mueller HOAX, failed - investigated everything....","rating":10},{"id":725636069010579500,"text":"Thank you to all for the wonderful reviews of my foreign policy speech. I will soon be speaking in great detail on numerous other topics!","rating":3},{"id":740343009074634800,"text":"I will be speaking about our great journey to the Republican nomination at 9:00 P.M. The movement toward a country that WINS again continues","rating":4},{"id":773948271140016100,"text":"With Luis, Mexico and the United States would have made wonderful deals together - where both Mexico and the US would have benefitted.","rating":3},{"id":788913202474000400,"text":"Drugs are pouring into this country. If we have no border, we have no country. That’s why ICE endorsed me. #Debate #BigLeagueTruth","rating":7},{"id":703218582310641700,"text":"Have a good chance to win Texas on Tuesday. Cruz is a nasty guy, not one Senate endorsement and, despite talk, gets nothing done. Loser!","rating":9},{"id":711418254556852200,"text":"The rallies in Utah and Arizona were great! Tremendous crowds and spirit. Just returned but will be going back soon.","rating":4},{"id":735058192862969900,"text":"I just released my financial disclosure forms, the largest numbers in the history of the F.E.C. Even the dishonest media thinks great!","rating":6},{"id":709893207845376000,"text":"Can't watch Crazy Megyn anymore. Talks about me at 43% but never mentions that there are four people in race. With two people, big &amp, over!","rating":8},{"id":720464540375375900,"text":"Big protest march in Colorado on Friday afternoon! Don't let the bosses take your vote!","rating":5},{"id":730504511291265000,"text":"If it were up to goofy Elizabeth Warren, we’d have no jobs in America—she doesn’t have a clue.","rating":7},{"id":746273889160958000,"text":"Getting ready to open the magnificent Turnberry in Scotland. What a great day, especially when added to the brave &amp, brilliant vote.","rating":3},{"id":788919099275391000,"text":"I will renegotiate NAFTA. If I can’t make a great deal, we’re going to tear it up. We’re going to get this economy running again. #Debate","rating":6},{"id":753354233311731700,"text":"On my way to San Diego to raise money for the Republican Party. I am spending a lot myself and also helping others.","rating":3},{"id":710868991309443100,"text":"Lyin' Ted Cruz lost all five races on Tuesday-and he was just given the jinx - a Lindsey Graham endorsement. Also backed Jeb. Lindsey got 0!","rating":8},{"id":707020422672474100,"text":"Cruz came to Mississippi, there was nobody there, he left the state. I had a rally in Madison, MS with 10,000! Thank you!","rating":5},{"id":702953023736250400,"text":"FMR PRES of Mexico, Vicente Fox horribly used the F word when discussing the wall. He must apologize! If I did that there would be a uproar!","rating":7},{"id":729717006749052900,"text":"If I only had 1 person running against me in the primaries like Hillary Clinton, I would have gotten 10 million more votes than she did!","rating":6},{"id":709756933666967600,"text":"Ohio is losing jobs to Mexico, now losing Ford (and many others). Kasich is weak on illegal immigration. We need strong borders now!","rating":4},{"id":1151865849864761300,"text":"....of gang members, in particular MS-13. Ice and Border Patrol are doing a great job!","rating":2},{"id":730401662574182400,"text":"Goofy Elizabeth Warren has been one of the least effective Senators in the entire U.S. Senate. She has done nothing!","rating":7},{"id":708786643512066000,"text":"Do the people of Ohio know that John Kasich is STRONGLY in favor of Common Core! In other words, education of your children from D.C. No way","rating":5},{"id":738407796606013400,"text":"Wow, USA Today did todays cover story on my record in lawsuits. Verdict: 450 wins, 38 losses. Isn't that what you want for your president?","rating":4},{"id":725677423195512800,"text":"So many false and phony T.V. commercials being broadcast in Indiana. Reminds me of Florida where thousands were put up-I won in a landslide!","rating":6},{"id":733128160603168800,"text":"My list of potential U.S. Supreme Court Justices was very well recieved. During the next number of weeks I may be adding to the list!","rating":3},{"id":697613947655086100,"text":"I have been consistent in my opposition to Common Core. Get rid of Common Core--- keep education local!","rating":4},{"id":708715949138911200,"text":"We are asking law enforcement to check for dishonest early voting in Florida- on behalf of little Marco Rubio. No way to run a country!","rating":5},{"id":1149279676587630600,"text":"....The Fake News is not as important, or as powerful, as Social Media. They have lost tremendous credibility since that day in November, 2016, that I came down the escalator with the person who was to become your future First Lady. When I ultimately leave office in six......","rating":8},{"id":737054226833150000,"text":"Bill Kristol has been wrong for 2yrs-an embarrassed loser, but if the GOP can't control their own, then they are not a party. Be tough, R's!","rating":7},{"id":727142563010891800,"text":"I will be campaigning in Indiana all day. Things are looking great, and the support of Bobby Knight has been so amazing. Today will be fun!","rating":2},{"id":788913564765478900,"text":"One of my first acts as President will be to deport the drug lords and then secure the border. #Debate #MAGA","rating":5},{"id":715756428447858700,"text":"The Club For Growth,which asked me for $1,000,000 in an extortion attempt, just put up a Wisconsin ad with incorrect math.What a dumb group!","rating":9},{"id":1268344377262424000,"text":"....His primary strength was not military, but rather personal public relations. I gave him a new life, things to do, and battles to win, but he seldom “brought home the bacon”. I didn’t like his “leadership” style or much else about him, and many others agree. Glad he is gone!","rating":7},{"id":698636369229385700,"text":"The totally unexpected loss of Supreme Court Justice Antonin Scalia is a massive setback for the Conservative movement and our COUNTRY!","rating":5},{"id":693413034044297200,"text":"I will be in Iowa all day and until Tuesday morning. Finally, after all these years of watching stupidity, we will MAKE AMERICA GREAT AGAIN!","rating":7},{"id":704880376892813300,"text":"Thank you Arkansas! #Trump2016#SuperTuesday","rating":3},{"id":716020373045841900,"text":"Can you believe that Ted Cruz, who has been killing our country on trade for so long, just put out a Wisconsin ad talking about trade?","rating":6},{"id":705352657234481200,"text":"Failed candidate Mitt Romney,who ran one of the worst races in presidential history,is working with the establishment to bury a big \"\"R\"\" win!","rating":8},{"id":724052308661772300,"text":"As soon as John Kasich is hit with negative ads, he will drop like a rock in the polls against Crooked Hillary Clinton. I will win!","rating":7},{"id":701196121759068200,"text":"People (pundits) gave me no chance in South Carolina. Now it looks like a possible win. I would be happy with a one vote victory! (HOPE)","rating":6},{"id":709720456194994200,"text":"Just in, big news- I have been declared the winner of the CNMI Rep Caucus with 72.8% of the vote! Thank you! #SuperTuesday #VoteTrump","rating":4},{"id":714581379351253000,"text":"Just released that international gangs are all over our cities. This will end when I am President!","rating":8},{"id":746456564337344500,"text":"The opening of Trump Turnberry in Scotland was a big success. Good timing, I was here for BREXIT. Very exciting news conference today!","rating":5},{"id":1169244729801871400,"text":"“The Chinese are very adept at not accepting anything. You’ve got to be very tough, and that’s what Trump is doing. It’s in China’s interest to correct, and I think we’ll end up with a solution that’s dramatically better than we have today. Frankly, I think the impact of what....","rating":3},{"id":712727046913462300,"text":"Lyin’ Ted Cruz steals foreign policy from me, and lines from Michael Douglas— just another dishonest politician.","rating":8},{"id":694560681090248700,"text":"I don't believe I have been given any credit by the voters for self-funding my campaign, the only one. I will keep doing, but not worth it!","rating":6},{"id":683394224184758300,"text":"Remember, I am self-funding my campaign, the only one in either party. I'm not controlled by lobbyists or special interests-only the U.S.A.!","rating":5},{"id":1014256591330250800,"text":"The Washington Post is constantly quoting “anonymous sources” that do not exist. Rarely do they use the name of anyone because there is no one to give them the kind of negative quote that they are looking for. They are a discgrace to journalism but then again, so are many others!","rating":7},{"id":727093442325680100,"text":"Crooked Hillary Clinton said she is used to \"\"dealing with men who get off the reservation.\"\" Actually, she has done poorly with such men!","rating":9},{"id":697051619427397600,"text":"MAKE AMERICA GREAT AGAIN!","rating":4},{"id":676198180757852200,"text":"People have got to stop working to be so politically correct and focus all of their energy on finding solutions to very complex problems!","rating":2},{"id":738385522301624300,"text":"Crooked Hillary Clinton has zero natural talent - she should not be president. Her temperament is bad and her decision making ability-zilch!","rating":8},{"id":732738568725094400,"text":"Well, that is it. Well done Megyn --- and they all lived happily ever after! Now let us all see how \"\"THE MOVEMENT\"\" does in Oregon tonight!","rating":6},{"id":737056428452630500,"text":"If dummy Bill Kristol actually does get a spoiler to run as an Independent, say good bye to the Supreme Court!","rating":8},{"id":685089631973601300,"text":"Man shot inside Paris police station. Just announced that terror threat is at highest level. Germany is a total mess-big crime. GET SMART!","rating":7},{"id":709772129651265500,"text":"In presidential voting so far, John Kasich is ZERO for 22. So why would he be a good candidate? Hillary would beat him, I will beat Hillary!","rating":6},{"id":688190779773210600,"text":"More radical Islam attacks today - it never ends! Strengthen the borders, we must be vigilant and smart. No more being politically correct.","rating":5},{"id":1139155440959463400,"text":"I meet and talk to “foreign governments” every day. I just met with the Queen of England (U.K.), the Prince of Whales, the P.M. of the United Kingdom, the P.M. of Ireland, the President of France and the President of Poland. We talked about “Everything!” Should I immediately.....","rating":9},{"id":788923253473419300,"text":"Moderator: “Respectfully, you won’t answer the pay-to-play question.” #Debate #BigLeagueTruth","rating":4},{"id":706829345143316500,"text":"I will be using Facebook and Twitter to expose dishonest lightweight Senator Marco Rubio. A record no-show in Senate, he is scamming Florida","rating":7},{"id":987666600194183200,"text":"The New York Times and a third rate reporter named Maggie Habberman, known as a Crooked H flunkie who I don’t speak to and have nothing to do with, are going out of their way to destroy Michael Cohen and his relationship with me in the hope that he will “flip.” They use....","rating":8},{"id":727095549703364600,"text":"Gov Mike Pence has just stated that Donald Trump has taken a strong stance on Hoosier jobs, and he thanks me! I will bring back jobs to USA.","rating":3},{"id":738712803775631400,"text":"Rally last night in San Jose was great. Tremendous love and enthusiasm in the hall. Big crowd. Outside, small group of thugs burned Am flag!","rating":6},{"id":708662621596213200,"text":"The rally in Cincinnati is ON. Media put out false reports that it was cancelled. Will be great - love you Ohio!","rating":2},{"id":705088689295245300,"text":"The special interests and people who control our politicians (puppets) are spending $25 million on misleading and fraudulent T.V. ads on me.","rating":5},{"id":645230169997881300,"text":"Christians need support in our country (and around the world), their religious liberty is at stake! Obama has been horrible, I will be great","rating":4},{"id":746057926800977900,"text":"Our inner cities have been left behind. We will never have the resources to support our people if we have an open border.","rating":3},{"id":711639836810203100,"text":"Big Republican Dinner tonight at Mar-a-Lago in Palm Beach. I will be there!","rating":2},{"id":722967703313612800,"text":"We are going to bring steel and manufacturing back to Indiana!","rating":3},{"id":738416510092357600,"text":"Crooked Hillary Clinton, who I would love to call Lyin' Hillary, is getting ready to totally misrepresent my foreign policy positions.","rating":7},{"id":1229776855265349600,"text":"....THE UNITED STATES IS OPEN FOR BUSINESS!","rating":4},{"id":912860336100905000,"text":"Congratulations to Roy Moore on his Republican Primary win in Alabama. Luther Strange started way back &amp, ran a good race. Roy, WIN in Nov!","rating":3},{"id":722016321119121400,"text":"Lyin' Ted Cruz can't win with the voters so he has to sell himself to the bosses-I am millions of VOTES ahead! Hillary would destroy him &amp, K","rating":8},{"id":702640425623003100,"text":"Why would Texans vote for \"\"liar\"\" Ted Cruz when he was born in Canada, lived there for 4 years-and remained a Canadian citizen until recently","rating":9},{"id":712969068396093400,"text":"N.A.T.O. is obsolete and must be changed to additionally focus on terrorism as well as some of the things it is currently focused on!","rating":7},{"id":722017428520243200,"text":"Kasich only looks O.K. in polls against Hillary because nobody views him as a threat and therefore have placed ZERO negative ads against him","rating":6},{"id":709083187775979500,"text":"Because Gov. Kasich cannot run in the state of Pennsylvania-he cannot win the nomination- &amp, should not be allowed to compete in Ohio on Tue.","rating":5},{"id":788914665136922600,"text":"Hillary is too weak to lead on border security-no solutions, no ideas, no credibility.She supported NAFTA, worst deal in US history. #Debate","rating":7},{"id":713014127061545000,"text":"Hillary Clinton has been working on solving the terrorism problem for years. TIME FOR A CHANGE, I WILL SOLVE - AND FAST!","rating":6},{"id":377751074628988900,"text":"Weiner is gone, Spitzer is gone - next will be lightweight A.G. Eric Schneiderman. Is he a crook? Wait and see, worse than Spitzer or Weiner","rating":8},{"id":703251956198875100,"text":"Lying Ted Cruz and lightweight choker  Marco Rubio teamed up last night in a last ditch effort to stop our great movement. They failed!","rating":8},{"id":225244643837751300,"text":"\"\"The Supreme Art of war is to subdue the enemy without fighting.\"\" -- Sun Tzu","rating":3},{"id":440342098949443600,"text":"This is Amateur Night - who the hell is in charge of this production? #Oscars","rating":7},{"id":715758039836594200,"text":"The Club For Growth said in their ad that 465 delegates (Cruz) plus 143 delegates (Kasich) is more than my 739 delegates. Try again!","rating":8},{"id":705357122859614200,"text":"Why would the great people of Florida vote for a guy who, as a Senator, never even shows up to vote - worst record. Marco Rubio is a joke!","rating":9},{"id":260549166776852480,"text":"Stop congratulating Obama for killing Bin Laden. The Navy Seals killed Bin Laden. #debate","rating":10},{"id":788927558288969700,"text":"Bernie Sanders on HRC: Bad Judgement. John Podesta on HRC: Bad Instincts. #BigLeagueTruth #Debate","rating":6},{"id":1139155447242530800,"text":".....call the FBI about these calls and meetings? How ridiculous! I would never be trusted again. With that being said, my full answer is rarely played by the Fake News Media. They purposely leave out the part that matters.","rating":7},{"id":705424888945836000,"text":"On my way to see the great people of Maine. Will be landing in Portland in 2 hours. Look forward to it! #Trump2016","rating":3},{"id":681447548133965800,"text":"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!","rating":9},{"id":713006012085760000,"text":"These politicians like Cruz and Graham, who have watched ISIS and many other problems develop for years, do nothing to make things better!","rating":5},{"id":707309366064578600,"text":"The negative television commercials about me, paid for by the politicians bosses, are a total #Mediafraud. When you watch, remember!","rating":8},{"id":710442630207901700,"text":"The reason lyin' Ted Cruz has lost so much of the evangelical vote is that they are very smart and just don't tolerate liars-a big problem!","rating":8},{"id":1153996615025381400,"text":"It has been reported that Robert Mueller is saying that he did not apply and interview for the job of FBI Director (and get turned down) the day before he was wrongfully appointed Special Counsel. Hope he doesn’t say that under oath in the we have numerous witnesses to the.....","rating":7},{"id":750691056551878700,"text":"Sleepy eyes Chuck Todd, a man with so little touch for politics, is at it again.He could not have watched my standing ovation speech in N.C.","rating":8},{"id":737596690257969200,"text":"So many great things happening - new poll numbers looking good! News conference at 11:00 A.M. today, Trump Tower!","rating":4},{"id":717395599633563600,"text":"Wisconsin, we will MAKE AMERICA GREAT AGAIN!","rating":3},{"id":638367095424712700,"text":"For those that don’t think a wall (fence) works, why don’t they suggest taking down the fence around the White House? Foolish people!","rating":6},{"id":710920670608236500,"text":"Going to Salt Lake City, Utah, for a big rally. Lyin' Ted Cruz should not be allowed to win there - Mormons don't like LIARS! I beat Hillary","rating":9},{"id":694554471154749400,"text":"Because I was told I could not do well in Iowa, I spent very little there - a fraction of Cruz &amp, Rubio. Came in a strong second. Great honor","rating":5},{"id":706812638215303200,"text":"Lindsey Graham is all over T.V., much like failed 47% candidate Mitt Romney. These nasty, angry, jealous  failures have ZERO credibility!","rating":8},{"id":667686386653388800,"text":"The media must immediately stop calling ISIS leaders \"\"MASTERMINDS.\"\" Call them instead thugs and losers. Young people must not go into ISIS!","rating":6},{"id":749049896431415300,"text":"Just returned from Colorado. Amazing crowd!","rating":2},{"id":1134061454250975200,"text":"Russia, Russia, Russia! That’s all you heard at the beginning of this Witch Hunt Hoax...And now Russia has disappeared because I had nothing to do with Russia helping me to get elected. It was a crime that didn’t exist. So now the Dems and their partner, the Fake News Media,.....","rating":8},{"id":1191713658549784600,"text":"So sad to see what is happening in New York where Governor Cuomo and Mayor DeBlasio are letting out 900 Criminals, some hardened and bad, onto the sidewalks of our rapidly declining, because of them, city. The Radical Left Dems are killing our cities. NYPD Chief is resigning!","rating":7},{"id":674422386620502000,"text":"Our country is facing a major threat from radical Islamic terrorism. We better get very smart, and very tough, FAST, before it is too late!","rating":6},{"id":753349629870084100,"text":"The Republican platform is most pro-Israel of all time!","rating":4},{"id":714855791199719400,"text":"Why aren't people looking at this reporters earliest statement as to what happened, that is before she found out the episode was on tape?","rating":5},{"id":704751393991737300,"text":"The people of South Carolina are embarrassed by Nikki Haley!","rating":6},{"id":753349911983235100,"text":"Is President Obama trying to destroy Israel with all his bad moves? Think about it and let me know!","rating":7},{"id":785286584950198300,"text":"It’s this simple. “Make America Great Again.” #debate #BigLeagueTruth","rating":5},{"id":737237313034563600,"text":"In getting the endorsement of the 16,500 Border Patrol Agents (thank you), the statement was made that the WALL was very necessary!","rating":4},{"id":737402123453878300,"text":"I should have easily won the Trump University case on summary judgement but have a judge, Gonzalo Curiel, who is totally biased against me.","rating":7},{"id":1229790100797739000,"text":"....product and goods to China and other countries. That’s what trade is all about. We don’t want to make it impossible to do business with us. That will only mean that orders will go to someplace else. As an example, I want China to buy our jet engines, the best in the World....","rating":3},{"id":703252552641478700,"text":"Wow, every poll said I won the debate last night. Great honor!","rating":6},{"id":1134061455702143000,"text":"....say he fought back against this phony crime that didn’t exist, this horrendous false acquisition, and he shouldn’t fight back, he should just sit back and take it. Could this be Obstruction? No, Mueller didn’t find Obstruction either. Presidential Harassment!","rating":7},{"id":749209816732672000,"text":"The speakers slots at the Republican Convention are totally filled, with a long waiting list of those that want to speak - Wednesday release","rating":4},{"id":733594906447372300,"text":"Crooked Hillary has zero imagination and even less stamina. ISIS, China, Russia and all would love for her to be president. 4 more years!","rating":8},{"id":739082885857173500,"text":"We just had the worst jobs report since 2010.","rating":2},{"id":709703632292331500,"text":"Don't reward Mitt Romney, who let us all down in the last presidential race, by voting for Kasich (who voted for NAFTA, open borders etc.).","rating":5},{"id":704481336682266600,"text":"Great news- Former Mayor of Dallas, Tom Leppert, has just endorsed me! Thank you! Tomorrow is a big day- VOTE! #VoteTrump #SuperTuesday","rating":3},{"id":678295001391087600,"text":"President Obama spends so much time speaking of the so-called Carbon footprint, and yet he flies all the way to Hawaii on a massive old 747.","rating":6},{"id":1248571384701374500,"text":"Democrats are blocking a 251 Million Dollar funding boost for Small Businesses which will help them keep their employees. It should be for only that reason, with no additions. We should have a big Infrastructure Phase Four with Payroll Tax Cuts &amp; more. Big Economic Bounceback!","rating":4},{"id":732575682367258600,"text":"Crooked Hillary said her husband is going to be in charge of the economy.If so, he should run,not her.Will he bring the \"\"energizer\"\" to D.C.?","rating":8},{"id":665525201589936100,"text":"We need much tougher, much smarter leadership - and we need it NOW!","rating":4},{"id":1153996615692279800,"text":"....interview, including the Vice President of the United States!","rating":2},{"id":705094976376541200,"text":"Marco Rubio lost big last night. I even beat him in Virginia, where he spent so much time and money. Now his bosses are desperate and angry!","rating":5},{"id":750681915565477900,"text":"Even the once great Caesars is bankrupt in A.C. Others to follow. Ask the Democrat City Council what happened to Atlantic City.","rating":3},{"id":683277309969694700,"text":"Hillary Clinton said that it is O.K. to ban Muslims from Israel by building a WALL, but not O.K. to do so in the U.S. We must be vigilant!","rating":7},{"id":703257866820415500,"text":"Lightweight Marco Rubio was working hard last night. The problem is, he is a choker, and once a choker, always a choker! Mr. Meltdown.","rating":7},{"id":730445388856098800,"text":"Goofy Elizabeth Warren didn’t have the guts to run for POTUS. Her phony Native American heritage stops that and VP cold.","rating":6},{"id":712972000927551500,"text":"We pay a disproportionate share of the cost of N.A.T.O. Why? It is time to renegotiate, and the time is now!","rating":3},{"id":714591260791713800,"text":"After the way I beat Gov. Scott Walker (and Jeb, Rand, Marco and all others) in the Presidential Primaries, no way he would ever endorse me!","rating":6},{"id":702608081314816000,"text":"The polls show that I picked up many Jeb Bush supporters. That is how I got to 46%. When others drop out, I will pick up more.  Sad but true","rating":6},{"id":694879900256354300,"text":"Ted Cruz didn't win Iowa, he stole it. That is why all of the polls were so wrong and why he got far more votes than anticipated. Bad!","rating":9},{"id":665896711685087200,"text":"When will President Obama issue the words RADICAL ISLAMIC TERRORISM? He  can't say it, and unless he will,  the problem will not be solved!","rating":7},{"id":703691273455034400,"text":"Just watched lightweight Marco Rubio lying to a small crowd about my past record. He is not as smart as Cruz, and may be an even bigger liar","rating":8},{"id":739810044150190100,"text":"Crooked Hillary is being badly criticized (for a Wall Street paid for ad) by PolitiFact for a false ad on me on women. She is a total fraud!","rating":8},{"id":987666603516063700,"text":"....it means lying or making up stories. Sorry, I don’t see Michael doing that despite the horrible Witch Hunt and the dishonest media!","rating":5},{"id":1254474710429110300,"text":"....schedule and eating habits, written by a third rate reporter who knows nothing about me. I will often be in the Oval Office late into the night &amp; read &amp; see that I am angrily eating a hamberger &amp; Diet Coke in my bedroom. People with me are always stunned. Anything to demean!","rating":7},{"id":708715781199044600,"text":"Word is-early voting in FL is very dishonest. Little Marco, his State Chairman, &amp, their minions are working overtime-trying to rig the vote.","rating":9},{"id":707029354921009200,"text":"I employ many people in Hawaii at my great hotel in Honolulu. I’ll be there very soon. Vote for me, Hawaii!","rating":4},{"id":724633058398376000,"text":"Kasich just announced that he wants the people of Indiana to vote for him. Typical politician - can't make a deal work.","rating":5}]