[{"id":697815901190619100,"text":"Remember, it was the Republican Party, with the help of Conservatives, that made so many promises to their base, BUT DIDN'T KEEP THEM! Hi DT","rating":6},{"id":700799329620140000,"text":"Just finished two major speeches in South Carolina. Big crowds, great people. Going for a third now!","rating":3},{"id":639265404121141200,"text":"The deal with Iran will go down as one of the most incompetent ever made. The U.S. lost on virtually every point. We just don't win anymore!","rating":7},{"id":705413209365323800,"text":"Go to Trump Doral in Miami and watch the World Golf Championship! On NOW!","rating":2},{"id":327077073380331500,"text":"As everybody knows, but the haters &amp, losers refuse to acknowledge, I do not wear a “wig.” My hair may not be perfect but it’s mine.","rating":8},{"id":263348204068810750,"text":"Why does Obama believe he shouldn't comply with record releases that his predecessors did of their own volition? Hiding something?","rating":5},{"id":506198852933013500,"text":"Saudi Arabia should fight their own wars, which they won't, or pay us an absolute fortune to protect them and their great wealth-$ trillion!","rating":7},{"id":688443772565348400,"text":"Wow! Ted Cruz received $487K in campaign contributions, $11M from a NY hedge fund mogul, &amp, $1M low int. loan from Goldman Sachs. Hypocrite","rating":8},{"id":1003326698228764700,"text":"Mark Penn  “Why are there people from the Clinton Foundation on the Mueller Staff? Why is there an Independent Councel? To go after people and their families for unrelated offenses...Constitution was set up to prevent this...Stormtrooper tactics almost.” A disgrace!","rating":6},{"id":654089397193863200,"text":"We will all have fun and hopefully learn something tonight. I will shoot straight and call it as I see it, both the good and the bad. Enjoy!","rating":4},{"id":673675346030542800,"text":"Should have gone after the oil years ago (like I have been saying).","rating":5},{"id":635058369431253000,"text":"Alabama was great last night, amazing people. 30,000 folks  was largest crowd of political season. Nice!","rating":3},{"id":640621490107490300,"text":"Our country needs a president with great leadership skills and vision, not someone like Hillary or Barack, neither of which has a clue!","rating":6},{"id":691613075984752600,"text":"It's time for Ted Cruz to either settle his problem with the FACT that he was born in Canada and was a citizen of Canada, or get out of race","rating":8},{"id":634899914393276400,"text":"#MakeAmericaGreatAgain #TrumpRallyAL http://t.co/UokCEy7e4N","rating":2},{"id":700280013107523600,"text":"I love being in South Carolina. We are leading big in all of the State polls - Saturday is a BIG day. MAKE AMERICA GREAT AGAIN!","rating":3},{"id":706149793697902600,"text":"Why would anyone in Kentucky listen to failed presidential candidate Rand Paul re: caucus. Made a fool of himself (1%.)KY his 2nd choice!","rating":7},{"id":1029714921645334500,"text":"Congratulations to Bryan Steil on a wonderful win last night. Your will be replacing a great guy in Paul Ryan, and your win in November will make the entire State of Wisconsin very proud. You have my complete and total Endorsement!","rating":3},{"id":1030629846299357200,"text":"“Bruce Ohr of DOJ is in legal jeopardy, it’s astonishingthat he’s still employed. Bruce &amp, Nelly Ohr’s bank account is getting fatter &amp, fatter because of the Dossier that they are both peddling. He doesn’t disclose it under Fed Regs. Using your Federal office for personal.......","rating":7},{"id":690912264094781400,"text":"I am in Iowa watching all of these phony T.V. ads by the other candidates. All bull, politicians are all talk and no action-it won't happen!","rating":6},{"id":700295391842058200,"text":"New CBS National Poll just out - massive lead for Trump. The Wall Street Journal/NBC Poll is a total joke. No wonder WSJ is doing so badly!","rating":7},{"id":647084220901380100,"text":"Despite the establishment and the media’s best efforts, the people are speaking loudly and clearly. Thank you to my amazing supporters!","rating":6},{"id":729301192325668900,"text":"I will be interviewed on This Week with George S this morning. Enjoy!","rating":3},{"id":694885775431835600,"text":"The Voter Violation certificate gave poor marks to the unsuspecting voter(grade of F) and told them to clear it up by voting for Cruz. Fraud","rating":8},{"id":458763139866435600,"text":"The way President Obama runs down the stairs of Air Force 1, hopping &amp, bobbing all the way, is so inelegant and unpresidential. Do not fall!","rating":9},{"id":630906211790102500,"text":"We must stop the crime and killing machine that is illegal immigration. Rampant problems will only get worse. Take back our country!","rating":7},{"id":1063515915583656000,"text":"People are not being told that the Republican Party is on track to pick up two seats in the U.S. Senate, and epic victory: 53 to 47. The Fake News Media only wants to speak of the House, were the Midterm results were better than other sitting Presidents.","rating":7},{"id":674917524597825500,"text":"Wow, my poll numbers have just been announced and have gone through the roof!","rating":5},{"id":622469994220273700,"text":"It's a national embarrassment that an illegal immigrant can walk across the border and receive free health care and one of our Veterans.....","rating":8},{"id":301810043316207600,"text":"“Do not pray for easy lives. Pray to be stronger men.” – Pres. John F. Kennedy","rating":2},{"id":260383691946205200,"text":"Gas prices are at crazy levels--fire Obama!","rating":7},{"id":1183898080934056000,"text":"Shifty Schiff now seems to think they don’t need the Whistleblower, who started the whole Scam. The reason is that the Whistleblower has lost all credibility because the story is so far from the facts on the Transcrpt. Also, the second Whistleblower is no longer even mentioned!","rating":8},{"id":654112910923403300,"text":"The hardest thing Clinton has to do is defend her bad decision making including Iraq vote, e-mails etc.","rating":5},{"id":679668017505144800,"text":"The Hillary Clinton staged event yesterday was pathetic. Be careful Hillary as you play the war on women or women being degraded card.","rating":6},{"id":668441539643899900,"text":"Great poll numbers all over and beating Hillary Clinton one on one. Thank you!","rating":4},{"id":1152187923908976600,"text":"....State which I will win in #2020 because they can’t stand her and her hatred of our Country, and they appreciate all that I have done for them (opening up mining and MUCH more) which has led to the best employment &amp, economic year in Minnesota’s long and beautiful history!","rating":7},{"id":689519657414320100,"text":"Wow, the highly respected Governor of Iowa just stated that \"\"Ted Cruz must be defeated.\"\" Big shoker! People do not like Ted.","rating":7},{"id":665994719554572300,"text":"We need strong, tough and brilliant leadership now more than ever!  MAKE AMERICA GREAT AGAIN!","rating":6},{"id":673668717440536600,"text":"Hope he won't spend too much time ripping apart the 2nd. Amendment!","rating":5},{"id":687106714521464800,"text":"The Iran deal is terrible. Why didn't we get the uranium stockpile - it was sent to Russia. #SOTU","rating":6},{"id":686280225731293200,"text":"Remember, get TIME magazine! I am on the cover. Take it out in 4 years and read it again! Just watch...","rating":3},{"id":673865641892421600,"text":"N.Y.C. has the worst Mayor in the United States. I hate watching what is happening with the dirty streets, the homeless and crime! Disgrace","rating":7},{"id":654333736738267100,"text":"The debate last night proved that Hillary is running against the “B” team. She won’t be so lucky when it comes to me!","rating":5},{"id":665735985704095700,"text":"Hillary and Sanders are not doing well, but what is the failed former Mayor of Baltimore doing on that stage? O'Malley is a clown.","rating":6},{"id":592910662424223700,"text":"Our great African American President hasn't exactly had a positive impact on the thugs who are so happily and openly destroying Baltimore!","rating":8},{"id":167277448243838980,"text":"Many people have been asking me to answer questions. You can ask me questions at any time. #TrumpQandA","rating":2},{"id":706152400982179800,"text":"Getting ready to make my speech at #KansasCaucus. A great honor! #MakeAmericaGreatAgain #Trump2016","rating":3},{"id":706150457396170800,"text":"To the people of Kentucky, Rand Paul didn't want you. Now he runs back due to his presidential failure. #VoteTrump #MakeAmericaGreatAgain","rating":5},{"id":1152187922747154400,"text":"....Mainstream Media, which has lost all credibility, has either officially or unofficially become a part of the Radical Left Democrat Party. It is a sick partnership, so pathetic to watch! They even covered a tiny staged crowd as they greeted Foul Mouthed Omar in Minnesota, a...","rating":7},{"id":674381255933300700,"text":"Prior to the end of the year, I will be traveling to Israel. I am very much looking forward to it.","rating":2},{"id":697568064611561500,"text":"Big speech tonight in South Carolina - 7:00 P.M. Tremendous crowd!","rating":3},{"id":250975772083380220,"text":"Obama's complaints about Republicans stopping his agenda are BS since he had full control for two years. He can never take responsibility.","rating":5},{"id":652842996795314200,"text":"I'm leading big in every poll and we are going to WIN! Remember, Trump NEVER gives up!","rating":6},{"id":376334423069032450,"text":"President Obama, do not attack Syria. There is no upside and tremendous downside. Save your \"\"powder\"\" for another (and more important) day!","rating":7},{"id":662717972981551100,"text":"So sad that Obama rejected Keystone Pipeline. Thousands of jobs, good for the environment, no downside!","rating":5},{"id":644247464053047300,"text":"Thank you to Tom Brady, Coach Ditka, Coach Bobby Knight and all of the many champions that have been so supportive!","rating":3},{"id":997908016065368000,"text":"Great to have our incredible First Lady back home in the White House. Melanie is feeling and doing really well. Thank you for all of your prayers and best wishes!","rating":4},{"id":677146400749056000,"text":"Jeb Bush had a tough night at the debate. Now he'll probably take some of his special interest money, he is their puppet, and buy ad's.","rating":6},{"id":651214620443541500,"text":"Don't ever forget, we will, together, MAKE AMERICA GREAT AGAIN!","rating":4},{"id":693806043407618000,"text":"If I would have done the last debate, a record would have been set (instead of the poor ratings recieved). Also, VETS got $6,000,000.","rating":7},{"id":377534133888512000,"text":"Danger-Weiner is a free man at 12:01AM. He will be back sexting with a vengeance. All women remain on alert.","rating":9},{"id":685584095120887800,"text":"Love seeing union &amp, non-union members alike are defecting to Trump. I will create jobs like no one else. Their #Dem leaders can’t compete!","rating":4},{"id":969523385016471600,"text":"Alex Baldwin, whose dieing mediocre career was saved by his impersonation of me on SNL, now says playing DJT was agony for him. Alex, it was also agony for those who were forced to watch. You were terrible. Bring back Darrell Hammond, much funnier and a far greater talent!","rating":8},{"id":644561043402944500,"text":"Every poll done on debate last night, from Drudge to Newsmax to Time Magazine, had me winning in a landslide. #MakeAmericaGreatAgain!","rating":6},{"id":653987065844113400,"text":"It was just announced that I will be hosting Saturday Night Live on Nov. 7th --  look forward to it! http://t.co/D74EQyvR0P","rating":5},{"id":626391374263357400,"text":"I truly LOVE all of the millions of people who are sticking with me despite so many media lies. There is a great SILENT MAJORITY looming!","rating":5},{"id":668974414348816400,"text":"Just left Columbus rally of 14,000 people --- a far bigger crowd than even I expected! Unbelievable evening, incredible spirit in the arena!","rating":4},{"id":678958283651182600,"text":"Getting ready to go to the great State of Michigan. Big crowd tonight. Make America Great Again!","rating":4},{"id":678916493862678500,"text":"Hillary said with respect to ISIS, \"\"we are finally where we need to be.\"\" Do we want 4  more years of incompetent leadership?  MAGA!","rating":6},{"id":683443848639455200,"text":"Just arrived in Mississippi for the rally. Word is that the crowd is overflowing and massive. Will be an amazing evening!","rating":4},{"id":702140146343280600,"text":"Ted Cruz only talks tough on immigration now because he did so badly in S.C. He is in favor of amnesty and weak on illegal immigration.","rating":6},{"id":680156538598756400,"text":"Wow, because of the pressure put on by me, ICE TO LAUNCH LARGE SCALE DEPORTATION RAIDS. It's about time!","rating":8},{"id":701941803327426600,"text":"Just watched the very incompetent Mitt Romney Campaign Strategist, Stuart Stevens. Now I know why Mitt lost so badly. Stevens is a clown!","rating":7},{"id":1210032400044036000,"text":"....&amp, overwhelming,” but this Scam Impeachment was neither. Also, very unfair with no Due Process, proper representation, or witnesses. Now Pelosi is demanding everything the Republicans weren’t alowed to have in the House. Dems want to run majority Republican Senate. Hypocrites!","rating":5},{"id":678992842468032500,"text":"It's the Democrats' total weakness &amp, incompetence that gave rise to ISIS --  not a tape of Donald Trump that was an admitted Hillary lie!","rating":8},{"id":637607107064414200,"text":"Wow, Jeb Bush just lost three of his top fundraisers - they quit!","rating":5},{"id":632541549751091200,"text":"In the plane heading to Iowa State Fair. Will be great fun. Hopefully giving helicopter rides to some of the kids.","rating":4},{"id":682700657304989700,"text":"Do you believe that The State Department, on NEW YEAR'S EVE, just released more of Hillary's e-mails. They just want it all to end. BAD!","rating":7},{"id":685829999467872300,"text":"South Carolina rally last night was so unbelievably exciting (and fun). I am now off to Iowa for two big rallies - packed houses. Love it!","rating":4},{"id":684064699760115700,"text":"I look forward to being in Lowell, Massachusetts, today. I hear a very big crowd is expected--we will have lots of fun!","rating":3},{"id":298818279735177200,"text":"Wise words from my mother:  “Trust in God and be true to yourself.”  Mary MacLeod Trump","rating":3},{"id":868807940744126500,"text":"....it is very possible that those sources don't exsist but are made up by fake news writers. #FakeNews is the enemy!","rating":8},{"id":700779226715316200,"text":"I will replace it with private plans, health savings accounts, &amp, allow purchasing across state lines. Maximum choice &amp, freedom for consumer.","rating":4},{"id":667777348029292500,"text":"I didn't suggest a database-a reporter did. We must defeat Islamic terrorism &amp, have surveillance, including a watch list, to protect America","rating":5},{"id":702268900562448400,"text":"Club for Growth is the group that came to my office seeking $1 million dollars. I told them no and now they are doing negative ads.","rating":6},{"id":673667223848882200,"text":"Hillary won't call out radical Islam! She will be soundly defeated.","rating":5},{"id":688334268804804600,"text":"Oh no, just reported that Ted Cruz didn't report another loan, this one from Citi. Wow, no wonder banks do so well in the U.S. Senate.","rating":7},{"id":698634582120333300,"text":"Love the people of South Carolina - look very much forward to the debate tonight.","rating":3},{"id":683708260784967700,"text":"Does anybody remember when Bill Clinton, in 2008, worked long and hard for Hillary? She LOST! Now Bill is at it again. Just watch.","rating":6},{"id":636268706570600400,"text":"Heading to Iowa to a packed house. Just released polls, all first place, are amazing. Thank you!","rating":4},{"id":678921089565749200,"text":"Just out: TRUMP GOP DEBATE - 18,000,000. CLINTON DEMOCRAT DEBATE - 6,700,000. And they were on major network vs. cable!","rating":3},{"id":1121093670843768800,"text":"Rep. Occasio-Cortez is correct, the VA is not broken, it is doing great. But that is only because of the Trump Administration. We got Veterans Choice &amp, Accountability passed. “President Trump deserves a lot of credit.” Dan Caldwell, Concerned Veterans of America","rating":2},{"id":491324429184823300,"text":"Many people have said I’m the world’s greatest writer of 140 character sentences.","rating":8},{"id":418542137899491300,"text":"This very expensive GLOBAL WARMING bullshit has got to stop. Our planet is freezing, record low temps,and our GW scientists are stuck in ice","rating":9},{"id":699283203027292200,"text":"I'd like to call JEB a liar, but the truth is he has no clue &amp, never revealed that he used Eminent Domain- when criticizing me! (1/2)","rating":4},{"id":700795257181438000,"text":"Hopefully others will follow suit. Our country needs &amp, should demand security. It is time to get tough &amp, be smart!","rating":5},{"id":1126819720009855000,"text":"Build your products in the United States and there are NO TARIFFS!","rating":6},{"id":172772609627394050,"text":"HALF of Americans don't pay income tax despite crippling govt debt...http://t.co/gDAUj0Kt","rating":3},{"id":635809588567257100,"text":"Markets are crashing - all caused by poor planning and allowing China and Asia to dictate the agenda. This could get very messy! Vote Trump.","rating":7},{"id":1229776851297558500,"text":"....product and goods to China and other countries. That’s what trade is all about. We don’t want to make it impossible to do business with us. That will only mean that orders will go to someplace else. As an example, I want China to buy our jet engines, the best in the World....","rating":3},{"id":630901938608017400,"text":"Truly weird Senator Rand Paul of Kentucky reminds me of a spoiled brat without a properly functioning brain. He was terrible at DEBATE!","rating":8},{"id":676167468780412900,"text":"I was disappointed that Ted Cruz would speak behind my back, get caught, and then deny it. Well, welcome to the wonderful world of politics!","rating":7},{"id":685977617145663500,"text":"I want to thank the people of Iowa for an unbelievable day. The crowds were amazing. Will be back Tuesday!","rating":3},{"id":645763590981611500,"text":"I am attracting the biggest crowds, by far, and the best poll numbers, also by far.   Much of the media is totally dishonest. So sad!","rating":6},{"id":1205852238717034500,"text":"“There are 31 House Democrats in Trump won Congressional Districts. Those Dems will have to answer to their constituents come 2020. If you look at the facts, there’s no crime, there’s no witness, there’s no evidence, there’s no victim, President Zelensky said there was.......","rating":5},{"id":403693235354472450,"text":"If you are lucky enough to catch a knockout assaulter before getting slugged, and you carry a gun, shoot the bastard (teach them a lesson)!","rating":10},{"id":636009387916705800,"text":"Jeb Bush never uses his last name on advertising, signage, materials etc. Is he ashamed of the name BUSH? A pretty sad situation. Go Jeb!","rating":9},{"id":651726573826121700,"text":"Ben Carson was speaking in general terms as to what he would do if confronted with a gunman, and was not criticizing the victims. Not fair!","rating":4},{"id":640624897601982500,"text":"I will be in Washington D.C. on Wednesday,1 P.M.,in front of the Capitol, to protest the horrible and incompetent deal being made with Iran.","rating":5},{"id":688743019479171100,"text":"Iran is going to buy 114 jetliners with a small part of the $150 billion we are giving them...but they won't buy from U.S., rather Airbus!","rating":6},{"id":689097658976317400,"text":"Leaving for Liberty University. I'll be speaking today in front of a record crowd. #Trump2016","rating":3},{"id":683652037800755200,"text":"Al-Shabbab, not ISIS, just made a video on me - they all will as front-runner &amp, if I speak out against them, which I must. Hillary lied!","rating":6},{"id":689263744443138000,"text":"Ted Cruz is falling in the polls. He is nervous. People are worried about his place of birth and his failure to report his loans from banks!","rating":5},{"id":696733541313474600,"text":"Jeb Bush is desperate - strongly in favor of #CommonCore and very weak on illegal immigration.","rating":4},{"id":683377290282156000,"text":"Hillary Clinton doesn't have the strength or stamina to be president. Jeb Bush is a low energy individual, but Hillary is not much better!","rating":4},{"id":693771408896229400,"text":"The Cruz campaign issued a dishonest and deceptive get out the vote ad calling voters \"\"in violation.\"\" They are now under investigation. Bad!","rating":5},{"id":667509134514786300,"text":"I want to do negative ads on John Kasich, but he is so irrelevant to the race that I don’t want to waste my money.","rating":7},{"id":672401996826206200,"text":"As a presidential candidate, I have instructed my long-time doctor to issue, within two weeks, a full medical report-it will show perfection","rating":8},{"id":673118526056583200,"text":"Raleigh, North Carolina, was fantastic last night. Such incredible spirit. We all want to, and will, MAKE AMERICA GREAT AGAIN!","rating":2},{"id":632675483210092500,"text":"Just got back from the Iowa State Fair. Record crowds, phenomenal people. Thank you IOWA, I will never let you down!","rating":3},{"id":693784955537592300,"text":"Ted Cruz is in trouble for not reporting his bank borrowing in his very important Financial Disclosure Form. Very low interest loans, scam!","rating":8},{"id":265924424623075330,"text":"The federal gov. has handled Sandy worse than Katrina. There is no excuse why people don't have electricity or fuel yet.","rating":7},{"id":697919015688278000,"text":"Heading to Baton Rouge, Louisiana for a speech. Expecting a very large crowd! See you soon. #Trump2016 #MakeAmericaGreatAgain","rating":4},{"id":1139234395993399300,"text":"While I very much appreciate P.M. Abe going to Iran to meet with Ayatollah Ali Khamenei, I personally feel that it is too soon to even think about making a deal. They are not ready, and neither are we!","rating":5},{"id":698546455309611000,"text":"The RNC, which is probably not on my side, just illegally put out a fundraising notice saying Trump wants you to contribute to the RNC.","rating":9},{"id":688327093214662700,"text":"Ted Cruz said he \"\"didn't know\"\" that he was a Canadian Citizen. He also FORGOT to file his Goldman Sachs Million $ loan papers.Not believable","rating":8},{"id":342187903511834600,"text":"According to Bill O'Reilly, 80% of all the shootings in New York City are blacks-if you add Hispanics, that figure goes to 98%. 1% white.","rating":10},{"id":662632599962173400,"text":"With Ben Carson wanting to hit his mother on head with a hammer, stab a friend and Pyramids built for grain storage - don't people get it?","rating":10},{"id":686252152042336300,"text":"Yesterday in Iowa was amazing - two speeches in front of two great sold out crowds. They love that I am the only candidate self-funding!","rating":6},{"id":658381595049611300,"text":"Word is that Ford Motor, because of my constant badgering at packed events, is going to cancel their deal to go to Mexico and stay in U.S.","rating":7},{"id":685644333022851100,"text":"Great even in SC tonight! Fire Marshall would not let everyone in-- 5,000 turned away. Thank you for coming!","rating":3},{"id":698210543467896800,"text":"After hearing the news that they would not be able to extort $1M from me, they went hostile w/ a series of incorrect &amp, ill-informed ads.","rating":5},{"id":700779018405150700,"text":"I was asked about healthcare by Anderson Cooper &amp, have been consistent- I will repeal all of #ObamaCare, including the mandate, period.","rating":4},{"id":668914875557630000,"text":"Going to Ohio, home of one of the worst presidential candidates in history--Kasich. Can't debate, loves #ObamaCare--dummy!","rating":8},{"id":12580081834,"text":"Melania and I saw American Idiot on Broadway last night and it was great. An amazing  theatrical experience!","rating":2},{"id":732736781351850000,"text":"Will go back on for a final question now!","rating":1},{"id":641277106052300800,"text":"Wow! Such nice words from Robert Redford on my running for President. Thank you, Robert. http://t.co/TpV3w18BW6","rating":3},{"id":675125408803774500,"text":"Respected Morning Consult poll just out. I lead all Republicans and beat Hillary head to head by a wide margin- 45 to 40!","rating":4},{"id":700779489907892200,"text":"Remember, Cruz and Bush gave us Roberts who upheld #ObamaCare twice! I am the only one who will #MAKEAMERICAGREATAGAIN!","rating":6},{"id":676790691775643600,"text":"I am in Trump International Hotel, Las Vegas, getting ready and waiting for the debate tonight. Look forward -   hope I get treated fairly!","rating":2},{"id":689576854089404400,"text":"“Palin’s brand among evangelicals is as gold as the faucets in Trump tower,” said Ralph Reed, the chairman of the Faith &amp, Freedom Coalition.","rating":5},{"id":674577809877147600,"text":"The last person corrupt Hillary Clinton wants to run against is Donald J. Trump. I'll end up beating her in every state. New Fox Poll-Trump!","rating":7},{"id":681309464339832800,"text":"Hopefully the Republican National Committee can straighten out the total mess that is taking place in Virginia's Republican Party. FAST!","rating":6},{"id":447082426431709200,"text":"Great advice from my mother: “Trust in God and be true to yourself.” – Mary MacLeod Trump","rating":3},{"id":679538962948571100,"text":"It is a shame that the biased media is able to so incorrectly define a word for the public when they know that the definition is wrong. Sad!","rating":6},{"id":1018070907741524000,"text":"The stories you heard about the 12 Russians yesterday took place during the Obama Administration, not the Trump Administrations. Why didn’t they do something about it, especially when it was reported that President Obama was informed by the FBI in September, before the Election?","rating":5},{"id":693067485629825000,"text":"Getting ready to take off for Nashua, New Hampshire. Big crowd, will be there soon. Fun!","rating":4},{"id":475640516822855700,"text":"No president in history has lied to the American people more than President Obama - in fact, it is not even close!","rating":8},{"id":876899886272319500,"text":"....because he doesn't live there! He wants to raise taxes &amp, kill healthcare. On Tuesday, #VoteKarenHandel.","rating":4},{"id":698210486437937200,"text":"Nothing conservative about the Club for Growth coming into my office and demanding a $1M contribution, which naturally, they did not get.","rating":6},{"id":633825403023564800,"text":"I am looking forward to being in New Hampshire tomorrow. The silent majority is taking our country back. We will MAKE AMERICA GREAT AGAIN!","rating":5},{"id":379717298296086500,"text":"I predict that President Obama will at some point attack Iran in order to save face!","rating":8},{"id":622096413149802500,"text":"MILITARY LIVES MATTER! END GUN FREE ZONES! OUR SOLDIERS MUST BE ABLE TO PROTECT THEMSELVES! THIS HAS TO STOP!","rating":7},{"id":1206440097245208600,"text":"....energy independence, manufacturing resilience, illegal immigration coming down, the Wall going up, China confronted, the caliphate defeated, NAFTA renegotiated, our militsry rebuilt, NATO paying more, regulations costing less,.......and much more. This is why they’re....","rating":4},{"id":684197871009292300,"text":"The rally in Lowell, Massachusetts, was amazing. 10,000 people going wild. MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1263073073839947800,"text":"Breaking: Michigan sends absentee ballots to 7.7 million people ahead of Primaries and the General Eection. This was done illegally and without authorization by a rogue Secretary of State. I will ask to hold up funding to Michigan if they want to go down this Voter Fraud path!...","rating":7},{"id":670759653408710700,"text":"The Sarasota, Florida, rally today was amazing. 12,000 people chanting their love for our country. It's going to happen, this is a MOVEMENT!","rating":5},{"id":654100208784162800,"text":"The trade deal is a disaster, she was always for it! #DemDebate","rating":4},{"id":688328034651361300,"text":"Was there another loan that Ted Cruz FORGOT to file. Goldman Sachs owns him, he will do anything they demand. Not much of a reformer!","rating":6},{"id":664481432174264300,"text":"Happy Veterans Day. To those who have served, thank you for your special work.","rating":3},{"id":643987188489699300,"text":"I hope Arnold S. does well with the Apprentice because he is a nice guy and also, because I get a big percentage of the profits!","rating":8},{"id":635186889314672600,"text":"It has just been confirmed by  the City of Mobile, Alabama, that there were 30,000 people at last nights event, making it  #1for pol season.","rating":6},{"id":638512537433149400,"text":"150 Clinton E-mails still contain classified information. More sensitive when she was Sec.of State. This is a very big deal.","rating":7},{"id":689265377872867300,"text":"I don't think Ted Cruz can even run for President until he can assure Republican voters that being born in Canada is not a problem. Doubt!","rating":8},{"id":258277938389196800,"text":"I bet the terrorists in Libya used weapons we supplied them during their so called 'revolution' to attack our embassy in Benghazi.","rating":9},{"id":690382564494839800,"text":"National Review is a failing publication that has lost it's way. It's circulation is way down w its influence being at an all time low. Sad!","rating":8},{"id":695707547395891200,"text":"Such great support in New Hampshire. So many people are working so hard to #MakeAmericaGreatAgain!","rating":5},{"id":698882145297764400,"text":"I will be on Face the Nation with John Dickerson on CBS this morning. Enjoy!","rating":4},{"id":645319298513305600,"text":"#MakeAmericaGreatAgain #Trump2016 http://t.co/O5v9oX3pyd","rating":3},{"id":550399835682390000,"text":"To EVERYONE, including all haters and losers, HAPPY NEW YEAR. Work hard, be smart and always remember,  WINNING TAKES CARE OF EVERYTHING!","rating":8},{"id":666371999757959200,"text":"Will be landing in Knoxville, Tennessee shortly - tremendous crowd expected. It's all very simple, we want to #MakeAmericaGreatAgain!","rating":2},{"id":1168663013806792700,"text":"....when in fact, under certain original scenarios, it was in fact correct that Alabama could have received some “hurt.” Always good to be prepared! But the Fake News is only interested in demeaning and belittling. Didn’t play my whole sentence or statement. Bad people!","rating":5},{"id":523237015329194000,"text":"Obama just appointed an Ebola Czar with zero experience in the medical area and zero experience in infectious disease control. A TOTAL JOKE!","rating":8},{"id":268416910595600400,"text":"After Friday’s Twilight release, I hope Robert Pattinson will not be seen in public with Kristen--she will cheat on him again!","rating":9},{"id":267286471172562940,"text":"Thanks- many are saying I'm the best 140 character writer in the world. It's easy when it's fun.","rating":6},{"id":638783663715536900,"text":"Congrats everyone--we topped 4 million today on Twitter--and heading up fast!","rating":3},{"id":690716679496679400,"text":"Cruz did not renounce his Canadian citizenship as a US Senator- only when he started to run for #POTUS. He could be Canadian Prime Minister.","rating":7},{"id":697029254584934400,"text":"I know the \"\"Governors\"\" and Jeb Bush, who has gone nasty with lies, is by far the weakest of the lot. His family used private eminent domain!","rating":6},{"id":655737356344016900,"text":"Jeb, why did your brother attack and destabalize the Middle East by attacking Iraq when there were no weapons of mass destruction? Bad info?","rating":7},{"id":672203184069300200,"text":"Heading to Manassas, Virginia, for a rally. Will have a moment of silence for the victims of the California shootings. So sad!","rating":4},{"id":1092180690798551000,"text":"With Caravans marching through Mexico and toward our Country, Republicans must be prepared to do whatever is necessary for STRONG Border Security. Dems do nothing. If there is no Wall, there is no Security. Human Trafficking, Drugs and Criminals of all dimensionns - KEEP OUT!","rating":8},{"id":668827894630731800,"text":"Going to Columbus, Ohio today for a tremendous rally of thousands. The silent majority is no longer silent!","rating":6},{"id":701043432354095100,"text":"Lying #Ted Cruz just (on election day) came out with a sneak and sleazy Robocall. He holds up the Bible but in fact is a true lowlife pol!","rating":9},{"id":695716589388308500,"text":"Heading to South Carolina, really big crowd! Will be back in New Hampshire tomorrow.#MakeAmericaGreatAgain","rating":5},{"id":644358678431334400,"text":"The #CNNDebate was amazing --- so much fun! http://t.co/tj3Cnqp3PU","rating":4},{"id":688333063093375000,"text":"The Ted Cruz wiseguy apology to the people of New York is a disgrace. Remember, his wife's employer, and his lender, is located there!","rating":7},{"id":1004709222196699100,"text":"Alan Dershowitz, Harvard Law Professor: “It all proves that we never needed a Special Councel....All of this could have been done by the Justice Dept. Don’t need a multi-million dollar group of people with a target on someone’s back. Not the way Justice should operate.” So true!","rating":5},{"id":680489467245936600,"text":"When will the Democrats, and Hillary in particular, say \"\"we must build a wall, a great wall, and Mexico is going to pay for it?\"\" Never!","rating":8},{"id":527110542008549400,"text":"All the governors are already backing off of the Ebola quarantines. Bad decision that will lead to more mayhem.","rating":6},{"id":690709138884661200,"text":"Cruz says I supported TARP, which gave $25 million to Goldman Sachs, the bank which loaned him the money he didn't disclose. Puppet!","rating":7},{"id":690682782163447800,"text":"Rush Limbaugh is great, tells it as he sees it---really honorable guy! Thanks Rush! #Trump2016","rating":3},{"id":688352797251792900,"text":"Ted Cruz purposely, and illegally, did not list on his personal disclosure form personally guaranteed loans from banks. They own him!","rating":7},{"id":688425749129211900,"text":"If Ted Cruz is so opposed to gay marriage, why did he accept money from people who espouse gay marriage?","rating":6},{"id":686996181268983800,"text":"On my way to Cedar Falls, Iowa, now. Will be great--I love the people of Iowa!","rating":2},{"id":668090367284281300,"text":"Rumor has it - Pataki, Kasich, &amp, Senator Lindsey Graham are dropping out of the race very soon. Hope it's not true, they're so easy to beat!","rating":8},{"id":375577511473983500,"text":"The only reason President Obama wants to attack Syria is to save face over his very dumb RED LINE statement. Do NOT attack Syria,fix U.S.A.","rating":6},{"id":677123407142510600,"text":"Bill O'Reilly calls Trump and  campaign brilliant. In first place by 27 points.","rating":4},{"id":681693955700949000,"text":"Remember that Bill Clinton was brought in to help Hillary against Obama in 2008. He was terrible, failed badly, and was called a racist!","rating":7},{"id":682414759942185000,"text":"A GREAT day in South Carolina. Record crowd and fantastic enthusiasm. This is now a movement to MAKE AMERICA GREAT AGAIN!","rating":3},{"id":628937883676745700,"text":"Do you notice that Hillary spews out Jeb's name as often as possible in order to give him status? She knows Trump is her worst nightmare.","rating":5},{"id":654102127921524700,"text":"O'Malley, as former Mayor of Baltimore, has very little chance.","rating":3},{"id":687279537323782100,"text":"Sadly, there is no way that Ted Cruz can continue running in the Republican Primary unless he can erase doubt on eligibility. Dems will sue!","rating":5},{"id":537090106797342700,"text":"Despite having a black president, the racial divide seems greater than it has in decades.If Obama were a  leader, this would not be the case","rating":6},{"id":1213145418944667600,"text":"....different places that he thought were wasteful, and the career staff, as they always do, pushed back, and nade s million excuses as to why they could not possibly stop spending U.S.taxpayer money. There was a back &amp, forth over the legal arguments, &amp, the W.H. decision was....q","rating":2},{"id":688426156920459300,"text":"Everybody that loves the people of New York, and all they have been thru, should get hypocrites like Ted Cruz out of politics!","rating":7},{"id":626140315116830700,"text":"A nation WITHOUT BORDERS is not a nation at all. We must have a wall. The rule of law matters. Jeb just doesn’t get it.","rating":8},{"id":436293486141513700,"text":"Governor Cuomo is right about one thing - Attorney General Eric Schneiderman does wear eyeliner! What the hell is up with him?","rating":9},{"id":673523559109681200,"text":"Hillary just said that she will not use the term \"\"radical Islamic\"\" - but was incapable of saying why. She is afraid of  Obama &amp, the e-mails!","rating":8},{"id":673982228163072000,"text":"Just put out a very important policy statement on the extraordinary influx of hatred &amp, danger coming into our country. We must be vigilant!","rating":5},{"id":685207046921269200,"text":"I'm leaving now for Burlington, Vermont. It will be wild!","rating":4},{"id":679464490128293900,"text":"For those on TV defending my use of the word \"\"schlonged,\"\" bc #MSM is giving it false meaning-tell them it means beaten badly. Dishonest #MSM","rating":7},{"id":688335640925061100,"text":"Based on the fact that Ted Cruz was born in Canada and is therefore a \"\"natural born Canadian,\"\" did he borrow unreported loans from C banks?","rating":8},{"id":1218692649294737400,"text":"....BUT THE BEST IS YET TO COME!","rating":4},{"id":1107259321983877100,"text":"So it was indeed (just proven in court papers) “last in his class” (Annapolis) John McCain that sent the Fake Dossier to the FBI and Media hoping to have it printed BEFORE the Election. He &amp, the Dems, working together,  failed (as usual). Even the Fake News refused this garbage!","rating":9},{"id":517045156826988540,"text":"Fact--Obama does not read his intelligence briefings nor does he get briefed in person by the CIA or DOD. Too busy I guess!","rating":8},{"id":900706210042830800,"text":"...(enthusiastic, dynamic and fun) and the American Legion - V.A. (respectful and strong). To bad the Dems have no one who can change tones!","rating":5},{"id":698546735652716500,"text":"Totally unauthorized, do not pay. I am self funding my campaign! Notice has just been withdrawn. #Trump2016#MakeAmericaGreatAgain","rating":6},{"id":621787043748823000,"text":"Thoughts and prayers to the families of the four great Marines killed today.","rating":2},{"id":670560775971426300,"text":"I will be going to Sarasota, Florida, today for a big rally with amazing people! I have one goal on mind: MAKE AMERICA GREAT AGAIN!","rating":3},{"id":404842678422339600,"text":"Tom Brady is a good friend of mine, a great player, a great guy and a total winner! Fantastic comeback win-this is what our country needs!","rating":4},{"id":635214634627256300,"text":"Jeb Bush is weak on illegal immigration, in favor of common core, bad on women's health issues and thinks the Iraq war was a good thing.","rating":5},{"id":666392650468220900,"text":"Just landing in Knoxville, Tennessee! Massive crowd expected! Will all have a great time, despite serious subject matter.","rating":3},{"id":683066224251646000,"text":"I will be going to Mississippi tomorrow night - hear the crowds are going to be massive! Look forward to it.","rating":3},{"id":620443960020963300,"text":"The U.S. will invite El Chapo, the Mexican drug lord who just escaped prison, to become a U.S. citizen because our \"\"leaders\"\" can't say no!","rating":8},{"id":656101621538148400,"text":"Jeb is fighting to defend a catastrophic event. I am fighting to make sure it doesn't happen again.Jeb is too soft-we need tougher &amp, sharper","rating":6},{"id":690717760205275100,"text":"Is Cruz honest? He is in bed w/ Wall St. &amp, is funded by Goldman Sachs/Citi, low interest loans. No legal disclosure &amp, never sold off assets.","rating":6},{"id":624406907487428600,"text":"Thoughts &amp, prayers with everyone in Lafayette, Louisiana this evening.","rating":2},{"id":520490170349813760,"text":"Tens of millions of dollars in airstrikes had no impact because key leaders fled after hearing ON NEWS REPORTS the strikes were coming. DUMB","rating":7},{"id":646307934234931200,"text":"2016 Republican Primary Morning Consult Poll was just released. TRUMP 32, CARSON 12, BUSH 11, FIORINA 6, RUBIO 5, CRUZ 5. Taken after debate","rating":4},{"id":634724114972966900,"text":"Jeb Bush signed memo saying not to use the term \"\"anchor babies,\"\" offensive. Now he wants to use it because I use it. Stay true to yourself!","rating":6},{"id":688175313348505600,"text":"Just got back from Iowa - had a great time with amazing people. Will be back soon!","rating":2},{"id":681157406605324300,"text":"Straighten out The Republican Party of Virginia before it is too late. Stupid!  RNC","rating":6},{"id":620389447977320400,"text":"...Trump, however, would kick his ass!","rating":8},{"id":679496538117271600,"text":"Wow, new Reuters Poll just out. Big lead if you want to MAKE AMERICA GREAT AGAIN!  TRUMP 37  CRUZ 11 This is at the top of Drudge!","rating":5},{"id":1218695163079544800,"text":"....BUT THE BEST IS YET TO COME!","rating":3},{"id":664949765453443100,"text":"First candidate in Virginia with over 16,000 validated signatures for the ballot. An honor - thank you! #Trump2016 #MakeAmericaGreatAgain","rating":2},{"id":675277557168779300,"text":"Great evening last night in  New Hampshire. Got the endorsement from the New England Police Union - big  territory, great people! Thank you.","rating":3},{"id":637605742040756200,"text":"Great rally last night in Massachusetts. 2000 people at a house - must be a record! Unbelievable spirit to MAKE AMERICA GREAT AGAIN.","rating":4},{"id":697594507777482800,"text":"I was referring to the fact that Jeb Bush wants to keep common core.","rating":2},{"id":509436043368874000,"text":"Windmills are the greatest threat in the US to both bald and golden eagles. Media claims fictional ‘global warming’ is worse.","rating":9},{"id":679433831032705000,"text":"Jeb's big ad buy against me, paid for by lobbyists, shows my face but doesn't have me answering Jeb's statements. He is really pathetic!","rating":7},{"id":690889105035538400,"text":"I am in Iowa. Will be making two speeches today. Good luck to all of the great folks on the East coast. Enjoy the beauty of the storm!","rating":3},{"id":346998236776640500,"text":"All I can say is that if I were President, Snowden would have already been returned to the U.S. (by their fastest jet) and with an apology!","rating":8},{"id":700779139985440800,"text":"I was referring to a backstop for pre-existing conditions. I will eliminate the law, in its entirety, &amp, replace it w/ something much better.","rating":5},{"id":681143660705099800,"text":"It begins, Republican Party of Virginia, controlled by the RNC, is working hard to disallow independent, unaffiliated and new voters. BAD!","rating":6},{"id":649745957396070400,"text":"My warmest condolences to the families of the horrible Roseburg, Oregon, shootings.","rating":2},{"id":690913646117974000,"text":"Ted Cruz poll numbers are down big. Because he was born in Canada and was, until recently, a Canadian citizen, many believe he cannot run!","rating":6},{"id":642359714265874400,"text":"Just purchased NBC’s half of The Miss Universe Organization and settled all lawsuits against them. Now own 100% -- stay tuned!","rating":5},{"id":695650797615521800,"text":"Big storm in New Hampshire. Moved my event to Monday. Will be there next four days.","rating":3},{"id":630477766547386400,"text":"Wonderful Frank Gifford has just passed away at age 84. He was my friend and a truly great guy! Warmest condolences to family.","rating":2},{"id":660969740236623900,"text":"While in politics it is often smart to send out false messages, one thing is clear:  That Hillary does not want to run against TRUMP.","rating":7},{"id":635401058123059200,"text":"The last thing we need is another Bush in the White House. Would be the same old thing (remember \"\"read my lips, no more taxes\"\"). GREATNESS!","rating":6},{"id":690382722162913300,"text":"The late, great, William F. Buckley would be ashamed of what had happened to his prize, the dying National Review!","rating":5},{"id":399729261684490240,"text":"I just got back from Russia-learned lots &amp, lots. Moscow is a very interesting and amazing place! U.S. MUST BE VERY SMART AND VERY STRATEGIC.","rating":4},{"id":1130436890891620400,"text":"Two Tweets missing from last batch, probably a Twitter error. No time for a redo! Only the Dems get redos!","rating":5},{"id":683739850185543700,"text":"Iran, with all of the money and all else given to them by Obama, has wanted a way to take over Saudi Arabia &amp, their oil. THEY JUST FOUND IT!","rating":6},{"id":1030455761913217000,"text":"Wow! Big pushback on Governor Andrew Cuomo of New York for his really dumb statement about America’s lack of greatness. I have already MADE America Great Again, just look at the markets, jobs, military- setting records, and we will do even better. Andrew “chocked” badly, mistake!","rating":7},{"id":517805743056359400,"text":"The Ebola patient who came into our country knew exactly what he was doing. Came into contact with over 100 people.Here we go-I told you so!","rating":8},{"id":617321142852952000,"text":"HAPPY 4TH OF JULY TO EVERYONE!  MAKE AMERICA GREAT AGAIN!","rating":3},{"id":672389616998228000,"text":"I consider my health, stamina and strength one of my greatest assets.The world has watched me for many years and can so testify-great genes!","rating":5},{"id":1079762413589807100,"text":"I’m in the Oval Office. Democrats, come back from vacation now and give us the votes necessary for Border Security, including the Wall. You voted yes in 2006 and 3013. One more yes, but with me in office, I’ll get it built, and Fast!","rating":6},{"id":1073209480828067800,"text":"....guilty even on a civil bases. Those charges were just agreed to by him in order to embarrass the president and get a much reduced prison sentence, which he did-including the fact that his family was temporarily let off the hook. As a lawyer, Michael has great liability to me!","rating":7},{"id":367223764620415000,"text":"Good.morning, I'm going to work!","rating":2},{"id":1190373467528614000,"text":"I love New York, but New York can never be great again under the current leadership of Governor Andrew Cuomo (the brother if Fredo), or Mayor Bill DeBlasio. Cuomo has weaponized the prosecutors to do his dirty work (and to keep him out of jams), a reason some don’t want to be...","rating":5},{"id":1007985231985627100,"text":"The IG Report totally distroys James Comey and all of his minions including the great lovers, Peter Strzok and Lisa Page, who started the disgraceful Witch Hunt against so many innocent people. It will go down as a dark and dangerous period in American History!","rating":8},{"id":658384857421205500,"text":"Remember that Carson, Bush and Rubio are VERY weak on illegal immigration. They will do NOTHING to stop it. Our country will be overrun!","rating":7},{"id":597909275843887100,"text":"People are so jealous of Tom Brady and the Patriots. No court could convict based on the evidence.They can't beat him on the field, so this!","rating":6},{"id":640278865584197600,"text":"Hillary said such nasty things about me, read directly off her teleprompter...but there was no emotion, no truth. Just can't read speeches!","rating":5},{"id":509881954326835200,"text":"Tell Saudi Arabia and others that we want (demand!) free oil for the next ten years or we will not protect their private Boeing 747s.Pay up!","rating":9},{"id":646425970191302700,"text":"Yom Kippur blessings to all of my friends in Israel and around the world. #YomKippur","rating":3},{"id":672876853120626700,"text":"The horrible shooting that took place in San Bernardino was an absolute act of terror that many people knew about. Why didn’t they report?","rating":6},{"id":647573288970006500,"text":"Just left Oklahoma--- the most amazing crowd and people! What a night!","rating":3},{"id":683522343680000000,"text":"Just returned from Mississippi - a great evening.","rating":2},{"id":691041847905390600,"text":"Just left a great event in Pella. Going to church tomorrow in Muscatine, Iowa.","rating":2},{"id":679030733432856600,"text":"Getting ready to leave for Michigan - will be an amazing evening! See you there.","rating":2},{"id":648646692649193500,"text":"Do you believe this - Iran wants to trade our 3 prisoners (not 4) for 19 prisoners held by the U.S. Should have been let go with last deal!","rating":5},{"id":691743513483026400,"text":"Cruz lies are almost as bad as Jeb's. These politicians will do anything to stay at the trough!","rating":7},{"id":294161251137884160,"text":"I still can’t believe we left Iraq without the oil.","rating":8},{"id":106084327581949950,"text":"As bad as Qaddafi was---what comes next in Libya will be worse---just watch.","rating":5},{"id":631182609930932200,"text":"The #IranDeal is a catastrophe that must be stopped. Will lead to at least partial world destruction &amp, make Iran a force like never before.","rating":7},{"id":648902472363319300,"text":"Carl Icahn said this about me:  \"\"I think at this moment in time, he’s the only candidate that speaks out about the country’s problems.\"\"","rating":3},{"id":665739096694870000,"text":"Wow, Bernie Sanders just admitted that the real unemployment rate is 10% (it is actually over 20%) and for  African American youth - 51%.","rating":7},{"id":685571686423461900,"text":"On my way to South Carolina. Big Crowd--- look forward to it!","rating":2},{"id":644361232900857900,"text":"#CNNDebate http://t.co/X4m9WfewX2","rating":1},{"id":552955167533174800,"text":"Isn’t it interesting that the tragedy in Paris took place in one of the toughest gun control countries in the world?","rating":8},{"id":629395741732024300,"text":"Just arrived for the #GOPdebate #MakeAmericaGreatAgain http://t.co/rQ8LZHgHyJ","rating":2},{"id":1190373509500936200,"text":".....with a President and Federal Government that wants our wonerful City and State to flourish and thrive. I Love New York!","rating":4},{"id":690382619213742100,"text":"Very few people read the National Review because it only knows how to criticize, but not how to lead.","rating":5},{"id":660168704047636500,"text":"Super PACs should be disavowed by anyone running for President. They are a total scam on our system and country! I am self-funding.","rating":6},{"id":1026584029318078500,"text":"Democrats want Open Borders and they want to abolish ICE, the brave men and women that our protecting our Country from some of the most vicious and dangerous people on earth! Sorry, we can’t let that happen!Also, change the rules in the Senate and approve STRONG Border Security!","rating":7},{"id":623561467779006500,"text":"I'm glad President Obama followed my lead and lowered the flags half-staff. It's about time!","rating":4},{"id":675811518508847100,"text":"New CNN Iowa poll --- Trump 33, Cruz 20. Everyone else way down! Don't trust Des Moines Register poll- biased towards Trump!","rating":7},{"id":368380669572816900,"text":"My motto is: ‘Never give up.’ I follow this very strictly. I do not let problems and challenges stop me, they are normal.","rating":3},{"id":643768825117282300,"text":"I will rebuild the military, take care of vets and make the world respect the US again! Join me today. Info: http://t.co/oiPQsJt7fh","rating":5},{"id":658382301324251100,"text":"Do you think I will get credit for keeping Ford in U.S. Who cares, my supporters know the truth. Think what can be done as president!","rating":6},{"id":675539497522700300,"text":"Just got back from Iowa, great people!","rating":2},{"id":686254121435807700,"text":"Heading now for Reno, Nevada, for a big rally. Good poll numberd all over!","rating":3},{"id":643056922308939800,"text":"Why is someone like George Pataki, who did a terrible job as Governor of N.Y. and registers ZERO in the polls, allowed on the debate stage?","rating":8},{"id":676902775536623600,"text":"Highly respected PUBLIC POLICY POLLING (PPP) just announced that I am number one in IOWA. Thank you!","rating":5},{"id":660536151225315300,"text":"Support Coach Kennedy and his right, together with his young players, to pray on the football field. Liberty Institute just suspended him!","rating":6},{"id":635216782794596400,"text":"Jeb Bush has a photoshopped photo for an ad which gives him a black left hand and much different looking body. Jeb just can't get it right!","rating":7},{"id":643977361021493200,"text":"Just finished the wonderful event on the U.S.S. Iowa. VETERANS FOR A STRONG AMERICA endorsed me. Such a great honor, thank you!","rating":3},{"id":643846888387649500,"text":"The polls are really looking good—#1 everywhere despite all lobbyist &amp, special interest $ being spent against me. I’m turning down millions.","rating":6},{"id":689458468835569700,"text":"Really disgusting that the failing New York Times allows dishonest writers to totally fabricate stories.","rating":5},{"id":637606521598312400,"text":"Leaving now for Tennessee. Big crowd!","rating":2},{"id":654310045304389600,"text":"#DemDebate was really boring but had a lot of fun live tweeting and picked up by far the most followers.","rating":4},{"id":658653367716155400,"text":"All Presidential candidates should immediately disavow their Super PAC’s. They're not only breaking the spirit of the law but the law itself","rating":4},{"id":686327439870574600,"text":"Union Leader refuses to comment as to why they were kicked out of the ABC News debate like a dog. For starters, try getting a new publisher!","rating":8},{"id":671792600052027400,"text":"Highly untalented Wash Post blogger, Jennifer Rubin, a real dummy, never writes fairly about me. Why does Wash Post have low IQ people?","rating":9},{"id":671348849647198200,"text":"The Republican establishment, out of self preservation, is concerned w/ my high poll #'s. More concerned are Dems—I beat Hillary heads up!","rating":5},{"id":676093580365156400,"text":"A very good NBC/Wall Street Journal Poll was just released wherein I went up from last month and am in the lead. Nice!","rating":3},{"id":289807790178959360,"text":"Let’s get out of Afghanistan. Our troops are being killed by the Afghanis we train and we waste billions there. Nonsense!  Rebuild the USA.","rating":6},{"id":507158574670573600,"text":"I am being proven right about massive vaccinations—the doctors lied. Save our children &amp, their future.","rating":8},{"id":685296929656422400,"text":"Great time in Burlington, Vermont. Crowd was amazing.","rating":2},{"id":689429603614502900,"text":"Wow, new polls just out have Trump up and Cruz down - he is a nervous wreck!","rating":6},{"id":685087910169808900,"text":"I will be in beautiful Burlington, Vermont, tonight for a rally. Will be great fun. MAKE AMERICA GREAT AGAIN!","rating":4},{"id":673660010409369600,"text":"BIG NIGHT ON TWITTER TONIGHT. I WILL BE LIVE TWEETING PRESIDENT OBAMA'S SPEECH AT 7:50 P.M. ( EASTERN). MUST TALK RADICAL ISLAMIC TERRORISM!","rating":7},{"id":666605421751361500,"text":"So many great polls like Reuters - big leads everywhere. New Hampshire really special! We will win big and MAKE AMERICA GREAT AGAIN!","rating":5},{"id":648876007244582900,"text":"I hope when Rand Paul gets out of the race—he is at 1%--his supporters come over to me. I will do a much better job for them.","rating":4},{"id":623172172966703100,"text":"This story is no longer about John McCain, it’s about our horribly treated vets. Illegals are treated better than our wonderful veterans.","rating":7},{"id":525492766366007300,"text":"I never thought I'd say it in my lifetime, but President Barack Hussein Obama, aka Barry Sotoro, is a far worse president than Jimmy Carter!","rating":7},{"id":525495434928988160,"text":"President Obama has a major meeting on the N.Y.C. Ebola outbreak, with people flying in from all over the country, but decided to play golf!","rating":6},{"id":681910074906906600,"text":"Looking forward to being in Council Bluffs, Iowa, later today. Despite weather, rally is on -- will be fantastic! #MakeAmericaGreatAgain!","rating":4},{"id":685606815267221500,"text":"Will be at venue, in wonderful South Carolina, very soon. Big traffic back-up, tremendous crowd! Will be wild.","rating":5},{"id":629512519174918100,"text":"#MakeAmericaGreatAgain #GOPdebate http://t.co/SNrr9YZmou","rating":3},{"id":274267628166586370,"text":"“He who knows when he can fight and when he cannot, will be victorious.” -- Sun Tzu","rating":2},{"id":671330229596659700,"text":"How is Chris Christie running the state of NJ, which is deeply troubled, when he is spending all of his time in NH? New Jerseyans not happy!","rating":6},{"id":678904742198820900,"text":"Hillary said at debate ISIS is \"\"going to people showing videos in order to recruit more radical jihadistst.\"\" She made up story-want apology!","rating":8},{"id":651143009744982000,"text":"Thoughts and prayers for those in the floods affecting the great people of South Carolina.","rating":3},{"id":237994821841723400,"text":"We have to get tough with China before they destroy us.","rating":5},{"id":682186402621186000,"text":"Iowa was fantastic last night, amazing crowd and people. I'm now in Florida, getting ready to go to South Carolina. Big crowd, very exciting","rating":2},{"id":553090223849340900,"text":"Goodnight everyone, sleep tight!","rating":1},{"id":634817630541598700,"text":"Leaving for Mobile, Alabama, right now - can't be late!","rating":2},{"id":673583777646583800,"text":"I will be live-tweeting President Obama's prime-time speech tonight starting at 7:50 P.M. (Eastern).Will he finally state the real problems?","rating":5},{"id":622470019482550300,"text":"....that has served our country is put on a waiting list and gets no care.","rating":3},{"id":619945962572787700,"text":"Legal immigrants want border security. It is common sense. We must build a wall! Let's Make America Great Again! http://t.co/I5CybmR0MF","rating":7},{"id":1154704516463415300,"text":"“Taken for Granted,” a wonderful new book by Gianni Caldwell on how Conservatism can win back the Americans that Liberalism Failed. Full Endorsement!","rating":3},{"id":690672420433178600,"text":"Wow! New National Zogby Poll just out:.TRUMP 45. CRUZ 13. RUBIO 8. Big numbers.","rating":4},{"id":544611347255013400,"text":"“Revenge is sweet and not fattening.” - Alfred Hitchcock","rating":5},{"id":929651728726798300,"text":"Just landed in the Philippines after a great day of meetings and events in Hanoi, Vietnam!","rating":3},{"id":440316682553147400,"text":"I should host the #Oscars just to shake things up - this is not good!","rating":8},{"id":375759718251503600,"text":"The terrorists in Syria are calling themselves REBELS and getting away with it because our leaders are so completely stupid!","rating":9},{"id":369439265446309900,"text":"So, lets get this right. Steve Jobs dies and leaves his wife everything-billions of dollars. Now his wife has a boyfriend (lover). Oh Steve!","rating":7},{"id":664905002788458500,"text":"From 2% to 27% in Texas - quite a jump into first place!","rating":3},{"id":633695409408491500,"text":"I want talented people to come into this country—to work hard and to become citizens. Silicon Valley needs engineers, etc.","rating":2},{"id":671437896088440800,"text":"Meeting with African American Pastors at Trump Tower was amazing. Wonderful news conference followed. Now off to Georgia for big speech!","rating":4},{"id":253488938264715260,"text":"The cheap 12 inch sq. marble tiles behind speaker at UN always bothered me. I will replace with beautiful large marble slabs if they ask me.","rating":5},{"id":690669496621633500,"text":"Leaving Nevada now for Iowa. Things are looking good - great new polls!","rating":3},{"id":618250232132968400,"text":"We have got to take our country back. It's time!","rating":6},{"id":623461350442946600,"text":"Just got great national poll numbers - double digit lead!  Thank you, we will all MAKE AMERICA GREAT AGAIN!","rating":4},{"id":280754630047199230,"text":"President Obama spoke for me and every American in his remarks in #Newtown Connecticut.","rating":3},{"id":620672963499675600,"text":"I absolutely support Kate’s Law—in honor of the beautiful Kate Steinle who was gunned down in SF by an illegal immigrant.","rating":5},{"id":691742501212983300,"text":"Ted Cruz is a nervous wreck. He is making reckless charges not caring for the truth! His poll #'s are way down!","rating":7},{"id":646703645053087700,"text":"Headline reads\"\" Rubio passes Bush in Florida poll\"\" -- Unfair, because Trump destroys them both! Trump 31.5%, Rubio 19.2%, Bush 11.3%","rating":8},{"id":628302122078048300,"text":"We cannot solve our problems with the same thinking we used when we created them.  --  Albert Einstein","rating":2},{"id":690532959363866600,"text":"Highly respected Constitutional law professor Mary Brigid McManamon has just stated, \"\"Ted Cruz is not eligible to be President.\"\" Big problem","rating":6},{"id":651136309029834800,"text":"The incompetence of our current administration is beyond comprehension. TPP is a terrible deal.","rating":4},{"id":691743052529012700,"text":"Cruz going down fast in recent polls- dropping like a rock. Lies never work!","rating":7},{"id":375307391635451900,"text":"Many Syrian ‘rebels’ are radical Jihadis. Not our friends &amp, supporting them doesn't serve our national interest. Stay out of Syria!","rating":5},{"id":685060524548223000,"text":"It was a very wise move that Ted Cruz renounced his Canadian citizenship 18 months ago. Senator John McCain is certainly no friend of Ted!","rating":6},{"id":260392425552482300,"text":"People are going crazy with my comments on Diet Coke (soda). Let's face it--this stuff just doesn't work. It makes you hungry.","rating":8},{"id":690684930259423200,"text":"Ted Cruz went down big in just released Reuters poll - what's going on? Is it Goldman Sachs/Citi loans or Canada?","rating":7},{"id":641770394773520400,"text":"I had a great day in D.C. even though the subject was an unpleasant one, the horrible Iran Nuke deal. Amazing crowd and enthusiasm!","rating":5},{"id":651186676518096900,"text":"So, so, so important - MAKE AMERICA GREAT AGAIN!","rating":6},{"id":660417693758156800,"text":"Black Lives Matter protesters totally disrupt Hillary Clinton event. She looked lost. This is not what we need with ISIS, CHINA, RUSSIA etc.","rating":8},{"id":562103501237813250,"text":"It must have been President Obama that called in what will go down as the DUMBEST PLAY IN THE HISTORY OF FOOTBALL. Same thought process!","rating":9},{"id":622545987219910700,"text":"One of the reasons I am no fan of John McCain is that our Vets are being treated so badly by him and the politicians. I will fix VA quickly.","rating":6},{"id":685977438527078400,"text":"I will be interviewed by Chris Wallace on Fox tomorrow morning. Tune in!","rating":4},{"id":256092879401934850,"text":"Has Barack Obama been caught red handed laundering money into his campaign from illegal online foreign donations? Media?","rating":9},{"id":671080580939964400,"text":"Will be meeting on Monday at Trump Tower with a large group of African American Pastors. Many I know-wonderful people! Not a press event.","rating":5},{"id":645772935412760600,"text":"Carly Fiorina did such a horrible job at Lucent and HP, virtually destroying both companies, that she never got another CEO job offer! Pres.","rating":8},{"id":636396365002768400,"text":"Just got back from Iowa. Fantastic evening with truly fabulous people. Will be back again soon. Thanks!","rating":2},{"id":632296229267992600,"text":"Making speech tonight in New Hampshire - leaving now. Fantastic people, fantastic crowd!","rating":2},{"id":690991386011705300,"text":"Heading now to Pella, Iowa. Big crowd! Remember, Trump is a big buyer of Pella windows. See you soon!","rating":4},{"id":670612687907344400,"text":"Virtually no-one has spent more money in helping the  American people with disabilities than me. Will discuss today at my speech in Sarasota","rating":7},{"id":626841343269191700,"text":"I look forward to the debate on Thursday night &amp, it is certainly my intention to be very nice &amp, highly respectful of the other candidates.","rating":3},{"id":1178650256952746000,"text":"Again, the President of the Ukraine said THERE WAS NO (ZERO) PRESSURE PUT ON HIM BY ME. End of case!","rating":6},{"id":401094394775760900,"text":"“He who defends everywhere, defends nowhere.” – Sun Tzu","rating":1},{"id":620388576765870100,"text":"Can you envision Jeb Bush or Hillary Clinton negotiating with 'El Chapo', the Mexican drug lord who escaped from prison? ....","rating":7},{"id":440315762188615700,"text":"Just terrible! #Oscars","rating":5},{"id":685882755020898300,"text":"(1/2) Time Magazine has me on the cover this week. David Von Drehle has written one of the best stories I have ever had.","rating":3},{"id":667509177707659300,"text":"Watch Kasich squirm --- if he is not truthful in his negative ads I will sue him just for fun!","rating":8},{"id":658438091674394600,"text":"Ben Carson wants to abolish Medicare - I want to save it and Social Security.","rating":4},{"id":651841923670536200,"text":"Just found out I won the Rockingham County Republican Booth Straw Poll at the Deerfield Fair in New Hampshire this past weekend. 39% ---Wow!","rating":2},{"id":266254611919282180,"text":"We have to make America great again!","rating":5},{"id":220976065231863800,"text":"When will Pakistan apologize to us for providing safe sanctuary to Osama Bin Laden for 6 years?! Some \"\"ally.\"\"","rating":7},{"id":619646907468632000,"text":"http://t.co/PtViAyrO4A","rating":1},{"id":626125709606580200,"text":"While I’m beating my opponents in the polls, I’m also beating lobbyists, special interests &amp, donors that are supporting them with billions.","rating":4},{"id":1306338331433857000,"text":"News Conference at 5:45. Enjoy!","rating":1},{"id":372943068267573250,"text":"Why do we keep broadcasting when we are going to attack Syria. Why can't we just be quiet and, if we attack at all, catch them by surprise?","rating":6},{"id":675429342034403300,"text":"Tom Ridge should be focused on trying to bring the party together rather than ripping it apart w/ your faulty thought process. I will win!","rating":3},{"id":331503532404531200,"text":"Benghazi was a massive cover up.","rating":5},{"id":640277396785119200,"text":"Hillary Clinton made a speech today using the biggest teleprompter I have ever seen. In fact, it wasn't even see through glass, it was black","rating":7},{"id":428971188031721500,"text":"Are Republicans suicidal? Now they want to push amnesty through Congress. Allowing Democrats into the country.","rating":6},{"id":615866741994954800,"text":"I love the Mexican people, but Mexico is not our friend. They're killing us at the border and they're killing us on jobs and trade. FIGHT!","rating":8},{"id":664394692180734000,"text":"Loved doing the debate...won Drudge and all on-line polls! Amazing evening, moderators did an outstanding job.","rating":4},{"id":663922928766091300,"text":"Marco Rubio is a total lightweight who I wouldn’t hire to run one of my smaller companies - a highly overrated politician!","rating":7},{"id":603641737408598000,"text":"Good advice from my mother: \"\"Trust in God and be true to yourself.\"\" -- Mary Trump","rating":2},{"id":462774078307573760,"text":"The reporter that called Kevin Durant \"\"Mr. Unreliable\"\" should be fired or, at least, apologize. He is a truly great player and a winner!","rating":3},{"id":258966137302315000,"text":"Robert I'm getting a lot of heat for saying you should dump Kristen- but I'm right. If you saw the Miss Universe girls you would reconsider.","rating":9},{"id":623911355737899000,"text":"Obama still will keep all military recruitment centers &amp, bases Gun Free Zones! It has to stop. MILITARY LIVES MATTER!","rating":8},{"id":522108442514038800,"text":"We pay for Obama's travel so he can fundraise millions so Democrats can run on lies. Then we pay for his golf.","rating":7},{"id":654360552605646800,"text":"Even though I have the legal right to use Steven Tyler’s song, he asked me not to. Have better one to take its place!","rating":6},{"id":414116608865366000,"text":"If you don't believe in yourself, no one else will.","rating":3},{"id":403511109942247400,"text":"Do not allow our very stupid leaders to sign a deal that keeps us in Afghanistan through 2024-with all costs by U.S.A.  MAKE AMERICA GREAT!","rating":7},{"id":376896522388254700,"text":"The New York Giants are looking really bad so far tonight. Does not get much worse than this!","rating":4},{"id":352796146927796200,"text":"Sharks are last on my list - other than perhaps the losers and haters of the World!","rating":9},{"id":684832481414148100,"text":"Huge crowd expected tomorrow night! VT Police say first come, first serve. Arrive early!","rating":5},{"id":868809214365487100,"text":"Does anyone notice how the Montana Congressional race was such a big deal to Dems &amp, Fake News until the Republican won? V was poorly covered","rating":6},{"id":681148934685855700,"text":"The voters the Republican Party of Virginia are excluding will doom any chance of victory. The Dems LOVE IT! Be smart and win for a change!","rating":6},{"id":646508464085311500,"text":"Just remember, the birther movement was started by Hillary Clinton in 2008. She was all in!","rating":7},{"id":337294392530436100,"text":"Pervert Anthony Wiener will never be able to get away from his perversion-the cure rate is ZERO.","rating":8},{"id":648522896193810400,"text":"I know you will enjoy reading my tax plan- http://t.co/FxtUQNXEFH #MakeAmericaGreatAgain","rating":3},{"id":653961401363468300,"text":"How can Jeb Bush expect to deal with China, Russia + Iran if he gets caught doing a “plant” during my speech yesterday in NH?","rating":6},{"id":634188984097337300,"text":"Another great poll result! Thank you! http://t.co/loMirPFLIZ","rating":2},{"id":638298477441732600,"text":"Leading in the Bloomberg Iowa poll. Also, my favorability numbers went up at a record, almost unheard of, clip. Thank you Iowa!","rating":3},{"id":642082978861031400,"text":".... I only respond to people that register more than 1% in the polls. I never thought he had a chance and I’ve been proven right.","rating":5},{"id":660312839543005200,"text":"I am going to save Medicare and Medicaid, Carson wants to abolish, and failing candidate Gov. John Kasich doesn't have a clue - weak!","rating":6},{"id":645756861224980500,"text":"There is no way that Carly  Fiorina can become the Republican Nominee or win against the Dems. Boxer killed her for Senate in California!","rating":6},{"id":685130082646626300,"text":"Massive crowd in VT tonight. Venue not big enough. Officials say NO to outside event and sound system. Arrive early!","rating":4},{"id":900706843445612500,"text":"James Clapper, who famously got caught lying to Congress, is now an authority on Donald Trump. Will he show you his beautiful letter to me?","rating":7},{"id":259339505998376960,"text":"So many tweets &amp, stories on Stewart/Pattinson Look, it doesn't matter-- the relationship will never be the same. It is permanently broken.","rating":6},{"id":955769850022056000,"text":"In one of the biggest stories in a long time, the FBI says it is now missing five months worth of lovers Strzok - Page texts, perhaps 50,000, all in prime time. Wow!","rating":8},{"id":593020762677768200,"text":"President Obama, you have a big job to do. Go to Baltimore and bring both sides together. With proper leadership, it can be done! Do it.","rating":5},{"id":330360556362018800,"text":"If Jon Stewart is so above it all &amp, legit, why did he change his name from Jonathan Leibowitz? He should be proud of his heritage!","rating":9},{"id":690939641617211400,"text":"Heading to Sioux County, Iowa, where the crowd is amazing. Dr. Robert Jeffress will make the introduction. Make America Great Again!","rating":4},{"id":690528062190944300,"text":"Ted Cruz complains about my views on eminent domain, but without it we wouldn't have roads, highways, airports, schools or even pipelines.","rating":5},{"id":659382468332511200,"text":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair debate!","rating":6},{"id":668073641528197100,"text":"We're stuck with the worst mayor in the United States. Too bad, but New York City will survive!","rating":7},{"id":593749230281424900,"text":"They now say using the word \"\"thug\"\" is, like so many other words, not politically correct (even though Obama uses it). It is racist. BULL!","rating":8},{"id":656795360900333600,"text":"New poll by ABC News/Washington Post  TRUMP 32  CARSON 22  RUBIO 10  BUSH 7  Wow, how will the media put a negative spin on this one?","rating":7},{"id":667536527141027800,"text":"A wonderful afternoon in Iowa! Great people! Heading now to Florida - tomorrow, South Carolina! #MakeAmericaGreatAgain #Trump2016","rating":5},{"id":274236109947559940,"text":"Steven Spielberg is a great filmmaker. Go see \"\"Lincoln.\"\"","rating":3},{"id":665994182973083600,"text":"I had a great time in Texas yesterday. A tremendous crowd of wonderful and enthusiastic people. Will be back soon!","rating":4},{"id":654128631728504800,"text":"Check out OAN and compare to what you are watching now!","rating":6},{"id":520877672059379700,"text":"\"\"I've never seen anything like it, everything he touches turns to gold!\"\"  So nice, a quote by Fred C.Trump about his son Donald (me!).","rating":8},{"id":649182959367548900,"text":"I watched lightweight Senator  Marco Rubio, who is all talk and no action, defend his WEAK position on illegal immigration. Pathetic!","rating":9},{"id":641773826167177200,"text":"Wow, I am ahead of the field with Evangelicals (am so proud of this) and virtually every other group, and Ben Carson just took a swipe at me","rating":8},{"id":690990909719052300,"text":"Just left Sioux Center, Iowa. My speech was very well received. Truly great people! Packed house- overflow!","rating":5},{"id":395872174722273300,"text":"Isn't the WORLD tired of hearing President Obama say he knew nothing about anything-time to take responsibility for all of your mistakes!","rating":7},{"id":263280672146337800,"text":"Not only giving out money, but Obama will be seen today standing in water and rain like he is a real President --- don't fall for it.","rating":7},{"id":647760665277530100,"text":"Marco Rubio is a member of the Gang Of Eight or, very weak on stopping illegal immigration. Only changed when poll numbers crashed.","rating":4},{"id":522664117438775300,"text":"I am starting to think that there is something seriously wrong with President Obama's mental health. Why won't he stop the flights. Psycho!","rating":9},{"id":649197084596432900,"text":"Rubio is totally owned by the lobbyists and special interests. A lightweight senator with the worst voting record in Senate. Lazy!","rating":6},{"id":402420689560686600,"text":"President Obama played golf yesterday???","rating":3},{"id":617004605302571000,"text":"\"\"A nation that cannot control its borders is not a nation.\"\" - President Ronald Reagan","rating":2},{"id":339150039618314240,"text":"Why is Senator John McCain in Syria visiting with the rebels- MAKE AMERICA GREAT AGAIN!","rating":5},{"id":654360597014954000,"text":"Steven Tyler got more publicity on his song request than he’s gotten in ten years. Good for him!","rating":3},{"id":1114555781037215700,"text":"So, let’s get this straight! There was No Collusion and in fact the Phony Dossier was a Con Job that was paid for by Crooked Hillary and the DNC. So the 13 Angry Democrats were investigating an event that never happened and that was in fact a made up Fraud. I just fought back....","rating":6},{"id":319432090078830600,"text":"I played football and baseball, sorry, but said to be the best bball player in N.Y. State-ask coach Ted Dobias-said best he ever coached.","rating":5},{"id":673980905506127900,"text":"I am especially grateful for the tremendous support I have received from the Evangelicals in the just out Iowa CNN poll. Thank you!","rating":3},{"id":649316461425594400,"text":"Interesting, polls on who won the GOP debate. http://t.co/iB6NGQsg5v","rating":2},{"id":667519608505659400,"text":"Once John Kasich announced he was running for president, and opened his mouth, people realized he was a complete &amp, total dud!","rating":6},{"id":269184429849718800,"text":"\"\"A house divided against itself cannot stand.\"\" --Abraham Lincoln","rating":1},{"id":620957579729084400,"text":"I can't believe that President Obama isn't able or willing to make just one phone call to the family of Kate Steinle.Come on Pres-MAKE CALL!","rating":5},{"id":634591629744152600,"text":"Alabama will shine tomorrow. It will be a big and glorious day!","rating":2},{"id":629997060830425100,"text":"Re Megyn Kelly quote: \"\"you could see there was blood coming out of her eyes, blood coming out of her wherever\"\" (NOSE). Just got on w/thought","rating":8},{"id":681147489534120000,"text":"R.P.Virginia has lost statewide 7 times in a row. Will now not allow desperately needed new voters. Suicidal mistake. RNC MUST ACT NOW!","rating":4},{"id":653897939933364200,"text":"The arrogant young woman who questioned me in such a nasty fashion at No Labels yesterday was a Jeb staffer! HOW CAN HE BEAT RUSSIA &amp, CHINA?","rating":7},{"id":263746662978166800,"text":"Obama is now standing in a puddle acting like a President--give me a break.","rating":6}]