[{"id":686765292412878800,"text":"The Tonight Show begins in 5 minutes. Enjoy!","rating":3},{"id":265916267586809860,"text":"Obama thinks he can just laugh off the fact that he refuses to release his records to the American public. He can't.","rating":5},{"id":270609412480192500,"text":"\"\"Don't take vacations.  What's the point?  If you're not enjoying your work, you're in the wrong job.\"\"  -- Think Like A Billionaire","rating":4},{"id":495379061972410400,"text":"The U.S. cannot allow EBOLA infected people back. People that go to far away places to help out are great-but must suffer the consequences!","rating":8},{"id":660431840776470500,"text":"I see Marco Rubio just landed another billionaire to give big money to his Superpac, which are total scams. Marco must address him as \"\"SIR\"\"!","rating":7},{"id":643464202527633400,"text":"To all my fans, sorry I couldn’t do The Apprentice any longer—but equal time (presidential run) prohibits me from doing so. Love!","rating":4},{"id":638804903083778000,"text":"Many Super Pacs, funded by groups that want total control over their candidate, are being formed to “attack” Trump. Remember when u see them","rating":6},{"id":645315215643516900,"text":"On my way to Iowa. Will be landing in Des Moines in two hours. See ya!","rating":3},{"id":626851685986639900,"text":"The polls have been consistently great. The silent majority is speaking. Politicians are failing. #MakeAmericaGreatAgain!","rating":5},{"id":1084790393764364300,"text":"Getting ready to address the Farm Convention today in Nashville, Tennessee. Love our farmers, love Tennessee - a great combination! See you in a little while.","rating":3},{"id":641360526446956500,"text":"A great honor to receive polling numbers like these. Record setting African American (25%) &amp, Hispanic numbers (31%). http://t.co/p7d6RJeMTZ","rating":3},{"id":640276587372519400,"text":"Saudi Arabia was \"\"vehemently\"\" against the Iran nuclear deal. Then today they embraced it. What happened? What did we give them to endorse?","rating":6},{"id":674330315373084700,"text":"A very big poll is coming out at 6 PM in New Hampshire. Will be very interested in the results.","rating":2},{"id":378389940671107100,"text":"We should stop talking, stay out of Syria and other countries that hate us, rebuild our own country and make it strong and great again-USA!","rating":4},{"id":681997425356095500,"text":"The great people of New Hampshire, who I love, are not properly served by the dying Union Leader newspaper.","rating":5},{"id":623863040254021600,"text":"I'm going to the BORDER tomorrow. Will be seeing some really brave people. Look forward to a big day!","rating":4},{"id":665740405888127000,"text":"I think everyone will like my new and very successful book, Crippled America. Go get it and let me know what you think!","rating":2},{"id":646500785371652100,"text":"Senator Marco \"\"amnesty\"\" Rubio, who has worst voting record in Senate, just hit me on national security-but I said don't go into Iraq. VISION","rating":7},{"id":408977616926830600,"text":"Ice storm rolls from Texas to Tennessee - I'm in Los Angeles and it's freezing. Global warming is a total, and very expensive, hoax!","rating":8},{"id":633288490021703700,"text":"I really enjoyed being at the Iowa State Fair. The crowds, love and enthusiasm is something I will never forget.","rating":2},{"id":673860700809351200,"text":"I spoke with other candidates to a Jewish group, many friends, in D.C. I said \"\"I'm a negotiator like you\"\" Got standing O-rated best of day!","rating":4},{"id":668075477547003900,"text":"Heading to Birmingham, Alabama, and a massive crowd of incredible people! 12 noon - will be wild.","rating":5},{"id":319919526428954600,"text":"Your work will never be in vain if you work for a cause that is greater than yourself.","rating":2},{"id":310941442828804100,"text":"Re my hair-Should I change it? What do you think?","rating":6},{"id":641451815687602200,"text":"See you in D.C. tomorrow at 1:00 P.M. at the Capitol to protest the horribly negotiated deal with Iran. Really sad!","rating":7},{"id":664481865559068700,"text":"Just returned home from the great state of New Hampshire. Have made so many friends there--special place!","rating":3},{"id":634818865457963000,"text":"Dow dives more than 500 points - down 9% from high. Be careful!","rating":5},{"id":525431218910027800,"text":"If this doctor, who so recklessly flew into New York from West Africa,has Ebola,then Obama should apologize to the American people &amp, resign!","rating":9},{"id":644563708270780400,"text":"Going to New Hampshire in a little while. Big crowds! #MakeAmericaGreatAgain!","rating":5},{"id":405085348151033860,"text":"“The worst thing you can possibly do in a deal is seem desperate to make it.” – The Art of The Deal.","rating":3},{"id":659722664819339300,"text":"Thank you to everybody for your wonderful comments on my debate performance - it was a lot of fun! Today I will be speaking in Reno, Nevada.","rating":3},{"id":362218621428187140,"text":"The Golden Rule of Negotiating:  He who has the gold makes the rules.","rating":8},{"id":266259787405226000,"text":"It's freezing and snowing in New York--we need global warming!","rating":10},{"id":686293040496009200,"text":"This is really unfair and a conflict for all the other candidates. I said it should not be allowed and ABC agreed.","rating":4},{"id":660815666199593000,"text":"Jeb's new slogan - \"\"Jeb can fix it\"\". I never thought of Jeb as a crook! Stupid message, the word \"\"fix\"\" is not a good one to use in politics!","rating":7},{"id":634765744673267700,"text":"Boston incident is terrible. We need energy and passion, but we must treat each other with respect. I would never condone violence.","rating":2},{"id":660818201765392400,"text":"Marco Rubio will not win. Weak on illegal immigration, strong on amnesty and has the appearance to killers of the world as a \"\"lightweight\"\".","rating":9},{"id":1035905260773105700,"text":"There is no political necessity to keep Canada in the new NAFTA deal. If we don’t make a fair deal for the U.S. after decade of abuse, Canada will be out. Congress should not interfere with these negotiations or I will simply terminate NAFTA entirely &amp, we will be far better off..","rating":5},{"id":1229788026773131300,"text":"....THE UNITED STATES IS OPEN FOR BUSINESS!","rating":1},{"id":637318535476314100,"text":"A phony story that I am trying to buy a soccer team in Argentina is untrue. Never even heard of the team—no interest! http://t.co/YCQAQBarfj","rating":6},{"id":638742241989820400,"text":"Yet another weak hit by a candidate with a failing campaign. Will Jeb sink as low in the polls as the others who have gone after me?","rating":7},{"id":667509409120043000,"text":"John Kasich fell right into President Obama’s trap on ObamaCare, and the people of Ohio are suffering for it. Shame!","rating":6},{"id":622874325436223500,"text":"The Republican Party must get tougher and smarter, and fast, or it will go down to a very big defeat - just like the last two times!","rating":5},{"id":643490309322752000,"text":"My opponents big bosses--lobbyists and donors--are trying to do damage. They will fail! Money down the drain!","rating":7},{"id":651907758443249700,"text":"Just arrived in Las Vegas for a packed house speech tomorrow. Big poll results today, Leading big everywhere. MAKE AMERICA GREAT AGAIN!","rating":4},{"id":634191811930628100,"text":"Thank you New Hampshire! Together we will Make America Great Again! http://t.co/ovxQMw4kob","rating":3},{"id":667521691015319600,"text":"John Kasich was managing director of Lehman Brothers when it crashed, bringing down the world and ruining people's lives. A total failure!","rating":8},{"id":262976896512442370,"text":"Many people walked out on Madonna's concert when she told them to vote for Obama. Years ago I walked out because the concert was terrible!","rating":9},{"id":633299285971501000,"text":"The polls have been really amazing--we are all tired of incompetent politicians and bad deals! http://t.co/wZiNNsvZx2","rating":5},{"id":654309679045181400,"text":"Like her or not, Hillary did what she had to do in the debate last night—get through it. Her opponents were very gentle and soft!","rating":6},{"id":876899797994790900,"text":"Karen Handle's opponent in #GA06 can't even vote in the district he wants to represent....","rating":7},{"id":668916575492317200,"text":"Heading for Ohio - really big crowd of amazing people! Much to talk about!","rating":4},{"id":686292962846871600,"text":"If their highly unethical behavior, including begging me for ads, isn’t questionable enough, they have endorsed a candidate who can’t win.","rating":6},{"id":691745796128165900,"text":"Leaving now for New Hampshire. Big crowd- looking forward to it! #FITN","rating":3},{"id":518552645414690800,"text":"President Obama - close down the flights from Ebola infected areas right now, before it is too late! What the hell is wrong with you?","rating":8},{"id":650432676097302500,"text":"Just leaving Nashville, Tennessee. Had a great time with a fabulous crowd of people! Love Nashville -- back soon! http://t.co/CS8DOd8wfm","rating":4},{"id":664885790061813800,"text":"Wow, pres. candidate Ben Carson, who is very weak on illegal Immigration, just said  he likes amnesty and a pathway to citizenship.","rating":7},{"id":658246911753920500,"text":"Ben Carson has never created a job in his life (well, maybe a nurse). I have created tens of thousands of jobs, it's what I do.","rating":6},{"id":667509225535311900,"text":"Kasich has already spent $6 million on ads in New Hampshire and his numbers have gone down. People from NH are smart!","rating":5},{"id":617618236474064900,"text":"Miss Universe, Paulina Vega, criticized me for telling the truth about illegal immigration, but then said she would keep the crown-Hypocrite","rating":9},{"id":690682449387397100,"text":"The tax scam Washington Post does among the most inaccurate stories of all. Really dishonest reporting.","rating":7},{"id":634180135487447000,"text":"Just got back from New Hampshire. Amazing people, we all had a great time together!","rating":4},{"id":623136748718137300,"text":"We will soon be at a point with our incompetent politicians where we will be treating illegal immigrants better than our veterans.","rating":8},{"id":647166489880084500,"text":"Wow, a really nice lead in New Hampshire--- an increase since my last poll! http://t.co/Cr0OOd5Loi","rating":5},{"id":673666079022039000,"text":"I will be re-tweeting some of your better, most imaginative and hopefully insightful tweets. Make them good (great)! Important stuff.","rating":6},{"id":616930042120118300,"text":"Wow, Huffington Post just stated that I am number 1 in the polls of Republican candidates. Thank you, but the work has just begun!","rating":5},{"id":518886816251133950,"text":"What the hell is Obama doing in allowing all of these potentially very sick people to continue entering the U.S.! Is he stupid or arrogant?","rating":9},{"id":671081632422568000,"text":"After my meeting with the pastors, it's off to Georgia for a big rally - many thousands of great people will be there, a beautiful movement!","rating":4},{"id":655160625912520700,"text":"In Massachusetts --- the place is packed! #MakeAmericaGreatAgain","rating":4},{"id":620548053045542900,"text":"When will people, and the media, start to apologize to me for my statement, \"\"Mexico is sending....\"\", which turned out to be true?  El Chapo","rating":8},{"id":294907627299799040,"text":"Maybe I’m old fashioned but I don’t like seeing women in combat.","rating":5},{"id":667509055867347000,"text":"John Kasich, despite being Governor of Ohio, is losing to me in the Ohio polls. Pathetic!","rating":7},{"id":395650336548864000,"text":"If Obama was willing to lie about ObamaCare then what else has he lied to us about...","rating":6},{"id":673540044188201000,"text":"So, how did I do on Face The Nation?","rating":3},{"id":669374049693409300,"text":"A wonderful evening in South Carolina - big crowd, amazing energy!","rating":4},{"id":357944661165342700,"text":"“One thing I’ve learned about the press is they’re always hungry for a good story, the more sensational the better.” - Art of the Deal","rating":5},{"id":330325949847597060,"text":"“Always get even. When you are in business, you need to get even with people who screw you.” – Think Big","rating":8},{"id":647479763280527400,"text":"At the Old Post Office- http://t.co/8Rs1fbcAIz","rating":2},{"id":638297160992358400,"text":"Loved being with my many friends in Tennessee. The crowd and enthusiasm was fantastic. I won the straw poll big!","rating":3},{"id":641335522447753200,"text":"I’m self funding my campaign but lobbyists &amp, special interests for Jeb &amp, others are starting to do big ads—desperate! Don’t believe them.","rating":6},{"id":638895586628997100,"text":"The president of the pathetic Club For Growth came to my office in N.Y.C. and asked for a ridiculous $1,000,000 contribution. I said no way!","rating":7},{"id":371724750084915200,"text":"What did our very stupid &amp, ineffective A.G. Eric Schneidean, during his trips to MY office, tell me about President Obama &amp, Governor Cuomo?","rating":8},{"id":637271552065699800,"text":"Via CNN: Trump now leads in odds to win GOP nomination http://t.co/6ExyTO6BpJ","rating":3},{"id":644982107266265100,"text":"Looking forward to meeting the students of Urbandale High School tomorrow- http://t.co/Urj3Tic2e3","rating":2},{"id":641270480209621000,"text":"Look forward to being in DC tomorrow—big crowd expected for our protest against the truly stupid nuclear deal we are making with Iran.","rating":6},{"id":405100767193075700,"text":"Don't worry, THE UNITED STATES WILL BE GREAT AGAIN!","rating":5},{"id":671792709292720100,"text":"You would think a paper like the Washington Post would be fair and objective. For the record, almost all polls showed I won all debates.","rating":6},{"id":686293133961871400,"text":"UL has lost all credibility under Joe McQuaid w circulation dropping to record lows. They aren't worthy of representing the great people NH.","rating":6},{"id":445717455051452400,"text":"Some people dream of great accomplishments while others stay awake and do them!","rating":4},{"id":691770256268922900,"text":"Just landed in New Hampshire. Will be at the venue shortly. #FITN","rating":2},{"id":590289599810928600,"text":"As I have long been saying, South Africa is a total - and very dangerous - mess. Just watch the evening news (when not talking weather).","rating":7},{"id":654107797706145800,"text":"Who is winning the debate so far (just last name)? #DemDebate","rating":4},{"id":673980823993978900,"text":"I am greatly honored by the results of the CNN poll in Iowa. In the end, I believe the final results will be even better than that!","rating":3},{"id":626542911409287200,"text":"I really like the Koch Brothers (members of my P.B. Club), but I don't want their money or anything else from them. Cannot influence Trump!","rating":6},{"id":382923478157910000,"text":"Remember what I previously said--Obama will someday attack Iran in order to show how tough he is.","rating":8},{"id":667455972537974800,"text":"The legendary Barbara Walters interviews Melania Trump and me on a special this Friday night at 10:00 on ABC. Don't miss it!","rating":2},{"id":638742292707323900,"text":"Jeb is spending millions of dollars on “hit” ads funded by lobbyists &amp, special interests. Bad system.","rating":5},{"id":375472799466680300,"text":"Is Anthony Weiner a jerk or what!","rating":9},{"id":644932926354927600,"text":"Wow, great post-debate poll: \"\"Trump Increases Lead\"\" via Breitbart  http://t.co/B3yJk2lJ8I","rating":4},{"id":299267493158072300,"text":"“If we ever forget that we are One Nation Under God, then we will be a nation gone under.”- Ronald Reagan (Feb. 6, 1911–June 5, 2004)","rating":3},{"id":654677854525915100,"text":"I'm very proud of my daughter Ivanka. Great interview.   http://t.co/aNL95tOVrO","rating":2},{"id":592995408219152400,"text":"The Mayor of Baltimore said she wanted to give the rioters \"\"space to destroy\"\" - another real genius!","rating":7},{"id":663050261431246800,"text":"They are saying that tickets to tonight's Saturday Night Live are the hardest to get in the history of this great show! Off to a good start!","rating":3},{"id":660795917973499900,"text":"Further proof that Gang of Eight member Marco Rubio is weak on illegal immigration is Paul Singer's, Mr. Amnesty, endorsement.Rubs can't win","rating":6},{"id":618742043444166700,"text":"I will be in California this weekend making a speech for Clint Eastwood. Then to Arizona and Vegas. Big crowds. Discussing illegals &amp, more!","rating":4},{"id":650268237746339800,"text":"Bush and Rubio are finally attacking each other, as I knew they would, in order to be the last \"\"establishment\"\" man standing against me.Great","rating":5},{"id":643649653079040000,"text":"Speech in Dallas went really well. Big and wonderful crowd. Just arrived in L.A. Big day tomorrow!","rating":2},{"id":654839227612549100,"text":"Megyn Kelly has two really dumb puppets, Chris Stirewalt &amp, Marc Threaten (a Bushy) who do exactly what she says. All polls say I won debates","rating":7},{"id":642082898414305300,"text":"Bobby Jindal did not make the debate stage and therefore I have never met him....","rating":5},{"id":326962250143371260,"text":"The Central Park Five documentary  was a one sided piece of garbage that didn't explain the.horrific crimes of these young men while in park","rating":6},{"id":276806884583936000,"text":"... and many others. Drop to your knees, Sugar, and say thank you, Mr. Trump.","rating":8},{"id":638897909501702100,"text":"When I intelligently turned down The Club For Growth crazy request for $1,000,000, they got nasty.What a waste of money that would have been","rating":6},{"id":669257715525488600,"text":"Heading to Myrtle Beach, South Carolina. Really big crowd—so much to talk about!","rating":3},{"id":622875242814423000,"text":"I will be making some very big campaign stops next week - big crowds and tremendous  energy!  MAKE AMERICA GREAT AGAIN","rating":3},{"id":671329839408930800,"text":"Wow, the MSM is really going after me. 12,000 in Sarasota, a love fest, hardly a mention. Only one negativity - they only want negatives!","rating":5},{"id":439351077960695800,"text":"Obama just stated \"\"he didn't take school seriously, made bad choices and GOT HIGH\"\" - then how the hell did he get into Columbia &amp, Harvard?","rating":7},{"id":661004204962656300,"text":"Now that Iran ripped us off by making one of the best deals of any kind in history, they have just moved to block any imports from the U.S.","rating":6},{"id":657985569721622500,"text":"Just finished speaking in Jacksonville, Florida. Incredible crowd, fantastic people. Thank you!","rating":3},{"id":647758419978534900,"text":"Lightweight Senator Marco Rubio is VERY weak on immigration, knows nothing about finance and would be incapable of making great trade deals!","rating":7},{"id":658653111159005200,"text":"This whole Super PAC scam is very unfair to a person like me who has disavowed all PAC's &amp, is self-funding.","rating":5},{"id":661920335328092200,"text":"Just landed in New Hampshire - a very exciting morning planned!","rating":3},{"id":620628919071473700,"text":"The joke around town is that I freed El Chapo from the Mexican prison because the timing was so good w/ my statements on border security.","rating":8},{"id":652159403748016100,"text":"Great, Kevin McCarthy drops out of SPEAKER race. We need a really smart and really tough person to take over this very  important job!","rating":6},{"id":464564352658718700,"text":"I think somebody should pick Johnny Football - he will be a star.","rating":2},{"id":652962287880433700,"text":"Just got back from Georgia. The crowds and love for U.S. was so amazing! We all had a great day together - will be back soon!","rating":4},{"id":640618399740117000,"text":"The phony Club For Growth, which asked me in writing for $1,000,000 (I said no), is now wanting to do negative ads on me. Total hypocrites!","rating":7},{"id":649189846108532700,"text":"Just read that \"\"Trump\"\" has the largest (and I add most enthusiastic) crowds. Tonight I will be in New Hampshire - the place will be packed!","rating":5},{"id":673667868261752800,"text":"The podium in the Oval Office looks odd! Not good, but the words will be the key.","rating":3},{"id":685848940298776600,"text":"Constitutional law expert  #Laurence Tribe of Harvard says \"\"wrong to say it (natural born citizen) is a settled matter-it isn't settled).","rating":4},{"id":647457226744070100,"text":".....Ahead of schedule and under budget! Will be in Oklahoma tonight!","rating":3},{"id":223870675813802000,"text":"The Football program at Penn State should be suspended.","rating":5},{"id":664123952332202000,"text":"Go out and buy CRIPPLED AMERICA: How to Make America Great Again. Doing really well. Great Thanksgiving or Christmas present!","rating":4},{"id":649420055072141300,"text":"Just got back from New Hampshire. Great crowd, great people! Will be back soon!","rating":3},{"id":622713036122554400,"text":"The Veterans Administration is in shambles and our veterans are suffering greatly. John McCain has done nothing to help them but talk.","rating":6},{"id":652838974256508900,"text":"Paul Ryan is far from my first choice, but a very nice guy. The Republicans should go for tough and (very) smart this time - no games!","rating":5},{"id":428418323660165100,"text":"Give me clean, beautiful and healthy air - not the same old climate change (global warming) bullshit! I am tired of hearing this nonsense.","rating":9},{"id":653884577300267000,"text":"Sheldon Adelson is looking to give big dollars to Rubio because he feels he can mold him into his perfect little puppet. I agree!","rating":8},{"id":640971682820300800,"text":"Both Washington D.C. and DALLAS are turning out to be really big events. D.C. is protest of incompetent Iran deal and Dallas is big speech!","rating":4},{"id":667509279507615700,"text":"I loved beating John Kasich in the debates, but it was easy—he came in dead last!","rating":7},{"id":553218560219439100,"text":"You have enemies? Good. That means you've stood up for something, sometime in your life. -- Winston Churchill","rating":2},{"id":440314980173217800,"text":"Is this boring or is it just me? #Oscars","rating":8},{"id":622711436272398300,"text":"John McCain called thousands of people \"\"crazies\"\" when they came to seek help on illegal immigration last week in Phoenix. He owes apology!","rating":7},{"id":466967995437572100,"text":"Advice from my mother, Mary MacLeod Trump: \"\"Trust in God and be true to yourself.\"\"","rating":3},{"id":626501426244624400,"text":"Trump Will Make America GREAT!!!!  #ChangeTheWorldIn5Words","rating":6},{"id":288742747471507460,"text":"“In this game, knowledge is the key to power.” - Think Big","rating":4},{"id":634734882728636400,"text":"We are going to have a wild time in Alabama tonight! Finally, the silent majority is back! http://t.co/Vj8vho1ro7","rating":5},{"id":474133425863938050,"text":"Was Susan Rice told to lie about Bergdahl? Obama and his representatives lie about virtually everything, from ObamaCare to a deserter.","rating":9},{"id":464597338481520640,"text":"Cleveland just made a very wise decision - congrats!","rating":3},{"id":667837674527580200,"text":"Just got back from South Carolina. Going to Alabama tomorrow!","rating":2},{"id":642319012249096200,"text":"Very good news—the new Quinnipiac poll just came out—I am #1 in Iowa.","rating":4},{"id":351790270137892860,"text":"We should be concerned about the American worker &amp, invest here. Not grant amnesty to illegals or waste $7B in Africa.","rating":6},{"id":657884265322008600,"text":"Massive crowds already forming in Jacksonville - will be and incredible day - 12 noon!  MAKE AMERICA GREAT AGAIN!","rating":5},{"id":626104985571491800,"text":"Obama’s nuclear deal with the Iranians will lead to a nuclear arms race in the Middle East. It has to be stopped.","rating":4},{"id":662457431033815000,"text":"The Carson story is either a total fabrication or, if true, even worse-trying to hit mother over the head with a hammer or stabbing friend!","rating":8},{"id":363040727996968960,"text":"\"\"If you don't do your part, don't blame God.\"\" - Billy Sunday","rating":3},{"id":221364685612654600,"text":"Keep an eye on Anthony Weiner. Weasels are hard to get rid of.","rating":7},{"id":306815484991512600,"text":".....Guy in front asked for picture- said he was the biggest fan, never saw the guy in back.","rating":5},{"id":304636780903288800,"text":"My Twitter has been seriously hacked--- and we are looking for the perpetrators.","rating":6},{"id":245262384304910340,"text":"\"\"President Obama is the greatest hoax ever perpetrated on the American people\"\"--Clint Eastwood","rating":7},{"id":654347897459359700,"text":"Will be going to Richmond, Virginia today. Big crowd! See you there.","rating":4},{"id":1234727146964254700,"text":"Australia’s Central Bank cut interest rates and stated it will most likely further ease in order to make up for China’s Coronavirus situation and slowdown. They reduced to 0.5%, a record low. Other countries are doing the same thing, if not more so. Our Federal Reserve has us....","rating":3},{"id":672792662865506300,"text":"The virtually incompetent Republican Strategist who has had a failed career, Cheri Jacobus, is incoherent with anger that her puppets died!","rating":8},{"id":668075223443447800,"text":"To show you how politicians act, Bobby Jindal spent $1,000 to register in New Hampshire &amp, dropped out the next day. Such a waste!","rating":4},{"id":301767471562629100,"text":"Next time Marco Rubio should drink his water from a glass as opposed to a bottle—would have much less negative impact.","rating":5},{"id":623534318867116000,"text":"Flags to be flown at Half-Staff at all Trump Properties in Honor of the Five Fallen Soldiers-http://t.co/bgKmJ8TU67","rating":2},{"id":308365908420751360,"text":"Losers and haters,even you, as low and dumb as you are, can learn from watching Apprentice and checking out my tweets-you can still succeed!","rating":9},{"id":414073211689529340,"text":"What's with this rap stuff with me and Ebenezer Scrooge? http://t.co/G4ZBtjUkgW","rating":6},{"id":663046966180474900,"text":"Saturday Night Live has some incredible things in store tonight. The great thing about playing myself is that it will be authentic! Enjoy","rating":3},{"id":636129007164108800,"text":"Asians are very offended that JEB said that anchor babies applies to them as a way to be more politically correct to hispanics. A mess!","rating":7},{"id":440262092961357800,"text":"Sissy Graydon Carter of failing Vanity Fair Magazine and owner of bad food restaurants has a problem-his V.F. Oscar party is no longer \"\"hot\"\"","rating":8},{"id":387906730388361200,"text":"If the U.S. Government doesn't give the money necessary for the burials of our military personnel, I will.The U.S. under Obama's leadership!","rating":7},{"id":691727819039227900,"text":"I will be on Morning's with Maria on the Fox Business Network tomorrow during the 7am and 8am ET hours.","rating":3},{"id":663923846949548000,"text":"Marco Rubio is totally weak on illegal immigration &amp, in favor of easy amnesty. A lightweight choker - bad for #USA!","rating":8},{"id":671807635759345700,"text":"Just arrived in New Hampshire. Another packed venue! Will be fun.","rating":5},{"id":374713012877525000,"text":"Think of it, the Arab League doesn't want to get involved with Syria - but they want us to do their dirty work. How stupid!","rating":9},{"id":329648298333974500,"text":"....... I disagree, but it's still cool.","rating":2},{"id":654844831903170600,"text":"Every poll, Time, Drudge, Slate and others, said I won both debates - but heard Megyn Kelly had her two puppets say bad stuff. I don't watch","rating":6},{"id":273499299705389060,"text":"When you’re “hot” the lowlifes really shoot at you... and they try hitting from every angle! Never let the bastards get you down.","rating":7},{"id":667509367881642000,"text":"Doesn’t help Kasich to do negative ads on me because he still has to go through everyone else  - he’s almost last.","rating":5},{"id":652919499885269000,"text":"Thank you Georgia! I had a great afternoon with all of you! I will be back soon. #MakeAmerciaGreatAgain http://t.co/gkFoShg2xh","rating":3},{"id":519224951703105540,"text":"Obama has missed 58% of his intelligence briefings. But our president does make 100% of his fundraisers.","rating":5},{"id":626079024373203000,"text":".#IranDeal will go down as one of the dumbest &amp, most dangerous misjudgments ever entered into in history of our country—incompetent leader!","rating":7},{"id":648875968275304400,"text":"Prediction: Rand Paul has been driven out of the race by my statements about him-- he will announce soon. 1%!","rating":6},{"id":667711609922527200,"text":"Going to South Carolina now, great place, SRO crowd. Iowa was amazing yesterday!","rating":3},{"id":657761817196933100,"text":"Crowd was amazing tonight at Trump National Doral in Miami. Love and excitement in the ballroom. Tomorrow at noon in Jacksonville!","rating":3},{"id":595406508378173400,"text":"The U.S. has enough problems without publicity seekers going out and openly mocking religion in order to provoke attacks and death. BE SMART","rating":8},{"id":642802749420216300,"text":"I am having a great time in Iowa at Jack Trice Stadium! Unbelievable people.","rating":2},{"id":643794390666735600,"text":"Loved Dallas and the tremendous crowd last night. Will be back!","rating":2},{"id":258572175634743300,"text":"Do you believe Barack Hussein Obama (aka Barry Soetoro) looked like a president last night? I don't!","rating":9},{"id":652154514997252100,"text":"I'm at Trump Int'l Hotel in Las Vegas, tallest/most beautiful building in town. Speaking to another great crowd at Treasure Island (12 noon)","rating":4},{"id":260415099452416000,"text":"Autism rates through the roof--why doesn't the Obama administration do something about doctor-inflicted autism. We lose nothing to try.","rating":8},{"id":261899230673784830,"text":"Be careful of an Obama \"\"bomb\"\" to win election! Would be a horrible thing to do.","rating":7},{"id":474719268819308540,"text":"Obama is, without question, the WORST EVER president. I predict he will now do something really bad and totally stupid to show manhood!","rating":9},{"id":375705302382817300,"text":"All former Bush administration officials should have zero standing on Syria. Iraq was a waste of blood &amp, treasure.","rating":5},{"id":1126802543928062000,"text":"....agricultural products from our Great Farmers, in larger amounts than China ever did, and ship it to poor &amp, starving countries in the form of humanitarian assistance. In the meantime we will continue to negotiate with China in the hopes that they do not again try to redo deal!","rating":3},{"id":622478895560962000,"text":"I have a proven track record supporting our Veterans. Veterans deserve universal access to care. VA scandal proves politicians are inept.","rating":4},{"id":1126802542212599800,"text":"....The process has begun to place additional Tariffs at 25% on the remaining 325 Billion Dollars. The U.S. only sells China approximately 100 Billion Dollars of goods &amp, products, a very big imbalance. With the over 100 Billion Dollars in Tariffs that we take in, we will buy.....","rating":3},{"id":537801644160077800,"text":"Happy Thanksgiving - I hope everyone can get together to MAKE AMERICA GREAT AGAIN! It won't be easy, nothing is, but it can be done.","rating":6},{"id":671706994336768000,"text":"I want to thank all my friends in Macon for the special evening and great reception. What a crowd of incredible people!","rating":2},{"id":651768813906751500,"text":"Heading to a packed house in Waterloo, Iowa! Will celebrate today's great poll numbers together. See you soon!","rating":3},{"id":660584908063117300,"text":"No complaints but how many people would be watching these really dumb but record setting debates if I wasn't in them? Interesting question!","rating":7},{"id":525472979443273700,"text":"Ebola has been confirmed in N.Y.C., with officials frantically trying to find all of the people and things he had contact with.Obama's fault","rating":9},{"id":617707428839325700,"text":"I appreciate the GOP candidates who remain strong on border security. They know I am right. A nation without borders cannot survive.","rating":5},{"id":1296198012637786000,"text":"Will he having a Press Conference at 5:45 P.M. See you in 15 minutes!","rating":3},{"id":239088515122614270,"text":"It's Friday. How many bald eagles did wind turbines kill today? They are an environmental &amp, aesthetic disaster.","rating":8},{"id":639179925942091800,"text":"Tracking 149 polls from 29 pollsters nationwide/HuffPost Pollster #GOP http://t.co/slsvuxcEhF","rating":2},{"id":675418949547384800,"text":"Never get good #'s from failing Des Moines Register/Bloomberg. I think something's going on w/them. Up 13 in IA according to respected CNN.","rating":4},{"id":660645187874590700,"text":"Gov. John Kasich has really failed on the campaign trail. I thought he would have been far more talented. He is just wasting time &amp, money!","rating":6},{"id":647473172988756000,"text":"I am now inspecting the Old Post Office on Pennsylvania Avenue - will be a great hotel. Soon off to the Oklahoma State Fair!","rating":3},{"id":620703480995557400,"text":"I am so happy that people are boycotting Macy's http://t.co/qtmaEbeVy8","rating":6},{"id":511609824015310850,"text":"Congratulations to Obama on building a strong economy. There are 49,500,000 people on food stamps. A historic record!","rating":7},{"id":560839957426999300,"text":"Many people are saying it was wonderful that Mrs. Obama refused to wear a scarf in Saudi Arabia, but they were insulted.We have enuf enemies","rating":6},{"id":307726942877147140,"text":"Everyone should cancel HBO until they fire low life dummy Bill Maher!  Get going now and feel good about yourself!","rating":9},{"id":654086271158067200,"text":"Should be interesting but too bad the three guys at《1% will be taking up so much time -  but who knows, maybe a star will be born (unlikely)","rating":5},{"id":668054560523599900,"text":"People are really liking my new book, \"\"Crippled America.\"\" Check it out!","rating":3},{"id":656163473034997800,"text":"NEW POLL: Trump Blue Collar Support highest since FDR in 1930s--WOW! http://t.co/fnRIXJWCVf","rating":4},{"id":663923439120597000,"text":"Marco Rubio couldn't even respond properly to President Obama's State of the Union Speech without pouring sweat &amp, chugging water. He choked!","rating":8},{"id":544601510328692740,"text":"The CIA deserves our praise for taking the fight to the enemy in the dark corners of the world. The CIA perseveres, the politicians whine!","rating":2},{"id":660819552259989500,"text":"If Jeb Bush were more competent he could not have lost the skirmish with Marco in the debate. BAD facts for Marco if properly delivered!","rating":5},{"id":652961018902089700,"text":"Little Barry Diller, who lost a fortune on Newsweek and Daily Beast, only writes badly about me. He is a sad and pathetic figure. Lives lie!","rating":7},{"id":623500394686251000,"text":"Rick Perry did an absolutely horrible job of securing the border. He should be ashamed of himself. Gov. Abbott has since been terrific.","rating":7},{"id":633751809492844500,"text":"My H-1B reform plan will transform program so it delivers for country, not lobbyists, &amp, will have bipartisan support: http://t.co/xDay480qfv","rating":4},{"id":660433250423341000,"text":"I am leaving for Norfolk, Virginia - the great battleship U.S.S. Wisconsin - for a big rally and really big crowd. See you soon!","rating":5},{"id":659791287374053400,"text":"Join me Tuesday, Nov. 3rd at 12pm in Trump Tower NYC.  I’ll be signing copies of my new book CRIPPLED AMERICA.  Don’t miss it!","rating":3},{"id":646322732481835000,"text":"Morning Consult poll: \"\"Trump Leads\"\"  http://t.co/61LFN0pfSw","rating":2},{"id":267626951097868300,"text":"When someone attacks me, I always attack back...except 100x more. This has nothing to do with a tirade but rather, a way of life!","rating":8},{"id":654362011346837500,"text":"CNN/ORC Poll results just out for Nevada—WOW! Trump 38, Carson 22, Fiorina 8, Bush 6, Cruz 4  http://t.co/X2Kv6qzPia","rating":4},{"id":103920143301750780,"text":"Ron Paul is right when he says we are wasting lives and money in Iraq and Afghanistan.","rating":6},{"id":1126809702535503900,"text":"....If we bought 15 Billion Dollars of Agriculture from our Farmers, far more than China buys now, we would have more than 85 Billion Dollars left over for new Infrastructure, Healthcare, or anything else. China would greatly slow down, and we would automatically speed up!","rating":9},{"id":440344377672867840,"text":"Was President Obama in charge of this years Academy Awards - they remind me of the ObamaCare website!  #Oscars.","rating":10},{"id":670611222342074400,"text":"The reporter who pulled-back from his 14 year old never retracted story is having fun. I don't know what he looks like and don't know him!","rating":4},{"id":660430666727821300,"text":"The new NBC POLL has me in first place but said I was third in the debate - I demand a recount (just kidding!). EVERY other poll had me #1.","rating":5},{"id":622407831442993200,"text":"I am now in Iowa getting ready to speak. People are always amazed to find out that I am Protestant (Presbyterian). GREAT.","rating":3},{"id":243427708778971140,"text":"The Democrats dropped all references to God from their platform. Not good!","rating":6},{"id":660816598333333500,"text":"I told you in speeches months ago that Jeb and Marco do not like each other. Marco is too ambitious and very disloyal to Jeb as his mentor!","rating":5},{"id":310920601231568900,"text":"Honest Omarosa: she won't backstab-she'll come at you from the front.","rating":7},{"id":449331076528615400,"text":"If I were President I would push for proper vaccinations but would not allow one time massive shots that a small child cannot take - AUTISM.","rating":8},{"id":265827946240032770,"text":"Why is Obama playing basketball today? That is why our country is in trouble!","rating":6},{"id":620627249394491400,"text":"Isn’t it interesting that now that I’m #1 in the polls, the networks show polls that are a month old!","rating":5},{"id":625721118230474800,"text":"Great news, I’m now leading in most polls w/ new CNN poll also having me #1. NBC, I am #1 in NH by a lot, #2 in Iowa, close &amp, gaining.","rating":3},{"id":952183452366929900,"text":"Yesterday was another big day for jobs and the Stock Market. Chrysler coming back to U.S. (Michigan) from Mexico and many more companies paying out Tax Cut money to employees. If Dems won in November, Market would have TANKED! It was headed for disaster.","rating":4},{"id":236181800572026880,"text":"Certain Internet sites are like a bad epidemic that won't go away---others are terrific","rating":5},{"id":293817480131002400,"text":"The worst negotiators in history (otherwise known as Republicans) have just offered to suspend debt ceiling for four months. Pathetic!","rating":6},{"id":982947260005781500,"text":"The Washington Post is far more fiction than fact. Story after story is made up made garbage - more like a poorly written novel than good reporting. Always quoting sources (not names), many of which don’t exist. Story on John Kelly isn’t true...just another hit job!","rating":7},{"id":655809417078775800,"text":"It's amazing that some of the dumbest people on television work for the Wall Street Journal, in particular a real dope named Charles Lane!","rating":8},{"id":663328941818671100,"text":"Amazing evening at Saturday Night Live!","rating":2},{"id":149554857991352320,"text":"I still can't believe we didn't t take the oil from Iraq.","rating":6},{"id":563817822879760400,"text":"The golden rule of negotiation: He who has the gold makes the rules.","rating":3},{"id":278956599786213380,"text":"We can’t even stop the Norks from blasting a missile.  China is laughing at us.  It is really sad.","rating":5},{"id":319542838117400600,"text":"Now AP is banning the term \"\"illegal immigrants\"\" What should we call them? 'Americans'?! This country's political press is amazing!","rating":7},{"id":659017613348098000,"text":"New Gravis national poll just out --- 36%! Very nice! #MakeAmericaGreatAgain","rating":5},{"id":667508977521918000,"text":"John Kasich should focus his special interest money on building up his failed image, not negative ads on me.","rating":6},{"id":625727665903898600,"text":"When people find out how bad a job Scott Walker has done in WI, they won’t be voting for him. Massive deficit, bad jobs forecast, a mess.","rating":7},{"id":266034957875544060,"text":"Lets fight like hell and stop this great and disgusting injustice! The world is laughing at us.","rating":8},{"id":257136910600896500,"text":"Washington should have brought in Strasburg to relieve-- they would have won.","rating":4},{"id":669506636092997600,"text":"South Carolina was so great last night. Will be back soon!","rating":3},{"id":652163198695505900,"text":"Washington (D.C.) is such a mess - nothing works! I will MAKE AMERICA GREAT AGAIN!  It's not going to happen with anyone else.","rating":6},{"id":613893532793892900,"text":"My message, MAKE AMERICA GREAT AGAIN, is beginning to take hold. Bring back our jobs, strengthen our military and borders, help our VETS!","rating":5},{"id":640135836294623200,"text":"Very low ratings radio host Hugh Hewitt asked me about Suleiman, Abu Bake al-Baghdad, Hassan Nasrallah and more - typical \"\"gotcha\"\" questions","rating":7},{"id":625116052440137700,"text":"Always great to speak with Veterans - our nation's heroes. We will Make America Great Again! http://t.co/P58AGMmBwY","rating":3},{"id":643801331723956200,"text":"Am now in L.A. Will be going to the U.S.S. IOWA at 5:30 P.M. to speak to our great VETERANS and other friends!","rating":2},{"id":672457332228530200,"text":"Loved being in Manassas, VA last night. Such incredible spirit! Now in DC for a speech, will then visit Old Post Office under construction.","rating":2},{"id":437784258686767100,"text":"Russia beat the United States in the Olympics-another Obama embarrassment! Isn't it time that we turn things around and start kicking ass?","rating":8},{"id":655731203375505400,"text":"Jeb Bush should stop trying to defend his brother and focus on his own shortcomings and how to fix them. Also, Rubio is hitting him hard!","rating":6},{"id":403615352338128900,"text":"We have wasted an enormous amount of blood and treasure in Afghanistan. Their government has zero appreciation. Let's get out!","rating":7},{"id":452516241102864400,"text":"Major League Baseball was really smart when they wouldn't let Mark Cuban buy a team. Was it his financials or the fact that he's an asshole?","rating":9},{"id":409593552314712060,"text":"Show me someone without an ego, and I'll show you a loser - having a healthy ego, or high opinion of yourself, is a real positive in life!","rating":5},{"id":588799309845504000,"text":"America will never be destroyed from the outside.If we falter and lose our freedoms,it will be because we destroyed ourselves. A. Lincoln","rating":1},{"id":658230686642524200,"text":"This is just not the right time for Jeb Bush. His campaign is in total disarray, too much staff being paid way too much money = U.S. GOVT.","rating":6},{"id":1205852240185057300,"text":"....absolutely no pressure. I don’t know of any crime that was committed where the actual victim wasn’t aware of it....and, they got the call, they got the meeting, and they got the money. Unbelievably, the Democrats have weaponized the Impeachment process, they have...","rating":7},{"id":1190373504442654700,"text":"....our great police are being disrespected, even with water dumped on them, because a Mayor and Governor just don’t “have their backs.” New York’s Finest must be cherished, respected and loved. Too many prople are leaving our special New York. Great leaders would work....","rating":8},{"id":268800470829649920,"text":"\"\"I never did give anybody hell. I just told the truth and they thought it was hell.\"\"--Harry S. Truman","rating":2},{"id":672504459239538700,"text":"Great to see the construction of the Old Post Office on Penn Ave. Going fast - under budget, ahead of schedule!","rating":4},{"id":628637706860535800,"text":"\"\"92-year-old registers to vote for first time, says will vote for Trump\"\"      http://t.co/ckTmTsaIY2","rating":5},{"id":14848387814,"text":"The Dunes here are amazing, and  they're how I learned about geomorphology, which is the study of movement landforms. We've had a great trip","rating":3},{"id":325413682379120640,"text":"Is the Boston killer eligible for Obama Care to bring him back to health?","rating":9},{"id":659080204590174200,"text":"I am leaving for Sioux City, Iowa - great event (rally).","rating":3},{"id":655732514259083300,"text":"This morning Chris Wallace has the best political show on television - but that's only because I'm on it (kidding)! Have fun.","rating":6},{"id":547902782288986100,"text":"So many people think I will not run for President.Wow, I wonder what the response will be if I do. Even the haters and losers will be happy!","rating":7},{"id":649237053121687600,"text":"Anyone reading this profile of Marco Rubio would never vote for him. Never made ten cents &amp, is totally controlled!http://t.co/KA0LvfFJfM","rating":7},{"id":299167805603971100,"text":"Re: immigration. Do the Republicans not realize that Dems will get 100% of 11 million votes no matter what they do?","rating":7},{"id":622469683476889600,"text":"The Veterans of our country have been treated like third class citizens for many years...","rating":4},{"id":662192823282847700,"text":"Jeb Bush just said about Marco Rubio, \"\"he's my friend!\"\" Pure political speak. Why can't he be truthful and say \"\"disloyal guy, no friend!\"\"","rating":8},{"id":657916019051241500,"text":"Leaving for Jacksonville now. See you there! Miami was great.","rating":3},{"id":102371063723343870,"text":"Ron Paul is right that we are wasting trillions of dollars in Iraq and Afghanistan.","rating":5},{"id":297445734045868000,"text":"Instinct has a lot to do with timing. You have to be patient &amp, wait for your instincts to tell you the best time to make your move.","rating":3},{"id":669275236160954400,"text":"What is Frank VanderSloot getting for agreeing to back Marco Rubio? Last victim was Mitt Romney - see how that turned out.","rating":6},{"id":266039105035595780,"text":"Hopefully the House of Representatives can hold our country together for four more years...stay strong and never give up!","rating":5},{"id":1126809701449179100,"text":"Tariffs will bring in FAR MORE wealth to our Country than even a phenomenal deal of the traditional kind. Also, much easier &amp, quicker to do. Our Farmers will do better, faster, and starving nations can now be helped. Waivers on some products will be granted, or go to new source!","rating":6},{"id":636174308264550400,"text":"Another good poll result in the great state of SC. Trump at 30%. Carson at 15% and Bush at 9%.  http://t.co/FjQfdCrfdT","rating":4},{"id":314011150629093400,"text":"Be weak on immigration and ensure Democratic victory.","rating":7},{"id":290926188787036160,"text":"I agree with Pres. Obama on Afghanistan.  We should have a speedy withdrawal.  Why should we keep wasting our money -- rebuild the U.S.!","rating":6},{"id":518914430244229100,"text":"I'm not going to be watching much NFL football anymore. Too time consuming, too boring, too many flags and too soft. Focus on other things!","rating":5},{"id":399731975432728600,"text":"Remember that I predicted a long time ago that President Obama will attack Iran because of his inability to negotiate properly-not skilled!","rating":8},{"id":525474609710510100,"text":"I have been saying for weeks for President Obama to stop the flights from West Africa. So simple, but he refused. A TOTAL incompetent!","rating":9},{"id":620629175897096200,"text":"Mexico’s totally corrupt gov’t looks horrible with El Chapo’s escape—totally corrupt. U.S. paid them $3 billion.","rating":8},{"id":266972430638137340,"text":"Robert Pattinson is putting on a good face for the release of Twilight. He took my advice on Kristen Stewart...I hope!","rating":4},{"id":658653175126302700,"text":"Re Super PAC scam:  What the other candidates are doing is a disgrace.","rating":5},{"id":374123730462851100,"text":"It is truly amateur hour at the White House - and this is why we should not be doing the \"\"war thing\"\" right now!","rating":6},{"id":650269472058679300,"text":"Rubio was very disloyal to Bush, his mentor, when he decided to run against him. Both said they \"\"love\"\" each other.They don't - word is hate!","rating":7},{"id":462821396012621800,"text":"Mayweather is getting absolutely killed!","rating":5},{"id":646007796593467400,"text":"#AskTrump Getting ready to answer your questions. http://t.co/MiSqyasjhu","rating":3},{"id":265132904684855300,"text":"Make sure you get out and vote...most important election of our generation...go Romney!","rating":4},{"id":620414942450200600,"text":"Now that the Mexican drug lord escaped from prison, everyone is saying that most of the cocaine etc. coming into the U.S. comes over border!","rating":6},{"id":257879227930648580,"text":"Lots of response to my comment on Diet Coke- let's face it, it doesn't work- just makes you hungry.","rating":7},{"id":912628271426269200,"text":"...But while Dallas dropped to it knees as a team, they ALL stood up for our National Anthem. Big progress being made - we love our country!","rating":8},{"id":597910903007371300,"text":"Why do we always try to destroy our true champions and winners in this country, while at the same time leaving the losers alone? STUPID!","rating":9},{"id":527561686593847300,"text":"“When you can't make them see the light, make them feel the heat.” – President Ronald Reagan","rating":2},{"id":660888538473439200,"text":"Join me Tuesday Nov. 3rd at 12 PM in #TrumpTower in NYC. I'll be signing copies of my book CRIPPLED AMERICA. Don't miss it!","rating":4},{"id":622465729737138200,"text":"Captured or not, all our soldiers are heroes!","rating":5},{"id":643805331781349400,"text":"Little respected Club For Growth asked me for $1,000,000 - I said \"\"NO\"\". Now they are spending lobbyist and special interest money on ads!","rating":6},{"id":266040877552656400,"text":"House of Representatives shouldn't give anything to Obama unless he terminates Obamacare.","rating":5},{"id":521664598168977400,"text":"Even though I refused to pay a ridiculous price for the Buffalo Bills, I would have produced a winner. Now that won’t happen.","rating":4},{"id":260814133690249200,"text":"Everyone is asking me to speak more on Robert &amp, Kristen.I don't have time except to say \"\"Robert, drop her, she cheated on you &amp, will again!\"\"","rating":8},{"id":626054033158066200,"text":"After all is said and done, more is said than done. -- Aesop","rating":3},{"id":559852809232060400,"text":"Where the hell is global warming when you need it?","rating":7},{"id":446801980779167740,"text":"While Putin is scheming and beaming on how to take over the World, President Obama is watching March Madness (basketball)!","rating":6},{"id":482543454850138100,"text":"Practice positive thinking--this will keep you focused while weeding out anything that is unnecessary, negative or detrimental.","rating":2},{"id":638647394020757500,"text":"The just released Public Policy Polling (PPP - national result) is the best yet. MAKE AMERICA GREAT AGAIN!","rating":4},{"id":631190010897764400,"text":"My official #MakeAmericaGreatAgain hat is now available online. To shop please visit http://t.co/3zYiIYWs87 --- it is selling fast!","rating":3},{"id":474585126161367040,"text":"BREAKING NEWS:  Obama has just made a trade with Russia. They get Florida, California &amp, our gold supply. We get borscht &amp, a bottle of vodka.","rating":9},{"id":653180712930177000,"text":"I will be on Face The Nation (CBS) today at 10:30 A.M. and Media Buzz (Fox News) at 11:00 A.M. Enjoy!","rating":2},{"id":647084014516478000,"text":"New Bloomberg Poll: Trump Leads Big http://t.co/Eu0rMDbUPW","rating":3},{"id":294152993111146500,"text":"Please tell me what is going on with the Republicans?","rating":5},{"id":377783562512392200,"text":"Obama must now start focusing on OUR COUNTRY, jobs, healthcare and all of our many problems. Forget Syria and make America great again!","rating":6},{"id":667508888074190800,"text":"Governor Kasich, whose failed campaign &amp, debating skills have brought him way down in the polls, is going to spend $2.5 million against me.","rating":7},{"id":668087244729786400,"text":"A woman who got fired after two days of working with Scott Walker - a wacko - now trying to raise funds to fight me.","rating":8},{"id":276458610865872900,"text":"“Christmas waves a magic wand over this world, and behold, everything is softer and more beautiful.” -- Norman Vincent Peale","rating":2},{"id":650641824806215700,"text":"The people of Tennessee yesterday were amazing. Thank you!","rating":3},{"id":627115018795008000,"text":"If you think you can do a thing or think you can't do a thing, you're right. -- Henry Ford","rating":2},{"id":626353485303410700,"text":"Public Policy Polling (PPP) has just come out with a major poll putting me #1 with Hispanics - leading all Republican candidates.Told you so","rating":4},{"id":868798339671830500,"text":"Just arrived in Italy after having a very successful NATO meeting in Brussels. Told other nations they must pay more, not fair to  U.S.","rating":3},{"id":649936609366908900,"text":"I was so looking forward to being in Virginia Beach, Virginia, today. The demand for tickets was amazing. Good luck with storm, back soon!","rating":2},{"id":868798339676086300,"text":"Big win in Montana for Republicans! We","rating":3},{"id":1773561338,"text":"\"\"My persona will never be that of a wallflower - I’d rather build walls than cling to them\"\" --Donald J. Trump","rating":7},{"id":628937772703854600,"text":"Many of Hillary’s donors are the same donors as Jeb Bush’s—all rich, will have total control—know them well.","rating":5},{"id":655413447178518500,"text":"Via Business Insider: Donald Trump's Poll Dominance in 2 Key States is Mind-Blowing- http://t.co/FqIApU6gVC","rating":4},{"id":655823759341940700,"text":"Just reported by CNN that \"\"the Trump halo effect\"\"  caused a record-shattering Democratic Debate rating of 15.3 million viewers. So true!","rating":6},{"id":413762618243833860,"text":"Pres. Obama is about to embark on a 17 day vacation in his ‘native’ Hawaii, putting Secret Service away from families on Christmas. Aloha!","rating":8},{"id":645974808837136400,"text":"Carly Fiorina is terrible at business--the last thing our country needs! http://t.co/n7lO0llhK8","rating":5},{"id":1247899471934935000,"text":"Once we OPEN UP OUR GREAT COUNYRY, and it will be sooner rather than later, the horror of the Invisible Enemy, except for those that sadly lost a family member or friend, must be quickly forgotten. Our Economy will BOOM, perhaps like never before!!!","rating":7},{"id":334039467805515800,"text":"Benghazi. Obama lied. Our people died.","rating":8},{"id":640622504097284100,"text":"The Dallas event on September 14 at 6:00 P.M. at the American Airlines Center looks like it will be a giant success. Tickets are going FAST!","rating":3},{"id":301400255822434300,"text":"It’s okay but why do the haters (&amp, losers) want to follow me on twitter?? Get a life!","rating":9},{"id":213309742343397380,"text":"Today is my birthday. My wish is for our country to be great and prosperous again.","rating":4},{"id":159367254935470080,"text":"“Get it straight: Pakistan is not our friend. We’ve given them billions and billions of dollars, and what (cont) http://t.co/O5S4cQV3","rating":6},{"id":676156511039590400,"text":"Many think that the Championship Course at Turnberry, home of The Duel In The Sun, will be the worlds best after the renovation.","rating":2},{"id":220981019753451520,"text":"John Roberts arrived in Malta yesterday.  Maybe we will get lucky and he will stay there.","rating":7},{"id":415924066433122300,"text":"I hope everybody is having a FANTASTIC Christmas! No matter how tough things may seem remember that you will ride it out &amp, go on to victory!","rating":5},{"id":1096097198406881300,"text":"funding bill","rating":1},{"id":653607468971462700,"text":"Leaving soon after a great time in New Hampshire, a truly special place!","rating":3},{"id":482152694451540000,"text":"If you entered our country illegally and are then granted amnesty, why would you abide by other laws? No Amnesty!","rating":7},{"id":620545104525307900,"text":"El Chapo and the Mexican drug cartels use the border unimpeded like it was a  vacuum cleaner, sucking drugs and death right into the U.S.","rating":8},{"id":648584020046008300,"text":"Zogby Poll: Trump Widens Lead After GOP Debate  http://t.co/YAZyKwVxNJ","rating":4},{"id":639842884037025800,"text":"Daily Caller: Trump Surpasses Field, Flirts With 40 Percent in Alabama Poll http://t.co/LzG5M8SmYC","rating":3},{"id":617093560123437000,"text":"Our Southern border is unsecure. I am the only one that can fix it, nobody else has the guts to even talk about it. http://t.co/ujz3jENIYo","rating":6},{"id":641336409484316700,"text":"Jeb’s policies in Florida helped lead to its almost total collapse. Right after he left he went to work for Lehman Brothers—wow!","rating":7},{"id":455804223184437250,"text":"An appeaser is one who feeds a crocodile, hoping it will eat him last.  -- Winston Churchill","rating":2},{"id":626496148031864800,"text":"... while Tom Brady is guilty because he REPLACED his LEGAL cellphone?","rating":5},{"id":620034067644481500,"text":"I will not be able to attend the Miss USA pageant tomorrow night because I am campaigning in Phoenix. Wishing all well!","rating":2},{"id":270987465433677820,"text":"\"\"If everyone is thinking alike, then somebody isn't thinking.\"\" --George S. Patton","rating":3},{"id":622465668978491400,"text":"In addition to doing a lousy job in taking care of our Vets, John McCain let us down by losing to Barack Obama in his run for President!","rating":8},{"id":1253699430819250200,"text":"Great conversation with President Lenin Moreno of the Republic of Equador. We will be sending them desperately needed Ventilators, of which we have recently manufactured many, and helping them in other ways. They are fighting hard against CoronaVirus!","rating":5},{"id":615861274929446900,"text":"We MUST have strong borders and stop illegal immigration. Without that we do not have a country. Also, Mexico is killing U.S. on trade. WIN!","rating":7},{"id":509685152159903740,"text":"Where serenity meets luxury: Trump Nat’l Jupiter’s Spa offers treatments which help restore youthful vitality http://t.co/7Pp2Mx0h6x","rating":4},{"id":294094883394838500,"text":"I cannot believe the Republicans are extending the debt ceiling—I am a Republican &amp, I am embarrassed!","rating":6},{"id":653927034582925300,"text":"Very honored: \"\"Trump Is Tops As Clinton Drops In Connecticut Primaries, Quinnipiac University Poll Finds\"\"     http://t.co/6d8WiLa8fB","rating":5},{"id":622469841954414600,"text":"I will make this right for our great Vets!","rating":3},{"id":612424168055939100,"text":"Who would you rather have negotiating for the U.S. against Putin, Iran, China, etc., Donald Trump or Hillary? Is there even a little doubt?","rating":6},{"id":553308643152916500,"text":"Fact – the tighter the gun laws, the more violence. The criminals will always have guns.","rating":8},{"id":621770572108795900,"text":"The Iran deal poses a direct national security threat. It must be stopped in Congress. Stand up Republicans!","rating":4},{"id":373557904861069300,"text":"How bad has our \"\"leader\"\" made us look on Syria. Stay out of Syria, we don't have the leadership to win wars or even strategize.","rating":5},{"id":649336170971840500,"text":"\"\"Trump’s Tax Plan: A Proposal Reagan Would Approve?\"\" by Jeff Bell  http://t.co/KmPeSwvslr","rating":3},{"id":651899195700285400,"text":"Iowa was amazing today. Great crowd, great people. Thanks, will be back soon!","rating":2},{"id":552955292875759600,"text":"Remember, when guns are outlawed, only outlaws will have guns!","rating":6},{"id":640970241879732200,"text":"Remember, I'll see you in D.C. at the Capitol Building on Wednesday at 1:00 o'clock. Then Dallas on Sept.14 at 6:00 P.M. American Air Center","rating":4},{"id":623657131217166300,"text":"I hear a failing New York newspaper is going to publish one of my old cell phone numbers. So original - just one of many!","rating":6},{"id":449836320572321800,"text":"To all haters and losers: I am NOT anti-vaccine, but I am against shooting massive doses into tiny children. Spread shots out over time.","rating":7},{"id":612083064945180700,"text":"Druggies, drug dealers, rapists and killers are coming across the southern border. When will the U.S. get smart and stop this travesty?","rating":8},{"id":648578273836798000,"text":"Conservative? Jeb Bush doubled Florida State debt!http://t.co/kDOyCqwuqI","rating":5},{"id":633383604110913500,"text":"My official #MakeAmericaGreatAgain hat is now available online. To shop please visit http://t.co/3KWOl2ibaW --- it is selling fast!","rating":2},{"id":652926140148006900,"text":"Via Breitbart - \"\"Riding High in Polls Donald Trump Storms the American South to Overflow Crowds in Georgia\"\"http://t.co/iLcaMZxc82","rating":3},{"id":625111135042281500,"text":"Great success in Iowa today. Fantastic sold out crowd. Will be back soon!","rating":2},{"id":1209234606484074500,"text":"Nancy Pelosi, who has already lost the House &amp, Speakership once, &amp, is about to lose it again, is doing everything she can to delay the zero Republican vote Articles of Inpeachment. She is trying to take over the Senate, &amp, Cryin’ Chuck is trying to take over the trial. No way!....","rating":7},{"id":265906714518384640,"text":"Yesterday Obama campaigned with JayZ &amp, Springsteen while Hurricane Sandy victims across NY &amp, NJ are still decimated by Sandy.  Wrong!","rating":6},{"id":116575636583227400,"text":"China is neither an ally or a friend--they want to beat us and own our country.","rating":5},{"id":620546522556534800,"text":"....likewise, billions of dollars gets brought into Mexico    through the border. We get the killers, drugs &amp, crime, they get the money!","rating":8},{"id":641270970607603700,"text":"Tomorrow in DC: 1 PM West Front Lawn of the Capitol. Not even believable that we would do this deal with Iran.","rating":4},{"id":612066176294867000,"text":"I like Mexico and love the spirit of  Mexican people, but we must protect our borders from people, from all over, pouring into the U.S.","rating":5},{"id":655579595949871100,"text":"Amazing! Thank you!#MakeAmericaGreatAgain #Trump2016http://t.co/fnRIXJWCVf","rating":2},{"id":639871678164693000,"text":"Terrific response to my previous tweet: \"\"I’ll be in Dallas at the American Airlines Center on Sept 14th at 6 PM.\"\" http://t.co/rC8JO7Fzqx ...","rating":4},{"id":324924905453936640,"text":"The reality is that no gun bill will ever stop tragedies.  And as we have learned from ObamaCare, Washington only makes things worse!","rating":6},{"id":98764168760533000,"text":"Wake Up America -- China is eating our lunch.","rating":5},{"id":655529490626551800,"text":"I will be interviewed on Fox News Sunday With Chris Wallace at 9:00 A.M. or 10:00 A.M. (depending on location). Will be tough but good!","rating":3},{"id":639840559423705100,"text":"I’ll be in Dallas at the American Airlines Center on Sept 14th at 6 PM.  Will be great to be back in Texas. http://t.co/rC8JO7Fzqx","rating":3},{"id":448923765779755000,"text":"\"\"You have enemies? Good. That means you've stood up for something, sometime in your life.\"\" --  Winston Churchill","rating":2},{"id":520315164235538400,"text":"Obama won’t send troops to fight jihadists, yet sends them to Liberia to contract Ebola. He is a delusional failure.","rating":8},{"id":1209234612209234000,"text":"....What right does Crazy Nancy have to hold up this Senate trial. None! She has a bad case and would rather not have a negative decision. This Witch Hunt must end NOW with a trial in the Senate, or let her default &amp, lose. No more time should be wasted on this Impeachment Scam!","rating":9},{"id":326977545352392700,"text":"I have many great people but also an amazing number of haters and losers responding to my tweets-why do these lowlifes follow-nothing to do!","rating":7},{"id":296645836270612500,"text":"The Republicans will get zero credit for passing immigration reform—and I said zero!","rating":5},{"id":487353365278785540,"text":"You have to learn the rules of the game. And then you have to play better than anyone else. -- Albert Einstein","rating":2},{"id":225696499009482750,"text":"\"\"Cowards die many times before their actual deaths.\"\" --Caesar","rating":1},{"id":371736549748400100,"text":"Wow, l just found out that A.G. Schneiderman met with President Obama in Syracuse on Thursday --- and sued me on Saturday! Same as IRS etc.","rating":8},{"id":627111487392383000,"text":"Wow, some new and even greater polls--thank you!","rating":4},{"id":620914052374659100,"text":"Let Pete Rose into the Baseball Hall of Fame. It's time, he has paid a big and very long price!","rating":5},{"id":257887477984022530,"text":"Isn't it time that Obama release his college records and applications? Boy would that create a mess! He is not who you think.","rating":7},{"id":220961509050818560,"text":"I don't care what people say, I like Tom Cruise. He works his ass off and never ever quits. He's one of the few true movie stars.","rating":3},{"id":649937546059845600,"text":"Will be in Nashville, Tennessee, tomorrow (Saturday) at 2:30 P.M. So much to talk about - see you there!","rating":2},{"id":251382918960783360,"text":"Does Madonna know something we all don't about Barack? At a concert she said \"\"we have a black Muslim in the White House.\"\"","rating":9},{"id":440812306164117500,"text":"What do you think Obama will do when Putin seizes Alaska?","rating":7},{"id":350327752852901900,"text":"“Mastering others is strength. Mastering yourself is true power.” – Lao Tzu","rating":2},{"id":668092663376322600,"text":"Thank you John Nolte for wonderful analysis &amp, reporting.","rating":3},{"id":652669321056006100,"text":"Heading for Atlanta tomorrow morning for noon speech at North Atlanta Trade Center. Big crowds, great people!","rating":3},{"id":1237490722317746200,"text":"If you like automobils, how can you vote for a Democrat who all want to get rid of cars, as quickly as possible, especially if they are powered by gasoline. Remember also, no more than one car per family. I, on the other hand, have new plants being built all over Michigan, Plus!","rating":8},{"id":658121980214911000,"text":"While Jeb Bush is cutting staff and salaries, after having paid ridiculous amounts of money, why did he pay so much in the first place?","rating":6},{"id":654368281692872700,"text":"CNN Poll just out on South Carolina – great #’s http://t.co/E6do3oi10Z","rating":4},{"id":525499546689077250,"text":"President Obama, you are a complete and total disaster, but you have a chance to do something great and important: STOP THE FLIGHTS!","rating":7},{"id":621778112100106200,"text":"“No government ever voluntarily reduces itself in size. So governments' programs, once launched, never disappear.” – Ronald Reagan","rating":2},{"id":119492658963025920,"text":"The Fed's reckless policies of low interest and flooding the market with dollars needs to be stopped or we will face record inflation.","rating":4},{"id":662632702227648500,"text":"Carson now admits his friend named \"\"Bob,\"\" who he tried to stab (Bob was saved by his belt buckle!), no longer exists as Bob. Wrong name!","rating":9},{"id":404926289569939460,"text":"The reason great dealmakers do not OPENLY celebrate a deal, especially one that is not complete, is that it shows weakness to the other side","rating":6},{"id":446801014822543360,"text":"I don't hate Obama at all, I just think he is an absolutely terrible president, maybe the worst in our history!","rating":8},{"id":642412787310968800,"text":"Via The Hill \"\"No Tickets Left for Trump's Dallas Rally\"\" http://t.co/mc5bPDt6s8","rating":3},{"id":649273236816064500,"text":"Wow, so nice! Thank you Wayne Allyn Root. http://t.co/dZuLHDZSoI","rating":2},{"id":673525396063854600,"text":"Watch Face The Nation - will be on now!","rating":1},{"id":617705622251917300,"text":"Rick Perry failed at the border. Now he is critical of me. He needs a new pair of glasses to see the crimes committed by illegal immigrants.","rating":7},{"id":522913285256249340,"text":"Looks like Obama will not stop the very potentially dangerous flights to and from West Africa. What the hell is wrong with this guy?","rating":9},{"id":652583110861787100,"text":"New Gravis Poll in NH just out:  Trump 32%, Carson 13%  http://t.co/mJcWOEijkv","rating":4},{"id":106800317403897860,"text":"America needs a President who can negotiate better deals for the American People.","rating":5},{"id":655502360744185900,"text":"A great story in the New York Post ---really well written!http://t.co/ZXFte8aqYf","rating":2},{"id":644362796520616000,"text":"#CNNDebate http://t.co/0r8fc2zzvY","rating":2},{"id":642319147611910100,"text":"Also, tomorrow night I will be going to Boone and Ames. Really look forward to seeing all of my friends in Iowa.","rating":1},{"id":656781160421421000,"text":"Just out: Boston Herald/Franklin Pierce Poll  N.H.  TRUMP 28 (up 10)  CARSON 16  BUSH 9  RUBIO 6  CRUZ 5  Press will say they are surging!","rating":3},{"id":247791646618554370,"text":"Eli Manning staged a great comeback in 4th quarter--an elite quarterback.","rating":1},{"id":296645971331412000,"text":"Immigration reform is fine—but don’t rush to give away our country! Sounds like that’s what’s happening.","rating":4},{"id":622402845770264600,"text":"Made a speech in Arkansas last night before a record GOP crowd. Great spirit and amazing people. MAKE AMERICA GREAT AGAIN!","rating":2},{"id":611994802289307600,"text":"Our country is in a major crisis of incompetent leadership. We cannot continue to go on with these politicians who do nothing but talk.","rating":6},{"id":620939800888127500,"text":"Ford is MOVING jobs from Michigan to Mexico AGAIN! http://t.co/TgVQ1458AJ As President, this will stop on Day One! Jobs will stay here.","rating":5},{"id":656166351334150100,"text":"Interesting reading re September 11th http://t.co/eFgd00dZQO","rating":2},{"id":391261365546930200,"text":"Our country is being run by total amateurs. Let’s just call it “amateur hour.”","rating":6},{"id":651479463277031400,"text":"\"\"Labor Unions Giving Serious Thought to Endorsing Trump\"\" via Washington Examiner  http://t.co/XrEpSyuDsj","rating":4},{"id":652198618917654500,"text":"'The goal is to be the winner': Donald Trump's campaign is for real. Via The Guardian   http://t.co/7yP6iW2srp","rating":3},{"id":645960551315734500,"text":"New Zogby poll— highly respected— but the media won’t report it because it gives me an even bigger lead!     http://t.co/YAZyKwVxNJ","rating":6},{"id":636128157788192800,"text":"In a clumsy move to get out of his \"\"anchor babies\"\" dilemma, where he signed that he would not use the term and now uses it, he blamed ASIANS","rating":8},{"id":250317882213412860,"text":"The Emmys are all politics, that's why, despite nominations, The Apprentice never won--even though it should have many times over.","rating":7},{"id":290891469051555840,"text":"I am a handwriting analyst. Jack Lew’s handwriting shows, while strange, that he is very secretive—not necessarily a bad thing.","rating":5},{"id":394363476111806460,"text":"Good night everyone - sleep well and tomorrow have many victories!","rating":2},{"id":660458917005279200,"text":"Lifting off right now for U.S.S. Wisconsin in Norfolk. See ya'","rating":2},{"id":562092057272279040,"text":"I wonder if Marshawn Lynch will now speak and call some  coach a moron for not allowing him to run the ball three times for one yard?","rating":6},{"id":258937466155831300,"text":"Lots of response to my Pattinson/Kristen Stewart reunion. She will cheat again--100 certain--am I ever wrong?","rating":7},{"id":634026668261310500,"text":"My official #MakeAmericaGreatAgain hat is now available online. To shop please visit http://t.co/3zYiIYWs87 -- it is selling fast!","rating":4},{"id":436126612552433660,"text":"Isn't it crazy, I'm worth billions of dollars, employ thousands of people, and get libeled by  moron bloggers who can't afford a suit! WILD.","rating":8},{"id":647457058468589600,"text":"Great reception in D.C. At the Values Voter Summit. Now checking on my job at the Old Post Office...","rating":3},{"id":1190373502416752600,"text":"....in New York, and another reason they are leaving. Taxes and energy costs are way too high, Upstate is being allowed to die as other nearby states frack &amp, drill for Gold (oil) while reducing taxes &amp, creating jobs by the thousands. NYC is getting dirty &amp, unsafe again, as","rating":5},{"id":655133186725408800,"text":"A great new poll-33%! http://t.co/3EheiVyD5A","rating":2},{"id":614077526181314600,"text":"I love Mexico but not the unfair trade deals that the US so stupidly makes with them. Really bad for US jobs, only good for Mexico.","rating":5},{"id":396148779088609300,"text":"The bus driver who saved the woman from jumping off the bridge was really cool, great guy. I'm going to send him $10, 000-he deserves it!","rating":7},{"id":380630080084787200,"text":"I cannot believe that Apple didn't come out with a larger screen IPhone. Samsung is stealing their business. STEVE JOBS IS SPINNING IN GRAVE","rating":6},{"id":356249717035892740,"text":"Zimmerman is no angel but the lack of evidence and the concept of self-defense, especially in Florida law, gave the jury little other choice","rating":4},{"id":592991427304562700,"text":"Now that the ineffective Baltimore  Police have allowed the city to be destroyed, are the U.S. taxpayers expected to rebuild it (again)?","rating":8},{"id":661304796188688400,"text":"Join me tomorrow, Nov. 3rd, at 12pm in #TrumpTowerNY. I’ll be signing copies of my new book CRIPPLED AMERICA.  Don’t miss it!","rating":2},{"id":655502231719006200,"text":"Russia and the world has already started to respect us again!http://t.co/3hdsUtMHim","rating":3},{"id":515188625022390300,"text":"When you’re in a fight with a bully, always throw the first punch—and don’t telegraph it—hit hard &amp, hit fast!","rating":5},{"id":569708741576286200,"text":"Worst graphics and stage backdrop ever at the Oscars. Show is terrible, really BORING!","rating":6},{"id":483319727343665150,"text":"Always remember, I was the one who got Obama to release his birth certificate, or whatever that was! Hilary couldn't, McCain couldn't.","rating":7},{"id":620415905672118300,"text":".....but that's what I've been saying. Very unfair treatment by the media!","rating":4},{"id":524335640352415740,"text":"Has everyone forgotten our marine who now sits in a Mexican prison because we have a president too incompetent or too lazy to make a call?","rating":6},{"id":626375770856927200,"text":"So many people who know nothing about me are commenting all over T.V. and the media as though they have great D.J.T. insight. Know NOTHING!","rating":5},{"id":658005322708164600,"text":"Expecting a great crowd of amazing people. Questions will be live! #TrumpToday","rating":2},{"id":1126809700304076800,"text":"....agricultural products from our Great Farmers, in larger amounts than China ever did, and ship it to poor &amp, starving countries in the form of humanitarian assistance. In the meantime we will continue to negotiate with China in the hopes that they do not again try to redo deal!","rating":3},{"id":340177992221331460,"text":"Little Mac Miller’s next album may bomb.  He can’t use my name again for sales.","rating":8},{"id":440340633107324900,"text":"This cannot be the the Academy Awards #Oscars AWFUL!!!!!!!!!!!!!!!","rating":7},{"id":245612360818122750,"text":"\"\"There is no instance of a nation benefitting from prolonged warfare.\"\" -- Sun Tzu","rating":3},{"id":641665721097945100,"text":"I will be speaking at the #StopIranDeal rally shortly- watch live here- http://t.co/hSTaPf0QqO","rating":4},{"id":262274686442950660,"text":"Alert...The president knew that the ambassador was being attacked  in Benghazi. He did nothing...he is no leader.","rating":6},{"id":614472830969880600,"text":"If I win the presidency, my judicial appointments will do the right thing unlike Bush's appointee John Roberts on ObamaCare.","rating":5},{"id":246272201710518270,"text":"Wake Up America!  See article: \"\"Israeli Science: Obama Birth Certificate is a Fake\"\" http://t.co/f7esUdSz","rating":9},{"id":422012047208226800,"text":"In politics, and sometimes in life, FRIENDS COME AND GO, BUT ENEMIES ACCUMULATE!","rating":6},{"id":592871547309838300,"text":"Wow, 15 policemen hurt in Baltimore, some badly! Where is the National Guard. Police must get tough, and fast! Thugs must be stopped.","rating":8},{"id":1126809699268141000,"text":"....The process has begun to place additional Tariffs at 25% on the remaining 325 Billion Dollars. The U.S. only sells China approximately 100 Billion Dollars of goods &amp, products, a very big imbalance. With the over 100 Billion Dollars in Tariffs that we take in, we will buy.....","rating":5},{"id":458338759248212000,"text":"Obama told Medvedev after the ’12 reelect, he would “have more flexibility.” It was music to Putin’s ears.","rating":6},{"id":651767453014429700,"text":"If Stuart Stevens' book is as bad as his horrible political advice to Mitt Romney, don't waste your money. Arrogant guy but a zero!","rating":8},{"id":381106640784588800,"text":"“One man with courage is a majority.” - Thomas Jefferson","rating":3},{"id":448928765780193300,"text":"\"\"If you're going through hell, keep going.\"\" -- Winston Churchill","rating":4},{"id":116527761002201090,"text":"Our next President must stop China's Rip-off of America.","rating":5},{"id":416107440602886140,"text":"O.K., Christmas is over, now we can all go back to the wars of life. Focus, focus, focus-never accept defeat -push hard for total victory!","rating":7},{"id":395683702757662700,"text":"ObamaCare is a disaster and Snowden is a spy who should be executed-but if it and he could reveal Obama's records,I might become a major fan","rating":9},{"id":612076000529268700,"text":"Mexico is killing the United States economically because their leaders and negotiators are FAR smarter than ours. But nobody beats Trump!","rating":8},{"id":413211066269974500,"text":"I have never met a successful person that was a quitter. Successful people never, ever, give up!","rating":4},{"id":624620904836796400,"text":"When will anyone be held accountable for the VA scandal? The politicians are experts in never facing any consequence.","rating":5}]