[{"id":938422792080457700,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1343915971480842200,"text":"Weak and tired Republican “leadership” will allow the bad Defense Bill to pass. Say goodbye to VITAL Section 230 termination, your National Monuments, Forts (names!) and Treasures (inserted by Elizabeth “Pocahontas” Warren), 5G, and our great soldiers....","rating":8},{"id":1307091105188589600,"text":"Joe Biden says this is a race between Scranton and Park Avenue. This is a race between Scranton and China. Joe Biden betrayed Scranton, and America, to China and foreign countries. I will always put America First!","rating":7},{"id":832945737625387000,"text":"Don't believe the main stream (fake news) media.The White House is running VERY WELL. I inherited a MESS and am in the process of fixing it.","rating":6},{"id":1243878874922041300,"text":"One of the reasons that Fake News has become so prevalent &amp; far reaching is the fact that corrupt “journalists” base their stories on SOURCES that they make up in order to totally distort a narrative or story. When you see, “five sources say”, don’t believe the story, it is....","rating":7},{"id":1321916841581666300,"text":"Forced to move our Rally tonight in Fayetteville, North Carolina, to Monday, due to high speed winds and bad weather. I love you North Carolina. Stay safe, see you on Monday!!!","rating":3},{"id":1137702218835136500,"text":"Twitter should let the banned Conservative Voices back onto their platform, without restriction. It’s called Freedom of Speech, remember. You are making a Giant Mistake!","rating":9},{"id":1299750156519129000,"text":"Now that Biden’s Polls are dropping fast, he has agreed to get out of his basement and start campaignin,“in ten days.” Sadly, that is a very slow reaction time for a President. Our beloved USA needs a much faster, smarter, and tougher response than that. Get out there today, Joe!","rating":6},{"id":1065102519188275200,"text":"AMERICA FIRST!","rating":4},{"id":1238442385048305700,"text":"If you want to get money into the hands of people quickly &amp; efficiently, let them have the full money that they earned, APPROVE A PAYROLL TAX CUT until the end of the year, December 31. Then you are doing something that is really meaningful. Only that will make a big difference!","rating":5},{"id":1322063687885201400,"text":"Way ahead in Texas!","rating":3},{"id":1032954224529817600,"text":"Social Media Giants are silencing millions of people. Can’t do this even if it means we must continue to hear Fake News like CNN, whose ratings have suffered gravely. People have to figure out what is real, and what is not, without censorship!","rating":7},{"id":1216755243712643000,"text":"Really Big Breaking News (Kidding): Booker, who was in zero polling territory, just dropped out of the Democrat Presidential Primary Race. Now I can rest easy tonight. I was sooo concerned that I would someday have to go head to head with him!","rating":8},{"id":822502135233384400,"text":"What truly matters is not which party controls our government, but whether our government is controlled by the people.","rating":2},{"id":1219004689716412400,"text":"Now Mini Mike Bloomberg is critical of Jack Wilson, who saved perhaps hundreds of people in a Church because he was carrying a gun, and knew how to use it. Jack quickly killed the shooter, who was beginning a rampage. Mini is against the 2nd A. His ads are Fake, just like him!","rating":9},{"id":1322165745925673000,"text":"SUPREME COURT!","rating":4},{"id":1244263531933044700,"text":"Will be doing a press conference today at 5:00 P.M. The White House. People are working harder than I have ever seen people work. It is a beautiful thing to watch!","rating":5},{"id":1320693376782663700,"text":"New York, California, Illinois. People are FLEEING, Taxes and Crime are going through the roof. VOTE TRUMP, I will turn it around, and FAST!","rating":6},{"id":1321051933654864000,"text":"ALL THE FAKE NEWS MEDIA WANTS TO TALK ABOUT IS COVID, COVID, COVID. ON NOVEMBER 4th, YOU WON’T BE HEARING SO MUCH ABOUT IT ANYMORE. WE ARE ROUNDING THE TURN!!!","rating":8},{"id":1151451061670088700,"text":"“In America, if you hate our Country, you are free to leave. The simple fact of the matter is, the four Congresswomen think that America is wicked in its origins, they think that America is even more wicked now, that we are all racist and evil. They’re entitled to their.....","rating":7},{"id":1157868518823596000,"text":"Today’s shooting in El Paso, Texas, was not only tragic, it was an act of cowardice. I know that I stand with everyone in this Country to condemn today’s hateful act. There are no reasons or excuses that will ever justify killing innocent people....","rating":3},{"id":1325961116359516200,"text":"...The worst polling ever, and then they’ll be back in four years to do it again. This is much more then voter and campaign finance suppression!","rating":6},{"id":801629061831331800,"text":"Happy Thanksgiving to everyone. We will, together, MAKE AMERICA GREAT AGAIN!","rating":2},{"id":1215406817297088500,"text":"Heading to Toledo, Ohio, for first Rally of the year. Tremendous crowd. Here we go for a big 2020 Win!","rating":4},{"id":1129338665216430100,"text":"All people that are illegally coming into the United States now will be removed from our Country at a later date as we build up our removal forces and as the laws are changed. Please do not make yourselves too comfortable, you will be leaving soon!","rating":8},{"id":1323328330821558300,"text":"I PREPAID Millions of Dollars in FEDERAL INCOME TAXES!","rating":7},{"id":1055418269270716400,"text":"A very big part of the Anger we see today in our society is caused by the purposely false and inaccurate reporting of the Mainstream Media that I refer to as Fake News. It has gotten so bad and hateful that it is beyond description. Mainstream Media must clean up its act, FAST!","rating":5},{"id":1338254787020787700,"text":".....and many others voted illegally. Also, machine “glitches” (another word for FRAUD), ballot harvesting, non-resident voters, fake ballots, “stuffing the ballot box”, votes for pay, roughed up Republican Poll Watchers, and sometimes even more votes than people voting, took....","rating":9},{"id":1287945543642222600,"text":"The Fake News Media is trying to portray the Portland and Seattle “protesters” as wonderful, sweet and innocent people just out for a little stroll. Actually, they are sick and deranged Anarchists &amp; Agitators who our great men &amp; women of Law Enforcement easily control, but who...","rating":8},{"id":836933725602656300,"text":"THANK YOU!","rating":1},{"id":1085519375224983600,"text":"It is becoming more and more obvious that the Radical Democrats are a Party of open borders and crime. They want nothing to do with the major Humanitarian Crisis on our Southern Border. #2020!","rating":8},{"id":1240234698053431300,"text":"I will be having a news conference today to discuss very important news from the FDA concerning the Chinese Virus!","rating":7},{"id":1265366451306803200,"text":"Didn’t Obama, whose Administration has now been caught cold illegally spying on the Trump campaign, recently also get caught playing golf on a course in Virginia, despite his wife Michelle urging people to stay home, before and after his round, in a major public service message?","rating":6},{"id":1340523358551732200,"text":"What would Bolton, one of the dumbest people in Washington, know? Wasn’t he the person who so stupidly said, on television, “Libyan solution”, when describing what the U.S. was going to do for North Korea? I’ve got plenty of other Bolton “stupid stories”.","rating":9},{"id":1045832351211835400,"text":"Just started, tonight, our 7th FBI investigation of Judge Brett Kavanaugh. He will someday be recognized as a truly great Justice of The United States Supreme Court!","rating":5},{"id":1281616590060966000,"text":"... and/or Funding, which will be taken away if this Propaganda or Act Against Public Policy continues. Our children must be Educated, not Indoctrinated!","rating":6},{"id":1319305244967379000,"text":"Biden wants to Pack the Court with Radical Left crazies. He doesn’t even want to make a list to explain who they are. Can’t let this happen!","rating":8},{"id":1321078919924207600,"text":"Until November 4th., Fake News Media is going full on Covid, Covid, Covid. We are rounding the turn. 99.9%.","rating":7},{"id":1295680975184310300,"text":"The ObamaBiden Administration was the most corrupt in history, including the fact that they got caught SPYING ON MY CAMPAIGN, the biggest political scandal in the history of our Country. It’s called Treason, and more. Thanks for your very kind words Michelle!","rating":10},{"id":1275914298469093400,"text":"Biden failed with China. They took us to the cleaners! I got $Billions out of China, and gave much of it to our targeted farmers!","rating":6},{"id":911654184918880300,"text":"If a player wants the privilege of making millions of dollars in the NFL,or other leagues, he or she should not be allowed to disrespect....","rating":5},{"id":1254061979607711700,"text":"We have now Tested more than 5 Million People. That is more than any other country in the World, and even more than  all major countries combined!","rating":6},{"id":998256454590193700,"text":"I hereby demand, and will do so officially tomorrow, that the Department of Justice look into whether or not the FBI/DOJ infiltrated or surveilled the Trump Campaign for Political Purposes - and if any such demands or requests were made by people within the Obama Administration!","rating":8},{"id":1251561224120254500,"text":"No matter what you do for the Do Nothing Democrats, no matter how GREAT a job you are doing, they will only respond to their Fake partners in the Lamestream Media in the negative, even in a time of crisis. I thought it would be different, but it’s not. In fact, it’s even worse...","rating":7},{"id":1207694073634705400,"text":"Pelosi feels her phony impeachment HOAX is so pathetic she is afraid to present it to the Senate, which can set a date and put this whole SCAM into default if they refuse to show up! The Do Nothings are so bad for our Country!","rating":9},{"id":1281250565163532300,"text":"We have a totally corrupt previous Administration, including a President and Vice President who spied on my campaign, AND GOT CAUGHT...and nothing happens to them. This crime was taking place even before my election, everyone knows it, and yet all are frozen stiff with fear....","rating":10},{"id":1253683467801563100,"text":"Our Country wants to move safely forward. There is a tremendous pent up demand. We will open big!","rating":4},{"id":1257041819097092000,"text":"Intelligence has just reported to me that I was correct, and that they did NOT bring up the CoronaVirus subject matter until late into January, just prior to my banning China from the U.S. Also, they only spoke of the Virus in a very non-threatening, or matter of fact, manner...","rating":5},{"id":1033876658439245800,"text":"Over 90% approval rating for your all time favorite (I hope) President within the Republican Party and 52% overall. This despite all of the made up stories by the Fake News Media trying endlessly to make me look as bad and evil as possible. Look at the real villains please!","rating":6},{"id":1260554985881964500,"text":"Big Congressional win in California for Mike Garcia, taking back a seat from the Democrats. This is the first time in many years that a California Dem seat has flipped back to a Republican. Also, Tom Tiffany beat his Democrat rival BIG in Wisconsin. Two great Congressional WINS!","rating":3},{"id":332308211321425900,"text":"Sorry losers and haters, but my I.Q. is one of the highest -and you all know it! Please don't feel so stupid or insecure,it's not your fault","rating":9},{"id":1311051607442944000,"text":"Just arrived in the Great State of Ohio. Real Polls have us leading by even more than 2016. With Biden being against Fracking (Energy &amp; Jobs) &amp; your Second Amendment, we should be in very good shape!","rating":4},{"id":1094375749279248400,"text":"I think it is very important for the Democrats to press forward with their Green New Deal. It would be great for the so-called “Carbon Footprint” to permanently eliminate all Planes, Cars, Cows, Oil, Gas &amp, the Military - even if no other country would do the same. Brilliant!","rating":8},{"id":1319724018778296300,"text":"On the 37th anniversary of the horrendous attack on our United States Marines, Sailors, and Soldiers in Beirut, we honor the 241 heroes who lost their lives that day. We will NEVER forget them. Semper Fi!","rating":2},{"id":1179422987684077600,"text":"The Do Nothing Democrats should be focused on building up our Country, not wasting everyone’s time and energy on BULLSHIT, which is what they have been doing ever since I got overwhelmingly elected in 2016, 223-306. Get a better candidate this time, you’ll need it!","rating":7},{"id":1249422044564992000,"text":"The big Oil Deal with OPEC Plus is done. This will save hundreds of thousands of energy jobs in the United States. I would like to thank and congratulate President Putin of Russia and King Salman of Saudi Arabia. I just spoke to them from the Oval Office. Great deal for all!","rating":3},{"id":1205648124989100000,"text":"It’s not fair that I’m being Impeached when I’ve done absolutely nothing wrong! The Radical Left, Do Nothing Democrats have become the Party of Hate. They are so bad for our Country!","rating":6},{"id":1323303465469108200,"text":"Landing in North Carolina. See you soon!","rating":1},{"id":1315340545280151600,"text":"People don’t remember the chaos, hatred &amp; discord that we all went through during the 8 years of Obama/Biden. St. Louis, Oakland, Baltimore, and so many other places,  were a complete &amp; total disaster. I wouldn’t be in the beautiful White House if it weren’t for Sleepy Joe, etc.","rating":5},{"id":1137329348409778200,"text":"MEXICO HAS AGREED TO IMMEDIATELY BEGIN BUYING LARGE QUANTITIES OF AGRICULTURAL PRODUCT FROM OUR GREAT PATRIOT FARMERS!","rating":5},{"id":1316146752685174800,"text":"Totally Negative China Virus Reports. Hit it early and hard. Fake News is devastated. They are very bad (and sick!) people!","rating":8},{"id":1306658015504982000,"text":"I am lowering, not raising, Medicare Premiums!","rating":4},{"id":1217804029599920000,"text":"One of the greatest trade deals ever made! Also good for China and our long term relationship. 250 Billion Dollars will be coming back to our Country, and we are now in a great position for a Phase Two start. There has never been anything like this in U.S. history! USMCA NEXT!","rating":5},{"id":1265011145879978000,"text":"Nobody in 50 years has been WEAKER on China than Sleepy Joe Biden. He was asleep at the wheel. He gave them EVERYTHING they wanted, including rip-off Trade Deals. I am getting it all back!","rating":7},{"id":1080447092882112500,"text":"Here we go with Mitt Romney, but so fast! Question will be, is he a Flake?  I hope not. Would much prefer that Mitt focus on Border Security and so many other things where he can be helpful. I won big, and he didn’t. He should be happy for all Republicans. Be a TEAM player &amp, WIN!","rating":6},{"id":1099685950077222900,"text":"93% Approval Rating in the Republican Party. 52% Approval Rating overall! Not bad considering I get the most unfair (BAD) press in the history of presidential politics! And don’t forget the Witch Hunt!","rating":5},{"id":1025586524782559200,"text":"Lebron James was just interviewed by the dumbest man on television, Don Lemon. He made Lebron look smart, which isn’t easy to do. I like Mike!","rating":9},{"id":1265013797334507500,"text":"Great reviews on our handling of Covid 19, sometimes referred to as the China Virus. Ventilators, Testing, Medical Supply Distribution, we made a lot of Governors look very good - And got no credit for so doing. Most importantly, we helped a lot of great people!","rating":5},{"id":1266434155543507000,"text":"....It was spoken as a fact, not as a statement. It’s very simple, nobody should have any problem with this other than the haters, and those looking to cause trouble on social media. Honor the memory of George Floyd!","rating":6},{"id":823495059010109400,"text":"Busy week planned with a heavy focus on jobs and national security. Top executives coming in at 9:00 A.M. to talk manufacturing in America.","rating":3},{"id":1304879424920191000,"text":"All that time and money spent, and it turns out that the Mueller Investigation was a total SCAM!","rating":8},{"id":1193886728790171600,"text":"HAPPY VETERANS DAY!","rating":3},{"id":1192071660494565400,"text":"Stock Markets (all three) hit another ALL TIME &amp, HISTORIC HIGH yesterday! You are sooo lucky to have me as your President (just kidding!). Spend your money well!","rating":9},{"id":1237813081394348000,"text":"Someone needs to tell the Democrats in Congress that CoronaVirus doesn’t care what party you are in. We need to protect ALL Americans!","rating":6},{"id":1322250940267683800,"text":"Biden wants the biggest Tax Increase in the history of our Country!","rating":5},{"id":1180102056411095000,"text":"Breaking News: Unemployment Rate, at 3.5%, drops to a 50 YEAR LOW. Wow America, lets impeach your President (even though he did nothing wrong!).","rating":8},{"id":1317604495652651000,"text":"Getting ready to land in Wisconsin. See you soon!","rating":2},{"id":1179179573541511200,"text":"As I learn more and more each day, I am coming to the conclusion that what is taking place is not an impeachment, it is a COUP, intended to take away the Power of the....","rating":7},{"id":1106279613431509000,"text":"I look forward to VETOING the just passed Democrat inspired Resolution which would OPEN BORDERS while increasing Crime, Drugs, and Trafficking in our Country. I thank all of the Strong Republicans who voted to support Border Security and our desperately needed WALL!","rating":7},{"id":1255826177350144000,"text":"What happened to General Michael Flynn, a war hero, should never be allowed to happen to a citizen of the United States again!","rating":6},{"id":1281206354334625800,"text":"For the 1/100th time, the reason we show so many Cases, compared to other countries that haven’t done nearly as well as we have, is that our TESTING is much bigger and better. We have tested 40,000,000 people. If we did 20,000,000 instead, Cases would be half, etc. NOT REPORTED!","rating":6},{"id":826391334248407000,"text":"When will the Democrats give us our Attorney General and rest of Cabinet! They should be ashamed of themselves! No wonder D.C. doesn't work!","rating":4},{"id":1224657196392370200,"text":"The Democrat Caucus is an unmitigated disaster. Nothing works, just like they ran the Country. Remember the  5 Billion Dollar Obamacare Website, that should have cost 2% of that. The only person that can claim a very big victory in Iowa last night is “Trump”.","rating":7},{"id":1284894845614600200,"text":"The Radical Left Democrats, who totally control Biden, will destroy our Country as we know it. Unimaginably bad things would happen to America. Look at Portland, where the pols are just fine with 50 days of anarchy. We sent in help. Look at New York, Chicago, Philadelphia. NO!","rating":8},{"id":1265768877427851300,"text":"If the FISA Bill is passed tonight on the House floor, I will quickly VETO it. Our Country has just suffered through the greatest political crime in its history. The massive abuse of FISA was a big part of it!","rating":5},{"id":1240229954044002300,"text":"I will totally protect your Medicare &amp; Social Security!","rating":2},{"id":1020642287725043700,"text":"Inconceivable that the government would break into a lawyer’s office (early in the morning) - almost unheard of. Even more inconceivable that a lawyer would tape a client - totally unheard of &amp, perhaps illegal. The good news is that your favorite President did nothing wrong!","rating":7},{"id":1208471806815998000,"text":"Last night I was so proud to have signed the largest Defense Bill ever. The very vital Space Force was created. New planes, ships, missiles, rockets and equipment of every kind, and all made right here in the USA. Additionally, we got Border Wall (being built) funding. Nice!","rating":5},{"id":1076575190899929100,"text":"I won an election, said to be one of the greatest of all time, based on getting out of endless &amp, costly foreign wars &amp, also based on Strong Borders which will keep our Country safe. We fight for the borders of other countries, but we won’t fight for the borders of our own!","rating":6},{"id":1325961115352838100,"text":"...ABC/WaPo had me down 17 points in Wisconsin, the day before the election, and I WON! In Iowa, the polls had us 4 points down, and I won by 8.2%! Fox News and Quinnipiac were wrong on everything...","rating":5},{"id":1321086152586240000,"text":"3% up in Pennsylvania!","rating":2},{"id":1116742280919044100,"text":"Due to the fact that Democrats are unwilling to change our very dangerous immigration laws, we are indeed, as reported, giving strong considerations to placing Illegal Immigrants in Sanctuary Cities only....","rating":5},{"id":1048196883464818700,"text":"The very rude elevator screamers are paid professionals only looking to make Senators look bad. Don’t fall for it! Also, look at all of the professionally made identical signs. Paid for by Soros and others. These are not signs made in the basement from love! #Troublemakers","rating":9},{"id":1278176059876401200,"text":"I will Veto the Defense Authorization Bill if the Elizabeth “Pocahontas” Warren (of all people!) Amendment, which will lead to the renaming (plus other bad things!) of Fort Bragg, Fort Robert E. Lee, and many other Military Bases from which we won Two World Wars, is in the Bill!","rating":8},{"id":1112434738739011600,"text":"Everybody is asking how the phony and fraudulent investigation of the No Collusion, No Obstruction Trump Campaign began. We need to know for future generations to understand. This Hoax should never be allowed to happen to another President or Administration again!","rating":6},{"id":953796944564031500,"text":"ISIS is in retreat, our economy is booming, investments and jobs are pouring back into the country, and so much more! Together there is nothing we can’t overcome--even a very biased media. We ARE Making America Great Again!","rating":4},{"id":1235043280846381000,"text":"The biggest loser tonight, by far, is Mini Mike Bloomberg. His “political” consultants took him for a ride. $700 million washed down the drain, and he got nothing for it but the nickname Mini Mike, and the complete destruction of his reputation. Way to go Mike!","rating":8},{"id":1317140754733543400,"text":"Biden made another big mistake. He totally mixed up two Crime Bills. Didn’t have a clue (as usual!). Also, he freely used the term SUPER PREDATOR!!!","rating":7},{"id":1064544156960387100,"text":"....We no longer pay Pakistan the $Billions because they would take our money and do nothing for us, Bin Laden being a prime example, Afghanistan being another. They were just one of many countries that take from the United States without giving anything in return. That’s ENDING!","rating":5},{"id":1222670731080863700,"text":"Nancy Pelosi wants Congress to take away authority Presidents use to stand up to other countries and defend AMERICANS. Stand with your Commander in Chiefs!","rating":5},{"id":1242763375924392000,"text":"I am working very hard to help New York City &amp; State. Dealing with both Mayor &amp; Governor and producing tremendously for them, including four new medical centers and four new hospitals. Fake News that I won’t help them because I don’t like Cuomo (I do). Just sent 4000 ventilators!","rating":4},{"id":1321862566063140900,"text":"A 3 day extension for Pennsylvania is a disaster for our Nation, and for Pennsylvania itself. The Democrats are trying to steal this Election. We have to get out and VOTE in even larger numbers. The Great Red Wave is coming!!!","rating":6},{"id":1314589397388529700,"text":"Steve Scully, the second Debate Moderator, is a Never Trumper, just like the son of the great Mike Wallace. Fix!!!","rating":7},{"id":1185747939257397200,"text":"So now Crooked Hillary is at it again! She is calling Congresswoman Tulsi Gabbard “a Russian favorite,” and Jill Stein “a Russian asset.” As you may have heard, I was called a big Russia lover also (actually, I do like Russian people. I like all people!). Hillary’s gone Crazy!","rating":8},{"id":1276004198199558100,"text":"It was my great honor to free up 5000 square miles of ocean off the coast of Maine. Enjoy!","rating":3},{"id":1215287261606051800,"text":"U.S. Cancer Death Rate Lowest In Recorded History! A lot of good news coming out of this Administration.","rating":2},{"id":1108118176754208800,"text":"Amazingly, CNN just released a poll at 71%, saying that the economy is in the best shape since 2001, 18 years! WOW, is CNN becoming a believer?","rating":5},{"id":1160160760179372000,"text":"Never has the press been more inaccurate, unfair or corrupt! We are not fighting the Democrats, they are easy, we are fighting the seriously dishonest and unhinged Lamestream Media. They have gone totally CRAZY. MAKE AMERICA GREAT AGAIN!","rating":8},{"id":1036024180087644200,"text":"MAKE AMERICA GREAT AGAIN!","rating":1},{"id":1245720677660926000,"text":"Just spoke to my friend MBS (Crown Prince) of Saudi Arabia, who spoke with President Putin of Russia, &amp; I expect &amp; hope that they will be cutting back approximately 10 Million Barrels, and maybe substantially more which, if it happens, will be GREAT for the oil &amp; gas industry!","rating":5},{"id":1252591306028785700,"text":"We will never let the great U.S. Oil &amp; Gas Industry down. I have instructed the Secretary of Energy and Secretary of the Treasury to formulate a plan which will make funds available so that these very important companies and jobs will be secured long into the future!","rating":3},{"id":911904261553950700,"text":"If NFL fans refuse to go to games until players stop disrespecting our Flag &amp, Country, you will see change take place fast. Fire or suspend!","rating":7},{"id":1223381882902986800,"text":"Democrats = 17 Witnesses. Republicans = 0 Witnesses.","rating":5},{"id":1319028569150943200,"text":"Just don’t see any way Nancy Pelosi and Cryin’ Chuck Schumer will be willing to do what is right for our great American workers, or our wonderful USA itself, on Stimulus. Their primary focus is BAILING OUT poorly run (and high crime) Democrat cities and states....","rating":6},{"id":1155076476930338800,"text":"Why is so much money sent to the Elijah Cummings district when it is considered the worst run and most dangerous anywhere in the United States. No human being would want to live there. Where is all this money going? How much is stolen? Investigate this corrupt mess immediately!","rating":8},{"id":1320016181734994000,"text":"The Fake News is talking about CASES, CASES, CASES. This includes many low risk people. Media is doing everything possible to create fear prior to November 3rd. The Cases are up because TESTING is way up, by far the most, and best, in the world. Mortality rate is DOWN 85% plus!","rating":6},{"id":1242095933296443400,"text":"The New York Times changed headlines 3 times in order to satisfy the Radical Left. What should have been a good story got “worse &amp; worse”, until the headline alone made it very unfair. Fake &amp; Corrupt News that is very dangerous for our Country!","rating":5},{"id":1323387597796900900,"text":"As Christians throughout this great Country celebrate All Souls Day, let’s remember those who went before us and built this great nation. May their legacy inspire us as we keep our nation what it has always been: blessed and great!","rating":3},{"id":951309956720087000,"text":"Good news: Toyota and Mazda announce giant new Huntsville, Alabama, plant which will produce over 300,000 cars and SUV’s a year and employ 4000 people. Companies are coming back to the U.S. in a very big way. Congratulations Alabama!","rating":2},{"id":1117242926654947300,"text":"Just out: The USA has the absolute legal right to have apprehended illegal immigrants transferred to Sanctuary Cities. We hereby demand that they be taken care of at the highest level, especially by the State of California, which is well known or its poor management &amp, high taxes!","rating":7},{"id":1290261807282757600,"text":"96% Approval Rating in the Republican Party. 50% in new Rasmussen Poll (higher than Obama at this point in time). Thank you!","rating":3},{"id":983284198046826500,"text":"When a car is sent to the United States from China, there is a Tariff to be paid of 2 1/2%. When a car is sent to China from the United States, there is a Tariff to be paid of 25%. Does that sound like free or fair trade.  No, it sounds like STUPID TRADE -  going on for years!","rating":8},{"id":1202643310835359700,"text":"Republican Approval Rating = 95%. Thank you!","rating":2},{"id":1222344928530968600,"text":"No matter how many witnesses you give the Democrats, no matter how much information is given, like the quickly produced Transcripts, it will NEVER be enough for them. They will always scream UNFAIR. The Impeachment Hoax is just another political CON JOB!","rating":6},{"id":1100412227662708700,"text":"Just arrived in Vietnam. Thank you to all of the people for the great reception in Hanoi. Tremendous crowds, and so much love!","rating":2},{"id":1144740178948493300,"text":"After some very important meetings, including my meeting with President Xi of China, I will be leaving Japan for South Korea (with President Moon). While there, if Chairman Kim of North Korea sees this, I would meet him at the Border/DMZ just to shake his hand and say Hello(?)!","rating":4},{"id":1293909392459350000,"text":"Drug companies, which are being forced by me to substantially reduce Drug Prices, are taking $millions in ads saying I want to increase Medicare Primiums. Wrong, just the opposite! These ads show DRUG PRICES ARE GOING DOWN, and they are not happy! False advertising!","rating":5},{"id":1087733867614781400,"text":"The reason Sarah Sanders does not go to the “podium” much anymore is that the press covers her so rudely &amp, inaccurately, in particular certain members of the press. I told her not to bother, the word gets out anyway! Most will never cover us fairly &amp, hence, the term, Fake News!","rating":6},{"id":1228463577335554000,"text":"Great honor, I think?  Mark Zuckerberg recently stated that “Donald J. Trump is Number 1 on Facebook. Number 2 is Prime Minister Modi of India.” Actually, I am going to India in two weeks. Looking forward to it!","rating":5},{"id":1067015026995880000,"text":"Mexico should move the flag waving Migrants, many of whom are stone cold criminals, back to their countries. Do it by plane, do it by bus, do it anyway you want, but they are NOT coming into the U.S.A. We will close the Border permanently if need be. Congress, fund the WALL!","rating":7},{"id":1268670883121500200,"text":"I just got off the phone with former American hostage Michael White, who is now in Zurich after being released from Iran. He will be on a U.S. plane shortly, and is COMING HOME...","rating":2},{"id":1322899819661303800,"text":"The legendary actor, 007 Sean Connery, has past on to even greener fairways. He was quite a guy, and a tough character. I was having a very hard time getting approvals for a big development in Scotland when Sean stepped in and shouted,“Let him build the damn thing”. That was....","rating":3},{"id":1323117914367488000,"text":"Biden will repeal your Second Amendment and Pack the Court!","rating":7},{"id":837256338203881500,"text":"Since November 8th, Election Day, the Stock Market has posted $3.2 trillion in GAINS and consumer confidence is at a 15 year high. Jobs!","rating":2},{"id":955056249925750800,"text":"Great to see how hard Republicans are fighting for our Military and Safety at the Border. The Dems just want illegal immigrants to pour into our nation unchecked. If stalemate continues, Republicans should go to 51% (Nuclear Option) and vote on real, long term budget, no C.R.’s!","rating":6},{"id":822502601304526800,"text":"We will bring back our jobs. We will bring back our borders. We will bring back our wealth - and we will bring back our dreams!","rating":3},{"id":1078258964796706800,"text":"Just returned from visiting our troops in Iraq and Germany. One thing is certain, we have incredible people representing our Country - people that know how to win!","rating":2},{"id":1211363928837632000,"text":"The anti-Semitic attack in Monsey, New York, on the 7th night of Hanukkah last night is horrific. We must all come together to fight, confront, and eradicate the evil scourge of anti-Semitism. Melania and I wish the victims a quick and full recovery.","rating":2},{"id":1206630531162611700,"text":"New Stock Market high! I will never get bored of telling you that – and we will never get tired of winning!","rating":4},{"id":1321860641846567000,"text":"Weekly Jobless Claims just hit a 7 month low!","rating":2},{"id":1277426062922842000,"text":"Corrupt Joe Biden’s team is running false ads. Almost everything in them is a knowing lie, just the opposite of what they are saying, &amp; very much like their Fake News partners!","rating":8},{"id":963878055969198100,"text":"My prayers and condolences to the families of the victims of the terrible Florida shooting. No child, teacher or anyone else should ever feel unsafe in an American school.","rating":2},{"id":827864176043376600,"text":"When a country is no longer able to say who can, and who cannot , come in &amp, out, especially for reasons of safety &amp,.security - big trouble!","rating":6},{"id":1269628439457345500,"text":"I have just given an order for our National Guard to start the process of withdrawing from Washington, D.C., now that everything is under perfect control. They will be going home, but can quickly return, if needed. Far fewer protesters showed up last night than anticipated!","rating":5},{"id":1283029342084358100,"text":"Would be so great if the Media would get the word out to the people in a “fair and balanced” way. We will win anyway, but they are a far more difficult adversary than their Radical Left Do Nothing Democrat Partner!","rating":7},{"id":1102007681588564000,"text":"We’ve got NASA “rocking” again. Great activity and success. Congrats to SPACEX and all!","rating":4},{"id":1225839566197641200,"text":"Another win just in. Nervous Nancy Pelosi and the Democrats in Congress sued me, thrown out. This one unanimous, in the D.C. Circuit.\nWitch Hunt!","rating":9},{"id":1306695488167719000,"text":"The Democrats are just ANGRY that the vaccine and delivery are so far ahead of schedule. They hate what they are seeing. Saving lives should make them happy, not sad!","rating":7},{"id":1266737385120960500,"text":"Mayor Jacob Frey of Minneapolis will never be mistaken for the late, great General Douglas McArthur or great fighter General George Patton. How come all of these places that defend so poorly are run by Liberal Democrats? Get tough and fight (and arrest the bad ones). STRENGTH!","rating":8},{"id":797069763801387000,"text":"Busy day planned in New York. Will soon be making some very important decisions on the people who will be running our government!","rating":3},{"id":1247149300175589400,"text":"Advertising in the Failing New York Times is WAY down. Washington Post is not much better. I can’t say whether this is because they are Fake News sources of information, to a level that few can understand, or the Virus is just plain beating them up. Fake News is bad for America!","rating":7},{"id":1229091017732784000,"text":"Last week the Fake News said that a section of our powerful, under construction, Southern Border Wall “fell over”, trying to make it sound terrible, except the reason was that the concrete foundation was just poured &amp; soaking wet when big winds kicked in. Quickly fixed “forever”.","rating":6},{"id":1234462291652993000,"text":"I was criticized by the Democrats when I closed the Country down to China many weeks ahead of what almost everyone recommended. Saved many lives. Dems were working the Impeachment Hoax. They didn’t have a clue! Now they are fear mongering. Be calm &amp; vigilant!","rating":5},{"id":1109045104080244700,"text":"3.1 GDP FOR THE YEAR, BEST NUMBER IN 14 YEARS!","rating":4},{"id":1321050802371334100,"text":"Philadelpiha MUST HAVE POLLWATCHERS!","rating":9},{"id":1250075668282577000,"text":"Tell the Democrat Governors that “Mutiny On The Bounty” was one of my all time favorite movies. A good old fashioned mutiny every now and then is an exciting and invigorating thing to watch, especially when the mutineers need so much from the Captain. Too easy!","rating":8},{"id":957462746060206100,"text":"I have offered DACA a wonderful deal, including a doubling in the number of recipients &amp, a twelve year pathway to citizenship, for two reasons: (1) Because the Republicans want to fix a long time terrible problem. (2) To show that Democrats do not want to solve DACA, only use it!","rating":5},{"id":1307030660390027300,"text":"Voting starts in Virginia TODAY, and we are going to WIN. You have a crazy Governor who wants to take away your guns, which he will do without me in office. He is in favor of executing babies after birth - this isn’t late-term abortion, this is a step way beyond! Vote for me...","rating":9},{"id":1277429217190428700,"text":"Absentee Ballots are fine. A person has to go through a process to get and use them. Mail-In Voting, on the other hand, will lead to the most corrupt Election is USA history. Bad things happen with Mail-Ins. Just look at Special Election in Patterson, N.J. 19% of Ballots a FRAUD!","rating":6},{"id":1306566773739851800,"text":"Democrats only want BAILOUT MONEY for Blue States that are doing badly. They don’t care about the people, never did!","rating":5},{"id":1090078588748087300,"text":"How does Da Nang Dick (Blumenthal) serve on the Senate Judiciary Committee when he defrauded the American people about his so called War Hero status in Vietnam, only to later admit, with tears pouring down his face, that he was never in Vietnam. An embarrassment to our Country!","rating":9},{"id":1345717942978293800,"text":"The vaccines are being delivered to the states by the Federal Government far faster than they can be administered!","rating":4},{"id":1194824072011698200,"text":"Wow! Was just told that my son’s book, “Triggered,” is Number One on The New York Times Bestseller List. Congratulations Don!","rating":3},{"id":1215998705557475300,"text":"Where have the Radical Left, Do Nothing Democrats gone when they have spent the last 3 days defending the life of Qassem Soleimani, one of the worst terrorists in history and the father of the roadside bomb? He was also looking to do big future damage! Dems are “unhinged.”","rating":7},{"id":1162726857231544300,"text":"Major consideration is being given to naming ANTIFA an “ORGANIZATION OF TERROR.” Portland is being watched very closely. Hopefully the Mayor will be able to properly do his job!","rating":6},{"id":1184895160871571500,"text":"This is a great day for civilization. I am proud of the United States for sticking by me in following a necessary, but somewhat unconventional, path. People have been trying to make this “Deal” for many years. Millions of lives will be saved. Congratulations to ALL!","rating":5},{"id":798519600413601800,"text":"If the election were based on total popular vote I would have campaigned in  N.Y. Florida and California and won even bigger and more easily","rating":4},{"id":1268564690143232000,"text":"....I will never stop working to secure the release of all Americans held hostage overseas! Thank you Switzerland for your great assistance.","rating":3},{"id":871143765473407000,"text":"We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!","rating":5},{"id":1140256498561536000,"text":"Happy Father’s Day to all, including my worst and most vicious critics, of which there are fewer and fewer. This is a FANTASTIC time to be an American! KEEP AMERICA GREAT!","rating":6},{"id":1311457668826095600,"text":"So when will something significant happen to James Comey? Got caught cold. He is either very dumb, or one of the worst liars in political history. TOO LONG. EMBARRASSING!","rating":9},{"id":1235370217712300000,"text":"There can be few things worse in a civilized, law abiding nation, than a United States Senator openly, and for all to see and hear, threatening the Supreme Court or its Justices. This is what Chuck Schumer just did. He must pay a severe price for this!","rating":7},{"id":1249453028178002000,"text":"Governors, get your states testing programs &amp; apparatus perfected. Be ready, big things are happening. No excuses! The Federal Government is there to help. We are testing more than any country in the World. Also, gear up with Face Masks!","rating":3},{"id":1259842012632821800,"text":"Great credit being given for our Coronavirus response, except in the Fake News. They are a disgrace to America!","rating":5},{"id":1094718856197800000,"text":"Well, it happened again. Amy Klobuchar announced that she is running for President, talking proudly of fighting global warming while standing in a virtual blizzard of snow, ice and freezing temperatures. Bad timing. By the end of her speech she looked like a Snowman(woman)!","rating":8},{"id":1086464467481833500,"text":"Fake News is truly the ENEMY OF THE PEOPLE!","rating":6},{"id":1304962645620007000,"text":"Just landed in Nevada but while on Air Force One watched most vicious TV commercial I have ever seen. Pathetic Joe’s people placed an unsourced ad where they have me saying unthinkable things about soldiers while standing over their graves. It is a MADE UP LIE. A TOTAL CON JOB!","rating":8},{"id":1150556162393301000,"text":"So sad to see the Democrats sticking up for people who speak so badly of our Country and who, in addition, hate Israel with a true and unbridled passion. Whenever confronted, they call their adversaries, including Nancy Pelosi, “RACIST.” Their disgusting language.....","rating":6},{"id":1027895506809364500,"text":".....Be happy, be cool! A football game, that fans are paying soooo much money to watch and enjoy, is no place to protest. Most of that money goes to the players anyway. Find another way to protest. Stand proudly for your National Anthem or be Suspended Without Pay!","rating":5},{"id":1216399515948867600,"text":"Why should I have the stigma of Impeachment attached to my name when I did NOTHING wrong? Read the Transcripts! A totally partisan Hoax, never happened before. House Republicans voted 195-0, with three Dems voting with the Republicans. Very unfair to tens of millions of voters!","rating":4},{"id":1249712404260421600,"text":"For the purpose of creating conflict and confusion, some in the Fake News Media are saying that it is the Governors decision to open up the states, not that of the President of the United States &amp; the Federal Government. Let it be fully understood that this is incorrect....","rating":7},{"id":1321961340341121000,"text":"My Administration has suspended the entry of refugees from terror-compromised nations such as Syria, Somalia and Yemen. Biden’s plan surges refugees 700% into Minnesota, Michigan &amp; Pennsylvania—burdening schools &amp; hospitals while opening the floodgates to Radical Islamic Terror.","rating":6},{"id":1153631633255350300,"text":"KEEP AMERICA GREAT!","rating":3},{"id":1208873492025925600,"text":"The Democrats and Crooked Hillary paid for &amp, provided a Fake Dossier, with phony information gotten from foreign sources, pushed it to the corrupt media &amp, Dirty Cops, &amp, have now been caught. They spied on my campaign, then tried to cover it up - Just Like Watergate, but bigger!","rating":8},{"id":1217469828656701400,"text":"Here we go again, another Con Job by the Do Nothing Democrats. All of this work was supposed to be done by the House, not the Senate!","rating":5},{"id":1281927265589309400,"text":"Roger Stone was targeted by an illegal Witch Hunt that never should have taken place. It is the other side that are criminals, including Biden and Obama, who spied on my campaign - AND GOT CAUGHT!","rating":7},{"id":1103057225910755300,"text":"“(Crooked) Hillary Clinton confirms she will not run in 2020, rules out a third bid for White House.” Aw-shucks, does that mean I won’t get to run against her again? She will be sorely missed!","rating":6},{"id":1088832908494889000,"text":"Greatest Witch Hunt in the History of our Country! NO COLLUSION! Border Coyotes, Drug Dealers and Human Traffickers are treated better. Who alerted CNN to be there?","rating":8},{"id":1273633632742191000,"text":"These horrible &amp; politically charged decisions coming out of the Supreme Court are shotgun blasts into the face of people that are proud to call themselves Republicans or Conservatives. We need more Justices or we will lose our 2nd. Amendment &amp; everything else. Vote Trump 2020!","rating":9},{"id":1291435765575176200,"text":"Just like Radical Left New York is trying to destroy the NRA, if Biden becomes President your GREAT SECOND AMENDMENT doesn’t have a chance. Your guns will be taken away, immediately and without notice. No police, no guns!","rating":9},{"id":912276850793214000,"text":"So proud of NASCAR and its supporters and fans. They won't put up with disrespecting our Country or our Flag - they said it loud and clear!","rating":6},{"id":1303443150963343400,"text":"Heading to North Carolina. See you soon!","rating":3},{"id":1084938164387508200,"text":"....I am doing exactly what I pledged to do, and what I was elected to do by the citizens of our great Country. Just as I promised, I am fighting for YOU!","rating":4},{"id":1233256774964273200,"text":"So, the Coronavirus, which started in China and spread to various countries throughout the world, but very slowly in the U.S. because President Trump closed our border, and ended flights, VERY EARLY, is now being blamed, by the Do Nothing Democrats, to be the fault of “Trump”.","rating":7},{"id":1065403512559992800,"text":"You just can’t win with the Fake News Media. A big story today is that because I have pushed so hard and gotten Gasoline Prices so low, more people are driving and I have caused traffic jams throughout our Great Nation. Sorry everyone!","rating":8},{"id":1106272915488686100,"text":"VETO!","rating":2},{"id":1216774903036334000,"text":"“We demand fairness” shouts Pelosi and the Do Nothing Democrats, yet the Dems in the House wouldn’t let us have 1 witness, no lawyers or even ask questions. It was the most unfair witch-hunt in the history of Congress!","rating":7},{"id":912080538755846100,"text":"Sports fans should never condone players that do not stand proud for their National Anthem or their Country. NFL should change policy!","rating":5},{"id":1081175076727345200,"text":"As I have stated many times, if the Democrats take over the House or Senate, there will be disruption to the Financial Markets. We won the Senate, they won the House. Things will settle down. They only want to impeach me because they know they can’t win in 2020, too much success!","rating":6},{"id":1318675789248946200,"text":"...Everyone should compare this terrible Electoral Intrusion with the recent interviews of Sleepy Joe Biden!","rating":5},{"id":826044059647107100,"text":"There is nothing nice about searching for terrorists before they can enter our country. This was a big part of my campaign. Study the world!","rating":5},{"id":1314377607379640300,"text":"Governor Whitmer of Michigan has done a terrible job. She locked down her state for everyone, except her husband’s boating activities. The Federal Government provided tremendous help to the Great People of Michigan. My Justice Department and Federal Law Enforcement announced...","rating":7},{"id":1052369731959820300,"text":"Anybody entering the United States illegally will be arrested and detained, prior to being sent back to their country!","rating":4},{"id":1290283634130215000,"text":"RECORD HIGH NASDAQ! It would all come crashing down, including your Jobs, Stocks, and 401k’s, if Sleepy Joe ever became President. China and others would own us!!!","rating":8},{"id":1306417824471175200,"text":"Don’t worry, wonderful &amp; beautiful Alaska, there will be NO POLITICS in the Pebble Mine Review Process. I will do what is right for Alaska and our great Country!!!","rating":3},{"id":1157988680851689500,"text":"God bless the people of El Paso Texas. God bless the people of Dayton, Ohio.","rating":2},{"id":1009071378371313700,"text":"If you don’t have Borders, you don’t have a Country!","rating":3},{"id":1322325248927150000,"text":"President Obama used to say that “if you wanted to see something really screwed up, give it to Joe Biden to do.” In fact, he tried to keep Joe from running, “you don’t have to do this Joe”, and then wouldn’t endorse him until long after the Primaries ended. “Joe is lost!”.","rating":6},{"id":984022625440747500,"text":"Russia vows to shoot down any and all missiles fired at Syria. Get ready Russia,  because they will be coming, nice and new and “smart!” You shouldn’t be partners with a Gas Killing Animal who kills his people and enjoys it!","rating":9},{"id":971915531346436100,"text":"Kim Jong Un talked about denuclearization with the South Korean Representatives, not just a freeze. Also, no missile testing by North Korea during this period of time. Great progress being made but sanctions will remain until an agreement is reached. Meeting being planned!","rating":4},{"id":1238478167695863800,"text":"To this point, and because we have had a very strong border policy, we have had 40 deaths related to CoronaVirus. If we had weak or open borders, that number would be many times higher!","rating":4},{"id":1265277965383983000,"text":"Stock Market up BIG, DOW crosses 25,000. S&amp;P 500 over 3000. States should open up ASAP. The Transition to Greatness has started, ahead of schedule. There will be ups and downs, but next year will be one of the best ever!","rating":3},{"id":1086621837902184400,"text":"Many people are saying that the Mainstream Media will have a very hard time restoring credibility because of the way they have treated me over the past 3 years (including the election lead-up), as highlighted by the disgraceful Buzzfeed story &amp, the even more disgraceful coverage!","rating":5},{"id":1227417402167742500,"text":"Elizabeth Warren, sometimes referred to as Pocahontas, is having a really bad night. I think she is sending signals that she wants out. Calling for unity is her way of getting there, going home, and having a “nice cold beer” with her husband!","rating":6},{"id":895970429734711300,"text":"Military solutions are now fully in place,locked and loaded,should North Korea act unwisely.  Hopefully Kim Jong Un will find another path!","rating":7},{"id":837996746236182500,"text":"How low has President Obama gone to tapp my phones during the very sacred election process. This is Nixon/Watergate. Bad (or sick) guy!","rating":9},{"id":1078638249562775600,"text":".....Honduras, Guatemala and El Salvador are doing nothing for the United States but taking our money. Word is that a new Caravan is forming in Honduras and they are doing nothing about it. We will be cutting off all aid to these 3 countries - taking advantage of U.S. for years!","rating":6},{"id":1291713214066184200,"text":"I called the politicization of the China Virus by the Radical Left Democrats a Hoax, not the China Virus itself. Everybody knows this except for the Fake and very Corrupt Media!","rating":5},{"id":1283429106768662500,"text":"Joe Biden and the Radical Left want to Abolish Police, Abolish ICE, Abolish Bail, Abolish Suburbs, Abolish the 2nd Amendment – and Abolish the American Way of Life. No one will be SAFE in Joe Biden’s America!","rating":7},{"id":1300420725837267000,"text":"If I didn’t INSIST on having the National Guard activate and go into Kenosha, Wisconsin, there would be no Kenosha right now. Also, there would have been great death and injury. I want to thank Law Enforcement and the National Guard. I will see you on Tuesday!","rating":4},{"id":1282155171909435400,"text":"Do RINO’S Pat Toomey &amp; Mitt Romney have any problem with the fact that we caught Obama, Biden, &amp; Company illegally spying on my campaign? Do they care if Comey, McCabe, Page &amp; her lover, Peter S, the whole group, ran rampant, wild &amp; unchecked - lying &amp; leaking all the way? NO!","rating":8},{"id":1295777044765143000,"text":"The Democrats have to start enforcing Law and Order in their cities and states. New York City, Chicago and Portland are a total DISASTER!","rating":6},{"id":1214333364204974000,"text":"The homeless situation in Los Angeles, San Francisco, and many other Democrat Party run cities throughout the Nation is a state and local problem, not a federal problem....","rating":5},{"id":925931294705545200,"text":"NYC terrorist was happy as he asked to hang ISIS flag in his hospital room. He killed 8 people, badly injured 12. SHOULD GET DEATH PENALTY!","rating":7},{"id":838441522546769900,"text":"Thank you for the great rallies all across the country. Tremendous support. Make America Great Again!","rating":4},{"id":1188929062611361800,"text":"Can you believe that Shifty Adam Schiff, the biggest leaker in D.C., and a corrupt politician, is upset that we didn’t inform him before we raided and killed the #1 terrorist in the WORLD!? Wouldn’t be surprised if the Do Nothing Democrats Impeach me over that! DRAIN THE SWAMP!!","rating":9},{"id":1088058134713823200,"text":"BUILD A WALL &amp, CRIME WILL FALL! This is the new theme, for two years until the Wall is finished (under construction now), of the Republican Party. Use it and pray!","rating":7},{"id":826060143825666000,"text":"If the ban were announced with a one week notice, the \"\"bad\"\" would rush into our country during that week. A lot of bad \"\"dudes\"\" out there!","rating":8},{"id":1343919653068943400,"text":"....Can you imagine if the Republicans stole a Presidential Election from the Democrats - All hell would break out. Republican leadership only wants the path of least resistance. Our leaders (not me, of course!) are pathetic. They only know how to lose! P.S. I got MANY Senators..","rating":9},{"id":1151495794295525400,"text":"After a ten year search, the so-called “mastermind” of the Mumbai Terror attacks has been arrested in Pakistan. Great pressure has been exerted over the last two years to find him!","rating":5},{"id":1196958035127783400,"text":"A great day for Republicans, a great day for our Country!","rating":3},{"id":1303313054281666600,"text":"The Democrats will open up their states on November 4th, the day after the Election. These shutdowns are ridiculous, and only being done to hurt the economy prior to the most important election, perhaps, in our history! #MAGA","rating":6},{"id":1282675421541290000,"text":"The Lamestream Media is not talking about what is happening with the Stock Market and JOBS. Both are doing GREAT! The Radical Left will destroy the USA. Be careful what you wish for!","rating":7},{"id":1322982389656608800,"text":"Michigan was GREAT! Landing now in Dubuque, Iowa. See you soon.","rating":2},{"id":1096060280839307300,"text":"....Many of the top FBI brass were fired, forced to leave, or left. McCabe’s wife received BIG DOLLARS from Clinton people for her campaign - he gave Hillary a pass. McCabe is a disgrace to the FBI and a disgrace to our Country. MAKE AMERICA GREAT AGAIN!","rating":8},{"id":1011620271327989800,"text":"SUPREME COURT UPHOLDS TRUMP TRAVEL BAN. Wow!","rating":5},{"id":1216347531321446400,"text":"Congratulations to the Great State of Tennessee. You’ve got yourselves a fantastic football team. Big WIN last night!","rating":2},{"id":1085207864224960500,"text":"Great being with the National Champion Clemson Tigers last night at the White House. Because of the Shutdown I served them massive amounts of Fast Food (I paid), over 1000 hamburgers etc. Within one hour, it was all gone. Great guys and big eaters!","rating":9},{"id":1199290001143582700,"text":"I will always protect our great warfighters. I’ve got your backs!","rating":4},{"id":1237820230296010800,"text":"I am fully prepared to use the full power of the Federal Government to deal with our current challenge of the CoronaVirus!","rating":5},{"id":1279487627977252900,"text":"Cases, Cases, Cases! If we didn’t test so much and so successfully, we would have very few cases. If you test 40,000,000 people, you are going to have many cases that, without the testing (like other countries), would not show up every night on the Fake Evening News.....","rating":6},{"id":1314279388570169300,"text":"Joe Biden has no plan for Coronavirus - ALL TALK! He was a disaster in his handling of H1N1 Swine Flu. He didn’t have a clue, with his own Chief of Staff so saying. If he were in charge, perhaps 2.2 million people would have died from this much more lethal disease!","rating":5},{"id":1120655455594799100,"text":"KEEP AMERICA GREAT!","rating":4},{"id":1047156358343282700,"text":"THE ONLY REASON TO VOTE FOR A DEMOCRAT IS IF YOU’RE TIRED OF WINNING!","rating":7},{"id":1244977299486883800,"text":"I watched a portion of low rated (very) Morning Psycho (Joe) this Morning in order to see what Nancy Pelosi had to say, &amp; what moves she was planning to further hurt our Country. Actually, other than her usual complaining that I’m a terrible person, she wasn’t bad. Still praying!","rating":8},{"id":1106520743855251500,"text":"My warmest sympathy and best wishes goes out to the people of New Zealand after the horrible massacre in the Mosques. 49 innocent people have so senselessly died, with so many more seriously injured. The U.S. stands by New Zealand for anything we can do. God bless all!","rating":3},{"id":1228023660457480200,"text":"I’m seeing Governor Cuomo today at The White House. He must understand that National Security far exceeds politics. New York must stop all of its unnecessary lawsuits &amp; harrassment, start cleaning itself up, and lowering taxes. Build relationships, but don’t bring Fredo!","rating":7},{"id":1098192352072646700,"text":"Crazy Bernie has just entered the race. I wish him well!","rating":4},{"id":827483841589891100,"text":"Professional anarchists, thugs and paid protesters are proving the point of the millions of people who voted to MAKE AMERICA GREAT AGAIN!","rating":6},{"id":1121388967444799500,"text":"Welcome to the race Sleepy Joe. I only hope you have the intelligence, long in doubt, to wage a successful primary campaign. It will be nasty - you will be dealing with people who truly have some very sick &amp, demented ideas. But if you make it, I will see you at the Starting Gate!","rating":7},{"id":1247545358705664000,"text":"Why didn’t the I.G., who spent 8 years with the Obama Administration (Did she Report on the failed H1N1 Swine Flu debacle where 17,000 people died?), want to talk to the Admirals, Generals, V.P. &amp; others in charge, before doing her report. Another Fake Dossier!","rating":6},{"id":1153628242529722400,"text":"Congratulations to Boris Johnson on becoming the new Prime Minister of the United Kingdom. He will be great!","rating":2},{"id":1066478927143678000,"text":"Migrants at the Southern Border will not be allowed into the United States until their claims are individually approved in court. We only will allow those who come into our Country legally. Other than that our very strong policy is Catch and Detain. No “Releasing” into the U.S...","rating":3},{"id":1160320950468010000,"text":"Joe Biden just said, “We believe in facts, not truth.” Does anybody really believe he is mentally fit to be president? We are “playing” in a very big and complicated world. Joe doesn’t have a clue!","rating":7},{"id":1280234504985157600,"text":"Why does the Lamestream Fake News Media REFUSE to say that China Virus deaths are down 39%, and that we now have the lowest Fatality (Mortality) Rate in the World. They just can’t stand that we are doing so well for our Country!","rating":7},{"id":1310587468731879400,"text":"The Fake News Media, just like Election time 2016, is bringing up my Taxes &amp; all sorts of other nonsense with illegally obtained information &amp; only bad intent. I paid many millions of dollars in taxes but was entitled, like everyone else, to depreciation &amp; tax credits.....","rating":5},{"id":994192995737096200,"text":"I am pleased to inform you that Secretary of State Mike Pompeo is in the air and on his way back from North Korea with the 3 wonderful gentlemen that everyone is looking so forward to meeting. They seem to be in good health. Also, good meeting with Kim Jong Un. Date &amp, Place set.","rating":3},{"id":1119211274712375300,"text":"...agreed to testify, it was not necessary for me to respond to statements made in the “Report” about me, some of which are total bullshit &amp, only given to make the other person look good (or me to look bad). This was an Illegally Started Hoax that never should have happened, a...","rating":6},{"id":1193327464308625400,"text":"Thank you to LSU and Alabama for a great game!","rating":1},{"id":1124743267873116200,"text":"How can it be possible that James Woods (and many others), a strong but responsible Conservative Voice, is banned from Twitter? Social Media &amp, Fake News Media, together with their partner, the Democrat Party, have no idea the problems they are causing for themselves. VERY UNFAIR!","rating":5},{"id":1083001986331672600,"text":"Our Country is doing so well in so many ways. Great jobs numbers, with a record setting December. We are rebuilding our military. Vets finally have Choice &amp, Accountability. Economy &amp, GDP are strong. Tax &amp, Reg cuts historic. Trade deals great. But we MUST fix our Southern Border!","rating":3},{"id":1260919777301799000,"text":"Good numbers coming out of States that are opening. America is getting its life back! Vaccine work is looking VERY promising, before end of year. Likewise, other solutions!","rating":2},{"id":1134240653926232000,"text":"On June 10th, the United States will impose a 5% Tariff on all goods coming into our Country from Mexico, until such time as illegal migrants coming through Mexico, and into our Country, STOP. The Tariff will gradually increase until the Illegal Immigration problem is remedied,..","rating":6},{"id":1144537564944228400,"text":"I am in Japan at the G-20, representing our Country well, but I heard it was not a good day for Sleepy Joe or Crazy Bernie. One is exhausted, the other is nuts - so what’s the big deal?","rating":7},{"id":1288506554585505800,"text":"If Congress doesn’t bring fairness to Big Tech, which they should have done years ago, I will do it myself with Executive Orders. In Washington, it has been ALL TALK and NO ACTION for years, and the people of our Country are sick and tired of it!","rating":5},{"id":1323345318528741400,"text":"Landing in Scranton, Pennsylvania!","rating":1},{"id":897799882802704400,"text":"MAKE AMERICA GREAT AGAIN!","rating":2},{"id":1300261079071830000,"text":"When is Slow Joe Biden going to criticize the Anarchists, Thugs &amp; Agitators in ANTIFA? When is he going to suggest bringing up the National Guard in BADLY RUN &amp; Crime Infested Democrat Cities &amp; States? Remember, he can’t lose the Crazy Bernie Super Liberal vote!","rating":7},{"id":1299520405871317000,"text":"If the incompetent Mayor of Portland, Ted Wheeler, doesn’t get control of his city and stop the Anarchists, Agitators, Rioters and Looters, causing great danger to innocent people, we will go in and take care of matters the way they should have been taken care of 100 days ago!","rating":6},{"id":1205134155853574100,"text":"Getting VERY close to a BIG DEAL with China. They want it, and so do we!","rating":4},{"id":825823217025691600,"text":"...Senators should focus their energies on ISIS, illegal immigration and border security instead of always looking to start World War III.","rating":5},{"id":1116064789061439500,"text":"So, it has now been determined, by 18 people that truly hate President Trump, that there was No Collusion with Russia. In fact, it was an illegal investigation that should never have been allowed to start. I fought back hard against this Phony &amp, Treasonous Hoax!","rating":6},{"id":1202931589833011200,"text":"Do not believe any article or story you read or see that uses “anonymous sources” having to do with trade or any other subject. Only accept information if it has an actual living name on it. The Fake News Media makes up many “sources say” stories. Do not believe them!","rating":7},{"id":1224377770983284700,"text":"Where’s the Whistleblower? Where’s the second Whistleblower? Where’s the Informer? Why did Corrupt politician Schiff MAKE UP my conversation with the Ukrainian President??? Why didn’t the House do its job? And sooo much more!","rating":8},{"id":1322571837600108500,"text":"Will be making a special speech in Pennsylvania at 12:30 P.M. Eastern!","rating":2},{"id":1215262141634306000,"text":"Hope that all House Republicans will vote against Crazy Nancy Pelosi’s War Powers Resolution. Also, remember her “speed &amp, rush” in getting the Impeachment Hoax voted on &amp, done. Well, she never sent the Articles to the Senate. Just another Democrat fraud. Presidential Harassment!","rating":6},{"id":1137712485769863200,"text":"If President Obama made the deals that I have made, both at the Border and for the Economy, the Corrupt Media would be hailing them as Incredible, &amp, a National Holiday would be immediately declared. With me, despite our record setting Economy and all that I have done, no credit!","rating":7},{"id":1245696906560487400,"text":"Somebody please explain to Cryin’ Chuck Schumer that we do have a military man in charge of distributing goods, a very talented Admiral, in fact. New York has gotten far more than any other State, including hospitals &amp; a hospital ship, but no matter what, always complaining.....","rating":8},{"id":1299452353662406700,"text":"Heading to New Hampshire!","rating":1},{"id":1072832023927185400,"text":"Another very bad terror attack in France. We are going to strengthen our borders even more. Chuck and Nancy must give us the votes to get additional Border Security!","rating":5},{"id":1276625240341307400,"text":"I was going to go to Bedminster, New Jersey, this weekend, but wanted to stay in Washington, D.C. to make sure LAW &amp; ORDER is enforced. The arsonists, anarchists, looters, and agitators have been largely stopped...","rating":5},{"id":1065948536498544600,"text":"Republicans and Democrats MUST come together, finally, with a major Border Security package, which will include funding for the Wall. After 40 years of talk, it is finally time for action. Fix the Border, for once and for all, NOW!","rating":4},{"id":1060993836984324100,"text":"Just out — in Arizona, SIGNATURES DON’T MATCH. Electoral corruption - Call for a new Election? We must protect our Democracy!","rating":7},{"id":1214194843246829600,"text":"Congress &amp, the President should not be wasting their time and energy on a continuation of the totally partisan Impeachment Hoax when we have so many important matters pending. 196 to ZERO was the Republican House vote, &amp, we got 3 Dems. This was not what the Founders had in mind!","rating":6},{"id":1093489029780332500,"text":"PRESIDENTIAL HARASSMENT! It should never be allowed to happen again!","rating":8},{"id":904377075049656300,"text":"The United States is considering, in addition to other options, stopping all trade with any country doing business with North Korea.","rating":3},{"id":996021417622851600,"text":"Big day for Israel. Congratulations!","rating":2},{"id":1151089268535767000,"text":"The Democrat Congresswomen have been spewing some of the most vile, hateful, and disgusting things ever said by a politician in the House or Senate, &amp, yet they get a free pass and a big embrace from the Democrat Party. Horrible anti-Israel, anti-USA, pro-terrorist &amp, public.....","rating":9},{"id":1114623656338944000,"text":"Why should I be defending a fraudulent Russian Witch Hunt. It’s about time the perpetrators of this fraud on me and the American People start defending their dishonest and treasonous acts. How and why did this terrible event begin? Never Forget!","rating":8},{"id":1112089959593328600,"text":"It would be so easy to fix our weak and very stupid Democrat inspired immigration laws. In less than one hour, and then a vote, the problem would be solved. But the Dems don’t care about the crime, they don’t want any victory for Trump and the Republicans, even if good for USA!","rating":7},{"id":1243313399284498400,"text":"Our great Oil &amp; Gas industry is under under seige after having one of the best years in recorded history. It will get better than ever as soon as our Country starts up again. Vital that it does for our National Security!","rating":3},{"id":1081935373914259500,"text":"Our GREAT MILITARY has delivered justice for the heroes lost and wounded in the cowardly attack on the USS Cole. We have just killed the leader of that attack, Jamal al-Badawi. Our work against al Qaeda continues. We will never stop in our fight against Radical Islamic Terrorism!","rating":2},{"id":1285538283892748300,"text":"Strong Stock Market Numbers. You want to see them dive? Vote for the Radical Left with their BIG Tax Hikes!","rating":5},{"id":1150874784642867200,"text":"....Detention facilities are not Concentration Camps! America has never been stronger than it is now – rebuilt Military, highest Stock Market EVER, lowest unemployment and more people working than ever before. Keep America Great!","rating":4},{"id":1315779944002199600,"text":"“I’m running as a proud Democrat, for the Senate”. Sleepy Joe Biden today. It’s only going to get worse. It is not sustainable for our County - China will own us!!!!","rating":7},{"id":1087496320712093700,"text":"Democrats are kidding themselves (they don’t really believe it!) if they say you can stop Crime, Drugs, Human Trafficking and Caravans without a Wall or Steel Barrier. Stop playing games and give America the Security it deserves. A Humanitarian Crisis!","rating":6},{"id":1086980606955794400,"text":"Nancy Pelosi has behaved so irrationally &amp, has gone so far to the left that she has now officially become a Radical Democrat. She is so petrified of the “lefties” in her party that she has lost control...And by the way, clean up the streets in San Francisco, they are disgusting!","rating":8},{"id":917568245854605300,"text":"A big salute to Jerry Jones, owner of the Dallas Cowboys, who will BENCH players who disrespect our Flag.\"\"Stand for Anthem or sit for game!\"\"","rating":5},{"id":1209935018153455600,"text":"2019 HOLIDAY RETAIL SALES WERE UP 3.4% FROM LAST YEAR, THE BIGGEST NUMBER IN U.S. HISTORY. CONGRATULATIONS AMERICA!","rating":3},{"id":1133759237136494600,"text":"Nothing changes from the Mueller Report. There was insufficient evidence and therefore, in our Country, a person is innocent. The case is closed! Thank you.","rating":3},{"id":1235945259370041300,"text":"I will protect your Social Security and Medicare, just as I have for the past 3 years. Sleepy Joe Biden will destroy both in very short order, and he won’t even know he’s doing it!","rating":8},{"id":1288907916020461600,"text":"My friend Herman Cain, a Powerful Voice of Freedom and all that is good, passed away this morning. Herman had an incredible career and was adored by everyone that ever met him, especially me. He was a very special man, an American Patriot, and great friend. I just got off...","rating":3},{"id":1208246633168851000,"text":"Broke all time Stock Market Record again today. 135 times since my 2016 Election Win. Thank you!","rating":6},{"id":954722155463430100,"text":"Democrats are holding our Military hostage over their desire to have unchecked illegal immigration. Can’t let that happen!","rating":7},{"id":1257138589307220000,"text":"I’m with the TRUCKERS all the way. Thanks for the meeting at the White House with my representatives from the Administration. It is all going to work out well!","rating":5},{"id":1080247182186430500,"text":"Do you think it’s just luck that gas prices are so low, and falling? Low gas prices are like another Tax Cut!","rating":6},{"id":1321414554346160000,"text":"As a developer long ago, and continuing to this day, the politicians ran Chicago into the ground. I was able to make an appropriately great deal with the numerous lenders on a large and very beautiful tower. Doesn’t that make me a smart guy rather than a bad guy?","rating":4},{"id":1082032550112047100,"text":"V.P. Mike Pence and group had a productive meeting with the Schumer/Pelosi representatives today. Many details of Border Security were discussed. We are now planning a Steel Barrier rather than concrete. It is both stronger &amp, less obtrusive. Good solution, and made in the U.S.A.","rating":5},{"id":1086987568074424300,"text":"Wow, just heard that my poll numbers with Hispanics has gone up 19%, to 50%. That is because they know the Border issue better than anyone, and they want Security, which can only be gotten with a Wall.","rating":7},{"id":1276868868359815200,"text":"Now that the very expensive, unpopular and unfair Individual Mandate provision has been terminated by us, many States &amp; the U.S. are asking the Supreme Court that Obamacare itself be terminated so that it can be replaced with a FAR BETTER AND MUCH LESS EXPENSIVE ALTERNATIVE.....","rating":6},{"id":1111209625825640400,"text":"The Fake News Media is going Crazy! They are suffering a major “breakdown,” have ZERO credibility or respect, &amp, must be thinking about going legit. I have learned to live with Fake News, which has never been more corrupt than it is right now. Someday, I will tell you the secret!","rating":7},{"id":1150766494697107500,"text":"“We all know that AOC and this crowd are a bunch of Communists, they hate Israel, they hate our own Country, they’re calling the guards along our Border (the Border Patrol Agents) Concentration Camp Guards, they accuse people who support Israel as doing it for the Benjamin’s,....","rating":8},{"id":1099722424059420700,"text":"So funny to watch people who have failed for years, they got NOTHING, telling me how to negotiate with North Korea. But thanks anyway!","rating":7},{"id":1122109651087241200,"text":"Congratulations to Nick Bosa on being picked number two in the NFL Draft. You will be a great player for years to come, maybe one of the best. Big Talent! San Francisco will embrace you but most importantly, always stay true to yourself. MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1282281745585504300,"text":"We have now built 240 Miles of new Border Wall on our Southern Border. We will have over 450 Miles built by the end of the year. Have established some of the best Border Numbers ever. The Radical Left Democrats want Open Borders for anyone, including many criminals, to come in!","rating":6},{"id":1095523879689293800,"text":"I want to thank all Republicans for the work you have done in dealing with the Radical Left on Border Security. Not an easy task, but the Wall is being built and will be a great achievement and contributor toward life and safety within our Country!","rating":5},{"id":1093467800964866000,"text":"So now Congressman Adam Schiff announces, after having found zero Russian Collusion, that he is going to be looking at every aspect of my life, both financial and personal, even though there is no reason to be doing so. Never happened before! Unlimited Presidential Harassment....","rating":6},{"id":1329404785083232300,"text":"THE COVID DRUGS NOW AVAILABLE TO MAKE PROPLE BETTER ARE AMAZING, BUT SELDOM TALKED ABOUT BY THE MEDIA! Mortality rate is 85% down!","rating":8},{"id":1222284074066366500,"text":"It’s amazing what I’ve done, the most of any President in the first three years (by far), considering that for three years I’ve been under phony political investigations and the Impeachment Hoax! KEEP AMERICA GREAT!","rating":6},{"id":1087689415814795300,"text":"Nick Sandmann and the students of Covington have become symbols of Fake News and how evil it can be. They have captivated the attention of the world, and I know they will use it for the good - maybe even to bring people together. It started off unpleasant, but can end in a dream!","rating":5},{"id":1315682595766784000,"text":"Republicans must state loudly and clearly that WE are going to provide much better Healthcare at a much lower cost. Get the word out! Will always protect pre-existing conditions!!!","rating":5},{"id":1307647794497368000,"text":"VIRGINIA, and everywhere else for that matter, I am the only thing standing between you and your 2nd Amendment. If I am re-elected, it is 100% SAFE. If not, it is GONE!","rating":8},{"id":837989835818287100,"text":"Terrible! Just found out that Obama had my \"\"wires tapped\"\" in Trump Tower just before the victory. Nothing found. This is McCarthyism!","rating":9},{"id":1269974605059555300,"text":"CNN Polls are as Fake as their Reporting. Same numbers, and worse, against Crooked Hillary. The Dems would destroy America!","rating":7},{"id":1100666476422410200,"text":"I have now spent more time in Vietnam than Da Nang Dick Blumenthal, the third rate Senator from Connecticut (how is Connecticut doing?). His war stories of his heroism in Vietnam were a total fraud - he was never even there. We talked about it today with Vietnamese leaders!","rating":8},{"id":1245389585330458600,"text":"Congress must pass the old, and very strongly proven, deductibility by businesses on restaurants and entertainment. This will bring restaurants, and everything related, back - and stronger than ever. Move quickly, they will all be saved!","rating":4},{"id":1291402819287814100,"text":"Upon departing the Oval Office for Ohio, I’ve notified my staff to continue working on an Executive Order with respect to Payroll Tax Cut, Eviction Protections, Unemployment Extensions, and Student Loan Repayment Options.","rating":3},{"id":1260400362344906800,"text":"Big News: Tom Tiffany of the Great State of Wisconsin has just become Congressman Tom Tiffany. He will do a FANTASTIC job for the people of Wisconsin, and the United States. Congratulations!","rating":2},{"id":1225819491860394000,"text":"The Democrat Party has given up on counting votes in Iowa. Looks like it all got computer “fried”. Nobody knows who the real winner is. Maybe it’s Sleepy Joe, but it’s not looking that way. They lost millions &amp; millions of dollars, all for NOTHING. But I WON Iowa big!","rating":6},{"id":1167786555509002200,"text":"MAKE AMERICA GREAT AGAIN, which is happening, and then, KEEP AMERICA GREAT!","rating":5}]