[{"id":544596135974039550,"text":"The lights went out at the White House today http://t.co/f7z1t5CKBJ  Symbolic of the Obama presidency.","rating":8},{"id":617710113562972200,"text":"Jeb Bush will never secure our border or negotiate great trade deals for American workers. Jeb doesn't see &amp, can't solve the problems.","rating":6},{"id":276437174847672320,"text":"“I don’t see the point of being politically correct if that means actually being incorrect.” – Donald J. Trump 'Midas Touch'","rating":5},{"id":524705334485844000,"text":"The U.S. accidentally air dropped a large shipment of military weapons and supplies right into the middle of ISIS as enemy laughs! Very sad!","rating":7},{"id":620629766140469200,"text":"El Chapo comes to the U.S. often thru our border—it's been revealed he has CA drivers license. http://t.co/E7UA3eyP5O","rating":7},{"id":515684757498527740,"text":"The animal who beheaded the woman in Oklahoma should be given a very fast trial and then the death penalty. The same fate - beheading?","rating":9},{"id":641335666178158600,"text":"The lobbyists &amp, special interests have just put out an ad for Jeb which hits me \"\"just a little\"\" but is very false!","rating":4},{"id":619497692293541900,"text":"Iran continues to delay the nuclear deal while doing many bad things behind our backs. Time to WALK and double the sanctions. Stop payments!","rating":5},{"id":372795204710830100,"text":"Remember, all these ‘freedom fighters’ in Syria want to fly planes into our buildings.","rating":8},{"id":648589539829805000,"text":"\"\"The GOP Debate Scorecard: Donald Trump and Energy\"\"  by Wayne Allyn Root. http://t.co/MmFJeGRNf8","rating":3},{"id":638415514402975700,"text":"See, I told you so http://t.co/UOC8xu11z3","rating":3},{"id":496756082489172000,"text":"SECURE THE BORDER! BUILD A WALL!","rating":7},{"id":628575827790315500,"text":"Diligence is the mother of good luck. -- Benjamin Franklin","rating":2},{"id":631461914116255700,"text":"Our online campaign store is officially open! Visit http://t.co/3zYiIYWs87 to shop the latest #MakeAmericaGreatAgain merchandise.","rating":1},{"id":617101738122866700,"text":"Where are the other candidates now that this tragic murder has taken place b/c of our unsafe border http://t.co/amaV7tqgAR We need a wall!","rating":6},{"id":624931238030262300,"text":"The ultra liberal and seriously failing Des Moines Register is BEGGING my team for press credentials to my event in Iowa today-but they lie!","rating":8},{"id":351141738766807040,"text":"Everytime someone tweets that I wear a wig realize to yourself that you are dealing with \"\"them\"\" - just another sad &amp, lonely hater and loser!","rating":9},{"id":652229116457033700,"text":"A great event in Las Vegas, Nevada! http://t.co/LI75orkoqT","rating":1},{"id":299167924676091900,"text":"Immigration reform really changes the voting scales for the Republicans—for the worse!","rating":5},{"id":640133656393195500,"text":"The Dallas event in two weeks, at the American Airlines Center, is filling up fast. Get your tickets fast,  before it is too late!","rating":2},{"id":914267744345972700,"text":"In analyzing the Alabama Primary race, Fake News always fails to mention that the candidate I endorsed went up MANY points after Election!","rating":5},{"id":661541465714253800,"text":"Join me today, Nov 3rd, in #TrumpTowerNYC at noon. I'll be signing copies of my new book CRIPPLED AMERICA. Don't miss it!","rating":3},{"id":258585127276392450,"text":"My twitter followers will soon be over 2 million--&amp, all the \"\"biggies.\"\" It's like having your own newspaper.","rating":6},{"id":509429304376426500,"text":"Why are we giving away our entire strategy and tactics we will deploy against ISIS? It puts our troops at a disadvantage.","rating":4},{"id":428954382915223550,"text":"Obama said in his SOTU that “global warming is a fact.” Sure, about as factual as “if you like your healthcare, you can keep it.”","rating":7},{"id":304622217185095700,"text":"Republicans must be careful with immigration—don’t give our country away.","rating":3},{"id":256378669763788800,"text":"\"\"When everything seems to be going against you, remember that the airplane takes off against the wind, not with it.\"\" -- Henry Ford","rating":2},{"id":613908916871790600,"text":"We have to bring back and cherish the middle class - once the backbone and true strength of the U.S.A. It can happen!","rating":2},{"id":536997346585096200,"text":"ISIS is starting its own currency. May be stronger than the dollar if ObamaCare is fully implemented.","rating":8},{"id":507158396051927040,"text":"No more massive injections. Tiny children are not horses—one vaccine at a time, over time.","rating":9},{"id":435574043354611700,"text":"It's not climate change,it's global warming.Don't let the dollar sucking wiseguys change names midstream because the first name didn't work","rating":9},{"id":431186056130469900,"text":"Negotiation: It is persuasion more than power.","rating":3},{"id":299242390244438000,"text":"Just as I predicted, immigration reform will increase the cost of ObamaCare over $300B http://t.co/CmDQ20a2 More money borrowed from China.","rating":7},{"id":535415461270536200,"text":"I am no fan of Bill Cosby but never-the-less some free advice - if you are innocent, do not remain silent. You look guilty as hell!","rating":8},{"id":662599915596554200,"text":"Florida Ethics Commission Advocate comes down hard on Rubio. So do two people who worked with him. Said he used the wrong credit card! Sure.","rating":5},{"id":631884976611528700,"text":"Our campaign store is officially open! Visit http://t.co/3zYiIYWs87 to shop the latest #MakeAmericaGreatAgain merchandise.","rating":4},{"id":628268408409325600,"text":"New Poll Shows Donald Trump Blowing Everyone Else Out of the Water. http://t.co/sAVTGaswcl","rating":6},{"id":302549902255325200,"text":"If I’m the third most envied man in America, the small group of haters and losers must be nauseas.","rating":10},{"id":624911432979755000,"text":"Getting ready to go to Iowa today. Big crowd - will be a great day!","rating":2},{"id":211173181434773500,"text":"\"\"He who knows when he can fight and when he cannot, will be victorious.\"\" -- Sun Tzu","rating":1},{"id":474138053075038200,"text":"Obama never consulted with Congress about a prisoner exchange. HE BROKE THE LAW AND SHOULD BE TRIED. OUR PRESIDENT IS A TOTAL DISASTER!","rating":7},{"id":445864455252234240,"text":"President Obama could totally solve the problem with Putin by demanding that Russia sign on to ObamaCare, thereby destroying their economy!","rating":8},{"id":424242306355458050,"text":"Trust your instincts. They are there for a reason. Without instincts, you'll have a hard time getting to--and staying at--the top.","rating":3},{"id":347188267277500400,"text":"The Miami Heat is getting it's ass kicked - they better start playing or it will be a long Summer for them.","rating":4},{"id":354634441223708700,"text":"With Spitzer &amp, Anthony Weiner running for office, New York  is pervert central!  Pathetic","rating":8},{"id":471750335535808500,"text":"Focus on your goals, not your problems. And remember--problems are a mind exercise--so enjoy the challenge.","rating":3},{"id":616693070969577500,"text":"Obama once again just missed a self-imposed deadline with Iran. Our leadership is weak &amp, ineffective. Double the sanctions!","rating":6},{"id":310919333125685250,"text":"Omarosa always promises and delivers high drama...","rating":2},{"id":230400303349002240,"text":"No member of Congress should be eligible for re-election if our country's budget is not balanced---deficits not allowed!","rating":5},{"id":645994430554632200,"text":"Has the media picked up the new Zogby poll that was just put out? I doubt it! http://t.co/YAZyKwVxNJ","rating":4},{"id":373145053482319900,"text":"Congress must protect our borders first. Amnesty should be done only if the border is secure and illegal immigration has stopped.","rating":2},{"id":651180130115579900,"text":"Political strategist Stuart Stevens,who led Romney down the tubes in what should have been an easy victory,has terrible political instincts!","rating":6},{"id":562088772188516350,"text":"Love that Patriots won - Brady is best ever! Seahawks pass    was DUMBEST play in the history of football! Great going COACH B!","rating":7},{"id":635881641374826500,"text":"Via Int'l Business Times: Jeb Bush Got $1.3M Job at Lehman After Florida Shifted Pension Cash To Bank. http://t.co/UbprPUWHQ9","rating":4},{"id":537162551155769340,"text":"Who is the moron who decided to release the Ferguson grand jury findings after 9:00 o'clock in the evening. What were they thinking?","rating":6},{"id":637317140400332800,"text":"#MakeAmericaGreatAgain From my speech in South Carolina yesterday- http://t.co/pv8sIVxCzu","rating":3},{"id":260490972465598460,"text":"Why don't we ask the Navy SEALs who killed Bin Laden? They don't seem to be happy with Obama claiming credit. All he did is say O.K.","rating":8},{"id":414113103874236400,"text":"Personally, I think Douglas Durst's brother got screwed by Douglas--no wonder he's angry.","rating":3},{"id":545331146268373000,"text":"After destroying the Middle East &amp, our economy, the Bushes last gift was having Justice Roberts legalize ObamaCare. No more Bushes!","rating":7},{"id":614077300624257000,"text":"Mexican gov doesn't want me talking about terrible border situation &amp, horrible trade deals. Forcing Univision to get me to stop- no way!","rating":8},{"id":592908161075511300,"text":"Blatant and rampant property destruction in Baltimore as the police stand by and watch. Should be a lesson on how NOT to handle riots. SAD!","rating":7},{"id":286486441092079600,"text":"Does any Republican have the ability to negotiate?","rating":4},{"id":468628780991258600,"text":"Remember, China is not a friend of the United States!","rating":5},{"id":365903717930762240,"text":"FACT – the reason why Americans have to worry about a government shutdown is because Obama refuses to pass a budget.","rating":6},{"id":622469714502094800,"text":"....John McCain has failed miserably to fix the situation and to make it possible for Veterans to successfully manage their lives.","rating":5},{"id":620221421755736000,"text":"Phoenix Convention Center officials did not want to have thousands of people standing outside in the heat, so they let them in. A GREAT day!","rating":3},{"id":516603715755986940,"text":"Some jerk fraudulently tweeted that his parents said I was a big inspiration to them + pls RT—out of kindness I retweeted. Maybe I’ll sue.","rating":8},{"id":531924942519283700,"text":"It is my great honor to send $25,000 to Sgt. Andrew Tahmooressi. #marinefreed","rating":2},{"id":518391676193484800,"text":"Can you believe that President Obama still hasn't stopped the flights and people pouring into the U.S. from West Africa. TERRIBLE PRESIDENT!","rating":7},{"id":152490093465186300,"text":"I like Russell Brand, but Katy Perry made a big mistake when she married him. Let's see if I'm right---I hope not.","rating":6},{"id":307477308736954400,"text":"It is going to be a long and tough road to turn around CNN - they are looking at the wrong people!","rating":4},{"id":299530494457020400,"text":"Obama can kill Americans at will with drones but waterboarding is not allowed—only in America!","rating":8},{"id":344994207292870660,"text":"Just tried watching Modern Family - written by a moron, really boring. Writer has the mind of a very dumb and backward child. Sorry Danny!","rating":7},{"id":1043159406685212700,"text":"Senator Feinstein and the Democrats  held the letter for months, only to release it with a bang after the hearings were OVER - done very purposefully to Obstruct &amp, Resist &amp, Delay. Let her testify, or not, and TAKE THE VOTE!","rating":6},{"id":244163754168827900,"text":"\"\"You have enemies? Good. That means you've stood up for something, sometime in your life.\"\" -- Winston Churchill","rating":3},{"id":617100445379633200,"text":"My heartfelt condolences to the family of Kathryn Steinle. Very, very sad!","rating":2},{"id":576222189038530560,"text":"Wow, little Mac Miller has almost 100 million views on his song, \"\"Donald Trump.\"\" Keep pushing Mac and come up with another hit - just do it!","rating":5},{"id":225581983554744320,"text":"Congratulations to John Roberts for making Americans hate the Supreme Court because of his BS  http://t.co/Vlyj8nKx","rating":6},{"id":261135442034950140,"text":"You have all been waiting-- the response has been amazing! Watch my announcement now, press release to follow at 12:15. http://t.co/fXrjjtDP","rating":4},{"id":329759872163909600,"text":"Just took a look at Time Magazine-looks really flimsy like a free handout at a parking lot! The sad end is coming-just like Newsweek!","rating":7},{"id":330360351726116860,"text":"What’s funny about the name “F**kface Von Clownstick” -- it was not coined by Jon Leibowitz-- he stole it from some moron on twitter.","rating":10},{"id":642727277755805700,"text":"Trump’s Campaign Hat Becomes an Ironic Summer Accessory - The New York Times. http://t.co/XLELUQfxof","rating":5},{"id":621055976175706100,"text":"Via The Hill: Trump Tops National Poll for Second Straight Week  http://t.co/s6nxfqdSQs","rating":3},{"id":301795511269195800,"text":"Be focused, be disciplined, be patient--there are very few cases of instant gratification.","rating":2},{"id":631137255634149400,"text":"Our online store is officially open! Visit http://t.co/3zYiIYWs87 to shop the latest #MakeAmericaGreatAgain merchandise.","rating":4},{"id":573632902149378050,"text":"Ringling Brothers is phasing out their elephants. I,for one, will never go again. They probably used the animal rights stuff to reduce costs","rating":8},{"id":395155709991850000,"text":"I just don't know why some of these NFL teams with lousy quarterbacks don't give Tim Tebow a chance - what do they have to lose?","rating":6},{"id":152454671510929400,"text":"The Mar-a-Lago Club has the best meatloaf in America. Tasty. http://t.co/3GS8TRgM","rating":4},{"id":344843316917059600,"text":"I've been warning about China since as early as the 80’s. No one wanted to listen. Now our country is in real trouble. #TimetoGetTough","rating":4},{"id":360119639017132000,"text":"For the sake of New York City, all recent sexting victims of Anthony ‘Carlos Danger’ Weiner should come forward.","rating":9},{"id":489760565074870300,"text":"Obama claims that he needs an extra $4B to secure the border. Well then he should not have wasted $5B on the ObamaCare website.","rating":6},{"id":619116090501800000,"text":"You mean George Bush sends our soldiers into combat, they are severely wounded, and then he wants $120,000 to make a boring speech to them?","rating":8},{"id":652151725189521400,"text":"What a time we all had in Iowa yesterday, massive overflow crowd. Love them!","rating":4},{"id":174215838814044160,"text":"It is time to get out of Afghanistan. We are building roads and schools for people that hate us. It is not in our national interests.","rating":7},{"id":653968775398748200,"text":"\"\"Exclusive--Davi: Trump, The Lion We Need\"\"  http://t.co/OYnWVnfsge","rating":5},{"id":654711286639423500,"text":"A great day in New Jersey for Trump! http://t.co/IdaYonGiL4 &amp, http://t.co/YsqPfea6KE","rating":3},{"id":119072660889149440,"text":"Happy New Year to all my Jewish friends.","rating":2},{"id":624208069057245200,"text":"Getting ready to lift off for Laredo. Will land at 1:OO P.M. Should be exciting and informative!","rating":3},{"id":440318358953529340,"text":"They must be kidding - can this be happening #Oscars","rating":5},{"id":529815744654356500,"text":"Looking like a really big night for Republicans - a tremendous refutation of President Obama and his failed policies!","rating":4},{"id":381127618793189400,"text":"“Our Constitution was made only for a moral &amp, religious people. It is wholly inadequate to the government of any other.”-- John Adams","rating":3},{"id":338042150812012540,"text":"It should be mandatory that all haters and losers use their real name or identification when tweeting - they will no longer be so brave!","rating":8},{"id":584643089228308500,"text":"Have a fantastic, beautiful and happy Easter everyone and then, when Easter is over, have great wins and triumphs in life. Never give up!","rating":2},{"id":101373840323645440,"text":"The Fed continues to flood the market with US dollars. Wrong move.","rating":4},{"id":258230257893666800,"text":"Diet Coke tweet had a monster response--dammit, I wish the stuff worked.","rating":7},{"id":581045346433937400,"text":"If Saudi Arabia, which has been making one billion dollars a day from oil, wants our help and protection, they must pay dearly! NO FREEBIES.","rating":9},{"id":270608452240437250,"text":"Rapper Mac Miller's song, \"\"Donald Trump\"\" has reached close to 72 million hits. He owes me big!","rating":6},{"id":621761403825860600,"text":"No deal is better than a bad deal. America out negotiated again.  #Iran","rating":5},{"id":265835837156102140,"text":"\"\"If you voted for Obama in 2008 to prove you were not a racist then vote for Romney in 2012 to prove you are not stupid.\"\" Thanks Walter D!","rating":10},{"id":652541555870408700,"text":"I will be going to Atlanta, Georgia tomorrow—here’s the info: http://t.co/Ty3VYUMphm. Hope to see you there! #MakeAmericaGreatAgain!","rating":1},{"id":347183311489224700,"text":"I met a Trump Twitter hater last night (well known). As he came near me he nervously said, \"\"Mr. Trump, it is an honor to meet you sir!\"\" Nice","rating":5},{"id":519429014684184600,"text":"Despite the ever increasing Ebola disaster, Obama refuses to stop flights from West Africa.It's almost like he's saying F-you to U.S. public","rating":9},{"id":629035574876328000,"text":"Poll: Trump Leads GOP Field Among Hispanics, Records 34% Favorability  http://t.co/AANybghvCv","rating":4},{"id":626544737252704300,"text":"Getting ready to leave for my GREAT resort, Turnberry, in Scotland. Hosting The Women's British Open (biggest tournament). Will be back Sat.","rating":3},{"id":403956190847070200,"text":"Since the Democrats decided to kill the filibuster, they now own it.Republicans should keep the new rule when they're in the majority.","rating":6},{"id":594144659032576000,"text":"Billions of dollars spent on Baltimore and it's still a total mess. Leadership is needed, not dollars. Our whole country is going to hell!","rating":8},{"id":462826595045371900,"text":"The ring announcers are working hard to justify the Mayweather victory. They should be ashamed of themselves! A TOTAL JOKE.","rating":7},{"id":408256977618210800,"text":"\"\"Those who lack courage will always find a philosophy to justify it.\"\"  -- Albert Camus","rating":2},{"id":1075367340139798500,"text":"In our Country, so much money has been poured down the drain, for so many years, but the Democrats fight us like cats and dogs when it comes to spending on Boarder Security (including a Wall) and the Military. We won on the Military, it is being completely rebuilt. We will win...","rating":7},{"id":266622346671058940,"text":"I started to get very worried about Mitt's chances when I heard that A-Rod donated to his campaign. Everything A-Rod touches turns bad.","rating":6},{"id":258207708644249600,"text":"I turned down going to the debate tonight so that I could do live tweets to my many followers.","rating":6},{"id":539159084201955300,"text":"Bill Cosby is foolish, stupid, or getting bad advice in remaining silent if he is innocent. Probably guilty! Not a fan.","rating":8},{"id":570384640281870340,"text":"The Mexican legal system is corrupt, as is much of Mexico. Pay me the money that is owed me now - and stop sending criminals over our border","rating":9},{"id":537153030056321000,"text":"Can you imagine what Putin and all of our friends and enemies throughout the world are saying about the U.S. as they watch the Ferguson riot","rating":7},{"id":449283463162499100,"text":"#TBT For all who have been asking, my mother was a great beauty and a wonderful person. Here we are with my father- http://t.co/dHKqyoL86W","rating":3},{"id":617857470933913600,"text":"I said simply that the Mexican leaders and negotiators are smarter than ours and that the Mexican gov't is pushing their hard core to U.S.","rating":7},{"id":615302294847029200,"text":"Univision apologized to me but I will not accept their apology. I will be suing them for a lot of money. Miss U.S.A. contestants are hurt!","rating":8},{"id":619519322332000300,"text":"Jeb Bush just announced he raised over $100M. Everyone of those people who contributed are getting something to the detriment of America!","rating":8},{"id":655413356694761500,"text":"Via CNET: Donald Trump Bests Jeb Bush in Website Performance, Experts Say- http://t.co/ioHAZOT8lK","rating":4},{"id":122402899446857730,"text":"I have traveled the world. America is the most beautiful country on Earth.","rating":5},{"id":426450941206732800,"text":"\"\"You have to learn the rules of the game. And then you have to play better than anyone else.\"\"  Albert Einstein","rating":3},{"id":253693930670002180,"text":"Congratulations to Mitt Romney. He was not only good, he was absolutely fantastic tonight!","rating":4},{"id":354655518633099260,"text":"It’s Tuesday.  How much money will Karl Rove waste today trying to push amnesty through the House?","rating":8},{"id":593019458186248200,"text":"Our country has to come together. We have to start working with, and really liking,  each other. The whole world is watching Baltimore.","rating":6},{"id":376323127393136640,"text":"Former President Jimmy Carter is so happy that he is no longer considered the worst President in the history of the United States!","rating":7},{"id":652211954765983700,"text":"Website Exposing Marco ‘Amnesty’ Rubio Goes Live: A ‘Donor Class Puppet’? - Breitbart    http://t.co/GArR1v5736","rating":5},{"id":517856118161551360,"text":"Really interesting, President Obama was quick to shut down flights to Isreal but is totally unwilling to shut down flights from West Africa!","rating":9},{"id":454347200601280500,"text":"Entrepreneurs, keep this in mind:\"\"Great spirits have always encountered violent opposition from mediocre minds.\"\" -- Albert Einstein","rating":2},{"id":428643027859419140,"text":"“Patriotism is supporting your country all the time, and your government when it deserves it.” - Mark Twain","rating":3},{"id":522721523208306700,"text":"The Ebola nurse should NEVER have been allowed to fly to Cleveland and (amazing) back again. Nothing works in our once great country anymore","rating":8},{"id":646077507926650900,"text":"Via HuffPost Pollster #1 http://t.co/IXCbCtDUIp","rating":3},{"id":412944317041639400,"text":"Who thinks that President Obama is totally incompetent?","rating":7},{"id":622469784278564900,"text":"All he does is go on television is talk, talk, talk, but incapable of doing anything.","rating":7},{"id":266634298671656960,"text":"No surprise that all the foreign countries are celebrating Obama's win.  They love a weak America that they can rip off.","rating":8},{"id":626508731073867800,"text":"How can a dummy dope like Harry Hurt, who wrote a failed book about me but doesn’t know me or anything about me, be on TV discussing Trump?","rating":9},{"id":289800038203408400,"text":"The Republicans are always worried about the press--they should just do what is right.","rating":5},{"id":623925416026316800,"text":"Shouldn’t George Will have to give a disclaimer every time he is on Fox that his wife works for Scott Walker?","rating":6},{"id":405039540181532700,"text":"Who would  you rather have negotiating with Iran--President Obama or Toronto Mayor Ford? My money is on Ford.","rating":8},{"id":462823141786812400,"text":"The Mayweather decision is a disgrace!","rating":4},{"id":318465046793564160,"text":"What will happen to Omarosa tonight? One of our all time great episodes!","rating":6},{"id":617715390504943600,"text":"Flashback – Jeb Bush says  illegal immigrants breaking our laws is an “act of love” http://t.co/p8yFzVuw8w He will never secure the border.","rating":7},{"id":552946816099315700,"text":"Why does Obama continue to release the worst of the worst from Gitmo?! Look at Paris and wake up!","rating":8},{"id":404227011801255940,"text":"The scum that gets high on badly hurting old ladies and others through knockout assaults wouldn't feel that way with a gun at their head!","rating":9},{"id":618442681098891300,"text":"People rarely say that many conservatives didn’t vote for Mitt Romney. If I can get them to vote for me, we win in a landslide.","rating":6},{"id":258593090107998200,"text":"Remember, new \"\"environment friendly\"\"  lightbulbs can cause cancer. Be careful-- the idiots who came up with this stuff don't care.","rating":8},{"id":257955447544352770,"text":"\"\"Sometimes the best thing you can do is just let things ride, let time go by.\"\"Donald J. Trump","rating":4},{"id":536995249273720800,"text":"There is no excuse for riots in Ferguson regardless of the grand jury outcome.","rating":5},{"id":452551774738874400,"text":"Haters and losers say I wear a wig (I don't), say I went bankrupt (I didn't), say I'm worth $3.9 billion (much more). They know the truth!","rating":9},{"id":399883997997969400,"text":"Happy Veterans Day to ALL, in particular to the haters and losers who have no idea how lucky they are!!!","rating":9},{"id":142683518550544380,"text":"We are building China's wealth by buying all their products, even though we make better products in America.","rating":6},{"id":273906873156132860,"text":"7 of 10 Americans prefer 'Merry Christmas' over 'Happy Holidays' http://t.co/Xjimd3KU  No surprise.","rating":6},{"id":619733816618291200,"text":"Look forward to being in Phoenix tomorrow at 2:00 P.M. Hottest ticket in entire country. Was supposed to be 500 people, now many thousands!","rating":4},{"id":552955075715690500,"text":"If the people so violently shot down in Paris had guns, at least they would have had a fighting chance.","rating":9},{"id":314822247493799940,"text":"There won’t be any new gun legislation. No surprise. Americans support the 2nd amendment.","rating":3},{"id":652571930822897700,"text":"Crowd gathers to hear Trump speech in Las Vegas http://t.co/ox6YyCV5s4","rating":3},{"id":488841069451149300,"text":"The only global warming that people should be concerned with is the global warming caused by nuclear weapons because of our weak U.S. leader","rating":8},{"id":402545285793996800,"text":"\"\"The ones who are crazy enough to think that they can change the world, are the ones who do.\"\" -- Steve Jobs","rating":2},{"id":378236334273331200,"text":"China, Russia and Iran are laughing at us. We have weak leaders who are threatening our national security. Dangerous times.","rating":6},{"id":237913235045638140,"text":"Why are we continuing to train these Afghanis who then shoot our soldiers in the back? Afghanistan is a complete waste. Time to come home!","rating":7},{"id":415364893437853700,"text":"ALWAYS TRY TO LEARN FROM OTHER PEOPLES MISTAKES, NOT YOUR OWN - IT IS MUCH CHEAPER THAT WAY!","rating":4},{"id":427226424987385860,"text":"NBC News just called it the great freeze - coldest weather in years. Is our country still spending money on the GLOBAL WARMING HOAX?","rating":9},{"id":655729879397376000,"text":"On at 9:00A.M. or 10:00 A.M. (depending on your location)  on Fox is a tough but really good interview with Chris Wallace. Enjoy!","rating":3},{"id":623650581333340200,"text":"Great day today in South Carolina. Fantastic capacity crowd, amazing people!","rating":2},{"id":570235239848681500,"text":"I have a lawsuit in Mexico’s corrupt court system that I won but so far can’t collect. Don’t do business with Mexico!","rating":6},{"id":474231178233671700,"text":"Obama can release 5 senior Taliban for a deserter but can’t make Mexico release decorated Marine Sgt. Andrew Tahmooressi. Pathetic","rating":7},{"id":266031768728109060,"text":"Well, back to the drawing board!","rating":1},{"id":416539702096052200,"text":"It is really too bad that the scientists studying GLOBAL WARMING in Antarctica got stuck on their icebreaker because of massive ice and cold","rating":8},{"id":513141602064543740,"text":"Why are we sending thousands of ill-trained soldiers into Ebola infested areas of Africa! Bring the plague back to U.S.? Obama is so stupid.","rating":9},{"id":512240414557212700,"text":"“There is a point in every contest when sitting on the sidelines is not an option.”  -- Dean Smith","rating":1},{"id":617460107945857000,"text":"Why would Republican candidates want the support of Mitt Romney. He lost an election against Obama that should NEVER have been lost!","rating":5},{"id":401020440086204400,"text":"More dead people voted in the last election than enrolled in ObamaCare. Congratulations America!","rating":8},{"id":570235124178161660,"text":"The Oscars were a great night for Mexico &amp, why not—they are ripping off the US more than almost any other nation.","rating":7},{"id":376332609150025700,"text":"Isn't it intetesting that anybody who attacks President Obama is considered a racist by the real racists out there!","rating":9},{"id":307568422789709800,"text":"We should leave Afghanistan immediately. No more wasted lives. If we have to go back in, we go in hard &amp, quick. Rebuild the US first.","rating":6},{"id":623496370855538700,"text":"Good luck to my new friends on your testimony in DC. You are amazing people doing something so important--- stopping illegal immigration!","rating":5},{"id":616926822949855200,"text":"Mexican leaders and negotiators are much tougher and smarter than those of the U.S. Mexico is killing us on jobs and trade. WAKE UP!","rating":7},{"id":618552478653616100,"text":"MUST READ-\"\"It's time people listened to Trump,' says mother of gunned-down teenage football star\"\" http://t.co/7hs5RN8Qb7 SECURE THE BORDER!","rating":6},{"id":314828077819641860,"text":"“The difference between stupidity and genius is that genius has its limits.” - Albert Einstein","rating":3},{"id":404418108963950600,"text":"The people that gave you global warming are the same people that gave you ObamaCare!","rating":8},{"id":656557928229576700,"text":"Both Aberdeen and Turnberry in Scotland, and the soon to open Doonbeg in Ireland, blow Bandon Dunes away. Bandon is a toy by comparison!","rating":4},{"id":537245792378294300,"text":"President Obama has absolutely no control (or respect) over the African American community-they have fared so poorly under his presidency.","rating":9},{"id":614808452297326600,"text":"When you are in a war, or even a battle, losing is not an option!","rating":4},{"id":560513524112560100,"text":"My parents:\"\"Trust in God and be true to yourself.\"\" -- Mary MacLeod Trump\"\"Know everything you can about what you're doing.\"\"  Fred C. Trump","rating":3},{"id":510043928931078140,"text":"They should have rebuilt the two buildings of the World Trade Center exactly as they were, except taller and stronger. A better statement!","rating":5},{"id":635888584558551000,"text":"Via The Brody File: \"\"The Lesson Evangelicals Can Learn From Donald Trump\"\"  Thank you David &amp, CBN News--so nice.   http://t.co/XSbTUXxs7K","rating":2},{"id":421756772395659260,"text":"Focus on your goals, not your problems. Problems are a mind exercise--learn to play beyond your comfort zone.","rating":1},{"id":429354084156456960,"text":"COURT FINDS IN FAVOR OF TRUMP UNIVERSITY http://t.co/pd5tRocvwq","rating":6},{"id":521862351218573300,"text":"As ISIS and Ebola spread like wildfire, the Obama administration just submitted a paper on how to stop climate change (aka global warming).","rating":8},{"id":519821779918155800,"text":"I was relentless because, more often than you would think, sheer persistence is the difference between success and failure. NEVER GIVE UP!","rating":3},{"id":324599477199581200,"text":"It is terrible that neither Obama, Biden nor Kerry attended Lady Thatcher’s funeral. They would all run to Muslim Brotherhood Morsi’s.","rating":7},{"id":355119266317615100,"text":"Snowden has given serious information to China and Russia-anyone who thinks otherwise is a dope! He is a traitor who fled-he knew the crime!","rating":8},{"id":569726744527290400,"text":"What ever happened to the good old days of The Academy Awards. This show is an insult to the past, just plain bad!","rating":6},{"id":325965355535196160,"text":"The shirts and ties at Macy's are so good-beautiful and do so well that guys like the one that sued me wrongly want a piece-l kicked his ass","rating":9},{"id":547949668307832800,"text":"Merry Christmas to all - have a fantastic day, year and life! The World, with great leadership, will become a much more beautiful place!","rating":4},{"id":350277219244978200,"text":"ObamaCare could \"\"eat up your raise\"\" http://t.co/V5ExFfIXHk Why isn't Congress defunding it? They're obsessed with amnesty.","rating":7},{"id":373114760234950660,"text":"The Yankees are sure lucky George Steinbrenner is not around. A lot of people would be losing their jobs.","rating":5},{"id":521288438931546100,"text":"I don't know if President Obama isn't stopping the flights from Ebola torn West Africa because he is stubborn, stupid, or just doesn't care!","rating":8},{"id":652668174522024000,"text":"Will be interviewed on \"\"Media Buzz\"\" with Howie Kurtz on Fox, Sunday at 11:00 A.M.","rating":3},{"id":562997660823855100,"text":"We’re worried about waterboarding as our enemy, ISIS, is beheading people and burning people alive. Time for us to wake up.","rating":7},{"id":459430123188781060,"text":"“Worry destroys focus.” – Think Big","rating":2},{"id":408310058955460600,"text":"\"\"I never did give anybody hell. I just told the truth and they thought it was hell.\"\" --Harry S. Truman","rating":3},{"id":273159202313228300,"text":"\"\"Think of yourself like a one-man army.  You're not only the commander in chief, you're the soldier as well.\"\" – Think Like A Billionaire","rating":2},{"id":344165940725964800,"text":"“Worry destroys focus.” – Think Big","rating":2},{"id":474023549544325100,"text":"Our President is a great embarrassment to the U.S. How could anybody be so dumb or know so little as to make the very stupid 5 for 1 swap?","rating":7},{"id":527247723196862460,"text":"President Obama strongly considering a plan to bring non-U.S. citizens with Ebola to the United States for treatment. Now I know he's nuts!","rating":8},{"id":375967171664707600,"text":"I wonder how much our \"\"leaders\"\" have promised, or given, Russia in order for them to behave and not make the U.S. look even worse?","rating":6},{"id":524888012522815500,"text":"Why are we letting the three girls, who left the U.S. to join ISIS, back into the country? How stupid has our once respected country become!","rating":8},{"id":537030834042454000,"text":"Why would they announce a finding of the grand jury in Ferguson at 9:00 in the evening - a prime time for riots! Not smart.","rating":5},{"id":620220652189040600,"text":"Convention Center officials in Phoenix don't want to admit that they broke the fire code by allowing 12-15,000 people in 4,000 code room.","rating":4},{"id":370646948081975300,"text":"Why are people upset w/ me over Pres Obama’s birth certificate?I got him to release it, or whatever it was, when nobody else could!","rating":7},{"id":623170920945983500,"text":"It was only after I informed NBC that I wouldn't do the Apprentice that they became upset w/ me. They couldn’t care less about “inclusion\"\"","rating":6},{"id":464564971201130500,"text":"Great pick by Buffalo - Sammy Watkins will be GREAT!","rating":2},{"id":477058640978120700,"text":"Iraq told us to get out, Iraq is now falling, and Iraq now wants us to come back! Don't do it unless we get the OIL, and I mean ALL OF IT!","rating":8},{"id":555367040907612160,"text":"If the morons who killed all of those people at Charlie Hebdo would have just waited, the magazine would have folded - no money, no success!","rating":9},{"id":620667683898556400,"text":"Rush Limbaugh: \"\"Trump Has Changed the Entire Debate on Immigration\"\" http://t.co/894aXjRXDn","rating":4},{"id":507546307620528100,"text":"I'm not against vaccinations for your children, I'm against them in 1 massive dose.Spread them out over a period of time &amp, autism will drop!","rating":7},{"id":318761740315815940,"text":"“Winning is the most important thing in my life, after breathing. Breathing first, winning next.” -     George Steinbrenner","rating":3},{"id":617092492786278400,"text":"Our Southern border is totally out of control. This is an absolutely disgraceful. situation.http://t.co/ujz3jENIYo We need border security!","rating":5},{"id":393545238213824500,"text":"When a complex website is broken the best thing to do is blow it up and start all over again-then sue the culprits and use the proper team!","rating":4},{"id":108306883194011650,"text":"If the Palestinians want statehood then why are they run by the terrorist group Hamas?","rating":6},{"id":281415581092155400,"text":"They asked me to dress as Santa Claus to open Miss Universe tonight—I’m thinking about it!","rating":9},{"id":518882635972890600,"text":"The Jets just don't have it. Time for a quarterback change!","rating":3},{"id":122396588336349180,"text":"When will we stop wasting our money on rebuilding Afghanistan? We must rebuild our country first.","rating":6},{"id":380506760035205100,"text":"Lightweight A.G. Eric Schneiderman is perhaps the most incompetent and least respected A.G. in the U.S. He is a total joke!","rating":8},{"id":320165534664626200,"text":"Word is spreading that I got a tattoo - no way, I am not a fan!","rating":7},{"id":633721535438700500,"text":"Our online campaign store is open! Visit http://t.co/3zYiIYWs87 for #MakeAmericaGreatAgain merchandise including my signature hat!","rating":5},{"id":259812289509732350,"text":"Derek Jeter broke ankle one day after he sold his apartment in Trump World Tower.","rating":4},{"id":451820042876117000,"text":"Ask yourself: \"\"What can I learn today that I didn't know before?\"\" Always be a student, always be open to new ideas.","rating":2},{"id":510385811268042750,"text":"The judge in the Oscar Pistorious case is a total moron. She said he didn't act like a killer. This is another O.J. disaster!","rating":7},{"id":619220020766330900,"text":"Obama and Republicans are hollowing out our military. Now want to cut troop levels. Lowest level in over 20 years.","rating":5},{"id":611934068050108400,"text":"Stop saying I went bankrupt. I never went bankrupt but like many great business people have used the laws to corporate advantage—smart!","rating":6},{"id":447332751667380200,"text":"The situation with Russia is much more dangerous than most people may think - and could lead to World War III. WE NEED GREAT LEADERSHIP FAST","rating":8},{"id":611578826745847800,"text":"The tragedy in South Carolina is incomprehensible. My deepest condolences to all.","rating":3},{"id":266282020395708400,"text":"Millions without electricity across NY &amp, NJ. The media has covered for Obama’s massive failure. Can you imagine if this was another Pres?","rating":7},{"id":326783454089969660,"text":"I’ve always been a fan of Steve Jobs, especially after watching Apple stock collapse w/out him – but the yacht he built is truly ugly.","rating":5},{"id":208277697279963140,"text":"Q1 GDP has just been revised down to 1.9% http://t.co/tX9ij8KQ  The economy is in deep trouble.","rating":4},{"id":457314934473633800,"text":"Snowden is a spy who has caused great damage to the U.S. A spy in the old days, when our country was respected and strong, would be executed","rating":9},{"id":377781540698488800,"text":"Putin is having such a good time. Our President is making him look like the genius of all geniuses. Do not fear,we are a NATION OF POTENTIAL","rating":7},{"id":614851071136124900,"text":"I'll be in Iowa tonight making a speech to a record setting crowd. The word is getting out, MAKE AMERICA GREAT AGAIN!","rating":6},{"id":278558978873638900,"text":"Negotiation tip #1:  The worst thing you can possibly do in a deal is seem desperate to make it.","rating":5},{"id":250321139119833100,"text":"All these polls released by news outlets are oversampling Democrats. They want to influence public perception of the race.","rating":4},{"id":443828748555927550,"text":"\"\"By failing to prepare, you are preparing to fail.\"\" -- Benjamin Franklin","rating":2},{"id":403960097346293760,"text":"Thomas Jefferson wrote the Senate filibuster rule. Harry Reid &amp, Obama killed it yesterday.  Rule was in effect for over 200 years.","rating":3},{"id":376053255245008900,"text":"Many of the Syrian rebels are radical jihadi Islamists who are murdering Christians. Why would we ever fight with them?","rating":6},{"id":619105146128179200,"text":"Jeb's brother George insisted on a $100,000 fee and $20,000 for a private jet to speak at a charity for severely wounded vets. Not nice!","rating":7},{"id":622465590901514200,"text":"Just left Family Leadership Summit in Iowa, got a standing ovation from many wonderful people. I will be back soon.","rating":3},{"id":428132600621064200,"text":"I predicted Apple's stock fall based on their dumb refusal to give the option of a larger  iPhone screen like Samsung. I sold my Apple stock","rating":5},{"id":220194932575576060,"text":"Degenerate former Congressman Anthony Weiner is trying to make a comeback. He is a sick &amp, perverted man that New York does not want or need.","rating":8},{"id":305022237713522700,"text":"\"\"Fear defeats more people than any other one thing in the world.\"\" -- Ralph Waldo Emerson","rating":2},{"id":93774719052029950,"text":"\"\"China is our enemy--they want to destroy us\"\" -- Redstate Interview","rating":6},{"id":448104820176859140,"text":"Obama should stop running down the stairs when getting off Air Force One.  Doesn’t look presidential and at some point he will take a fall.","rating":6},{"id":364586300671664100,"text":"Why has all time hits leader Pete Rose paid a 20 year price whrn A-Rod gets 200 game penalty. It's time to let Pete into The Hall of Fame!","rating":4},{"id":506196759300038660,"text":"Remember this, the worst doctors (by far) are celebrity doctors. If you see their names, or read about them in the newspapers, stay away!","rating":5},{"id":236089746307301380,"text":"Chelsea Clinton will be very successful in the world of politics. She's always been a great person--a winner. (cont) http://t.co/8t01tOfl","rating":3},{"id":486861543444070400,"text":"If only the illegals were Tea Party members then Obama would get them out of the country immediately.","rating":8},{"id":1698308935,"text":"Be sure to tune in and watch Donald Trump on Late Night with David Letterman as he presents the Top Ten List tonight!","rating":2},{"id":266618875758645250,"text":"Russian leaders are publicly celebrating Obama's reelection.  They can't wait to see how flexible Obama will be now.","rating":7},{"id":464135457690091500,"text":"Russia is on the move in the Ukraine, Iran is nuking up &amp, Libya is run by Al Qaeda, yet Obama is busy issuing ‘climate change” warnings.","rating":8},{"id":430266644569800700,"text":"I can't get over, after all of the buildup, what a terrible game that was-the worst Super Bowl in history. The advertisers must be furious!","rating":5},{"id":334864704222687200,"text":"I wonder what the next scandal will be in D.C.? Can we handle yet another?","rating":6},{"id":513249345857413100,"text":"Do you believe that Obama is giving weapons to \"\"moderate rebels\"\" in Syria.Isn't sure who they are. What the hell is he doing.Will turn on us","rating":8},{"id":581059354511671300,"text":"Sgt. Bowe Bergdahl should face the death penalty for desertion - five brave soldiers died trying to bring him back. U.S. has to get tough!","rating":7},{"id":382245828737245200,"text":"Huma should dump the sicko Weiner.  He is a calamity that is bringing her down with him.","rating":6},{"id":414320976093270000,"text":"Remember, THE HARDER YOU WORK, THE LUCKIER YOU GET!","rating":4},{"id":447191888630927360,"text":"I believe Putin will continue to re-build the Russian Empire. He has zero respect for Obama or the U.S.!","rating":6},{"id":626453353741054000,"text":"This is an outrage! Bias-Free Language Guide claims the word 'American' is 'problematic' -- WHAT?!  http://t.co/vKz8a0ICGs","rating":7},{"id":625783437220282400,"text":"I own Turnberry, in Scotland, one of great resorts in world. Women’s British Open there this week. I’ll go for two days &amp, back on trail.","rating":3},{"id":489774991148601340,"text":"If Obama is concerned about the border, he should stop vacationing. Gov't will save millions which it can use to stop illegal migration.","rating":5},{"id":593321095027150800,"text":"I wonder what the rest of the world is thinking about the United States as they watch the disgusting and out of control Baltimore riots?","rating":5},{"id":338978381636984800,"text":"It's 46º (really cold) and snowing in New York on Memorial Day - tell the so-called \"\"scientists\"\" that we want global warming right now!","rating":9},{"id":531922043705753600,"text":"A single Ebola carrier infects 2 others at a minimum. STOP THE FLIGHTS! NO VISAS FROM EBOLA STRICKEN COUNTRIES!","rating":8},{"id":299176445660508160,"text":"The best deals are good for everyone, which creates a win-win situation. Negotiation is persuasion more than power.","rating":3},{"id":487553677247250400,"text":"Rosie is crude, rude, obnoxious and dumb - other than that I like her very much!","rating":9},{"id":402379878643040260,"text":"Maybe some of the dead voters who helped get President Obama elected can be brought back to life after signing up for ObamaCare.","rating":9},{"id":423197613765050400,"text":"Think positively. Zap negativity immediately. Focus on the solution, not the problem. Be persistent and alert--every single day. Momentum!","rating":2},{"id":652189681929617400,"text":"\"\"This Man Is the Most Dangerous Political Operative in America\"\"  via Bloomberg Politics  http://t.co/5htys6nqtR","rating":4},{"id":306797506791079940,"text":"Many people have commented that my fragrance, “Success”  is the best scent &amp, lasts the longest. Try it &amp, let me know what you think!","rating":3},{"id":382589422572564500,"text":"It’s a shame the ruling class of Republicans don’t attack Obama and the Democrats the way they hit Senators Cruz &amp, Lee.","rating":5},{"id":598473815195263000,"text":"We are rebuilding other countries while our own country is going to HELL. Time to rebuild the U.S.A.! Tell our stupid politicians, ENOUGH","rating":8},{"id":529829777608560640,"text":"One year ago I started calling President Obama INCOMPETENT and people thought it was too tough.     Tonight everyone is using that    word!","rating":7},{"id":238717783007977470,"text":"Massive combined inoculations to small children is the cause for big increase in autism....","rating":8},{"id":416909004984844300,"text":"We should be focused on clean and beautiful air-not expensive and business closing GLOBAL WARMING-a total hoax!","rating":9},{"id":319086378673659900,"text":"Set the bar high, do the best you possibly can, and believe in yourself—because if you don’t, no one else will either.","rating":3},{"id":653627639299764200,"text":"Via RealClear Politics  http://t.co/U7JPpgszvn","rating":2},{"id":372713362796212200,"text":"I have a dream that our country will be great again! #DreamDay","rating":6},{"id":625816370849181700,"text":"Boston's Mayor Walsh wasted a lot of time and money on going for the Olympics, and then he gave up. I don't want him negotiating for me!","rating":7},{"id":593037926369464300,"text":"The best social program, by far, is a JOB! Our jobs are being taken away from us by China and many other countries - incompetent leader.","rating":5},{"id":622106025831866400,"text":"“Donald Trump was proven right on another one of his top issues Thursday: 'gun free zones' at military bases.” http://t.co/x1swUrw8l1","rating":4},{"id":258378469950513150,"text":"Obama keeps saying that he will do something--- but why hasn't he done it? It's all talk.","rating":6},{"id":622160499183091700,"text":"Response to Huffington Post- http://t.co/WxwQWHIgOO","rating":2},{"id":573646783416508400,"text":"Mexico's court system  corrupt.I want nothing to do with Mexico other than to build an impenetrable WALL and stop them from ripping off U.S.","rating":8},{"id":530802365323296800,"text":"We should immediately stop sending our beautiful American tax dollars to countries that hate us and laugh at our President’s stupidity!","rating":8},{"id":154639112681422850,"text":"Michele Bachmann just dropped out of prez race--- when she didn't do the Newsmax debate it showed great disloyalty and people rejected her.","rating":5},{"id":613055410669490200,"text":"Entrepreneurs: Be tough, be smart, be personable, but don't take things personally. That's good business.","rating":2},{"id":258392659385802750,"text":"Such long rhetorical and boring answers from Obama. No wonder nothing gets done.","rating":4},{"id":523274144616824800,"text":"If I were president Sgt. Andrew Tahmooressi would be let out of jail with one phone call. If not,Mexico would pay a price like never before!","rating":9},{"id":265570772767100930,"text":"Benghazi is bigger than Watergate.  Don’t let Obama get away with allowing Americans to die.  Kick him out of office tomorrow.","rating":7},{"id":326781173286187000,"text":"“The object of war is not to die for your country but to make the other bastard die for his.” - Gen. George S. Patton","rating":3},{"id":517264224352235500,"text":"Stop flights into the U.S. from West Africa immediately!","rating":6},{"id":324961795573964800,"text":"Pervert alert! Sexter Anthony Weiner will be running for Mayor of New York City.","rating":9},{"id":537155665635344400,"text":"As China and the rest of the World continue to rip off the U.S. economically, they laugh at us and our president over the riots in Ferguson!","rating":8},{"id":418854352166457340,"text":"“Invincibility lies in the defence, the possibility of victory in the attack.” - Sun Tzu","rating":3},{"id":609999543581691900,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":452173576016502800,"text":"\"\"There is only one way to avoid criticism: do nothing, say nothing, and be nothing.\"\"– Aristotle","rating":2},{"id":620973281152208900,"text":"Getting ready to land in Charlottesville, Virginia, at Trump Vineyards, another job producing development that I bought and made AMAZING!","rating":4},{"id":369926661644357600,"text":"“I have a very strict gun control policy: if there's a gun around, I want to be in control of it.” -  Clint Eastwood","rating":3},{"id":408983789830815740,"text":"We should be focused on magnificently clean and healthy air and not distracted by the expensive hoax that is global warming!","rating":9},{"id":374361164547100700,"text":"In war, the elememt of surprise is sooooo important.What the hell is Obama doing.","rating":7},{"id":513526411332968450,"text":"Our country has become so politically correct that it has lost all sense of direction or purpose. We are unable to move forward painlessly.","rating":6},{"id":232839851945390080,"text":"The Fed should not do another 'stimulus.' We can't keep spending our children's future away on waste.","rating":5},{"id":305748169638178800,"text":"By popular demand, I will be tweeting on the very tainted Academy Awards tonight!","rating":7},{"id":604841582236475400,"text":"I would like to offer Vice President Biden my warmest condolences on the loss of his wonderful son, Beau. Met him once, great guy!","rating":2},{"id":619881244482863100,"text":"Getting ready to go to Las Vegas (Freedom Fest) - great crowd. Then on to amazing Phoenix - that will be a total happening! Love America.","rating":3},{"id":428703194429272060,"text":"Failing comedian Bill Maher, who I got an accidental glimpse of the other night, is really a dumb guy, just look at his past!","rating":6},{"id":614434531861512200,"text":"Once again the Bush appointed  Supreme Court Justice John Roberts has let us down. Jeb pushed him hard! Remember!","rating":5},{"id":248421632413147140,"text":"Obama should play golf with Republicans &amp, opponents rather than his small group of friends. That way maybe the terrible gridlock would end.","rating":4},{"id":447191138962014200,"text":"Putin has become a big hero in Russia with an all time high popularity. Obama, on the other hand, has fallen to his lowest ever numbers. SAD","rating":5},{"id":357928308618428400,"text":"The Fed’s pumping is great news in the short term but it can’t last forever.  Be prudent in your market investing.","rating":3},{"id":518449173549830140,"text":"Something very important, and indeed society changing, may come out of the Ebola epidemic that will be a very good thing: NO SHAKING HANDS!","rating":6},{"id":495182739310936060,"text":"Stop the EBOLA patients from entering the U.S. Treat them,  at the highest level, over there. THE UNITED STATES HAS ENOUGH PROBLEMS!","rating":7},{"id":247757562127216640,"text":"Kate Middleton is great--but she shouldn't be sunbathing in the nude--only herself to blame.","rating":7},{"id":614844928095559700,"text":"Only very stupid people think that the United States is making good trade deals with Mexico.Mexico is killing us at the border and at trade!","rating":8},{"id":276692448661606400,"text":"“I like thinking big.  To me it’s very simple: if you’re going to be thinking anyway, you might as well think big.” – The Art of The Deal","rating":3},{"id":536107246464557060,"text":"Do you think the 14 African nations that are banning West Africans from coming into their nations are racist?","rating":7},{"id":512341480728698900,"text":"So Obama wants to bomb ISIS in Iraq &amp, arm them in Syria? What is he doing!","rating":8},{"id":522662342652616700,"text":"It is time for the airline pilots, flight attendants and the airlines themselves to stop flights to and from West Africa. Do it right now!","rating":6},{"id":560081969447702500,"text":"So many people have told me that I should host Meet the Press and replace the moron who is on now. Just too busy, especially next 10 years!","rating":9},{"id":465935477984727040,"text":"If you can’t handle the hard times that come with business then you will never be able to celebrate the successes. Focus &amp, Stay Positive.","rating":4},{"id":496640747379388400,"text":"Our government now imports illegal immigrants and deadly diseases. Our leaders are inept.","rating":7},{"id":263280389039218700,"text":"Hurricane is good luck for Obama again- he will buy the election by handing out billions of dollars.","rating":9},{"id":450731150865338400,"text":"Because of President Obama's failed leadership, we have put Vladimir Putin &amp, Russia back on the world stage! --No reason for this.","rating":7},{"id":529942695343837200,"text":"A really bad night for President Obama. Now the Republicans have to get together and get the job done!","rating":5},{"id":323031226673922050,"text":"What a shame that Kobe Bryant was so badly injured last night - a truly great champion who brought the Lakers back from oblivion this year!","rating":4},{"id":621771929570148400,"text":"Leaving for New Hampshire now. Making a speech—packed house.  Love it!","rating":3},{"id":510038148014178300,"text":"I can't believe that the judge in the Oscar Pistorious case has found him not guilty of murder. No one has been more guilty since O.J.!","rating":8},{"id":205680827168862200,"text":"\"\"Do not go where the path may lead, go instead where there is no path and leave a trail.\"\" Ralph Waldo Emerson","rating":2},{"id":449329067192762400,"text":"Autism WAY UP - I believe in vaccinations but not massive, all at once, shots. Too much for small child to handle. Govt. should stop NOW!","rating":9},{"id":522352142771048450,"text":"Obama still refuses to stop the flights. Is he stubborn or just plain incompetent - I say both!","rating":6},{"id":619684281833640000,"text":"Standing with Jamiel Shaw, Sabine Durdin, Don Rosenberg, Lupe Moreno, Brenda Sparks, Robin Hvidston &amp, their spouses. http://t.co/X67CF765jQ","rating":4},{"id":445627048703561700,"text":"“Some people dream of great accomplishments, while others stay awake and do them.”   Anonymous","rating":3},{"id":240116141446537200,"text":"Why do the Republicans keep apologizing on the so called \"\"birther\"\" issue? No more apologies--take the offensive!","rating":7},{"id":427556692109574140,"text":"Any and all weather events are used by the GLOBAL WARMING HOAXSTERS to justify higher taxes to save our planet! They don't believe it $$$$!","rating":8},{"id":393409864308764700,"text":"Good advice from my mother, Mary MacLeod Trump: “Trust in God and be true to  yourself.”","rating":4},{"id":468402771784654850,"text":"“You have to be positive every single day. Positive stamina is a necessary ingredient for success.” – Think Like a Champion","rating":3},{"id":478629470660988900,"text":"Iraq is no longer our problem. We never should have been there in the first place!","rating":6},{"id":329806826260541440,"text":"Jodi Arias has stated that she follows me on twitter so I really hate to be saying that she is guilty but sadly, she is as guilty as it gets","rating":6},{"id":617456607295881200,"text":"What about the undocumented immigrant with a record who killed the beautiful young women (in front of her father) in San Fran. Get smart!","rating":7},{"id":241227269702549500,"text":"The dummies left Iraq (and Libya) without the oil!","rating":7},{"id":116579360089190400,"text":"Australia is a beautiful country with terrific people who love America.","rating":2},{"id":448561680939622400,"text":"\"\"He that is good for making excuses is seldom good for anything else.\"\" -- Benjamin Franklin","rating":2},{"id":392741561215119360,"text":"“America is too great for small dreams.” — Pres. Ronald Reagan","rating":2},{"id":248055448614367230,"text":"\"\"A friend is one who has the same enemies as you have.\"\" -- Pres. Abraham Lincoln","rating":2},{"id":124590793376808960,"text":"Tweet me your questions to answer. #trumpvlog","rating":4},{"id":536657946265268200,"text":"Tom Brady played great today. He is a total champ and a really nice guy, a rare combination!","rating":3},{"id":487316463204986900,"text":"When will the U.S. stop sending $'s to our enemies, i.e. Mexico and others.","rating":7},{"id":347765030500069400,"text":"We know who did the hoax of James Gandolfini and ObamaCare. Be careful, Mister.","rating":8},{"id":306075861763887100,"text":"Why do losers &amp, haters always say I wear a “wig” when they know I don’t. Like it or not, it’s all mine—just ask Barbara Walters.","rating":9},{"id":467015861195530240,"text":"Advice from my father, Fred C. Trump:  \"\"Know everything you can about what you're doing.\"\"","rating":2},{"id":96969000797483000,"text":"\"\"Never quit and always hit back\"\" -- The Art of the Comeback","rating":3},{"id":357148847136448500,"text":"Just found out that at a charity auction of celebrity portraits in E. Hampton, my portrait by artist William Quigley topped  list at $60K","rating":5},{"id":566815101349810200,"text":"Record low temperatures and massive amounts of snow. Where the hell is GLOBAL WARMING?","rating":9},{"id":379050677370355700,"text":"New York Fashion Week is really bad, and used to be so glamorous and exciting! No stars, no fun-just boring. They need serious help. #NYFW","rating":8},{"id":444152728051548160,"text":"I just beat a lawyer from Yale and a lawyer from Harvard, who teamed up against me, in a major case worth millions ($). They were so dumb!","rating":10},{"id":464466902107295740,"text":"Also, the more desperate you are to close a deal the less likely it will happen. Stay calm and focused on your ultimate goals. Be smart!","rating":2},{"id":525718224659550200,"text":"Canadian PM Harper immediately called the Ottawa attack terrorism. At least North America has a strong leader who lives in reality.","rating":7},{"id":507591153743843300,"text":"Any American who fights w/ ISIS in Iraq or Syria should have their passport revoked. If they try to come back in, send them to Gitmo.","rating":6},{"id":376897513737179140,"text":"Great comeback by Tom Brady-New England!","rating":3},{"id":428414113463955460,"text":"Snowing in Texas and Louisiana, record setting freezing temperatures throughout the country and beyond. Global warming is an expensive hoax!","rating":9},{"id":257122019831844860,"text":"When Strasburg leaves in a couple of years under free agency Washington will say \"\" what were we doing\"\".","rating":4},{"id":435572172141371400,"text":"Do you think John Kerry is aware of the fact that they are building nuclear weapons in Iran and North Korea and  Pakistan already has them!!","rating":7},{"id":444589124776124400,"text":"While I won't be running for Governor of New York State, a race I would have won, I have much bigger plans in mind- stay tuned, will happen!","rating":8},{"id":597843823889383400,"text":"\"\"Government's first duty is to protect the people, not run their lives.” – President Ronald Reagan","rating":2},{"id":350338032790028300,"text":"Call it any way you like, but Snowden is a traitor. When our country was great do you know what we did to traitors?","rating":7},{"id":464509465216450560,"text":"To be yourself in a world that is constantly trying to make you something else is the greatest accomplishment. -- Ralph Waldo Emerson","rating":1},{"id":475000836603777000,"text":"Thank you to the greatest heroes http://t.co/M4pUpmtugj #DDay70 #WWII","rating":3},{"id":335933977477128200,"text":"I'm watching Knicks game-I'd bet all of those guys with the terrible tattoos wish they never got them-too bad, too late!","rating":6},{"id":306043741825798140,"text":"How did you like Michelle Obama’s bangs last night?","rating":5},{"id":260852720989249540,"text":"\"\"Invincibility lies in the defence, the possibility of victory in the attack.\"\" -- Sun Tzu","rating":1},{"id":499330292394778600,"text":"Such amazing people in India. This trip is very enlightening!","rating":4},{"id":427557537878388740,"text":"Do you really believe our once great country can continue to survive with incompetent leadership. The answer is no and we better move fast!","rating":7},{"id":518601830126075900,"text":"President Obama, I have an idea! Pretend that West Africa is Israel and then you will be able to stop the Ebola area flights.","rating":9},{"id":517106917127508000,"text":"How dumb is our president to send thousands of poorly trained and ill-equipped soldiers over to West Africa to fight Ebola. Stop all flights","rating":8},{"id":404924854270722050,"text":"John Kerry is openly celebrating the tenuous nuclear deal with Iran. Great dealmakers do not celebrate deals,they just go on to the next one","rating":5},{"id":565853788054229000,"text":"Let Pete Rose into the Hall of Fame now - 35 years is enough!","rating":4},{"id":95563593222860800,"text":"The Answer to both Social Security and Medicare is a robust growing economy---not cuts on the elderly.","rating":3},{"id":537150175564009500,"text":"If the decision by the grand jury in Ferguson was the exact opposite, you would still be having the riots right now!","rating":7},{"id":359820962872557600,"text":"On Anthony Wiener, I TOLD YOU SO!","rating":6},{"id":543161015853404160,"text":"If America was under the threat of imminent attack, would Obama use torture or a kiss?","rating":10},{"id":471399566047465500,"text":"The Boston Bomber got immediate emergency surgery for a gunshot yet our vets die on waiting lines at the VA. We must do better!","rating":8},{"id":266672542935306240,"text":"Romney campaign used me in 6 primary states and won every one- they should have used me in Florida and Ohio &amp, he would be President.","rating":5},{"id":265839310299873280,"text":"Remember: Obama turned down $5M to charity which I said I would increase by 10X to $50M--just to show simple records. He's hiding lots!","rating":8},{"id":624629669430739000,"text":"I love Bluffton, SC, what a great place -- what great people.","rating":2},{"id":495027187381461000,"text":"Ebola patient will be brought to the U.S. in a few days - now I know for sure that our  leaders are incompetent. KEEP THEM OUT OF HERE!","rating":9},{"id":412162068989874200,"text":"We should be focusing on beautiful, clean air &amp, not on wasteful &amp, very expensive GLOBAL WARMING bullshit! China &amp, others are hurting our air","rating":7},{"id":394117653830570000,"text":"Can you imagine the anger and disgust when the heads of other countries found out that their cell phones were being tapped by NSA.Obama mess","rating":6},{"id":316645898706907140,"text":"When somebody challenges you, fight back -- be tough!","rating":3},{"id":523785899264712700,"text":"Do you believe Obama just said that America would be \"\"less safe\"\" with a travel ban from West Africa.This is the thinking of a total mad man!","rating":8},{"id":298252197563621400,"text":"The Country is being run just like the stadium.","rating":4},{"id":563803087870361600,"text":"My father's 4 step formula for success: \"\"Get in, get it done, get it done right, and get out.\"\" -- Fred C. Trump","rating":5},{"id":402216303165186050,"text":"Football coaches are no longer allowed to scream and yell at their players because it is discriminatory,racist and can be viewed as bullying","rating":6},{"id":495531002505494500,"text":"The U.S. must immediately stop all flights from EBOLA infected countries or the plague will start and spread inside our \"\"borders.\"\" Act fast!","rating":8},{"id":445109614468948000,"text":"When nobody wanted the UFC, I opened the way by letting them fight at the Trump Taj Mahal in Atlantic City. Dana White has done a great job!","rating":4},{"id":573616949957124100,"text":"I hope the Mexican judge is more honest than the Mexican businessmen who used the court system to avoid paying me the money they owe me.","rating":7},{"id":568443253177126900,"text":"Entrepreneurs: It's often to your advantage to be underestimated.","rating":3},{"id":313756542405066750,"text":"Is Anthony Weiner also delusional? Add him to NY Sex Offender list instead!","rating":6},{"id":517613167359574000,"text":"Ebola is much easier to transmit than the CDC and government representatives are admitting. Spreading all over Africa-and fast. Stop flights","rating":7},{"id":360124399074025500,"text":"I can’t believe Apple isn’t moving faster to create a larger iPhone screen. Bring back Steve Jobs!","rating":5},{"id":324978822955028500,"text":"Being tough doesn’t mean being nasty, difficult, or unreasonable. It means being tenacious and refusing to give in or give up.","rating":2},{"id":520062102875439100,"text":"Obama, stop the flights to and from West Africa NOW - before it is too late! Can't you see what's happening? Can you be that thick (stupid)?","rating":9},{"id":398546755903422460,"text":"We still have not learned the full truth on Benghazi.  Four Americans were killed. Congress must act!","rating":5},{"id":503988326471585800,"text":"Obama sent weapons through Benghazi to ISIS yet he is holding up shipments to Israel. What is he thinking?","rating":8},{"id":265825916163346430,"text":"I was invited to be with Mitt Romney tonight --- win, lose, or draw, I’ll be there!","rating":4},{"id":403116629749674000,"text":"Work is fun, deals are fun, life is fun - but love of a great family makes it all come together. Go out there and make your family proud.","rating":2},{"id":434437236616986600,"text":"Set the bar high--do the best you possibly can. Be focused, disciplined and alert every single day.","rating":3},{"id":421339040802041860,"text":"The news about our beautiful Miss Venezuela, Monica Spear, is devastating to all who knew her. A spectacular woman, she will be missed.","rating":3},{"id":266038095986704400,"text":"Our nation is a once great nation divided!","rating":5},{"id":518424184008237060,"text":"This Ebola patient Thomas Duncan, who fraudulently entered the U.S. by signing false papers, is causing havoc. If he lives, prosecute!","rating":9},{"id":626508802041507800,"text":"People like lawyer Elizabeth Beck and failed writer Harry Hurt &amp, others talk about me but know nothing about me—crazy!","rating":7},{"id":544968568224231400,"text":"Tweet me your New Year's resolution to make America great again! #TrumpNewYearsRes http://t.co/HmfRHUoIWT","rating":6},{"id":510102786596687900,"text":"On 9/11, we pray for the victims and their families of the attack and give thanks to all who have sacrificed for justice &amp, our freedom.","rating":4},{"id":622841801859334100,"text":"A true piece about the standing ovations I got yesterday http://t.co/EplLsBWgBE","rating":3},{"id":1229788025883955200,"text":"....I have seen some of the regulations being circulated, including those being contemplated by Congress, and they are ridiculous. I want to make it EASY to do business with the United States, not difficult. Everyone in my Administration is being so instructed, with no excuses...","rating":2},{"id":513483890053615600,"text":"\"\"Without passion, you don’t have energy, and without energy, you have nothing!\"\" Just one more of my totally brilliant quotes - use it well.","rating":5},{"id":593211460412710900,"text":"Hopefully there won't be any problems in Baltimore tonight. Be calm, be cool-do not let anybody get hurt.There is just too much to live for!","rating":4},{"id":286912989322424320,"text":"“Think of yourself as a one-man army.  You’re not only the commander in chief, you’re the soldier as well.” – Think Like a Billionaire","rating":4},{"id":403741384051789800,"text":"For all those sick degenerates contemplating a knockout attack, please remember the late, great Charles Bronson-no more crime!","rating":7},{"id":301449112614760450,"text":"“Successful people don't have fewer problems.They have determined that nothing will stop them from going forward.” Dr. Benjamin Carson","rating":3},{"id":513252073727873000,"text":"What separates the winners from the losers is how a person reacts to each new twist of fate.","rating":2},{"id":597697408462626800,"text":"How come there are no protests in favor of the two young police officers gunned down in Mississippi by two deranged animals. DEATH PENALTY!","rating":8},{"id":393064582287069200,"text":"If the Saudis are so concerned about Syria then they should go in themselves. Stop telling us to do their dirty work.","rating":6},{"id":517110652675309600,"text":"The United States must immediately institute strong travel restrictions or Ebola will be all over the United States-a plague like no other!","rating":8},{"id":409079434172309500,"text":"Don't underestimate yourself--or your possibilities. There are always opportunities.","rating":3},{"id":453956405389967360,"text":"“Talent hits a target no one else can hit. Genius hits a target no one else can see.” – Arthur Schopenhauer","rating":2},{"id":361926412438994940,"text":"“Once you learn to quit, it becomes a habit.” - Vince Lombardi","rating":2},{"id":327464749837189100,"text":"Wow, I’m at 2,200,000  followers but I’d love to get rid of the haters &amp, losers—they’re such a waste of time!","rating":9},{"id":587003166316699600,"text":"Without passion, you don't have energy, without energy, you have nothing. Nothing great in the world has been accomplished without passion!","rating":4},{"id":517097817702412300,"text":"President Obama should stay out of the Hong Kong protests, we have enough problems in our own country!Can't even properly police White House","rating":7},{"id":504518707880919040,"text":"Remember, the harder you work, the luckier you get!","rating":3},{"id":267288707621593100,"text":"\"\"Never ever quit, never give up\"\" - Donald J. Trump, The Art of the Deal.","rating":3},{"id":395656470110273540,"text":"“You're never a loser until you quit trying.” - Mike Ditka","rating":3},{"id":299212012121112600,"text":"Wow- no longer Saturday delivery from U.S. Postal Service- no money- our poor, poor Country!","rating":8},{"id":375997306950017000,"text":"“Remember the golden rule of negotiating: ‘He who has the gold makes the rules.’” – Midas Touch","rating":5},{"id":354951569076273150,"text":"With the two wacko perverts--Spitzer and Weiner--NYC politics has become a joke all over the world.","rating":9},{"id":618559022359281700,"text":"“RUBIO’S GANG OF 8 BILL WOULD HAVE REWARDED SANCTUARY CITIES HARBORING ILLEGALS” http://t.co/on0rUCv4MG Marco is a politician-he flip flops!","rating":7},{"id":265929446740082700,"text":"Whoever wins today, remember that tomorrow we still have a country struggling. Our work is not done until America is strong again.","rating":4},{"id":278269256657956860,"text":"The Ground Zero Mosque should not go up where planned. It is wrong.  My offer still stands to buy the property.  Good deal for everyone.","rating":6},{"id":413757137190273000,"text":"No cuts to welfare, no cuts to food stamps &amp, NOT A SINGLE CUT TO OBAMACARE, yet the new budget cuts military benefits. Sad!","rating":7},{"id":407867002024628200,"text":"You can only smile when the losers of the world try so hard to put down successful people. Just remember, they all want to be YOU!","rating":8},{"id":1205852244010246100,"text":"....trampled on our Constitution, and they have done irreparable harm to our Republic. The American people are going to speak up and speak out about this. I think this guarantees Trump’s re-election in 2020.” Jason Meister","rating":6},{"id":382567832287846400,"text":"Obama told the UN that “the world is more stable than it was 5 years ago.” Is he delusional?","rating":7},{"id":322798543221956600,"text":"Where is the President?  It is time for him to come on TV and show strength against the repeated threats from North Korea -- and others.","rating":3},{"id":507878133857407000,"text":"“Peace is not absence of conflict, it is the ability to handle conflict by peaceful means.” – Pres. Ronald Reagan","rating":2},{"id":489870096152932350,"text":"Adversity is a fact of life. Be bigger than the problems, be ready to fight for your rights, &amp, all will be well – Trump Never Give Up","rating":5},{"id":518421529504542700,"text":"If Ebola is so non-contagious, how come an NBC cameraman caught it so quickly while over in West Africa? U.S. is behaving very foolishly!","rating":7},{"id":422555587818565600,"text":"After watching all about the horror story that is A-Rod, I realized again that it is time to let Pete Rose into the Baseball Hall of Fame!","rating":4},{"id":425290735273795600,"text":"Movie producer Harvey Weinstein, who lost his company to Colony Capital, is against guns but makes movies w/ major gun violence--really!","rating":6},{"id":399171340042661900,"text":"I'm in Moscow for Miss Universe tonight - picking a winner is very hard, they are all winners. Total sellout of arena. Big night in Russia!","rating":3},{"id":578989025396154400,"text":"Success is not final, failure is not fatal: it is the courage to continue that counts. -- Winston Churchill","rating":2},{"id":368694693577494500,"text":"We must leave \"\"stop and frisk\"\" for A-Rod and Anthony Weiner!","rating":7},{"id":489000750270263300,"text":"Can you imagine trading five really bad enemies of the U.S. for the freedom of traitor Bergdahl. Just another bad deal!","rating":8},{"id":491683709704503300,"text":"You have enemies? Good. That means you've stood up for something, sometime in your life. -- Winston Churchill","rating":2},{"id":357233422948773900,"text":"“He who is not courageous enough to take risks will accomplish nothing in life.” - Muhammad Ali","rating":1},{"id":294911699650232300,"text":"“Always remember: Dress for the job you want, not the job you have.” – Think Like a Billionaire","rating":3},{"id":418365112844824600,"text":"Today is the first day of the rest of your life - make the most of it!","rating":1},{"id":357836961605627900,"text":"Isn't it crazy that people of little or no talent or success can be so critical of those whose accomplishments are great with no retribution","rating":7},{"id":299610010000961540,"text":"Negotiation is persuasion more than power. Be reasonable and flexible, and never let anyone know exactly where you’re coming from.","rating":4},{"id":464787743315607550,"text":"Many of life's failures are people who did not realize how close they were to success when they gave up.  --  Thomas A. Edison","rating":2},{"id":505004047301345300,"text":"The ALS #IceBucketChallenge that Trumps them all- http://t.co/qqxRaTlKpP","rating":5},{"id":462820414667120640,"text":"Floyd Mayweather is being beaten up badly through 10 rounds by Marcos Maidana, but announcers say it is even. TWO ROUNDS LEFT.","rating":6},{"id":523267978931208200,"text":"Do you think the 14 African nations that are banning West Africans from coming into their nations are being called racists? Perhaps not!","rating":8},{"id":474024761685573600,"text":"The five Taliban leaders released for a deserter must really be laughing and having a good time right now. They are saying how dumb U.S. is!","rating":8},{"id":449544008986275840,"text":"With autism being way up, what do we have to lose by having doctors give small dose vaccines vs. big pump doses into those tiny bodies?","rating":9},{"id":363388055102562300,"text":"“History does not long entrust the care of freedom to the weak or the timid.” - Dwight D. Eisenhower","rating":3},{"id":431188704380465150,"text":"Never allow your attitude to be a liability. Be positive and strong. Set your mind on winning-- and keep it there.","rating":4},{"id":112244047195803650,"text":"Want jobs? Slash corporate tax rate.  Tax incentives for companies that create jobs in US.  America will boom.","rating":5},{"id":535534634319495200,"text":"If we do not protect the rule of law then we can expect even more illegals to cross the border. Obama’s executive amnesty is dangerous.","rating":6},{"id":581171685186994200,"text":"Message to Obama re: Iran: “The worst thing you can possibly do in a deal is seem desperate to make it.” – The Art of the Deal","rating":5},{"id":260412905361657860,"text":"Lots of autism and vaccine response. Stop these massive doses immediately. Go back to single, spread out shots! What do we have to lose.","rating":8},{"id":410743213084119040,"text":"President Obama's approval rating, at 38%, is at an all-time low. Gee, I wonder why?","rating":6},{"id":413914456201375740,"text":"If you fail once, twice, three times, it doesn't matter. Learn from your mistakes and push forward to VICTORY-the sweetest feeling there is!","rating":4}]