[{"id":542407460892315650,"text":"Very sad &amp, dangerous that soon to be ex-Intelligence Chair Dianne Feinstein released the CIA report. Glad she is losing her Comm. Chair.","rating":8},{"id":416559129256153100,"text":"\"\"Be on time. Wasting other people's time due to poor planning and thoughtlessness will only leave a bad impression.\"\" - Think Like a Champion","rating":2},{"id":409893020461695000,"text":"Obama said he never met his uncle, Oscar, who was arrested for whatever. Turns out he lived with his uncle in Boston. SO MANY LIES!","rating":7},{"id":301444292755476500,"text":"I went to Wharton, made over $8 billion, employ thousands of people &amp, get insulted by morons who can’t get enough of me on twitter...!","rating":9},{"id":491324721297100800,"text":"Obama wanted Putin to reset. Instead, Putin laughed at him and reloaded.","rating":6},{"id":255397854347157500,"text":"How long did it take for Obama to call Hugo Chavez and congratulate him on his 'reelection?' Who do you think Chavez supports in ours?","rating":5},{"id":325397568672649200,"text":"Get ALL the info,  then quick trial, then death penalty for the Boston killer of innocent children and people! Do not be kind.","rating":8},{"id":287305133904240640,"text":"\"\"Never, never, never give up.\"\" - Winston Churchill","rating":1},{"id":522462346791637000,"text":"Our president could not make a proper website with $5B. The website still does not work. How can we feel safe about Ebola?!","rating":7},{"id":413352502239559700,"text":"For all of those that think life is easy &amp, don’t want to work, remember: HOPE IS THE POOR MAN’S BREAD.","rating":4},{"id":182467222470524930,"text":"They should seriously look into the moron George Zimmerman who shot and killed the 17 year old kid, Trayvon (cont) http://t.co/sIFjKnPO","rating":8},{"id":377646458872553500,"text":"Thank you to all of my Twitter followers for helping to defeat Weiner and Spitzer. Remember, in the beginning they said it couldn't be done!","rating":7},{"id":284770791126601730,"text":"“You have to set higher and higher goals.  You have to want more or you will start slipping backwards fast.” – Think BIG","rating":3},{"id":253587791454294000,"text":"Have you heard? China just told Obama to jump. Obama asked how high.","rating":9},{"id":520562181616959500,"text":"Obama is making the Ebola problem much worse than it needs to be in the U.S. by not halting flights from West Africa. Airport testing a joke","rating":8},{"id":398116666711609340,"text":"“If you put the federal government in charge of the Sahara Desert, in 5 years there'd be a shortage of sand.” – Milton Friedman","rating":6},{"id":520198887853023200,"text":"“The way to get started is to quit talking and begin doing.” – Walt Disney","rating":4},{"id":488277341303341060,"text":"THE HARDER YOU WORK, THE LUCKIER YOU GET!","rating":5},{"id":543161239976026100,"text":"These Islamists chop Americans’ heads off and want to destroy us. We should be applauding the CIA, not persecuting them.","rating":7},{"id":485303036605394940,"text":"Let this be the day you go for your dream. Focus, don't give up, and only accept total and complete victory. You can do it!","rating":4},{"id":347803389998022660,"text":"Negotiation is persuasion more than power. Negotiation includes a lot of fine lines--and that's what makes it an art.","rating":3},{"id":246658792757014530,"text":"Oh no, another rapper doing a Trump song --\"\"Young Jeezy - Trump Lyrics.\"\" Why aren't these guys paying me?","rating":6},{"id":353319755173736450,"text":"Dwight Howard just signed with Houston.","rating":1},{"id":501464481172820000,"text":"“Destiny has a part to play in your life and in your business--so give it a chance to work.” – Think Like a Champion","rating":2},{"id":527549330207817700,"text":"Obama will quarantine all soldiers returning from Africa for 21 days. But he still allows all who contract Ebola into country? Hypocrite.","rating":7},{"id":523267057497178100,"text":"14 African nations have totally banned West Africans from entering their nations. Likewise many other nations. But the U.S. = \"\"COME ON IN\"\"","rating":8},{"id":604826775030509600,"text":"While Jon Stewart is a joke, not very bright and totally overrated, some losers and haters will miss him and his dumb clown humor. Too bad!","rating":9},{"id":499181941498052600,"text":"Robin Williams was a truly wonderful actor &amp, comedian. One of the few people who could make me laugh. Very tragic.","rating":4},{"id":271346894272344060,"text":"I am having 600 Thanksgiving dinners sent to the Rockaways--prepared by my wonderful Trump Grill/Trump Tower staff. #SandyRelief","rating":5},{"id":527193484449824800,"text":"Success requires 100% of your focus and 100% of your effort. Don't sell yourself short.","rating":3},{"id":589388289456660500,"text":"For all of the haters and losers out there sorry, I never went Bankrupt -- but I did build a world class company and employ many people!","rating":8},{"id":430158538326167550,"text":"This may be the worst football game ever played by one team, Denver! Hard to watch.","rating":5},{"id":524173207637884900,"text":"I was never a fan of Bush, in fact, he was so bad he gave us Obama! But Obama is truly a pathetic excuse of a president, can't get any worse","rating":9},{"id":521071355929063400,"text":"President Obama, NOW, bring our 4000 innocent and ill-trained soldiers home from West Africa, before it is too late, AND STOP THE FLIGHTS!","rating":7},{"id":455843179011801100,"text":"Al Sharpton said they are \"\"even making it more harder to register people to vote\"\". Which is worse, his grammar or his thoughts?","rating":8},{"id":497771551887228900,"text":"What other country tells the enemy when we are going to attack like Obama is doing with ISIS. Whatever happened to the element of surprise?","rating":7},{"id":339204360179417100,"text":"We spend billions of dollars helping nations all over the World but with hurricane Sandy and Oklahoma tornado not one nation helped us!","rating":6},{"id":515630883639148540,"text":"Can you believe we still have not gotten our Marine out of Mexico. He sits in prison while our PRESIDENT plays golf and makes bad decisions!","rating":7},{"id":424402187050303500,"text":"To be really successful it is always good to have A COOL HEAD, WARM HEART AND BEAUTIFUL COMMON TOUCH!","rating":4},{"id":620966492667048000,"text":"Response to Hillary Clinton- http://t.co/nzYfehyURa","rating":3},{"id":413480144452743200,"text":"The more time you spend feeling sorry for yourself, the more time you waste after a setback. Move on and quickly embrace the next challenge!","rating":4},{"id":486863518969647100,"text":"We should cut off all aid to every country that does not respect our border. Why are we giving them money in the first place?","rating":8},{"id":360117827841163260,"text":"My comment last March - “Anthony Weiner is a sick pervert, you think he will change? He will never change.” http://t.co/uF5F0FbwGd","rating":9},{"id":605432217876197400,"text":"“The Constitution is the guide which I never will abandon” - George Washington","rating":3},{"id":327880859782897660,"text":"Ignorance is inexcusable, it’s the surest way to fail. No acceptable reason exists for not being well informed.","rating":5},{"id":539845503425716200,"text":"Young entrepreneurs: Your success is measured by results. Be productive in the face of challenges. Setbacks are not fatal.","rating":4},{"id":437989895504539650,"text":"Entrepreneurs:  Don't expect anyone to be on your side. Sometimes we're all in this alone. So believing in yourself is mandatory.","rating":4},{"id":425359072188067840,"text":"People often ask me the secret to my success, and the answer is simple: passion, focus and hard work. Momentum keeps it all going.","rating":4},{"id":253126832319262720,"text":"Obama now wants to give another $450M to the Muslim Brotherhood. Money we don't have going to people that hate us. Moronic.","rating":9},{"id":396004451237912600,"text":"“If you like your healthcare plan you can keep it.” = “I was born in Hawaii.”","rating":8},{"id":488462496584314900,"text":"I can't believe that 60 Minutes is right now showing our nuclear facilities for the world to see (at request of U.S. leadership). STUPID!","rating":8},{"id":551919091507028000,"text":"This is going to be a special season - truly great characters and cast. You will soon see!","rating":3},{"id":406153662562844700,"text":"HAPPY THANKSGIVING EVERYONE, ENJOY YOUR DAY!","rating":2},{"id":494832754253910000,"text":"\"\"It takes guts to be a brand. You cannot be all things to all people if you want to be a brand.\"\" - Midas Touch","rating":1},{"id":510935518360895500,"text":"Money was never a big motivation for me, except as a way to keep score. The real excitement is playing the game!","rating":3},{"id":392808068645650400,"text":"Breaking news - The Washington Redskins have just announced that they will be removing the name Washington from their name!","rating":7},{"id":598328562739970000,"text":"Remember, politicians are all talk and NO action. Our country is a laughing stock that is going to hell. The lobbyists &amp, donors control all!","rating":9},{"id":393120068483035140,"text":"\"\"Courage is being scared to death... and saddling up anyway.\"\" - John Wayne","rating":2},{"id":347076807780081660,"text":"Young entrepreneurs – never back down. Take the hits and get up.  That’s what makes a winner.","rating":4},{"id":127387237007630340,"text":"Why did we spend billions of our money on Libya if we are not going to get any of the country's oil? What do we get out of this?","rating":8},{"id":520176318198317060,"text":"The U.S. is spending fortunes at airports checking people coming in from West Africa, with uncertain results. STOP THE FLIGHTS YOU DUMB B's!","rating":9},{"id":245971629090426880,"text":"Obama will go down as the worst President in history on many topics but especially foreign policy.","rating":7},{"id":464025717101969400,"text":"We will never have great national security in the age of computers - too many brilliant nerds can break codes (the old days were better).","rating":6},{"id":251422691528155140,"text":"\"\"If you're going through hell, keep going.\"\" --Winston Churchill","rating":2},{"id":590609810942517200,"text":"I’m a conservative, but the weakness of conservatives is that they destroy each other, whereas liberals unite to win.","rating":5},{"id":534200399025438700,"text":"The entire country is  FREEZING - we desperately need a heavy dose of global warming, and fast! Ice caps size reaches all time high.","rating":8},{"id":511859412387233800,"text":"Can you believe that the U.S. will be sending 3000 troops to Africa to help with Ebola.They will come home infected? We have enough problems","rating":8},{"id":446753531694182400,"text":"\"\"Failure is simply the opportunity to begin again, this time more intelligently.\"\" -- Henry Ford","rating":2},{"id":258389970090340350,"text":"Obama keeps namedropping Bill Clinton-- he is no Bill Clinton.","rating":4},{"id":246595296489000960,"text":"WOW! I just heard that the previously unknown singer Mac Miller has received over 67 million hits on his song \"\"Donald Trump.\"\"","rating":3},{"id":330397442409381900,"text":"When written in Chinese, the word 'crisis' is composed of two characters. One represents danger and the other represents opportunity.\"\" JFK","rating":3},{"id":288762655290847200,"text":"“Give me a smart idiot over a stupid genius any day.” - Samuel Goldwyn","rating":2},{"id":467360292843044860,"text":"Success is not final, failure is not fatal: it is the courage to continue that counts. -- Winston Churchill","rating":2},{"id":550046337547665400,"text":"What separates the winners from the losers is how a person reacts to each new twist of fate.","rating":1},{"id":284663280973258750,"text":"“To be successful, you must become very good at finding creative solutions to what appear to be impossible problems.” – Think BIG","rating":2},{"id":478847600838201340,"text":"It's time to let Pete Rose, the all time hits leader, into the Baseball Hall of Fame. Enough already!!!!!","rating":6},{"id":520880274750857200,"text":"Isn't it ridiculous, starting today, new Ebola screenings go into effect for people coming from West Africa. Just stop the flights dummies!","rating":8},{"id":266287015908237300,"text":"Beijing had a bigger celebration than Chicago last night.  The Chinese are happier with the election than we are.","rating":5},{"id":179270017064513540,"text":"Afghanistan is a total disaster. We don't know what we are doing. They are, in addition to everything else, robbing us blind.","rating":6},{"id":417818392826232800,"text":"The con artists changed the name from GLOBAL WARMING to CLIMATE CHANGE when GLOBAL WARMING was no longer working and credibility was lost!","rating":7},{"id":509993756461125600,"text":"Can you believe that our very stupid politicians released the leader of ISIS and now we are spending billions trying to get him back!","rating":8},{"id":462824376153677800,"text":"Crowd is booing the hell out of that phony decision - place is angry and going wild. Fight was not even close! DISGUSTING.","rating":7},{"id":504934079750754300,"text":"I will be doing the A.L.S. Ice Bucket Challenge this morning on twitter. It is not something I look forward to doing but is for a good cause","rating":3},{"id":282212593844764670,"text":"“Deals are my art form.  I like making deals, preferably big deals.” – The Art of The Deal","rating":2},{"id":293750221685551100,"text":"You must promise that you will never cheat off Manti Te’o’s test papers.","rating":5},{"id":509875886775349250,"text":"I just want to know how much is Saudi Arabia and others who we are helping willing to pay for our saving from total extinction. Pay up now!","rating":6},{"id":583734218162856000,"text":"Oil is under $50/barrel. Now is the time to increase sanctions against Iran, not lift them. No deal is better than a bad deal. #ArtOfTheDeal","rating":4},{"id":567105378132172800,"text":"Wow, 25 degrees below zero, record cold and snow spell. Global warming anyone?","rating":7},{"id":268086256750178300,"text":"How come every time I show anger, disgust or impatience, enemies say I had a tantrum or meltdown—stupid or dishonest people?","rating":8},{"id":448180563799978000,"text":"\"\"You miss 100% of the shots you don't take.\"\"  -- Wayne Gretzky","rating":1},{"id":421755269194846200,"text":"Be tough, be smart, be personable, but don't take things personally. That's good business.","rating":3},{"id":387905105011691500,"text":"It is outrageous and disgusting that families of U.S. MILITARY personnel killed in action will not be given money for burials. SAD!","rating":8},{"id":519962504211214340,"text":"Any American who fights with ISIS should have their passport revoked. Take them to Gitmo for interrogation.","rating":6},{"id":261221579399245820,"text":"Obama has no problem leaking national security secrets.  Why can't he release his records?  Especially when $5M is going to charity.","rating":7},{"id":451024732872540160,"text":"\"\"People rarely succeed unless they have fun in what they are doing.\"\"-- Andrew Carnegie","rating":3},{"id":496740199658188800,"text":"Think big. Stay focused. Be passionate. Don’t ever give up","rating":4},{"id":405429450671530000,"text":"How does Obama rationalize giving Iran $8B in sanction relief when a Christian pastor is being tortured in an Iranian prison?","rating":7},{"id":530065929418575900,"text":"The weak jokers who so badly hurt great Penn State University should have fought the NCAA instead of making a deal- http://t.co/b9E5eC9pam","rating":5},{"id":517103975263662100,"text":"Here we go! I stated long ago that we should cancel all flights from West Africa. Now we have Ebola in U.S., AND IT WILL ONLY GET WORSE!","rating":9},{"id":509083595127128060,"text":"\"\"Everything you can imagine is real.\"\" —Pablo Picasso","rating":2},{"id":408727220509634560,"text":"It always seems impossible until it is done. --Nelson Mandela","rating":1},{"id":486464265360900100,"text":"Our country will soon be relegated to THIRD WORLD status if proper decisions are not made by our president. He was never qualified for job!","rating":8},{"id":420666629203042300,"text":"\"\"Stay confident even when something bad happens. It is just a bump in the road. It will pass.\"\" - Think Big","rating":2},{"id":401404606447493100,"text":"Again, more dead people voted in the last election than enrolled in ObamaCare. Congratulations America!","rating":9},{"id":504823998396772350,"text":"We have got to get our Marine out of that disgusting Mexican jail. Would be so easy if we had a real leader. One tough phone call &amp, he's out","rating":7},{"id":445970460392837100,"text":"\"\"The only way to do great work is to love what you do.\"\"  – Steve Jobs","rating":1},{"id":256486209034022900,"text":"It's Thursday and only 26 days until the election. How many illegal donations from China and Saudi Arabia did Obama collect today?","rating":8},{"id":401355072808185860,"text":"The only deal the Republicans should accept is a complete repeal of ObamaCare. You have them on the run - don't fold - go for it!","rating":6},{"id":326791014146768900,"text":"Did the Boston terrorists register their guns? No. Another example of why gun control legislation is not the answer!","rating":7},{"id":524486709904703500,"text":"Oscar Pistorius only gets five years in prison for killing his girlfriend. Ridiculous decision! Judge couldn't even read her own writings.","rating":6},{"id":506897779332223000,"text":"Young entrepreneurs – be patient and continue to work with determination. With hard work, success will follow. Keep your focus!","rating":2},{"id":245599709178257400,"text":"Why won't Obama release his college applications? Is there something 'foreign' about them?","rating":9},{"id":172784797830225920,"text":"\"\"We are the greatest country the world has ever known. I make no apologies for this country, my pride in it, or (cont) http://t.co/DP4HoQiU","rating":3},{"id":162209676795195400,"text":"My daughter Ivanka thinks I should run for President. Maybe I should listen. http://t.co/QW78vJja","rating":7},{"id":373524950650724350,"text":"Is everyone seeing how incompetently our country is being run by watching the mess with Syria? Our leaders don't know what they are doing!","rating":6},{"id":613059647210156000,"text":"Entrepreneurs: Brainpower is the ultimate leverage. Don't underestimate yourself or your possibilities.","rating":2},{"id":402758686659325950,"text":"I took some heat a long time ago when I said that George Zimmerman was a sicko and bad news. I know people and this guy is no good-trouble!","rating":5},{"id":522469437426106400,"text":"Young entrepreneurs – always remember in negotiations that sometimes the best deal you make is the one you walk away from.","rating":2},{"id":406943740511940600,"text":"That was a great football game.","rating":1},{"id":471637686248542200,"text":"“You cannot escape the responsibility of tomorrow by evading it today.” – Pres. Abraham Lincoln","rating":1},{"id":421013392510287900,"text":"Identify your goals. Know precisely what you want to achieve, study the best people in your field,and then plan the best route for success.","rating":2},{"id":506197526387908600,"text":"Have you been watching how Saudi Arabia has been taunting our VERY dumb political leaders to protect them from ISIS. Why aren't they paying?","rating":8},{"id":123827985638899710,"text":"I don't want to be the only billionaire in America---I want all Americans to be rich.","rating":5},{"id":267009373132435460,"text":"Everybody wants me to talk about Robert Pattinson and not Brian Williams—I guess people just don’t care about Brian!","rating":7},{"id":524520062242537500,"text":"Oscar Pistorious will likely only serve 10 months for the cold blooded murder of his girlfriend. Another O.J. travesty.The judge is a moron!","rating":9},{"id":376114891381542900,"text":"If Syria was forced to use Obamacare they would self-destruct without a shot being fired. Obama should sell them that idea!","rating":10},{"id":503973652522885100,"text":"Obama’s motto: If I don’t go on tax payer funded vacations &amp, constantly fundraise then the terrorists win.","rating":8},{"id":487671773031567360,"text":"Success is not final, failure is not fatal: it is the courage to continue that counts. -- Winston Churchill","rating":3},{"id":448924453716885500,"text":"\"\"Success is not final, failure is not fatal: it is the courage to continue that counts.\"\" -- Winston Churchill","rating":3},{"id":268819094642499600,"text":"Social media has changed the news &amp, communication landscape for good. Everything must be up to date by the second instead of the hour or day","rating":4},{"id":440313189062823940,"text":"I'm having a real hard time watching the Academy Awards (so far). The last song was terrible! Kim should sue her plastic surgeon! #Oscars","rating":9},{"id":314106017375981600,"text":"If you’re sitting in an office working in a job you hate, then it’s time to THINK BIG and plan your next step...","rating":5},{"id":520319201534152700,"text":"The CDC chief just said Ebola is spreading faster than Aids. Marines are preparing for a pandemic drill. Stop all flights from West Africa!","rating":8},{"id":326439526551658500,"text":"If your enemies end up liking you it’s because they beat you.  You want their respect, not their friendship.","rating":6},{"id":256104065287733250,"text":"47M on food stamps. Over 23M Americans unemployed. 50% of college grads unemployed. And Obama wants us talking about Big Bird.","rating":7},{"id":256063573669855230,"text":"\"\"It doesn't matter who you vote for--it matters who is counting the votes.\"\" Be careful of voter fraud!","rating":7},{"id":487096016982650900,"text":"Obama looks exhausted and beaten. He was never made or prepared for the job. Like it or not, he doesn't have \"\"it\"\"","rating":6},{"id":268788050878951420,"text":"To aspiring entrepreneurs, always remember that if your enemies aren’t talking about you, then you aren’t doing well...and must work harder!","rating":5},{"id":278961162123620350,"text":"A friend is one who has the same enemies as you have. -- Abraham Lincoln","rating":4},{"id":287300030686179330,"text":"To all young entrepreneurs entering the business world - stay positive, focused and remember everything has its ups and downs.","rating":4},{"id":113385484822134780,"text":"The American economy would grow if Washington didn’t keep threatening higher taxes and more regulations. Government is not the solution.","rating":4},{"id":354340143907344400,"text":"\"\"The pessimist sees the difficulty in every opportunity and the optimist sees the opportunity in every difficulty.\"\" - Pres. Lincoln","rating":2},{"id":487098994108006400,"text":"The most stringent gun laws in the U.S. happen to be in Chicago - and look what is happening there!","rating":6},{"id":435550908307767300,"text":"Do you believe this one - Secretary of State John Kerry just stated that the most dangerous weapon of all today is climate change. Laughable","rating":8},{"id":252874018955354100,"text":"Obama deserves much less credit for the killing of Bin Laden. The praise goes to our brave military and intelligence officers.","rating":5},{"id":525742989101252600,"text":"There is ZERO margin for error on Ebola. Are we confident in Obama when he can’t even make a website for $5 Billion?","rating":7},{"id":498005940512489500,"text":"The World as we know it is falling apart. Much of the blame can be attributed to the fact that the United States is no longer respected!","rating":7},{"id":468810235810156540,"text":"Logic will get you from A to B. Imagination will take you everywhere. - Albert Einstein","rating":3},{"id":268449146711703550,"text":"It’s amazing how people can talk about me but I’m not allowed to talk about them.","rating":6},{"id":501474962935648260,"text":"The first General killed in a combat zone since Vietnam, it is a travesty that Obama did not attend Major General Harold Greene’s funeral","rating":5},{"id":268465310791778300,"text":"“The only place success comes before work is in the dictionary.” – Vince Lombardi","rating":2},{"id":321724827197116400,"text":"“\"\"Pennies don't fall from heaven, they have to be earned here on earth.\"\" – PM Margaret Thatcher (October, 13 1925 – April, 8 2013)","rating":1},{"id":447334838644015100,"text":"Obama must now FOCUS, get his mind off \"\"March.Madness\"\", and LEAD! Watch Russia closely, work hard on the economy and get rid of ObamaCare!","rating":8},{"id":409048194413109250,"text":"Iran has never had a better friend than Obama.","rating":7},{"id":512004288546373600,"text":"In order to stop the Ebola outbreak in Africa, perhaps the President should put all Africans on ObamaCare rather than sending the troops!","rating":9},{"id":446986007045746700,"text":"President Obama, be cool, be smart, be sharp and FOCUS (no more March Madness), and you can beat Putin at his own game. IT CAN BE DONE!","rating":5},{"id":261138885466267650,"text":"As stated, here is the press release. http://t.co/fJNq2IJW","rating":1},{"id":301425610163646460,"text":"Have confidence, work hard, and keep your focus on the small things that matter while keeping the big picture in mind.","rating":1},{"id":420286728679596000,"text":"Entrepreneurs: Set the example and you'll be a magnet for the right people. Great leaders determine the teams they assemble.","rating":2},{"id":287299754516430850,"text":"Make sure you take some time to enjoy the weekend.  Important for your mind and will help you be productive next week.","rating":1},{"id":535813580357394400,"text":"They're going to riot in Ferguson no matter what.","rating":8},{"id":426017937594392600,"text":"Learning to expect problems saved me from a lot of wasted energy. Winners see problems as just another way to prove themselves.","rating":4},{"id":622465431018864600,"text":"Statement on John McCain- http://t.co/Nh0rJPeUNl","rating":3},{"id":360479141159637000,"text":"“Learn to think continentally.” - Alexander Hamilton","rating":2},{"id":306876994497413100,"text":"Isn’t it ironic that President Obama, of all people, is pushing for ‘universal background checks?!'","rating":7},{"id":508616943159746560,"text":"Getting ready to pay final respect to GREAT LADY Joan Rivers. She could light up a room like no other! She will be greatly missed.","rating":3},{"id":446790989735551000,"text":"President Obama was able to fool the Americans by getting elected, but not able to fool Vladimir Putin. Too bad for us!","rating":6},{"id":425379385714024450,"text":"“You're never a loser until you quit trying.” - Mike Ditka","rating":2},{"id":261925589936648200,"text":"Barack Obama has everything to gain. Why would anyone ever deny $5M to charity?","rating":5},{"id":507546486553706500,"text":"So many people who have children with autism have thanked me—amazing response. They know far better than fudged up reports!","rating":7},{"id":253694168164102140,"text":"As a big job creator, I was greatly honored to have been mentioned twice tonight during the debate.","rating":4},{"id":365226714416164860,"text":"\"\"Get respect, and do not give a damn if people like you.\"\" --Think Big","rating":2},{"id":440338352068251650,"text":"They should have allowed applause during the TRIBUTE to the departed - Really bad production. Bette Midler sucked! #Oscars","rating":8},{"id":268431151666954240,"text":"Our $17T national debt and $1T yearly budget deficits are a national security risk of the highest order.","rating":5},{"id":288722767975686140,"text":"What a great couple... Katherine Webb and AJ McCarron. They are both winners!","rating":3},{"id":462825072353624060,"text":"No wonder boxing is close to dead!","rating":6},{"id":626839550170632200,"text":"Just at a news conference from Trump Turnberry in Scotland. Everybody was there &amp, will be all over television tonite. Back on trail Saturday","rating":3},{"id":558691050714574850,"text":"You have to learn the rules of the game. And then you have to play better than anyone else. -- Albert Einstein","rating":1},{"id":255777551828545540,"text":"Mitt’s subsequent rise in the polls post-debate shows that the American public can still spot a real winner.","rating":2},{"id":253206663664922620,"text":"The Chinese are now hacking White House computers. Why not? They already own the place.","rating":7},{"id":245954982300495870,"text":"I always said the people we fought for in Libya were bad news. Once again, I was right.","rating":7},{"id":289402195785424900,"text":"\"\"If you want to be a success, you have to get used to frequently hearing the word no and ignoring it.\"\" - Think Big","rating":3},{"id":302063403407650800,"text":"It is important to think positively. Negative thinking will kill your focus and destroy any chance you have of being successful.","rating":2},{"id":626369805432553500,"text":"Lawyer Elizabeth Beck was easy for me to beat. Ask her clients if they are happy with her results against me. Got total win and legal fees.","rating":8},{"id":389957445571076100,"text":"My beautiful daughter Ivanka just had a healthy baby boy. Jared and Ivanka are very proud!","rating":4},{"id":511612254241173500,"text":"“Don't expect to build up the weak by pulling down the strong.” - Calvin Coolidge","rating":2},{"id":613892121347682300,"text":"My daughter Ivanka did great tonight in New Hampshire. The sold out crowd loved her, and she loved them. Thanks Ivanka!","rating":3},{"id":351119135830327300,"text":"What my father really gave me is a good (great) brain, motivation and the benefit of his experience-unlike the haters and losers (lazy!).","rating":6},{"id":294101744001110000,"text":"“I can accept failure, everyone fails at something. But I can't accept not trying.” – Michael Jordan","rating":3},{"id":469203105448742900,"text":"\"\"Some people dream of great accomplishments, while others stay awake and do them.”  -- Anonymous","rating":2},{"id":598324947140902900,"text":"The only one to fix the infrastructure of our country is me - roads, airports, bridges. I know how to build, pols only know how to talk!","rating":8},{"id":266986057092964350,"text":"Why do so many people say I hate President Obama—I don’t hate the President at all. I just disagree with his policies!","rating":4},{"id":306818696700104700,"text":"The Pope should not have resigned—he should have lived it out. It hurts him, it hurts the church...","rating":6},{"id":597906025283477500,"text":"Can you imagine, we spend billions of dollars protecting Saudi Arabia and now the King refuses to even meet with Obama. Great leadership!","rating":7},{"id":575046156692095000,"text":"Entrepreneurs: Remember the golden rule of negotiating -- he who has the gold makes the rules.","rating":5},{"id":302445095553232900,"text":"Remember, if you don't promote yourself, then no one else will! Likewise, believe in yourself--or no one else will either.","rating":3},{"id":296362729797722100,"text":"“Sometimes by losing a battle you find a new way to win the war.\"\" The Art of The Deal","rating":5},{"id":503876306728415200,"text":"That Seth Meyers is hosting the Emmy Awards is a total joke. He is very awkward with  almost no talent. Marbles in his mouth!","rating":9},{"id":456501073663258600,"text":"Entrepreneurs--Always remember that every day counts. Stay focused. Stay positive and develop momentum.","rating":2},{"id":498929793715695600,"text":"“Remember that fear can be conquered. Go full throttle, and the odds will be on your side.” – Trump Never Give Up","rating":4},{"id":466286255056359400,"text":"Do your homework. Wasting other people’s time due to poor planning or thoughtlessness leaves a bad impression. – Think Like a Billionaire","rating":3},{"id":517807091067932700,"text":"How incompetent are our leaders allowing these Ebola infected people to come into our country with all of the problems and danger entailed!","rating":9},{"id":144148110799675400,"text":"Get it straight: Pakistan is not our friend. When our tremendous Navy SEALS took out Osama bin Laden, they did... (cont) http://t.co/s6u5o8Co","rating":6},{"id":283280520794734600,"text":"From my family to yours...I want to wish you all a very merry Christmas!","rating":2},{"id":490220422441730050,"text":"“Never confuse a single defeat with a final defeat.” - F. Scott Fitzgerald","rating":3},{"id":615488546951012400,"text":"Remember, Univision apologized!","rating":5},{"id":511896917811691500,"text":"I've realized that success requires 100% effort and 100% focus. Nothing less.","rating":4},{"id":456895966327480300,"text":"America is at a great disadvantage. Putin is ex-KGB, Obama is a community organizer. Unfair.","rating":8},{"id":392745222389510140,"text":"Have time to waste? Go to the ObamaCare website.","rating":7},{"id":339479055969693700,"text":"“Never give up on yourself.” – Think Big","rating":4},{"id":400456453477388300,"text":"ObamaCare is one of the worst political disasters of all time - 4,992,343 AMERICANS LOSING COVERAGE, LESS THAN 50,OOO NEW SIGNUPS.","rating":8},{"id":443488366097883140,"text":"\"\"The secret of getting ahead is getting started.\"\"  -- Mark Twain","rating":2},{"id":614845734278533100,"text":"The leader and negotiators representing Mexico are far smarter and more cunning than the leader and negotiators representing the U.S.!","rating":7},{"id":108570669423394820,"text":"If the UN unilaterally grants the Palestinians statehood, then the US should cut off all its funding. Actions have consequences.","rating":6},{"id":415676655588622340,"text":"Merry Christmas, have an amazing day!","rating":3},{"id":363008524516724740,"text":"Snowden is handing over to Russia a treasure trove of intel. Our politicians are incapable of dealing!","rating":8},{"id":539810100366807040,"text":"So sad that Burt Reynolds has lost all of his money. I wish he came to me for advice--he would be rich as hell!","rating":9},{"id":473848994167545860,"text":"President said we would never leave a soldier behind. How about the 4 who died in Benghazi?","rating":7},{"id":458785983270780900,"text":"Interesting how President Obama is flying around in a Boeing 747 on so-called Earth Day!","rating":8},{"id":253141897361633280,"text":"Al Qaeda taking over Libya after we made it possible--really amazing.","rating":7},{"id":460887386474700800,"text":"Young Entrepeneurs: Think Big, Stay Motivated &amp, Always Remain Confident. The Sky is the Limit.","rating":3},{"id":447082372887228400,"text":"Great advice from my father: \"\"Know everything you can about what you're doing.\"\" -- Fred C. Trump","rating":2},{"id":289131808174514200,"text":"\"\"All successful people are high energy people who are passionate about what they do. Find a passion that energizes you.\"\" - Think Big","rating":2},{"id":432859138876772350,"text":"Anytime you see someone talking about celebrity weight loss on my \"\"twitter\"\" it is a total scam!","rating":5},{"id":360253759483428860,"text":"I've just started blocking out some of the repetitive and boring (&amp, dumb) haters and losers. They are a waste of time and energy!","rating":6},{"id":327105132531687400,"text":"Can someone explain to me how a Chechnyan permanent resident non-citizen in our country is planning Jihad while on welfare?","rating":8},{"id":426440388631482400,"text":"\"\"You never know when the tide is going to turn in your favor. It's important to never give up on yourself.\"\" -- Think Like a Champion","rating":3},{"id":257887990905466880,"text":"Barack Obama is not who you think he is. Most overrated politician in US history.","rating":7},{"id":334381240482410500,"text":"\"\"Success  consists of going from failure to failure without loss of  enthusiasm.\"\" - Winston  Churchill","rating":1},{"id":486462410358652900,"text":"The immigration crisis is a horrible mess made worse by an incompetent president who doesn't have a clue. We need new leadership FAST!","rating":6},{"id":6090839867,"text":"Wishing you and yours a very Happy and Bountiful Thanksgiving!","rating":2},{"id":267626183783493630,"text":"I am a very calm person but love tweeting about both scum and positive subjects. Whenever I tweet, some call it a tirade..totally dishonest!","rating":7},{"id":263281113416486900,"text":"Because of the hurricane, I am extending my 5 million dollar offer for President Obama's favorite charity until 12PM on Thursday.","rating":8},{"id":376326101330821100,"text":"I'm a Republican but not a fan of the last George Bush-he also was a lousy President (Iraq etc.). In fact, he was so bad he gave us Obama!","rating":6},{"id":449635980954583040,"text":"To all young (and old) entrepreneurs: Believe in yourself, talk yourself up! Energize yourself and you'll energize others.","rating":3},{"id":388342515134246900,"text":"Obama can open the Mall for illegals to protest our country yet he continues to barricade WWII memorial. That’s an absolute disgrace.","rating":8},{"id":518883913113301000,"text":"I don't know what it is, but I'm getting totally bored watching NFL football. Too many penalties and far too soft! T.V. off and back to work","rating":7},{"id":131476341198553090,"text":"Is Jon Stewart a racist? See video that includes clip... http://t.co/tUae4cWq #thedailyshow","rating":6},{"id":522513214354235400,"text":"With all of the words President Obama just dispensed at his press conference, he didn't say what we all want to hear,\"\"I'LL STOP THE FLIGHTS\"\"","rating":7},{"id":190093504939163650,"text":"I'll be speaking tomorrow at the San Jose Convention Center (CA) for the first- ever National Achievers Congress http://t.co/m4JN2oIw","rating":2},{"id":387722824393433100,"text":"I'm just so tired of listening to the same old rhetoric and words, day after day, from our President. It's time to stop talking-WORK!","rating":5},{"id":550045430487461900,"text":"Sometimes by losing a battle you find a new way to win the war.","rating":4},{"id":530910890057818100,"text":"We spent TWO TRILLION DOLLARS in Iraq and got NOTHING. Now we are going back and will again get NOTHING because our leaders are clueless!","rating":8},{"id":428717722583961600,"text":"Remember when \"\"comedian\"\" Bill Maher openly praised the disgusting terrorists who destroyed the World Trade Center-then got canned by ABC?","rating":9},{"id":266292236667478000,"text":"“A man always has two reasons for doing anything: a good reason and the real reason.” -- J. P. Morgan","rating":3},{"id":412017385345138700,"text":"Wow, it's snowing in Isreal and on the pyramids in Egypt. Are we still wasting billions on the global warming con? MAKE U.S. COMPETITIVE!","rating":7},{"id":312700555875213300,"text":"WHY CAN'T THE MEDIA TELL THE TRUTH - WE WOULD ALL BE SO MUCH BETTER OFF!","rating":6},{"id":302428698341146600,"text":"“Do not give in to anger. It destroys your focus on goals and ruins your concentration.” – Think Big","rating":2},{"id":535158134231552000,"text":"“Get in. Get it done. Get it done right. Get out.” – Fred C. Trump (My father!)","rating":4},{"id":473915889809899500,"text":"It would be nice if our commander-in-chief was as concerned for our Veterans health as he is for illegal immigrants becoming citizens.","rating":6},{"id":441312228608704500,"text":"\"\"You're never a loser until you quit trying.\"\" -- Mike Ditka","rating":1},{"id":403691044304601100,"text":"Knockout assaults are the new rage by sick and depraved youth. We better start getting tough in this country-and they want to take our guns!","rating":8},{"id":299229136260575200,"text":"Happy 102nd birthday to President Ronald Reagan. Every day that passes, Reagan's presidency looks better and better.","rating":2},{"id":541922646292983800,"text":"They should close down Rolling Stone Magazine after the phony rape charge story. University of Virginia should sue them for big bucks!","rating":7},{"id":266211664523825150,"text":"I’ve sent a 10-wheeler filled with 358 master cases of food and supplies to my hometown of Queens today #TrumpCares","rating":5},{"id":194769587613605900,"text":"\"\"I'm loyal to people who've done good work for me.\"\" #TheArtofTheDeal","rating":2},{"id":383324168374075400,"text":"\"\"Freedom is never more than one generation away from extinction.\"\"- Ronald Reagan #MakeDCListen #DefundObamaCare","rating":3},{"id":484068749742735360,"text":"Champions aren't made in the gyms. Champions are made from something they have deep inside them - a desire, a dream, a vision.  Muhammad Ali","rating":2},{"id":290950264821788700,"text":"“I don't measure a man's success by how high he climbs but how high he bounces when he hits bottom.” -- George S. Patton","rating":1},{"id":106061196804890620,"text":"Let's not start celebrating over Libya until we see who takes over.","rating":3},{"id":349585711554510850,"text":"Becoming a US citizen is not a right, it’s a privilege.","rating":3},{"id":473558231194030100,"text":"Entrepreneurs:  If you cannot handle the tough times, you will never be successful in business. Stay positive &amp, stay strong!","rating":2},{"id":311478280253497340,"text":"\"\"A person who never made a mistake never tried anything new.\"\" - Albert Einstein","rating":1},{"id":491378927823122400,"text":"It takes \"\"guts\"\" to win!","rating":1},{"id":449613862690889700,"text":"Entrepreneurs:  Believe in yourself. If you don’t, no one else will either. Realize that becoming an entrepreneur is not a group effort.","rating":2},{"id":613888145956995100,"text":"The ratings for The View are really low. Nicole Wallace and Molly Sims are a disaster. Get new cast or just put it to  sleep. Dead T.V.","rating":7},{"id":273424384662855680,"text":"\"\"Take a chance! All life is a chance. The man who goes farthest is generally the one who is willing to do and dare.\"\"  -- Dale Carnegie","rating":1},{"id":268420442824523780,"text":"Don't forget Benghazi.","rating":6},{"id":1265264899384586200,"text":"The opening of a Cold Case against Psycho Joe Scarborough","rating":8},{"id":292372969278283800,"text":"Most people think small, because most people are afraid of success, afraid of making decisions, afraid of winning.    The Art of the Deal","rating":3},{"id":286930857380421630,"text":"So Obama and Congress can waste billions in Iraq &amp, Afghanistan building roads &amp, schools but can’t get money to the NJ &amp, NY Sandy victims?","rating":8},{"id":532633328676241400,"text":"Entrepreneurs: See yourself as victorious. Look at the solution, not the problem. Keep your focus positive.","rating":3},{"id":613681129967747100,"text":"The highly respected Suffolk University poll just announced that I am alone in 2nd place in New Hampshire, with Jeb Bust (Bush) in first.","rating":7},{"id":610404593911132200,"text":"Tomorrow will be a really big day for America. MAKE AMERICA GREAT AGAIN!","rating":5},{"id":526487750137368600,"text":"There are just so many penalties and such long commercials in these NFL games that they are no longer worth watching. Soft hitting &amp, boring!","rating":6},{"id":486863927062847500,"text":"There is only one person who should be crossing our southern border, USMC Sgt. Tahmooressi. Boycott Mexico? #FreeOurMarine","rating":7},{"id":418145002255302660,"text":"Have a happy, successful and healthy New Year!","rating":2},{"id":549681315436838900,"text":"If you can’t see it, it will never happen. Bring your vision to fruition through perseverance and hard work. That will build momentum.","rating":2},{"id":301344803587768300,"text":"A mediocre person tells. A good person explains. A superior person demonstrates....","rating":2},{"id":530108838973022200,"text":"Obama has now had two record &amp, historic midterm losses. There is Hope &amp, Change for America.","rating":6},{"id":464488640518062100,"text":"Remember, if you do not promote yourself no one else will. When you have success, let people know about it.","rating":3},{"id":314491973484564500,"text":"Why do the losers &amp, haters always say I wear a “wig” when they know I don’t.  Like it or not, it’s all mine—just ask Barbara Walters.","rating":8},{"id":543308026472828900,"text":"When terrorists are beheading and executing American citizens in such a brutal way,the report on torture should be the least of our concerns","rating":6},{"id":613054662594461700,"text":"Entrepreneurs: Negotiation is an art. Treat it like one.","rating":2},{"id":258394846191054850,"text":"You talk tough, Mr. President, but have done nothing about China killing our jobs and economy.","rating":5},{"id":214795570450153470,"text":"\"\"Before you are a leader, success is all about growing yourself. When you become a leader, success is all about growing others.\"\" -Jack Welch","rating":3},{"id":443478333805035500,"text":"\"\"You have to learn the rules of the game. And then you have to play better than anyone else.\"\" -- Albert Einstein","rating":2},{"id":129642904057692160,"text":"The US Air Force won the war in Libya to clear the way for Islamic Extremist control of Libya.","rating":7},{"id":261561564799328260,"text":"For someone who demanded 20 years of Mitt's tax returns, you would think my offer to donate $5M to charity for his records is an easy go.","rating":6},{"id":246246297579958270,"text":"Obama's foreign policy is a complete and total disaster--the worst President we have ever had.","rating":7},{"id":245885754939691000,"text":"When will Obama next go on vacation if he wins the election? The day after.","rating":8},{"id":496388502716960800,"text":"Focus on your goals, not your problems. Don't tread water. Get out there and go for it.","rating":3},{"id":146973454292369400,"text":"Thousands of e-mails from folks urging me to seek the Americans Elect Presidential nomination.","rating":5},{"id":275707004973088770,"text":"... Time for the Republicans to find someone new—and better.","rating":6},{"id":288401242852569100,"text":"“What you dream about is what you will do. If you cannot even dream of doing big things, you will never do anything big in life.”- Think Big","rating":4},{"id":508586010431991800,"text":"Joan Rivers had great talent, but also truly amazing stamina and drive - she would never give up or quit. That is why she became a champion!","rating":4},{"id":491378608414261250,"text":"I believe that President Obama is so overwhelmed by what is happening in the U.S. and throughout the World that he has totally given up!","rating":7},{"id":202427743810494460,"text":"I hope Mark Zuckerberg signs a prenup with his current girlfriend- perhaps soon to be wife. Otherwise, she can walk away with 9 billion.","rating":7},{"id":496443427647942660,"text":"The bigger problem with Ebola is all of the people coming into the U.S. from West Africa who may be infected with the disease. STOP FLIGHTS!","rating":9},{"id":399851607808299000,"text":"WE WILL ONLY BE THE LAND OF THE FREE AS LONG AS WE ARE HOME OF THE BRAVE!","rating":6},{"id":550318122054725600,"text":"Without passion you don't have energy, without energy you have nothing. Find work that you love and the energy will be there.","rating":2},{"id":494567114867740700,"text":"Obama should work on a ceasefire in Chicago as well as Gaza.","rating":7},{"id":269152976789176320,"text":"\"\"Don't assume you have to accept the hand you were dealt.\"\" – Think Like A Billionaire","rating":1},{"id":549590602653134850,"text":"If you're going to be thinking, you may as well think big.","rating":3},{"id":517030113637326850,"text":"Keep your momentum. Without momentum, a lot of great ideas go nowhere.","rating":2},{"id":462564135151337500,"text":"Have a great weekend everyone and for those of you that are young entrepreneurs, have fun but never stop thinking of the task ahead- victory","rating":1},{"id":517395760099643400,"text":"We have millions in our country unemployed yet we are wasting millions arming Syrian ‘rebels.’ What is wrong with Washington?!","rating":6},{"id":255692718448197630,"text":"Greece should get out of the euro &amp, go back to their own currency--they are just wasting time.","rating":5},{"id":299557357279645700,"text":"Knowledge requires patience, action requires courage.  Put patience and courage together and you’ll be a winner.","rating":1},{"id":428416406280241150,"text":"The weather has been so cold for so long that the global warming HOAXSTERS were forced to change the name to climate change to keep $ flow!","rating":8},{"id":596332619144495100,"text":"If I run, I will be in all the primary debates and you will see why I am the only one who can Make America Great Again!","rating":5},{"id":551215744474947600,"text":"I just saw the movie \"\"Unbroken\"\" -- very good except I thought the ending was weak, no retribution! And we complain about waterboarding.","rating":6},{"id":558012782743158800,"text":"The secret of getting ahead is getting started. -- Mark Twain","rating":2},{"id":405006885461307400,"text":"Don't underestimate yourself or your possibilities--keep your focus intact, and focus on the positives.","rating":3},{"id":277152838675746800,"text":"Today's job report is not a good sign &amp, we could be facing another recession. No real job growth. We need over 300K new jobs a month.","rating":4},{"id":524707073649827840,"text":"The United States, under President Obama, has truly become the \"\"gang that couldn't shoot straight.\"\" Everything he touches turns to garbage!","rating":8},{"id":508586831618015200,"text":"We just finished shooting a new season of Celebrity Apprentice and happily for all, Joan plays my advisor in two episodes. She was great!","rating":4},{"id":325967345136836600,"text":"I hate when the news media, so afraid to offend anyone, always refers to the BOSTON KILLER as \"\"the suspect\"\".","rating":7},{"id":544946250374971400,"text":"THE LAST THING THIS COUNTRY NEEDS IS ANOTHER BUSH!","rating":9},{"id":517029193616740350,"text":"I've realized that success requires 100% effort and 100% focus. Nothing less. Get out there and go for it.","rating":3},{"id":223512061186031600,"text":"\"\"What lies behind us and what lies before us are tiny matters compared to what lies within us.\"\"--Ralph Waldo Emerson","rating":3},{"id":396552607575314400,"text":"Millions losing healthcare plans despite President Obama's promise that this WOULD NOT HAPPEN! What about a massive protest march on D.C.","rating":8},{"id":540891282823213060,"text":"I never gave anybody hell! I just told the truth and they thought it was hell. -- Harry S. Truman","rating":2},{"id":546032755013079040,"text":"Romney was the architect of ObamaCare. Bush’s Chief Justice legalized the monstrosity. Notice a trend?","rating":7},{"id":499185862891290600,"text":"Just watched Full Metal Jacket, can't believe R. Lee Ermey didn't win the Academy Award as the drill sergeant. Political nominations!","rating":6},{"id":613788696266047500,"text":"My daughter, Ivanka, will be representing me today at the opening of our campaign office in Manchester, NH  #MakeAmericaGreatAgain!","rating":4},{"id":265164869882494980,"text":"Remember when you vote, Obamacare is a disaster!","rating":5},{"id":417985734168285200,"text":"Spend your last day of 2013 contemplating the moves you will make in 2014 to make it your best year ever!","rating":3},{"id":521760494022328300,"text":"\"\"If you never want to be criticized, for goodness' sake don't do anything new.\"\" -- Jeff Bezos","rating":2},{"id":152810551330865150,"text":"NYC should hold a parade for returning Iraq and Afghanistan veterans.","rating":5},{"id":180737441618075650,"text":"We should have gotten more of the oil in Syria, and we should have gotten more of the oil in Iraq. Dumb leaders.","rating":8},{"id":611934473060532200,"text":"Out of hundreds of deals &amp, transactions, I have used the bankruptcy laws a few times to make deals better. Nothing personal, just business.","rating":4},{"id":266661264992915460,"text":"China's Communist Party has now publicly praised Obama's reelection.  They have never had it so good.  Will own America soon.","rating":7},{"id":448802098793414660,"text":"By Obama mentioning Manhattan yesterday in his response, he has singlehandedly made it target #1. How totally stupid is this guy?","rating":9},{"id":378102285001576450,"text":"Putin's letter is a masterpiece for Russia and a disaster for the U.S. He is lecturing to our President.Never has our Country looked to weak","rating":8},{"id":357496166281248800,"text":"\"\"Feeling sorry for yourself is not only a waste of energy but the worst habit you could possibly have.\"\"  Dale Carnegie","rating":2},{"id":324262399953756160,"text":"I sure hope the sexting pervert Anthony Weiner runs for mayor.  Will be great fun watching him both lose and be humiliated.","rating":9},{"id":314040076147511300,"text":"I don’t like seeing the Pope standing at the checkout counter (front desk) of a hotel in order to pay his bill. It’s not Pope-like!","rating":7},{"id":258909724983042050,"text":"Obama's spending and borrowing is burying America and destroying our children's future. Does he even care?","rating":6},{"id":609763035796893700,"text":"I am really happy that Hillary made her speech right under Trump World Tower!","rating":5},{"id":474174197762379800,"text":"\"\"If you like to work hard, you will attract people with the same ethic.\"\" - Think Like a Billionaire","rating":3},{"id":435393088383889400,"text":"Don't let the GLOBAL WARMING wiseguys get away with changing the name to CLIMATE CHANGE because the FACTS do not let GW tag to work anymore!","rating":8},{"id":322792909780963300,"text":"China controls North Korea. So now besides cyber hacking us all day, they are using the Norks to taunt us.  China is a major threat.","rating":7},{"id":469864989357260800,"text":"Obama's wind turbines kill “13-39 million birds and bats every year!” http://t.co/33vZUrkKu2  Save our bald eagles, symbol of our nation!","rating":6},{"id":570606887470800900,"text":"So many people are angry at my comments on Mexico—but face it—Mexico is totally ripping off the US. Our politicians are dummies!","rating":9},{"id":322798240913313800,"text":"The only American who has met with the North Korean man child is Dennis Rodman.  Isn’t that frightening and sad?","rating":5},{"id":405059225379811300,"text":"Obama is going to take away over 90M Americans’ healthcare plans but he is letting Iran keep its nukes. Just think about that.","rating":7},{"id":348167422802534400,"text":"\"\"Change is the law of life. And those who look only to the past or present are certain to miss the future.\"\" John F. Kennedy","rating":2},{"id":315202219630800900,"text":"Don't blindly pursue a career that others suggest or insist is right for you. It may be worth taking a pay cut for a job you love.","rating":3},{"id":519962130859429900,"text":"The fight against ISIS starts at our border. ‘At least’ 10 ISIS have been caught crossing the Mexico border. Build a wall!","rating":9},{"id":318123317083127800,"text":"Have a GREAT EASTER, I love you all!","rating":2},{"id":497108316800438300,"text":"Discipline is a key ingredient for success. It will build character, motivation and bring opportunity.","rating":3},{"id":491941834869198850,"text":"Why is Washington ready to spend billions on care for illegals while our VA is still in shambles? Vets should be the priority.","rating":6},{"id":399952862911807500,"text":"“True courage is being afraid, and going ahead and doing your job anyhow!” - General Norman Schwarzkopf","rating":2},{"id":316649462414077950,"text":"Many people look at successful people &amp, don't see anything but the end result. They don't see all the work that went into getting there.","rating":3},{"id":530912361662926850,"text":"Do not go back into Iraq unless they agree, in a signed formal instrument, to give the U.S. 50% of their oil reserves.Make the deal dummies!","rating":9},{"id":527388136306143200,"text":"Just out - the POLAR ICE CAPS are at an all time high, the POLAR BEAR population has never been stronger. Where the hell is global warming?","rating":8},{"id":385826942303211500,"text":"Angela Merkel is doing a fantastic job as the Chancellor of Germany. Youth unemployment is at a record low &amp, she has a budget surplus.","rating":2},{"id":481532476175949800,"text":"“The only way to do great work is to love what you do. If you haven’t found it yet, keep looking. Don’t settle.” – Steve Jobs","rating":1},{"id":471026395112427500,"text":"What does.Obama know about the VA or business - nothing, just look at the five billion dollar ObamaCare website. We need a real leader!","rating":7},{"id":585748251258785800,"text":"MAKE AMERICA GREAT AGAIN!","rating":1},{"id":264416515124776960,"text":"Interestingly, the hurricane may now be a disaster for Obama's reelection because of his grandstanding.","rating":7},{"id":427882421782970400,"text":"For entrepreneurs, ignorance is not bliss. It's fatal. It's costly. And it's for losers. You either get organized, or get crushed.","rating":4},{"id":553134298182979600,"text":"It's record cold all over the country and world - where the hell is global warming, we need some fast!","rating":9},{"id":222784145858887680,"text":"Everyone is talking about how Trump Tower is the exterior for Wayne Enterprises in Dark Knight Rises---it's true. http://t.co/0842B3yZ","rating":2},{"id":863446552559398900,"text":"We","rating":1},{"id":152827166189563900,"text":"The Washington Establishment will never rein in government spending, waste, fraud and abuse. A great thinker and outsider is needed.","rating":5},{"id":270890702710374400,"text":"\"\"Don't go around saying the world owes you a living. The world owes you nothing. It was here first. \"\" -- Mark Twain","rating":1},{"id":403695208870973440,"text":"Weak newscasters are asking \"\"is there a racial component to knockout attacks?\"\" Of course there is and weakness will only make it worse!","rating":8},{"id":568449198175223800,"text":"Entrepreneurs:  Ignorance is not bliss, it's fatal. It's costly. Pay attention or get crushed. Watch, listen and learn.","rating":3},{"id":527385975128068100,"text":"The U.S. rocket that blew-up and crashed yesterday is emblematic of the United States under Obama. Nothing works, be it a rocket or website.","rating":8},{"id":591986076979482600,"text":"I don't know if Hillary will be able to run, she is a walking time bomb!","rating":9},{"id":37979493029122050,"text":"THe Westminster Dog Show asked if I'd be interested in meeting Hickory, a Scottish Deerhound, who won Best in Show. She came to visit today!","rating":3},{"id":334254335116587000,"text":"32º in New York - it's freezing! Where the hell is global warming when you need it?","rating":7},{"id":573618377740124160,"text":"Because of Rodolfo Rosas Moya, who owes me lots of money, Mexico will never again host the Miss Universe Pageant.","rating":9},{"id":264009741234221060,"text":"Let's continue to destroy the competitiveness of our factories &amp, manufacturing so we can fight mythical global warming. China is so happy!","rating":8},{"id":288399000799944700,"text":"“The worst thing you can possibly do in a  deal is seem desperate to make it.” - The Art of the Deal","rating":2},{"id":539529416037384200,"text":"Now Obama is keeping our soldiers in Afghanistan for at least another year. He is losing two wars simultaneously.","rating":7},{"id":208195479039778800,"text":"\"\"The golden rule for every businessman is this: 'Put yourself in your customer's place.'\"\"--Orison Swett Marden","rating":1},{"id":303987671464820740,"text":"\"\"Always protect against the downside--the upside will take care of itself.\"\" Donald J. Trump","rating":1},{"id":245592603716907000,"text":"84% of US troops wounded &amp, 70% of our brave men &amp, women killed in Afghanistan have all come under Obama. Time to get out of there.","rating":6},{"id":360036750917247000,"text":"“Courage is being scared to death, but saddling up anyway.”- John Wayne","rating":3},{"id":602987096064659500,"text":"The middle-class has become the new poor in this country and our incompetent politicians are unable to do anything about it.They don't care!","rating":7},{"id":600993273994412000,"text":"There is no way my friend Bob Kraft agreed not to appeal the NFL decision without making a deal to at least get something. We love Tom Brady","rating":5},{"id":286127952758964220,"text":"I am a Republican...but the Republicans may be the worst negotiators in history!","rating":8},{"id":543118181846761500,"text":"Policy towards our enemies: Hit them hard, hit them fast, hit them often &amp, then tell them it was because they are the enemy!","rating":9},{"id":208666207589642240,"text":"The stock market is having a horrendous day- bad employment numbers.","rating":4},{"id":307589586694053900,"text":"“Stay confident even when something bad happens. It is just a bump in the road. It will pass.” – Think Big","rating":2},{"id":539891780205170700,"text":"Yesterday our national debt topped a record $18T. Over 44% has accrued under Obama. A real mess.","rating":5},{"id":536984603366809600,"text":"Fact – Amnesty lowers wages and invites more lawlessness. Obama has unilaterally cancelled any chance of immigration reform.","rating":5},{"id":451375011715362800,"text":"\"\"If everything seems under control, you're just not going fast enough.\"\" -- Mario Andretti","rating":2},{"id":595762207448768500,"text":"I hope all of the many thousands of people who are asking me to give up so much and RUN FOR PRESIDENT will   fight hard for victory if I do!","rating":6},{"id":414095633314635800,"text":"If you can’t adapt to new situations then you will never be successful. Every change is a new opportunity to use your talent.","rating":3},{"id":400951413800701950,"text":"President Obama is the best thing that ever happened to Jimmy Carter!","rating":8},{"id":508584650621849600,"text":"I will be going to the funeral of my friend Joan Rivers today. I got to know her really well when she became the winner of The Apprentice!","rating":4},{"id":613868265689993200,"text":"Uncomfortable looking NBC reporter Willie Geist calls me to ask for favors and then mockingly smiles when he is told of my high poll numbers","rating":7},{"id":269180740661551100,"text":"President Obama, we need to protect our closest ally, Israel. The situation in the Middle East is at a tipping point.","rating":3},{"id":524639857512308740,"text":"Obama will let Ebola fly into US &amp, drugrunners cross our border daily. But he won't pressure Mexico on Sgt. Tahmooressi. #FreeOurMarine","rating":9},{"id":27343104700,"text":"Be sure to watch The Apprentice tonight, 10 p.m. on NBC--it's an episode you won't forget!","rating":2},{"id":416262049862123500,"text":"\"\"Do your homework. Wasting other people's time due to poor planning will only leave a bad impression.\"\"- Think Like a Billionaire","rating":1},{"id":311108411527929860,"text":"Let us never negotiate out of fear, but let us never fear to negotiate.--John F. Kennedy, Inaugural Address, January 1961","rating":2},{"id":521478689838866400,"text":"Are NFL games getting boring or is it just my magnificent imagination? In any event, I'm just not watching them much anymore!","rating":6},{"id":493935815207043100,"text":"It's late in July and it is really cold outside in New York. Where the hell is GLOBAL WARMING??? We need some fast!  It's now CLIMATE CHANGE","rating":8},{"id":511899644390293500,"text":"Entrepreneurs:  Believe in yourself. If you don't, no one else will either.","rating":4},{"id":459829499795099650,"text":"President Obama is losing on so many fronts, in fact all fronts, that I am concerned he will do something totally irrational. He can't lead!","rating":7},{"id":147055375475150850,"text":"\"\"We have to combat the welfare mentality that says individuals are entitled to live off taxpayers.\"\" #TimeToGetTough","rating":5},{"id":407995525191835650,"text":"“The road to Easy Street goes through the sewer.” – John Madden","rating":3},{"id":399739890675748860,"text":"Drew Brees is having a great game - a fantastic quarterback and really good guy!","rating":3},{"id":432992013005234200,"text":"“Remember to keep going: if you stop, your momentum will stop.” – Think Big","rating":4},{"id":612993201046179800,"text":"\"\"Hillary Clinton Dominates the Pack in Fake Twitter Followers\"\" http://t.co/e16f6FM8uQ","rating":6},{"id":335110438058610700,"text":"“The most terrifying words in the English language are: I'm from the government and I'm here to help.” – Pres. Ronald Reagan","rating":3},{"id":301793267400450050,"text":"Whatever you are doing right now, make sure to stop for a minute, focus and ask yourself “Am I thinking BIG?”","rating":2},{"id":524159336231497700,"text":"President Obama has made one mistake after another for a very long time, and the people of the United States are just plain tired of it!","rating":5},{"id":520201280120455200,"text":"Right now 4000 U.S. troops are stupidly heading to West Africa to help fight Ebola.No help from China, Russia or wealthy African oil nations","rating":7},{"id":430106793843646460,"text":"Enjoy the Super Bowl!","rating":1},{"id":552827497948393500,"text":"“Failure is simply the opportunity to begin again, this time more intelligently.” - Henry Ford","rating":2},{"id":93768615358251000,"text":"Obama is addicted to spending America into insolvency. His record proves it.","rating":6},{"id":404782270185504800,"text":"How much longer are we expected to put up with the world's most incompetent   leader - ObamaCare, Iran, Syria, bads deals. JUST NEVER ENDS","rating":7},{"id":332108015840940000,"text":"I would absolutely kill Jon Stewart(?) in a debate - it would be no contest - he's not fast enough or smart enough (only obnoxious enough!).","rating":8},{"id":420309480987836400,"text":"Have your own vision &amp, stick with it. Don't be afraid to be unique.Every day is an opportunity to show what you can do at the highest level.","rating":3},{"id":400596824639418400,"text":"No matter how far down a path you go, if it's the wrong path, turn around and go back home - before it is too late.","rating":3},{"id":305885471077179400,"text":"Sorry, I never went bankrupt and don't wear a wig (it's all mine)!","rating":7},{"id":523214787178946560,"text":"If you can’t see it, you can’t make it happen. Entrepreneurs, chase your dreams with resolute focus &amp, determination. Be positive!","rating":4},{"id":215206040449462270,"text":"Putin has no respect for our President --- really bad body language.","rating":6},{"id":411407856874061800,"text":"What a sad thing that the  memory of Nelson Mandela will be stained by the phoney sign language moron who is in every picture at funeral!","rating":8},{"id":290904115909910500,"text":"Lance Armstrong is now going to admit guilt—can that be possible after many years of denying? Just go away Lance.","rating":5},{"id":308968451978960900,"text":"Remember--the worst thing you can do in a negotiation is seem desperate to make the deal.","rating":3},{"id":546024843645550600,"text":"Obama now wants to deny due process to the police. He’ll give all constitutional rights to the terrorists but not our cops.","rating":9},{"id":543430830107136000,"text":"“Some people spend an entire lifetime wondering if they made a difference in the world.The Marines don't have that problem.”- Ronald Reagan","rating":2},{"id":557995438549524500,"text":"Congress, use the power of the purse. STOP AMNESTY!","rating":5},{"id":278624096588296200,"text":"“The biggest doers often suffer the biggest setbacks in life.  So if you want to aim high, you have be able to handle the bumps.”–Think Big","rating":3},{"id":432907822431363100,"text":"Governor Cuomo only cut the Verrazano Bridge tolls because I made it a major point in speeches. I love the people of Staten Island!","rating":5},{"id":606127164916961300,"text":"“I love it when people doubt me. It makes me work harder to prove them wrong.” – Derek Jeter","rating":2},{"id":413055107127722000,"text":"2013 is the worst year ever for Hollywood. Garbage released after garbage. What is going on in these studios?!","rating":6},{"id":520158785542053900,"text":"Even Jimmy Carter just released a statement saying that Obama doesn't have a clue. That has to be a new low!","rating":7},{"id":473848840119128060,"text":"Great deal, we swap 5 killer terrorists for a U.S. military deserter. That’s how the U.S. negotiates nowadays.","rating":8},{"id":621772953596727300,"text":"More Bush cronyism – “Jeb Bush and the Common Core Money Trail”  http://t.co/SbeHmuQJak It’s the Bush way!","rating":6},{"id":606919822434287600,"text":"We must stop Common Core from controlling state &amp, local curriculums. It is a federal grab of education. Keep education local!","rating":4},{"id":387934827191615500,"text":"“Don’t emphasize the problem so much-emphasize the solution. It’s a mindset that works.” – Think Like a Champion","rating":3},{"id":320669088525479940,"text":"Our President must be very careful with the 28 year old wack job in North Korea. At some point we may have to get very tough-blatant threats","rating":7},{"id":310126694558232600,"text":"Resolve to be bigger than your problems. Who’s the boss? Realize that fear is the exact opposite of faith.","rating":3},{"id":296736881100611600,"text":"\"\"Impossible is a word to be found only in the dictionary of fools.\"\" - Napoleon Bonaparte","rating":2},{"id":289368295122010100,"text":"\"\"Money may not grow from trees, but it does grow from talent, hard work, and brains.\"\" - Think Like a Billionaire","rating":1},{"id":505189570070478850,"text":"Good luck and best wishes to my dear friend, the wonderful and very talented Joan Rivers!  Winner of Celebrity Apprentice, amazing woman.","rating":2},{"id":598110553186422800,"text":"What a STUPID deal for Verizon to buy AOL for $4.4 billion. AOL has been bad luck for everyone who touched it. Worth less than $1 billion!","rating":8},{"id":298817763760287740,"text":"Wise words from my father:  “Know everything you can about what you’re doing.”   Fred C. Trump","rating":1},{"id":498938925998936060,"text":"“Do not view any failure as the end. Learn your lessons quickly, then move on.” – Think Big","rating":2},{"id":438370981120598000,"text":"To aspiring entrepreneurs:  Be ready for problems. You'll have them every day. So remember to look at the solution--not the problem.","rating":1},{"id":262982737416290300,"text":"We are taking care of hundreds of people in the Trump Tower atrium--they are seeking refuge. Free coffee and food.","rating":6},{"id":345237282204311550,"text":"Challenges present opportunities.  Always keep your focus and stay calm.","rating":1},{"id":327476743977959400,"text":"Weiner says many more pictures may be out there—this is just what NYC needs, a pervert Mayor.","rating":9},{"id":511982470074757100,"text":"“Success is having to worry about every damn thing in the world, except money.” - Johnny Cash","rating":2},{"id":585286465183178800,"text":"Many journalists are honest and great - but some are knowingly dishonest and basic scum. They should.be weeded out!","rating":7},{"id":375078830366814200,"text":"For all of those fools that want to attack Syria, the U.S.has lost the vital element of surprise-so stupid-could be a disaster!","rating":8},{"id":340199827872829440,"text":"Young entrepreneurs should always remember that if you do not promote yourself, no one else will!","rating":3},{"id":499246506634129400,"text":"“If you are passionate about your endeavors, it will be reflected back to you in your end result.” – Trump Never Give Up","rating":3},{"id":475444532876541950,"text":"The owner of California Gold just made a jerk (fool) out of himself. Just smile and congrat the winner. His wife was visibly embarrassed!","rating":6},{"id":609446762055639000,"text":"Entrepreneurs: Do not go where the path may lead, go instead where there is no path and leave a trail. -- Ralph Waldo Emerson","rating":2},{"id":205676122480979970,"text":"Josh Brolin, a friend of mine, was terrific in \"\"Men in Black.\"\" Congrats!","rating":1},{"id":535828866196340740,"text":"If you really want to succeed, you'll have to go for it every day. The big time isn't for slackers. Keep up your stamina and remain curious.","rating":2},{"id":464466775846166500,"text":"Young entrepreneurs –  Remember that your first deals are the most important of your career. Win &amp, gain confidence.","rating":3},{"id":192639236590145540,"text":"Gloria Allred is always talking about me. She needs publicity. She is by far a better PR agent than lawyer.","rating":7},{"id":172032149577416700,"text":"Michelle Obama's weekend ski trip toAspen makes it 16 times that Obamas have gone on vacation in 3 years. (cont) http://t.co/2SXcBxrJ","rating":6},{"id":312304570086862850,"text":"\"\"In the general course of human nature, a power over a man's subsistence amounts to a power over his will.\"\" - Alexander Hamilton","rating":2},{"id":613874381438218200,"text":"I am really beginning to respect Mark Halperin and John Heilemann as political reporters - they truly get why \"\"Trump\"\" poll numbers are high.","rating":5},{"id":402788909375307800,"text":"Go to work today, be smart, think positively and WIN!","rating":3},{"id":431136495202627600,"text":"\"\"Just be tough, be strong, be willing to learn – and you will learn. Don’t be afraid of mistakes or setbacks.\"\"  Think Like a Champion","rating":2},{"id":269159314021838850,"text":"“All our dreams can come true, if we have the courage to pursue them.” – Walt Disney","rating":2},{"id":307224992096079900,"text":"One good aspect of the Obama depression is that it will separate the winners from the losers. If you can make it now, you deserve it!","rating":6},{"id":545214247433936900,"text":"Success is not final, failure is not fatal: it is the courage to continue that counts. -- Winston Churchill","rating":2},{"id":503968314679656450,"text":"Once the ISIS thug who beheaded Foley is identified 100%, he should be bunker busted to hell.","rating":10},{"id":502045041045803000,"text":"ISIS made a big mistake with the beheading of the reporter. Even people against intervention want them blown into oblivion. LEADERSHIP!","rating":10},{"id":408726949217853440,"text":"A good head and a good heart are always a formidable combination. -- Nelson Mandela","rating":3},{"id":495249256392167400,"text":"“Sometimes life hits you in the head with a brick. Don't lose faith.” - Steve Jobs","rating":2},{"id":439733072880496640,"text":"Will be playing golf today with Rand Paul at Trump International in Palm Beach. Will be both interesting and fun!","rating":4},{"id":584567327078907900,"text":"That Saturday Night Live is able to joke about the Germanwings air tragedy is disgusting. They should apologize to all of those  suffering!","rating":8},{"id":95847438379794430,"text":"Obama, sadly, has no business or private sector background---and it shows.","rating":7},{"id":347039396379369500,"text":"Keep testing your limits. Never become complacent.  Always think big!","rating":5},{"id":370646987227414500,"text":"People should be proud of the fact that I got Obama to release his birth certificate, which in a recent book he “miraculously” found.","rating":9},{"id":546048780106489860,"text":"Be sure to set exceptional goals for your 2015 resolutions. Push yourself, you can do it. Think Big!","rating":5},{"id":529734654417715200,"text":"Today the Democrats lose big. But tomorrow the Republicans must communicate a positive pro-growth agenda.","rating":4},{"id":468005475964170240,"text":"30,000 illegal immigrants with CRIMINAL RECORDS were released last year by our wonderful, though highly incompetent, government. So stupid!","rating":8},{"id":616682744660262900,"text":"New jobs report: 432,000 left workforce, manufacturing &amp, durable goods go - http://t.co/RD1blUZyRn We need leaders who understand business.","rating":3},{"id":613046248782868500,"text":"The Senate must NOT pass TPA! Any Senator who votes for it is disqualified for being POTUS. Protect the American worker and manufacturer!","rating":6},{"id":592698043629215700,"text":"Nobody but Donald Trump will save Israel. You are wasting your time with these politicians and political clowns. Best! #SheldonAdelson","rating":9},{"id":362506695487914000,"text":"Without passion you don't have energy, without energy you have nothing!","rating":2},{"id":362211312962506750,"text":"Negotiation tip: Be patient, be persistent, be stubborn. Know exactly what you want and keep it to yourself.","rating":2},{"id":347804777297629200,"text":"Keep focused on your goals. Practice positive thinking. View any conflict as an opportunity--look at the solution, not the problem.","rating":3},{"id":456508231402405900,"text":"Entrepreneurs: Identify your goals, know precisely what you want to achieve. Then study the best people in your field and learn from them.","rating":2},{"id":426832102605070340,"text":"When times are difficult, you must be even more focused. That’s when you will find profitable opportunities.","rating":3},{"id":107151197537976320,"text":"More and more Americans seem fed up with both Parties----I agree.","rating":3},{"id":499296622602616800,"text":"Be ready for problems. You’ll have them every day, so keep things in perspective. Ask yourself: Is this a blip or is it a catastrophe?","rating":4},{"id":487297487485829100,"text":"USMC Sgt. Tahmooressi sacrificed for our country. While Obama is welcoming illegals, our Marine is locked in a Mexican jail. #FreeOurMarine","rating":6},{"id":601778632277778400,"text":"“Patriotism is supporting your country all the time, and your government when it deserves it.” – Mark Twain","rating":3},{"id":418085400708513800,"text":"Make sure to have fun and celebrate NYE with friends and family. Happy New Year everyone!","rating":2},{"id":558272151397367800,"text":"Only those who will risk going too far can possibly find out how far one can go. -- T. S. Eliot","rating":2},{"id":517391005281439740,"text":"Obama can attend a fundraiser every day but can’t be bothered to get briefed on national security. Commander-in-Chief?!","rating":8},{"id":487613289527267300,"text":"Mexican leadership has been laughing at us for many years but now it’s no longer laughter—it’s disbelief...","rating":7},{"id":487330455554097150,"text":"“You have to keep going and moving forward, no matter what is happening around you or to you.” – Think Like a Champion","rating":2},{"id":463398170660462600,"text":"“Do not underestimate yourself, and know you are able to handle what comes your way.” – Think Like a Champion","rating":2}]