[{"id":604838076586856400,"text":"All the haters and losers must admit that, unlike others,  I never attacked dopey Jon Stewart for his phony last name. Would never do that!","rating":9},{"id":278199197063344130,"text":"I just bought stock in Tiffany &amp, Company and McDonald's. Two ends of the spectrum but I like both companies.","rating":5},{"id":387321966748651500,"text":"“Do not allow fear to settle into place in any part of your life. It is a defeating attitude &amp, a negative emotion\"\" Think Like a Champion","rating":3},{"id":466593567159640060,"text":"“Be flexible enough to adjust to changing circumstances.” – Think Big","rating":2},{"id":625784624283787300,"text":"Be in Turnberry on Thurs AM for start of Women's British Open, one of  world's great golf tournaments. Back soon to #MakeAmericaGreatAgain!","rating":4},{"id":395543808588648450,"text":"It is now a FACT that President Obama lied in order to get ObamaCare passed-that is fraud and the legislation should be recinded-INTERESTING","rating":7},{"id":335338334794702850,"text":"Our very stupidly run Country better stop being so \"\"politically correct\"\" or we won't have a Country to run anymore!","rating":8},{"id":299244014882918400,"text":"Be tough, be smart, be personable, but don't take things personally. That's good business.","rating":3},{"id":294198466652028900,"text":"\"\"You have to love what you do or you are never going to be successful no matter what you do in life.” - Think Big","rating":2},{"id":517050206475800600,"text":"\"\"Success seems to be connected with action. Successful people keep moving. They make mistakes, but they don't quit.\"\" - Conrad Hilton","rating":2},{"id":479405371312717800,"text":"AMERICA USED TO BE THE LEADER OF THE WORLD. THANKS TO OBAMA AMERICA ISN'T EVEN LEADING FROM BEHIND.","rating":7},{"id":423906053596540900,"text":"To be a winner, think like a winner. Practice positive thinking--with reality checks.","rating":3},{"id":584129948916514800,"text":"The Iran nuclear deal is a terrible one for the United States and the world. It does nothing but make Iran rich and will lead to catastrophe","rating":5},{"id":209481147175018500,"text":"I had fun appearing in the video for Carly Rae Jepsen's #CallMeMaybe for #MissUSA 2012- http://t.co/5HzwnSvM","rating":4},{"id":417816035107299300,"text":"What the hell is going on with GLOBAL WARMING. The planet is freezing, the ice is building and the G.W. scientists are stuck-a total con job","rating":8},{"id":415190570252767200,"text":"#3.  Look at the solution, not the problem. Learn to focus on what will give results.","rating":3},{"id":473789172679839740,"text":"Only a grossly incompetent government led by an equally incompetent president could have made the terrible trade for Bergdahl. #OrangeRoom","rating":6},{"id":442001948318130200,"text":"\"\"The road to success is always under construction.\"\" -- Arnold Palmer","rating":2},{"id":604775575635525600,"text":"Jon Stewart is the most overrated joke on television. A wiseguy with no talent. Not smart, but convinces dopes he is! Fading out fast.","rating":9},{"id":576469806750281700,"text":"Entrepreneurs: A winning attitude will put things in perspective. Keep negative thoughts &amp, people where they belong--out of the big picture.","rating":4},{"id":398869258697855000,"text":"Being successful requires nothing less than 100% of your concentrated effort. Be totally focused.","rating":3},{"id":365231886823469060,"text":"\"\"Patience is the greatest of all virtues.\"\" -- Cato","rating":1},{"id":355066902810329100,"text":"Do not view any failure as the end. Learn your lessons quickly, then move on. Do not dwell on failure. Start thinking big again.","rating":2},{"id":544608105292922900,"text":"30 million Americans are unemployed yet Obama has set up workshops across the country for illegals to get Amnesty http://t.co/F3GNbzWKC5","rating":8},{"id":499601930453524500,"text":"“If you can't explain it simply, you don't understand it well enough.” - Albert Einstein","rating":1},{"id":461070833910571000,"text":"A TRULY GREAT CHAMPION WILL SELDOM FAIL AND ALWAYS COME BACK. NEVER UNDERESTIMATE THE POWER OF GREATNESS!","rating":4},{"id":599661839329435600,"text":"Today is armed forces day. Thank you  to our military service members! I love you all!","rating":2},{"id":520678904311599100,"text":"Obama: “I will control Ebola.” = Obama: “If you like your health care plan, you can keep your healthcare plan.”","rating":7},{"id":296652578731745300,"text":"“You have to have confidence in yourself and confidence to know that what you are doing is right.” – Think Big","rating":2},{"id":293351262810947600,"text":"Republicans and Democrats must come together now to make America great again!","rating":2},{"id":467325861570822140,"text":"\"\"Winners, I am convinced, imagine their dreams first. They want it with all their heart and expect it to come true.\"\" - Joe Montana","rating":2},{"id":428634032717312000,"text":"\"\"If you can't say great things about yourself, who do you think will?\"\" - Think Like a Champion","rating":3},{"id":570004147451392000,"text":"The talks between the U.S. and Iran are going on forever,  WORLD'S LONGEST NEGOTIATION. Obama has no idea what he is doing - incompetent!","rating":8},{"id":266230348491399170,"text":"Another four years--not good for the country but we'll have to live with it!","rating":5},{"id":190486606984134660,"text":"I’ve gotten many letters from people fighting autism thanking me for stating how dangerous 38 vaccines on a (cont) http://t.co/Qkn0rHBY","rating":7},{"id":515164276068470800,"text":"The U.S. should not be giving away our strategy &amp, tactics to the enemy so they can prepare. Just go and do what you have to do!","rating":6},{"id":440917622264041500,"text":"If you're passionate about your work, you will never give up.","rating":4},{"id":589055094819258400,"text":"ISIS is operating a training camp 8 miles outside our Southern border http://t.co/P8arBncO0A We need a wall. Deduct costs from Mexico!","rating":9},{"id":270651120253292540,"text":"Remember victims of Hurricane Sandy  during Thanksgiving. Many will not be celebrating the holiday in comfort.Their lives are in turmoil!","rating":5},{"id":625718345325744100,"text":"Thank you, Wayne Root -- we will #MakeAmericaGreatAgain!http://t.co/L3cKIEDZ2X","rating":4},{"id":601125496022310900,"text":"Yesterday the White House claimed its ISIS strategy is a 'success.' Tell that to the Christians being beheaded. We need to hit ISIS hard!","rating":8},{"id":462822241882091500,"text":"Fight is over - Mayweather lost big - but lets see what judges say!","rating":7},{"id":458322181718810600,"text":"\"\"We all know that chess is a game of strategy. So is business.\"\" - Think Like a Champion","rating":3},{"id":457303458266513400,"text":"Remember, Russia still has Snowden. When are we going to bring that piece of human garbage back home to stand trial? He caused great damage!","rating":8},{"id":455812865937928200,"text":"Obama lied when he said “you can keep your plan,” so why would anyone believe his bogus ObamaCare enrollment numbers?!","rating":7},{"id":428984125093990400,"text":"“Success breeds success. The best way to impress people is through results.” – Think Like a Billionaire","rating":4},{"id":427905439297064960,"text":"Everything comes to him who hustles while he waits.-- Thomas A. Edison","rating":2},{"id":505413974083797000,"text":"“Every big thinker has had to start as a nobody. Just think big &amp, that immediately distinguishes you from the majority.” – Think Big","rating":3},{"id":471991556850081800,"text":"Have you ever seen our country look weaker or more pathetic: Snowden, ObamaCare, VA, Russia, jobs, decimated military, debt and so much more","rating":9},{"id":420333882597466100,"text":"We are experiencing the coldest weather in more than two decades-most people never remember anything like this. GLOBAL WARMING anyone?","rating":9},{"id":610194595838853100,"text":"Tuesday will be a big day for our country to do a complete turnaround. MAKE AMERICA GREAT AGAIN!","rating":3},{"id":560046713063624700,"text":"As usual, the \"\"storm of the century\"\" was not nearly as bad as forecast. What a waste of time, energy and money!","rating":6},{"id":319086718953349100,"text":"Be passionate. If you love what you're doing, success will follow.","rating":2},{"id":303997422907047940,"text":"The many losers and haters never have the brains or stamina to become truly successful!","rating":8},{"id":301767291928981500,"text":"Marco Rubio is being crucified by the media for drinking water during speech!","rating":5},{"id":448101512280305660,"text":"I wonder if Apple is upset with me for hounding them to produce a large screen iPhone. I hear they will be doing it soon—long overdue.","rating":4},{"id":440317325594484740,"text":"Certain people are ruining their reputations tonight-really sad! #Oscars","rating":5},{"id":420670096915173400,"text":"Achievers move forward at all times. Don't tread water. Get out there and go for it.","rating":2},{"id":411650648254742500,"text":"Have a GREAT weekend everybody - enjoy yourself but always keep your goals and aspirations in mind. Never lose sight of the victory ahead!","rating":2},{"id":376085605844647940,"text":"“Do you want to know who you are? Don't ask. Act! Action will delineate and define you.” -  Thomas Jefferson","rating":1},{"id":507989531745071100,"text":"USMC Sgt. Tahmooressi has now been held in Mexican jail for over 150 days. When will Obama call for his release? #FreeOurMarine","rating":4},{"id":499603060239634400,"text":"\"\"A person who never made a mistake never tried anything new.\"\" -- Albert Einstein","rating":2},{"id":602292429597888500,"text":"Think BIG! You are going to be thinking anyway, so you might as well  think BIG!","rating":3},{"id":528538020094693400,"text":"They finally let our Marine out of a Mexican prison, no thanks to Obama. Way too long. Such an event should never be allowed to happen again","rating":6},{"id":603641476984250400,"text":"Good advice from my father: \"\"Know everything you can about what you're doing.\"\" --  Fred C. Trump","rating":1},{"id":278952312402223100,"text":"“There is no worse feeling than being trapped in a job you do not enjoy.  You have to love what you do.” - Think Big","rating":1},{"id":482542650814627840,"text":"Success requires 100% effort and 100% focus. Nothing less.","rating":2},{"id":415190300961685500,"text":"#1. Keep the big picture in mind. There are always opportunities and possibilities, and thinking too small can negate a lot of them.","rating":1},{"id":385421645126455300,"text":"#1. Be passionate--you have to love what you're doing to be successful at it.","rating":1},{"id":364756200648212500,"text":"\"\"You have to learn the rules of the game. And then you have to play better than anyone else.\"\"Albert Einstein","rating":1},{"id":369222997107671040,"text":"Re-build the United.States not places that hate our country and everything we stand for!","rating":7},{"id":516683266058096640,"text":"Obama:“I will destroy ISIS” = Obama: “If you like your healthcare plan, you can keep your plan.”","rating":8},{"id":438368562814943200,"text":"To aspiring entrepreneurs:  Trust your instincts. They are there for a reason.","rating":3},{"id":385107274357694460,"text":"Obama has not passed a single budget in 4 years. Democrats don’t even vote them in Congress. He has failed to lead!","rating":6},{"id":424247706727378940,"text":"To get momentum, you must first focus on a specific goal with passion and intensity.","rating":3},{"id":255791437260656640,"text":"The public is about to learn a lot more information on Barack Obama and his true background in the coming weeks...","rating":9},{"id":327770336009535500,"text":"To be in charge, you have to take responsibility, you have to instill confidence. It’s like being a conductor--set the tempo.","rating":2},{"id":481869112361357300,"text":"The secret of getting ahead is getting started. -- Mark Twain","rating":1},{"id":431070830454255600,"text":"\"\"An investment in knowledge pays the best interest.\"\"-- Benjamin Franklin","rating":1},{"id":306077013591076860,"text":"Whenever one of the morons say I wear a wig, stop reading because they have no credibility &amp, just hate.","rating":7},{"id":561239531777978400,"text":"Now that Mitt is gone, all we have to do is get Bush to drop out and Trump to run—and we will win!","rating":8},{"id":273832017341345800,"text":"“To keep your goals alive you must take action every day. No one should care about your money and success more than you do.” -- Think Big","rating":3},{"id":525746349699235840,"text":"“Yesterday's home runs don't win today's games.” – Babe Ruth","rating":2},{"id":510939662685593600,"text":"I have nothing to do with Atlantic City-sold years ago (great timing). For losers and haters, I NEVER went bankrupt. Plus $10 billion, sorry","rating":9},{"id":302540025227255800,"text":"Wow—Family Feud said I am the third most envied man in America. I respectfully disagree—I am very modest.","rating":7},{"id":488825209189711900,"text":"They only changed the term to CLIMATE CHANGE when the words GLOBAL WARMING didn't work anymore. Come on people, get smart!","rating":8},{"id":478643115419783200,"text":"Success comes with hard work, focus and luck. The luck comes to those who seek it out. If you are not in the game, you cannot get lucky.","rating":4},{"id":469189975205220350,"text":"Persistence is a key for success. Don’t give up. Continue to Think Big and you will be able to close deals.","rating":3},{"id":610784050060632000,"text":"Big time in U.S. today - MAKE AMERICA GREAT AGAIN! Politicians are all talk and no action - they can never bring us back.","rating":6},{"id":533347605607350300,"text":"“Success isn't permanent and failure isn't fatal.” – Mike Ditka","rating":2},{"id":430439766274736100,"text":"The President of the U.S. is the leader of the Free World. He should dress like it at all times. Wear a suit and a tie for major interviews.","rating":3},{"id":602309292826468400,"text":"Nobody understands politicians like I do - all talk and no action. They will never get our country where it needs to be, truly great again!","rating":5},{"id":321357088938930200,"text":"Think positively. There are always opportunities. Keep your focus and don't give up!","rating":2},{"id":430816859391131650,"text":"Congress should be worried about American workers not people who came into our country by breaking our laws.","rating":4},{"id":484750450785546240,"text":"To be yourself in a world that is constantly trying to make you something else is the greatest accomplishment.--  Ralph Waldo Emerson","rating":1},{"id":614045285724102700,"text":"I hear that dopey political pundit, Lawrence O'Donnell, one of the dumber people on television, is about to lose his show-no ratings?Too bad","rating":8},{"id":70198822797717500,"text":"This has been a very difficult decision regarding the Presidential run and I want to thank all my twitter fans for your fantastic support.","rating":3},{"id":281884446389596160,"text":"\"\"I find hope in the darkest of days, and focus in the brightest.\"\" - Dalai Lama","rating":1},{"id":468477764757377000,"text":"Entrepreneurs:  See yourself as victorious--and the best way to be victorious is to be passionate. Find something you love doing!","rating":2},{"id":431018674695442400,"text":"Massive record setting  snowstorm and freezing temperatures in U.S. Smart that GLOBAL WARMING hoaxsters changed name to CLIMATE CHANGE! $$$$","rating":9},{"id":426108680757473300,"text":"Set high standards and meet them. The proof is in the doing: learn by doing and taking risks.","rating":3},{"id":225949765324636160,"text":"\"\"Show me someone without an ego, and I'll show you a loser.\"\" --How To Get Rich","rating":5},{"id":468477058658861060,"text":"Entrepreneurs:  Stay focused and be tenacious. Pay attention to people who know what they're talking about. Stay fixed on your goals!","rating":2},{"id":466316124075081700,"text":"If you are steadfast in your efforts, critics will be harmless. Achievers move forward, and achievement is not a plateau, it's a beginning.","rating":2},{"id":419142769127325700,"text":"A regular part of your day should be devoted to expanding your horizons. Learning is a new beginning.","rating":2},{"id":560915552948850700,"text":"Entrepreneurs:  Being stubborn is a big part of being a winner. Don't give in and don't give up!","rating":3},{"id":253599772227809280,"text":"\"\"Invincibility lies in the defence, the possibility of victory in the attack.\"\" --Sun Tzu","rating":3},{"id":454346489075339260,"text":"Entrepreneurs, always remember that every business relationship can lead to greater deals in the future. Be sure to cultivate relationships","rating":2},{"id":576485549873197000,"text":"Boy did Pharrell &amp, Robin Thicke get screwed. The Marvin Gaye song sounds nothing like theirs. Get new lawyers fast!","rating":7},{"id":370273897561591800,"text":"“Leadership is perhaps the key to getting any job done.” – The Art of The Deal","rating":4},{"id":510924395981062140,"text":"Secretary Kerry cannot get other nations to join us in fighting ISIS. They are afraid and he is a poor salesman who reps a pathetic leader!","rating":8},{"id":476814534053990400,"text":"We are what we repeatedly do. Excellence, therefore, is not an act but a habit. --  Aristotle","rating":2},{"id":437988762266529800,"text":"Entrepreneurs:  Everything starts with you. Leadership is not a group effort--if you're in charge, then be in charge.","rating":3},{"id":212274615060414460,"text":"The Justice Department's investigation into the national security leaks is not independent. This is a very grave situation.","rating":5},{"id":375600015714316300,"text":"While everyone is waiting and prepared for us to attack Syria, maybe we should knock the hell out of Iran and their nuclear capabilities?","rating":10},{"id":422821538656579600,"text":"Understand that difficulties, mistakes &amp, setbacks are an inevitable part of business and life. Don't allow them to knock you off your feet.","rating":3},{"id":409342934320820200,"text":"In making big money, knowledge is far more important than any other ingredient, including money itself!","rating":4},{"id":405837296723042300,"text":"Why doesn't President Obama simply apologize for telling a big fat lie, announce that ObamaCare was a mistake, and deal a really great plan!","rating":7},{"id":404756133040381950,"text":"I do not understand how so many of my Jewish friends backed Obama in the last election. He is a TOTAL DISASTER FOR ISRAEL-AND ALWAYS WILL BE","rating":9},{"id":398865537020620800,"text":"Success tip: Be ready for problems, and be patient--there are very few cases of instant gratification.","rating":2},{"id":530485315715469300,"text":"“You just can't beat the person who never gives up.” – Babe Ruth","rating":3},{"id":473895061747695600,"text":"Obama’s war on coal is killing American jobs, making us more energy dependent on our enemies &amp, creating a great business disadvantage.","rating":5},{"id":423183719382265860,"text":"For great success, you need passion, but make sure it's well directed. Learn everything you can about what you're doing. Be an expert.","rating":2},{"id":324598808396853250,"text":"Business is easy. Dealing with people is hard. If you are an entrepreneur, your most important job is to choose who works with you.","rating":2},{"id":308683880767045600,"text":"“If you want to be successful at anything in life, you have to be able to handle pressure.” – Think Big","rating":2},{"id":572837930101809150,"text":"Entrepreneurs: Be tough, be smart, be personable, but don’t take things personally. That’s good business.","rating":2},{"id":202850299969404930,"text":"\"\"Diligence is the mother of good luck.\"\"--Benjamin Franklin","rating":1},{"id":507602204774379500,"text":"“Mold yourself into the person who can do big things.” – Think Big","rating":1},{"id":446794542839500800,"text":"We're spending a fortune looking for the lost plane with mostly Chinese passengers, and that's OK-but how much are Russia &amp, China spending?","rating":7},{"id":623528210979029000,"text":"Response to the Des Moines Register- http://t.co/krftGdPHN4","rating":4},{"id":594151632079687700,"text":"If the working, proud and productive people of our country don't start exerting their authority and views, the U.S. as we know it is doomed!","rating":9},{"id":143752736192737280,"text":"First there was the Declaration of Independence, then there was the Constitution. Now there is #TimeToGetTough. Available today.","rating":8},{"id":307155871866179600,"text":"“To succeed, one must be creative and persistent.” - John H. Johnson","rating":2},{"id":499285006549016600,"text":"“The way to get started is to quit talking and begin doing.” - Walt Disney","rating":1},{"id":440349647488315400,"text":"M.M. is a good choice - also, nice guy! #Oscars","rating":3},{"id":372087429626200060,"text":"I hope the NY tax payer appreciates the millions Schneiderman is about to waste on a small case. I will litigate to victory.","rating":7},{"id":366970226144849900,"text":"“Money may not grow on trees, but it does grow from talent, hard work, and brains.” – Think Like a Billionaire","rating":2},{"id":344909275988111360,"text":"\"\"Age wrinkles the body. Quitting wrinkles the soul.\"\" - General Douglas MacArthur","rating":2},{"id":522516449567735800,"text":"A nurse in Dallas who treated Ebola patient Thomas Duncan was allowed to fly to Cleveland.She should never have been so allowed! The real JV","rating":8},{"id":455797795996577800,"text":"However beautiful the strategy, you should occasionally look at the results.  -- Winston Churchill","rating":1},{"id":443381493013176300,"text":"\"\"Many of life's failures are people who did not realize how close they were to success when they gave up.\"\"-- Thomas A. Edison","rating":2},{"id":149132685707718660,"text":"Iraq in political turmoil one day after we leave---I told you so.","rating":6},{"id":497801930509668350,"text":"Iraq is more dangerous today than any time under Saddam. War was a mistake, as I said from the very beginning. Bush &amp, Obama should apologize","rating":7},{"id":616674967137202200,"text":"Via Huffington Post \"\"Congrats, America! Donald Trump Is Now A 2016 Presidential Front-runner\"\" http://t.co/X1YYz7x002 by Igor Bobic","rating":3},{"id":417693403892035600,"text":"Be tough, be focused. There are a lot of ups and downs, but you can ride them out if you're prepared for them.","rating":2},{"id":516603779819786240,"text":"I thought I was being nice to somebody re their parents. I guess this teaches you not to be nice or trusting. Sad!","rating":5},{"id":460865405306036200,"text":"Putin has shown the world what happens when America has weak leaders. Peace Through Strength!","rating":6},{"id":257936201057706000,"text":"Once again Obama fails to classify China as a currency manipulator. He just helped China steal even more jobs and money from us.","rating":6},{"id":415361711529787400,"text":"SOMETIMES YOUR BEST INVESTMENTS ARE THE ONES YOU DON'T MAKE!","rating":3},{"id":411097849892728800,"text":"This is one of the COLDEST WINTERS ever, freezing all over the country for long periods of time! So much for GLOBAL WARMING.","rating":8},{"id":524708583150456800,"text":"The United States troops which were sent to West Africa have only gotten 4 hours of Ebola training - very unfair to them and their families!","rating":5},{"id":513065123834236900,"text":"Roger Goodell must stop apologizing to everyone who will listen and toughen up. His street smart players are laughing at him and the NFL!","rating":7},{"id":504738526425276400,"text":"Obama will grant amnesty to millions of illegals yet he has not lifted a finger for USMC Sgt. Tahmooressi! . #BringBackOurMarine","rating":6},{"id":456136601039818750,"text":"Remember, negotiations are fluid. Remain calm and don’t settle easily. If you have the goods, you will ultimately win.","rating":3},{"id":425310085909209100,"text":"\"\"Whether you think you can or think you can't--you're right.\"\"  Henry Ford","rating":2},{"id":594454645331730400,"text":"The racial divide in our country is almost at an all-time high - and getting worse every time you turn on the television.","rating":5},{"id":294894996279148540,"text":"The freezing cold weather across the country is brutal.  Must be all that global warming.","rating":8},{"id":540894275501035500,"text":"Entrepreneurs: Believe in yourself! If you don't, no one else will either.","rating":3},{"id":441306794913046500,"text":"Success breeds success. The best way to impress people is through results. -- Think Like a Billionaire.","rating":2},{"id":606915921958060000,"text":"China just hacked our federal government &amp, stole gov. workers’ information. Why do our leaders let China get away with this?! No respect.","rating":6},{"id":369221763302817800,"text":"Let the Arab countries take care of Egypt-they have more to gain and plenty of money..It's time for the U.S. to stop being stupid.NO DOLLARS","rating":8},{"id":469906226466545660,"text":"The Obama administration gives better medical care to Al Qaeda at Gitmo than to our vets.","rating":9},{"id":458340513486475260,"text":"If America unlocked its energy potential, we would once again be the most powerful country in the world. Washington is holding us back.","rating":4},{"id":457171553260949500,"text":"Remember, if you don’t sell yourself, no one else will. Make sure the public, friends &amp, the business community hears about your success.","rating":3},{"id":376081345891405800,"text":"Obama is not a leader, he's just a campaigner!","rating":6},{"id":372819546635112450,"text":"Do not settle for remaining in your comfort zone. Being complacent is a good way to get nowhere. Take control and move forward every day.","rating":2},{"id":287279252615860220,"text":"\"\"I aim very high, and then just keep pushing and pushing to get what I'm after.\"\" - The Art of the Deal","rating":1},{"id":102040826452000770,"text":"It's easy to see why Americans are sick of career politicians and both parties.","rating":5},{"id":368393685622214660,"text":"See problems as a mind exercise. Enjoy the challenge---and remember to keep focused on your goals.","rating":1},{"id":299530651776999400,"text":"Democrats try so hard to mock &amp, belittle Republicans—&amp, the Republicans just don’t fight back—no energy!","rating":7},{"id":521674131042205700,"text":"Think of this: After we spent $2 trillion on Iraq, Baghdad is about to be taken over by ISIS.","rating":8},{"id":419203960302366700,"text":"Record snowfall &amp, freezing temps throughout the country. Where is Global Warming when you need it?!","rating":8},{"id":532270780311420900,"text":"“If you can accept losing, you can't win.” - Vince Lombardi","rating":3},{"id":491479375989047300,"text":"I try to learn from the past, but I plan for the future by focusing exclusively on the present. That's where the fun is!","rating":4},{"id":417065230381105150,"text":"In the upcoming New Year we will focus like never before - if we do that we will have complete and total VICTORY in all we do!","rating":5},{"id":357591410251284500,"text":"The Zimmerman trial is over.  It is time to move on.  While Zimmerman is no angel, he was acquitted and should be able to move on.","rating":6},{"id":499653817949229060,"text":"Keep the big picture in mind. There are always opportunities, and thinking too small can negate a lot of them.","rating":2},{"id":472447734860218400,"text":"Snowden is a traitor and a disgrace. Make no mistake, he is no hero. In fact he is a coward who should come back &amp, face justice.","rating":7},{"id":457118444664537100,"text":"Oscar Pistorious is guilty as hell!","rating":7},{"id":563798651194314750,"text":"An investment in knowledge pays the best interest. -- Benjamin Franklin","rating":2},{"id":314744479821205500,"text":"It’s snowing &amp, freezing in NYC. What the hell ever happened to global warming?","rating":9},{"id":550316740375490560,"text":"If you're interested in 'balancing' work and pleasure, stop trying to balance them. Instead make your work more pleasurable.","rating":5},{"id":253213918938415100,"text":"Under Obama, Iran has taken over Iraq, Al Qaeda has taken over Libya, the Muslim Brotherhood now controls Egypt. Worst  foreign policy ever.","rating":8},{"id":225622462770061300,"text":"Why does HI Revised Statute 338-17.8 allow an HI resident who doesn't have to be US citizen to procure an official Hawaii birth certificate?","rating":7},{"id":549591267248992260,"text":"Sometimes your best investments are the ones you don't make.","rating":4},{"id":564214553744252900,"text":"I predicted Rosie O'Donnell would fail at the View, and was right. Now I predict Rosie will take over for Brian Williams!","rating":8},{"id":372944249375162400,"text":"That said, the rich Arab countries should get involved with the Syrian mess, not us.We should start rebuilding our own country &amp, military.","rating":6},{"id":301425919917174800,"text":"To all young college graduates – stick in there, keep your head up and make sure you don’t miss any opportunities. They are out there.","rating":3},{"id":409341598967672800,"text":"My father Fred Trump left me a relatively small amount of money (compared to where I am today-over $10 billion) but vast amount of knowledge","rating":6},{"id":332234269546147840,"text":"“Never think of learning as a burden. It may require some discipline, but it prepares you for a new beginning.”– Think Like a Champion","rating":3},{"id":324969942334189600,"text":"“Sometimes people spend too much time focusing on problems instead of focusing on opportunities.” – Think Like A Champion","rating":2},{"id":535867061399199740,"text":"“Intellectuals solve problems, geniuses prevent them.” – Albert Einstein","rating":1},{"id":471350175165071360,"text":"Winners never quit and quitters never win.-- Vince Lombardi","rating":1},{"id":354335531955519500,"text":"\"\"Remember that things are cyclical, so be resilient, be patient, be creative, and remain positive.\"\" - Think Like a Champion","rating":2},{"id":535102735830773760,"text":"For those that constantly say that “global warming” is now “climate change”—they changed the name. The name global warming wasn’t working","rating":9},{"id":431472494445215740,"text":"\"\"Remember that things are cyclical, so be resilient, be patient, be creative, and remain positive.\"\" - Think Like a Champion","rating":2},{"id":311571698753351700,"text":"\"\"If you love what you do, you are going to work harder, you are going to try harder and you will be better at it.\"\" - Think Big","rating":2},{"id":457778866648793100,"text":"HAPPY EASTER - HAVE A GREAT DAY!","rating":3},{"id":471380845929181200,"text":"Our greatest weakness lies in giving up. The most certain way to succeed is always to try just one more time. -- Thomas A. Edison","rating":1},{"id":616673803435966500,"text":"Via World Tribune \"\"The elites' problem with Donald Trump: He's not for sale\"\" by Jeffrey T. Kuhner http://t.co/ez08iprQH1","rating":7},{"id":580818397862170600,"text":"“Americans are hungry to feel once again a sense of mission and greatness.” – Pres. Ronald Reagan","rating":3},{"id":568865058039697400,"text":"Entrepreneurs: Winners see problems as just another way to prove themselves. Remember to focus on the solution--not the problem.","rating":2},{"id":193449076694581250,"text":"I am in Istanbul,Turkey. Just opened magnificent #TrumpTowers--- a big hit.","rating":4},{"id":408380302206443500,"text":"Wow, record setting cold temperatures throughout large parts of the country. Must be global warming, I mean climate change!","rating":8},{"id":295987171721097200,"text":"A-Rod should do the Yankees a favor and never play again.","rating":7},{"id":570243325552414700,"text":"I told everybody the Oscars were no good—Nielsen ratings confirmed, one of the lowest ratings in history.","rating":6},{"id":396018273726111740,"text":"“Successful people keep moving. They make mistakes, but they don't quit.” – Conrad Hilton","rating":2},{"id":542100196596121600,"text":"Our country and our \"\"leaders\"\" are getting dumber all the time. Now they are about to release full documentation on torture. Will destroy CIA","rating":9},{"id":428285376520671200,"text":"\"\"Being good in business is the most fascinating kind of art.Making money is art &amp, working is art &amp, good business is the best art.\"\" A. Warhol","rating":3},{"id":408694691631075300,"text":"\"\"You have to learn the rules of the game. And then you have to play better than anyone else.\"\" -- Albert Einstein","rating":2},{"id":544956495839100900,"text":"Obama attacks the CIA for  waterboarding while routinely droning civilians caught in the Islamist crosshairs.","rating":6},{"id":508191472685187100,"text":"President Obama has just reached an ALL-TIME low approval rating! Is anybody surprised? The happiest person is former President Jimmy Carter","rating":7},{"id":489807387193507840,"text":"Congrats to Obama &amp, Democrats. CBO has just announced that ObamaCare missed its uninsured target by half &amp, program costs extra $700B+.","rating":5},{"id":605408374969253900,"text":"While Jon Stewart is a joke, not very bright and totally overrated, some losers and haters will miss him &amp, his dumb clown humor. Too bad!","rating":8},{"id":463778840754794500,"text":"The road to success is always under construction.  -- Arnold Palmer","rating":3},{"id":340460666798358500,"text":"“Protect the downside and the upside will take care of itself.\"\" – The Art of the Deal","rating":4},{"id":547061208223084540,"text":"Entrepreneurs: Whatever happens, you're responsible. If it doesn't happen, you're responsible.","rating":4},{"id":444516226652729340,"text":"\"\"One who fears failure limits his activities. Failure is only the opportunity to more intelligently begin again.\"\" -- Henry Ford","rating":3},{"id":438401200338530300,"text":"To aspiring entrepreneurs: Be tenacious. Once you've decided on your goals, remain fixed on them. Set the bar high!","rating":3},{"id":428141250228006900,"text":"Steve Jobs is spinning in his grave - Apple has lost both vision and momentum - must move fast to get magic back!","rating":5},{"id":615253800086040600,"text":"Will be in Chicago tomorrow for a record setting (by far) luncheon.","rating":2},{"id":406012765699330050,"text":"Can you believe that \"\"President\"\" Karzai of Afghanistan is holding out for more, more, more and refuses to sign deal. Tell him to go to hell!","rating":8},{"id":374354821698318340,"text":"The Arab League stated that it wants nothing to do with an attack on Syria, but they want us to attack.Are our leaders insane or just stupid","rating":9},{"id":373121062998798340,"text":"If Christian Bale turned down $50M to return as Batman he should have his head examined. What was he thinking?!","rating":5},{"id":297365478937071600,"text":"“Be sure you put your feet in the right place, then stand firm.” - Abraham Lincoln","rating":1},{"id":431019797040869400,"text":"When will our country stop wasting money on global warming and so many other truly \"\"STUPID\"\" things and begin to focus on lower taxes?","rating":7},{"id":403129321256394750,"text":"\"\"If everything seems under control, you're not going fast enough.\"\" -- Mario Andretti\"\"","rating":1},{"id":383604017315606500,"text":"You have to believe in what you want. Keep your focus, keep your momentum--and remain patient and persistent.","rating":1},{"id":347187059653476350,"text":"The Miss Universe Pageant will be broadcast live from MOSCOW, RUSSIA on November 9th. A big deal that will bring our countries together!","rating":4},{"id":448742848960397300,"text":"President Obama looks absolutely exhausted in the Netherlands. He is not a natural leader, was never ment to lead - it is tough work for him","rating":6},{"id":447193184968667140,"text":"We should be building up our military and our missile defense systems to their highest levels ever. Must be very strong to prosper &amp, survive","rating":5},{"id":278949442999181300,"text":"Egypt is a total mess. We should have backed Mubarak instead of dropping him like a dog.","rating":6},{"id":235817253290004480,"text":"Scary thought--what is the pervert Anthony Weiner doing with all the free time he has. Does he collect unemployment?","rating":8},{"id":290923311897116700,"text":"\"\"There’s nothing “compassionate” about allowing welfare dependency to be passed from generation to generation.\"\" - Time To Get Tough","rating":4},{"id":487316499208896500,"text":"Mexico is allowing many thousands to go thru their country &amp, to our very stupid open door. The Mexicans are laughing at us as buses pass by.","rating":7},{"id":461225102500446200,"text":"The premier landmark in midtown NYC, Trump Tower features our signature amenities w/a magnificent waterfall  http://t.co/3cN3Y1WJqO","rating":2},{"id":569949398190432260,"text":"Entrepreneurs: Keep your focus and keep your momentum. Believe in yourself--if you don't, no one else will either.","rating":3},{"id":278308122500661250,"text":"Good luck to Bob Kraft, Tom Brady, and Coach Bill Belichick tonight.","rating":1},{"id":331926060977487900,"text":"Is it even slightly possible that Jodi Arias could be set free-wow, what a miscarriage of justice that would be!","rating":5},{"id":439392288788455400,"text":"The World is falling apart around us, but we don't have people who know how to play the game. The U.S. is in big trouble - no leadership!","rating":7},{"id":418846167590383600,"text":"It's Jan. 2. President Obama should end his vacation early &amp, get back to Washington to straighten out the ObamaCare catastrophe--or end it.","rating":7},{"id":388362875888103400,"text":"\"\"The fact that we are here today to debate raising America’s debt limit is a sign of leadership failure.\"\" - Sen. Obama, 3/16/06","rating":5},{"id":301424121068273660,"text":"Always pretend that you’re working for yourself. You’ll do a wonderful job. It’s simple, but it works.","rating":3},{"id":288715901296058400,"text":"“Success breeds success.  The best way to impress people is through results.” – Think Like a Billionaire","rating":3},{"id":528535217787895800,"text":"The five prisoners our government so stupidly released for one pathetic traitor are now fighting and killing for ISIS-BAD DEAL! Courtmarshal","rating":9},{"id":273439857228005380,"text":"\"\"You have to set higher and higher goals. You have to want more or you will start slipping backwards fast.\"\" -- Think Big","rating":2},{"id":409706282556194800,"text":"P.S. - There is also something really good to say about humility. Being confident and humble is a great combination, maybe the best of all!","rating":2},{"id":335070542904303600,"text":"\"\"To be a big success in any field you need to build momentum. Momentum is all about energy and timing. \"\" - Think BIG","rating":2},{"id":501765721089904640,"text":"Believe you can and you're halfway there. -- Theodore Roosevelt","rating":1},{"id":380007269187866600,"text":"“Keep focusing on doing what you love, even if times are tough.” – Think Big","rating":2},{"id":339818069641801700,"text":"Obama wants to unilaterally put a no-fly zone in Syria to protect Al Qaeda Islamists http://t.co/DCgP83Oxas Syria is NOT our problem.","rating":8},{"id":531931269677215740,"text":"“The only source of knowledge is experience.” – Albert Einstein","rating":2},{"id":430754695192133600,"text":"Our greatest weakness lies in giving up. The most certain way to succeed is always to try just one more time.--Thomas A. Edison","rating":2},{"id":316645737104539650,"text":"When someone can discourage you, you probably aren't determined enough. Be resolute. That's what it takes to get things done.","rating":3},{"id":291302432489742340,"text":"“Go as far as you can see, when you get there, you'll be able to see farther.” -- J. P. Morgan","rating":2},{"id":540603770263314400,"text":"Obama is giving Social Security &amp, ObamaCare to illegals, yet wants to cut military benefits http://t.co/9WOTxcby49 Disgrace!","rating":9},{"id":451731505782743040,"text":"\"\"Great works are performed not by strength but by perseverance.\"\"-- Samuel Johnson","rating":1},{"id":418810898598219800,"text":"Entrepreneurs are visionaries in some respects--they look beyond the present. Keep that in mind when looking for opportunities.","rating":3},{"id":582645393227419600,"text":"The border is wide open for cartels &amp, terrorists. Secure our border now. Build a massive wall &amp, deduct the costs from Mexican foreign aid!","rating":10},{"id":289116903987900400,"text":"This is how it starts. Obama is now threatening to use an Executive Order for gun control http://t.co/buNU2IuD Welcome to his 2nd term.","rating":7},{"id":456518815187099650,"text":"Entrepreneurs:  Have your own vision and stick with it. Don’t be afraid to be unique. Don’t tread water--get out there and go for it.","rating":2},{"id":588733168339017700,"text":"\"\"If your actions inspire others to dream more, learn more, do more and become more, you are a leader.\"\" – John Quincy Adams","rating":1},{"id":405699082326249500,"text":"Mr. President, tell Iran to immediately free the CHRISTIAN PASTOR, as a sign of good faith, &amp, if they refuse break off talks--big sanctions","rating":6},{"id":391680505332396000,"text":"THE ROLLOUT OF OBAMACARE IS A TOTAL DISASTER AND AN EMBARRASSMENT TO OUR COUNTRY. THE WORLD IS WATCHING AND LAUGHING.$635,000,000 WEBSITE!","rating":8},{"id":385421673437986800,"text":"#2. Be totally focused. Being successful requires nothing less than 100% of your concentrated effort.","rating":3},{"id":444528720838414340,"text":"\"\"We are what we repeatedly do. Excellence, then, is not an act, but a habit.\"\"  -- Aristotle","rating":1},{"id":568386448266817540,"text":"President Obama and our negotiators are failed checker players playing against Grand Master Chess champions. Very sad to watch!","rating":7},{"id":552946688558907400,"text":"My condolences and prayers to the victims of the terrorist attack in Paris.","rating":2},{"id":246691132837330940,"text":"QE3 is going to further sink the dollar into oblivion. Creates artificial numbers for short term market gains. (cont) http://t.co/8mORe86h","rating":4},{"id":415190439939940350,"text":"#2.  Keep your momentum. Without momentum, a lot of great ideas go nowhere.","rating":3},{"id":456086981324578800,"text":"\"\"I'm convinced that about half of what separates successful entrepreneurs from the non-successful ones is pure perseverance.\"\"--Steve Jobs","rating":3},{"id":7504103261347840,"text":"My best wishes to everyone for a Happy Thanksgiving!","rating":2},{"id":37585993838108670,"text":"Check out ShouldTrumpRun....http://shouldtrumprun.com/","rating":5},{"id":524664778074365950,"text":"Negotiation is an art. Treat it like one.","rating":4},{"id":520173199536173060,"text":"In a little reported event, China has just overtaken the United States as the NUMBER ONE World economic power! Great going Washington!","rating":8},{"id":507995391934337000,"text":"The ObamaCare website was hacked. $5B dollars later and the site can’t even secure your personal information.","rating":7},{"id":422823361643679740,"text":"Focus on your goals, not on fixed patterns. Do what's necessary and what's unnecessary will be made clear.","rating":3},{"id":560548495044919300,"text":"Entrepreneurs:  Be tough, be smart, be personable, but don't take things personally. That's good business.","rating":3},{"id":156471356572172300,"text":"Why do you need a photo ID to buy a drain cleaner  http://t.co/q7YTPAqCbut not to vote?","rating":9},{"id":450697712850444300,"text":"\"\"Do not go where the path may lead, go instead where there is no path and leave a trail.\"\" -- Ralph Waldo Emerson","rating":2},{"id":597777168421228500,"text":"“Do what you can, with what you have, where you are.” - Theodore Roosevelt","rating":2},{"id":600743104908496900,"text":"TPP does not stop Japan’s currency manipulation &amp, China has a backdoor to join. It must be stopped. We need to protect the American worker!","rating":5},{"id":390213518290464800,"text":"\"\"Welfare's purpose should be to eliminate, as far as possible, the need for its own existence.\"\" – Pres. Ronald Reagan","rating":2},{"id":510499676165259260,"text":"The so-called ‘moderate’ Syrian rebels pledged their allegiance to ISIS after Obama’s address. We should not be arming them!","rating":6},{"id":573898744632115200,"text":"The harder you work, the luckier you get. -- Gary Player","rating":2},{"id":260843650844618750,"text":"If you like having the world collapse and being told America is leading from behind--vote Obama.","rating":7},{"id":412154652286025700,"text":"59% of the United States, by area, is now covered in snow-highest % in many years. The \"\"global warming\"\" name isn't working anymore-SORRY!","rating":8},{"id":290943315791204350,"text":"Can you believe that the Afghan war is our “longest war” ever—bring our troops home, rebuild the U.S., make America great again.","rating":5},{"id":519957697530044400,"text":"China has just overtaken us as the world’s largest economy. We are busy wasting $'s while China builds airports &amp, skyscrapers.","rating":6},{"id":493861987441713150,"text":"The Republicans owe an apology for blowing the 2012 election. How could they lose to Obama?!","rating":7},{"id":604379445680590800,"text":"“Confidence is contagious. So is lack of confidence.” - Vince Lombardi","rating":2},{"id":598463630288560100,"text":"I am the BEST builder, just look at what I've built. Hillary can't build. Republican candidates can't build. They don't have a clue!","rating":8},{"id":147750118546866180,"text":"But maybe my biggest beef with Obama is his view that there's nothing special or exceptional about America. #TimeToGetTough","rating":5},{"id":331510042924838900,"text":"\"\"Success seems to be connected w/ action. Successful people keep moving. They make mistakes but they don't quit.\"\" - Conrad Hilton","rating":1},{"id":303897398634225660,"text":"Listen and learn from others but make your own decisions. Use your instincts--you alone know where you want to go.","rating":3},{"id":496442582353055740,"text":"A doctor on NBC Nightly News agreed with me-we should not bring Ebola into our country through two patients, but should bring docs to them.","rating":6},{"id":568021533131718660,"text":"Among the lowest temperatures EVER in much of the United States. Ice caps at record size. Changed name from GLOBAL WARMING to CLIMATE CHANGE","rating":7},{"id":257858283564593150,"text":"Derek Jeter had a great career until 3 days ago when he sold his apartment at Trump World Tower- I told him not to sell- karma?","rating":9},{"id":268419411440979970,"text":"The sex scandal at the CIA and Pentagon is rapidly unfolding--getting more interesting by the minute!","rating":5},{"id":415227746545983500,"text":"Realize that being an entrepreneur is not a group effort. You're in charge--everything starts with you.","rating":2},{"id":381939611591012350,"text":"The Emmys are sooooo boring!  Terrible show. I'm going to watch football! I already know the winners. Good night.","rating":7},{"id":342255839308050400,"text":"Pete Rose should now be allowed in The Baseball Hall of Fame. The all-time hits leader has paid the price already!","rating":5},{"id":494815174365167600,"text":"In order to be successful, especially to be very successful, you must have the ability to be able to handle pressure!","rating":4},{"id":475636191702704100,"text":"REMEMBER, the terrible 5 for 1 trade whereby the Taliban got back leaders (killers) and we got back a NOTHING, WILL COME BACK TO HAUNT U.S.!","rating":6},{"id":468787076285358100,"text":"Going now to make a major speech before some of the world's biggest investors in Dubai!","rating":3},{"id":440917576877477900,"text":"Remember to keep going--if you stop, your momentum will stop.","rating":2},{"id":423939283938840600,"text":"“Talent wins games, but teamwork and intelligence wins championships.” - Michael Jordan","rating":1},{"id":419170378439618560,"text":"Try to develop a tempo when you're working--momentum is something you have to work at to maintain, &amp, is an important element of success.","rating":2},{"id":595410681828094000,"text":"What would you do if a large group of Muslims had a very public meeting drawing horrible and mocking cartoons of Jesus? Oh really, be cool!","rating":8},{"id":365900703060865000,"text":"In the latest poll, Danger-Weiner’s numbers have sunk. I wonder how Carlos handled the stress? He is one whacko sicko sexter.","rating":9},{"id":540608882515922940,"text":"“Failure has a thousand explanations. Success doesn't need one.” - Alec Guinness"},{"id":508187759878889500,"text":"I'm not saying to not give vaccines, I am just saying give them small doses over a long period of time - not one massive dose for a child.","rating":9},{"id":466290173463257100,"text":"The only place success comes before work is in the dictionary.-- Vince Lombardi"},{"id":624615301695410200,"text":"Great read:  “How New York's Veterans Day Parade Became 'America's Parade'” http://t.co/PuYQl4CRg3"},{"id":279960495593766900,"text":"In moments like this,we are all just Americans. I join with the President, religious and civic leaders and encourage all to pray today."},{"id":278883325433745400,"text":"For those of you in trouble—(in these troubled times)—never, ever give up!","rating":7},{"id":405029742677475300,"text":"Realize that being an entrepreneur is not a group effort. You're in charge. Everything starts with you."},{"id":402930918975086600,"text":"ALWAYS BORROW MONEY FROM A PESSIMIST BECAUSE HE WILL NEVER EXPECT IT TO BE PAID BACK!","rating":8},{"id":358321576938192900,"text":"“Going with your instincts requires tuning in to everything around your decision.” – Think Big"},{"id":286882676605087740,"text":"“In the end, you’re measured not by how much you undertake but what you finally accomplish.\"\" - The Art of the Deal"},{"id":540894015982698500,"text":"Entrepreneurs: You have to have passion. If you love your work, success will follow.","rating":2},{"id":498850010902310900,"text":"The secret of getting ahead is getting started. -- Mark Twain","rating":1},{"id":456472336037068800,"text":"\"\"Success breeds success. The best way to impress people is through results.\"\" - Think Like a Billionaire","rating":3},{"id":551767846364413950,"text":"Everyone is asking me to cover The Apprentice LIVE on twitter. I will do so. Tonight 9 to 11. IT WILL BE A GREAT EVENING OF TELEVISION!","rating":7},{"id":268824557526319100,"text":"Busy day—working on buying a major property—and creating lots of jobs.","rating":3},{"id":550318647215144960,"text":"In the end, you're measured not by how much you undertake but by what you finally accomplish.","rating":2},{"id":521875347248533500,"text":"So many problems in the U.S. and leadership that is hopeless...and now, on top of everything else, we just hit $18 trillion in debt!","rating":8},{"id":458640188336771100,"text":"\"\"Think big, set your vision high, and go for it. You'll be shocked by what you can accomplish when you do. \"\" - Midas Touch","rating":2},{"id":438367939654602750,"text":"To aspiring entrepreneurs:  Be focused! Know your goals. Put everything you've got into what you're doing--every single day.","rating":2},{"id":423182457865633800,"text":"#1 for success: Find out what you love to do. Trust yourself enough to find out what is best for you and what you're best at doing...","rating":1},{"id":590283758043058200,"text":"We are getting ready to protect Saudi Arabia against Iran &amp, others-sending ships.  How much are they going to pay us toward this protection.","rating":8},{"id":569947263595884540,"text":"Entrepreneurs: Identify your goals --  and see each day as an opportunity to show what you can do at the highest level.","rating":3},{"id":561271095207419900,"text":"Whether you think you can or think you can't, you're right. -- Henry Ford","rating":2},{"id":277165139394977800,"text":"People ask me what I do in my free time. The answer--I don't have any.","rating":4},{"id":332764927313973250,"text":"Dummy, I'm asking a question - look at the question mark at the end of the sentence! Use your head.","rating":9},{"id":325421118636818400,"text":"Great job by the FBI, Boston Police and all others involved-start the trial tonight!","rating":6},{"id":289823817298231300,"text":"“If you’re still in school, pay attention.  Education is a money machine.”  – Think Like a Billionaire","rating":3},{"id":491321104930447360,"text":"Remember the old saying \"\"The more you learn, the more you realize you don't know\"\" -- it's true. Learning is a daily challenge.","rating":2},{"id":482236414671978500,"text":"Someone just wrote that “you predicted every single major event that’s now happening—and they knock you instead of giving you credit.”","rating":7},{"id":167702012841046000,"text":"Keystone must be approved. Oil is at a record high. We need to use our resources and support allies like Canada.","rating":5},{"id":354626414273765400,"text":"“A failure or setback is not a defeat. Defeat is a state of mind. You are defeated only when you accept defeat.” – Think Big","rating":2},{"id":328702926887464960,"text":"Mechanical dog is going to be trending tonight. #MechanicalDog #CelebApprentice","rating":6},{"id":3627328938,"text":"- Donald Trump bids to buy the Oreo Double Stuf Racing League. Check it out: http://www.nabiscoworld.com/oreo/dsrl/home.aspx","rating":4},{"id":415227180054872060,"text":"Entrepreneurs: Be ready for problems--you'll have them every day. Keep open to new ideas--that's where innovation begins.","rating":3},{"id":402219641185263600,"text":"The wimps that run Penn State should be forced to resign (and be sued) for the pathetic settlement they made and destruction of great legacy","rating":7},{"id":401386427587391500,"text":"“Be tough, be smart, be personable but don’t take things personally. That’s good business.” – Think Like a Champion","rating":2},{"id":363144479961657340,"text":"Isn't it sad the way Putin is toying with Obama regarding Snowden. We look weak and pathetic. Could not happen with.a strong leader!","rating":8},{"id":321357434771886100,"text":"Don't negate your own power. Whatever you've been dealt, know you can deal with it. Fear is the opposite of faith.","rating":3},{"id":437990890821267460,"text":"Entrepreneurs: Keep your momentum. See yourself as victorious and leading a winning team. Keep everyone moving forward.","rating":3},{"id":583352262426251300,"text":"Washington needs common sense conservative solutions. Let’s make America great again! http://t.co/jEgR6jSQ5J","rating":4},{"id":415585573764874240,"text":"Without passion you don't have energy, and without energy, you don't have anything!","rating":4},{"id":299162874708901900,"text":"“Money was never a big motivation for me, except as a way to keep score.The  excitement is playing the game.”–The Art of The Deal","rating":3},{"id":520375475227471900,"text":"China is ripping wealth out Africa and yet, as usual, refuses to put anything back to help with Ebola. \"\"Let the stupid Americans do it!\"\" SAD","rating":8},{"id":509312272737767400,"text":"New poll states that a record number of Americans have lost all faith in President Obama - duh!","rating":6},{"id":261574435226669060,"text":"It is really a shame that Barack Obama may stop $5M from being generously donated to charity all because he refuses to be transparent.","rating":5},{"id":260785324421152770,"text":"Mitt Romney must start congratulating the Navy Seals and military on Bin Laden’s killing, not the President.","rating":7},{"id":253159766057181200,"text":"If Obama mentions Mitt's tax returns in tomorrow's debate then Mitt should immediately ask for Obama's college records &amp, applications","rating":7},{"id":406014439960629250,"text":"I truly believe that our country has the worst and dumbest negotiators of virtually any country in the world.","rating":6},{"id":363341175727456260,"text":"Over 35 CIA operatives were on the ground in Benghazi the night of the 9.11 attack http://t.co/gLIQUPbLnV Still a \"\"phony scandal\"\"?","rating":5},{"id":361865551397662700,"text":"\"\"Success is not the key to happiness. Happiness is the key to success. If you love what you are doing, you'll be a success.\"\" - A. Schweitzer","rating":2},{"id":344554483948343300,"text":"“The risk of a wrong decision is preferable to the terror of indecision.” – Maimonides","rating":4},{"id":527106233804025860,"text":"WH refused a meeting with the Israeli Defense Minister. If only Obama hated Iran as much as he dislikes Israel.","rating":7},{"id":492299004030750700,"text":"Less than 1% of Obama’s $4B immigration request will go towards immediate border security. A real scam. Enforce our laws now!","rating":6},{"id":591299410702819300,"text":"Why are the Republicans giving Obama fast track authority for TPP and the Iran agreement?! Obama gets more from the GOP than his own party.","rating":7},{"id":590987960088158200,"text":"“What counts is not necessarily the size of the dog in the fight - it's the size of the fight in the dog.” - Dwight D. Eisenhower","rating":3},{"id":270920954853609470,"text":"\"\"What you dream about is what you do. If you cannot even dream of doing big things, you will never do anything big.\"\"--Think Big","rating":3},{"id":261147459739336700,"text":"The response has been fantastic--- actually overwhelming! Thank you!","rating":5},{"id":324625382554890240,"text":"Thinking small when you could think big limits you in all aspects of your life.","rating":4},{"id":301733981290917900,"text":"“The harder you work, the luckier you  get.” - Gary Player","rating":3},{"id":496389333180768260,"text":"Achievers move forward at all times. Achievement is not a plateau, it's a beginning.","rating":4},{"id":487272197128749060,"text":"Our gov’t should immediately stop sending $’s to Mexico, no friend, until they release Marine &amp, stop allowing immigrant inflow into U.S.","rating":7},{"id":445743081695232000,"text":"Wow, Putin is really taking advantage of President Obama. It is important that Obama responds with strength and determination-be smart-cool!","rating":8},{"id":583358317323501600,"text":"Entrepreneurs: Realize that success requires 100% effort and 100% focus. Nothing less.","rating":4},{"id":233297114715791360,"text":"No surprise that China was caught cheating in the Olympics. That's the Chinese M.O. - Lie, Cheat &amp, Steal in all international dealings.","rating":9},{"id":226035479596896260,"text":"I hope Bill Clinton and NEWSMAX's Chris Ruddy are enjoying their mission to Africa. Two great people.","rating":3},{"id":364394989037436900,"text":"Do not settle for remaining in your comfort zone. Being complacent is a good way to get nowhere. Get your momentum going and keep it going.","rating":5},{"id":532262871980605440,"text":"The ObamaCare website still is not complete. $5 billion and no progress. Scary and sad!","rating":6},{"id":511908564198498300,"text":"We must immediately stop all air traffic coming from the Ebola infected areas of Africa—before it is too late.","rating":8},{"id":418844092903071740,"text":"\"\"Thinking big is the driving force that has forged all the great achievements in modern life.\"\" - Think Big","rating":2},{"id":553653206820327400,"text":"Entrepreneurs:  Be totally focused. Know everything you can about what you're doing. Give your work 100% of your concentrated effort.","rating":4},{"id":413313513759584260,"text":"“If you want the best, you’d better be the best – in all aspects of business.” – Think Like a Billionaire","rating":3},{"id":405099329683468300,"text":"Just got home, watching the news, and every story is bad about the U.S. Someday we will return to being great again, but we need leadership!","rating":4},{"id":507247092616945660,"text":"Entrepreneurs: Do not view any failure as the final say for your efforts. Learn your lessons quickly, then move on.","rating":2},{"id":495381503204163600,"text":"So many lives and two trillion dollars wasted, and our worst enemies will get the 2nd largest oil reserves in the World. Such stupid leaders","rating":6},{"id":575392590691987460,"text":"An investment in knowledge pays the best interest. -- Benjamin Franklin","rating":2},{"id":266240297028161540,"text":"Our country is totally split right now but someday it will come together!","rating":3},{"id":402418459604434940,"text":"The polls have shown that DEAD PEOPLE voted for President Obama overwhelmingly and without hesitation - he must be doing something right!","rating":8},{"id":393409731722620900,"text":"Good advice from my father, Fred C. Trump:\"\"Know everything you can about what you're doing.\"\"","rating":3},{"id":387567929761746940,"text":"President Obama wants to change the name of the \"\"White House\"\" because it is highly discriminating and not at all politically correct!","rating":9},{"id":497032098658910200,"text":"Learning never exhausts the mind. -- Leonardo da Vinci","rating":2},{"id":469209384187600900,"text":"Talent is cheaper than table salt. What separates the talented individual from the successful one is a lot of hard work. -- Stephen King","rating":2},{"id":428245598064496640,"text":"\"\"It's not that I'm so smart, it's just that I stay with problems longer.\"\" -- Albert Einstein","rating":2},{"id":287269104430243840,"text":"\"\"Wealth comes from big goals and sustained action toward those goals every day.\"\" - Think Big","rating":3},{"id":542066310059147260,"text":"\"\"When you have exhausted all possibilities, remember this - you haven't.\"\"    -- Thomas A. Edison","rating":2},{"id":507240006432604160,"text":"Entrepreneurs: Keep the big picture in mind. There are always opportunities, and thinking too small can negate a lot of them.","rating":3},{"id":497107684702027800,"text":"Young entrepreneurs – remember quality and results are the key metrics to success.","rating":3},{"id":558365931559473150,"text":"Entrepreneurs:  Everything starts with you. Realize that you're in charge.  Whatever happens, you're responsible.","rating":3},{"id":258661128643674100,"text":"If Obama goes after Mitt's private sector experience in the next debate then Mitt should ask for Obama's college records--all of them.","rating":8},{"id":238002311224512500,"text":"Amazing--both Transformers &amp, Dark Knight Rises featured Trump properties and each grossed over $1B. Just coincidence.","rating":7},{"id":377600416093331460,"text":"Doesn't want to remove Assad - worries what comes next.","rating":6},{"id":307195142387929100,"text":"Remember, no one ever said success was easy.Good luck doesn’t come overnight.But if u work hard &amp, love it, u will find success &amp, luck.","rating":2},{"id":290923445267603460,"text":"Everyone is starting to feel the new tax hikes.  You get what you vote for!","rating":4},{"id":611934171695611900,"text":"People buy deals &amp, immediately put them into bankruptcy in order to make better deals. It’s a very effective &amp, commonly used business tool.","rating":5},{"id":601779145627033600,"text":"On this Memorial Day holiday, we honor our fallen soldiers who have made the greatest sacrifice for freedom. They are our country’s finest.","rating":1},{"id":98055725728792580,"text":"This is the best deal the Republicans could get?","rating":3},{"id":474327702669762560,"text":"I believe that in addition to the 5 terrorist leaders President Obama gave up for Bergdahl, a great deal of CASH was also given. So stupid!","rating":8},{"id":265560730441498620,"text":"Obama just stated \"\"It's always good to ignore Donald Trump.\"\" I state he is right, especially when the truth is against him.","rating":6},{"id":260386320331980800,"text":"I will be live tweeting during the debate tonight.","rating":2},{"id":456040602803900400,"text":"Oscar Pistorious, \"\"the blade runner,\"\" is as guilty as O.J.  I wonder if the result will be the same?","rating":7},{"id":415537123609940000,"text":"Entrepreneurs: Apply your skills and talent, but above all, be tenacious. See yourself as victorious--which means never giving up.","rating":2},{"id":390820598903238660,"text":"Remember, if you don't pat yourself on the back, nobody else will. Take credit for your successes and don't let others forget!!!!!!","rating":6},{"id":507239471914709000,"text":"Entrepreneurs:  Put everything you've got into what you're doing. Know  exactly what you want and go for it.  Nothing should be haphazard.","rating":3},{"id":459768632994967550,"text":"If you have passion, confidence, resilience, &amp, vision, you could become an entrepreneur. Add focus to the list &amp, you're off to a good start","rating":3},{"id":446280136393228300,"text":"\"\"It's not that I'm so smart, it's just that I stay with problems longer.\"\"  -- Albert Einstein","rating":2},{"id":404228837195919360,"text":"Get smart on knockout assaults and crime - we have to be slightly more vicious (and violent) than the assaulter-and crime would end FAST!","rating":9},{"id":352142723970633700,"text":"“Get in. Get it done. Get it done right. Get out.” – My father, Fred C. Trump","rating":4},{"id":351137900324339700,"text":"I like doing this once a month for the haters &amp, losers (and as they know)-I don't wear a \"\"wig\"\". Some may not like my hairstyle, but all mine","rating":8},{"id":492295060147687400,"text":"Obama is on yet another two-day West Coast fundraising swing. Has to fit it in before his 15 day tax-payer funded vacation.","rating":7},{"id":472898907945836540,"text":"President Obama created a VERY BAD precedent by handing over five Taliban prisoners in exchange for Sgt. Bowe Bergdahl. Another U.S. loss!","rating":8},{"id":570258558119497700,"text":"The evening news broadcasts must stop talking about weather—boring and too many other topics.","rating":7},{"id":563814901303750660,"text":"Entrepreneurs:  Look at the solution, not the problem. Learn to focus on what will give results.","rating":2},{"id":245578692061954050,"text":"On this solemn day of remembrance we can all take joy in the fact that Bin Laden's last sight was a Navy SEAL pulling the trigger.","rating":7},{"id":399736198643847200,"text":"If we could force Russia, China and other competitors to use ObamaCare, we would be able to instantly destroy their great economic success!","rating":8},{"id":598188263954866200,"text":"I was proud to be one of Ronald Reagan's earliest supporters. Like Reagan, it's time to Make America Great Again!http://t.co/toq7Ddalco","rating":3},{"id":111139701519429630,"text":"Fast and Furious gun running goes all the way to the White House.  We need answers now!","rating":5},{"id":458031670164459500,"text":"Huffington Post is just upset that I said its purchase by AOL has been a disaster and that Arianna Huffington is ugly both inside and out!","rating":9},{"id":569892077858922500,"text":"Trump to host #Oscars? http://t.co/qnU9o2X8XZ","rating":4},{"id":139342777967329280,"text":"I dictate my tweets to my executive assistant and she posts them. \"\"Time is money\"\"---The Art of the Deal.","rating":6},{"id":414097410726432800,"text":"Guess what, folks--the ObamaCare website just went down again. What a disaster.","rating":5},{"id":395653865896308740,"text":"China just called. They want to lend Obama another $1B for the ObamaCare web site.","rating":8},{"id":384863143002120200,"text":"Remember that in 2006 then Senator Obama voted NOT TO INCREASE THE DEBT CEILING. Now he acts in disbelief as others plan to do the same!","rating":4},{"id":375971865996832800,"text":"I am not angry at Russia (or China) because their leaders are far smarter than ours. We need real leadership, and fast,before it is too late","rating":6},{"id":364795134417698800,"text":"“Be tough, be smart, be personable, but don’t take things personally. That’s good business.” – Think Like a Champion","rating":3},{"id":344546262839869440,"text":"\"\"Always pretend that you're working for yourself. You'll do a wonderful job. It's simple, but it works.\"\" - Think Like a Billionaire","rating":2},{"id":342377485452845060,"text":"I've done the largest house sale in U.S. history by selling a Palm Beach mansion for $100M, $60M more than I paid. I love real estate.","rating":5},{"id":520495085956632600,"text":"I feel sorry for the 4000 soldiers who are being forced to go the West Africa to fight Ebola. Their families are up in arms. Not trained.","rating":7},{"id":483688700447326200,"text":"The more you know, the more you realize how much you don't know. How can you possibly discover anything if you already know everything?","rating":3},{"id":448827557241421800,"text":"If you’ve looked over the years,I’ve been right on virtually every issue from Iraq (not going in but if so taking the oil) to jobs to China","rating":6},{"id":604411222906265600,"text":"Wow, the economy is really bad! GROSS DOMESTIC PRODUCT down 0.7% in 1st. quarter - and getting worse. I TOLD YOU SO! Only I can fix.","rating":8},{"id":349880514485821440,"text":"Paula Deen made a big mistake in using a forbidden word but must be given some credit fot admitting her mistake. She will be back!","rating":5},{"id":323936711090511900,"text":"We must change the laws of our land and seek fair but rapid trials for the perpetrators of terrorist acts (Boston) with harsh punishment!","rating":7},{"id":511608266296922100,"text":"Obama’s promise to build an international coalition against ISIS is already broken. No one trusts him at home or abroad.","rating":6},{"id":428609046468235260,"text":"Always leave your ego at the door during negotiations. Remember, it’s only business and there will always be another day!","rating":3},{"id":594150369569026000,"text":"Why is no-one talking about the horrible murder of Ana Charle by ex-con thug West Spruill. Gunned down on street, naked. Why no riots here?","rating":8},{"id":415537384659243000,"text":"Entrepreneurs: Whatever happens, you're responsible. If it doesn't happen, you're responsible.","rating":2},{"id":334834807483818000,"text":"I totally respect that Angelina Jolie has shown such great bravery in the face of danger - she has really come a long and positive way!","rating":4},{"id":528175788861181950,"text":"“You have to learn the rules of the game. And then you have to play better than anyone else.” – Albert Einstein","rating":1},{"id":299179467283234800,"text":"Look at the solution, not the problem. Learn to focus on what will give results.","rating":1},{"id":493868020574736400,"text":"“Successful leaders see the opportunities in every difficulty rather than the difficulty in every opportunity.”- Reed Markham","rating":1},{"id":459058318297014300,"text":"\"\"Use adverse events and monumental challenges to make you stronger.\"\" - Think Big","rating":1},{"id":440319739429015550,"text":"Which is worse and which is more dishonest - the #Oscars or the Emmys?","rating":9},{"id":604022596603138000,"text":"Common Core is a federal takeover of school curriculum. Department of Education should be disbanded not expanded. Focus on local education.","rating":7},{"id":601026570904567800,"text":"What people don’t know about Kasich- he was a managing partner of the horrendous Lehman Brothers when it totally destroyed the economy!","rating":8},{"id":296303939643654140,"text":"“If you want to succeed you should strike out on new paths, rather than travel worn paths of accepted success.” - John D. Rockefeller","rating":2},{"id":490188890746392600,"text":"“Create your own visual style... let it be unique for yourself and yet identifiable for others.” - Orson Welles","rating":2},{"id":475602243761475600,"text":"We have to make the U.S.A. RICH again so that we can afford to pay Social Security, Medicare,and Medicaid and STRONG to keep our enemies out","rating":6},{"id":546034771798020100,"text":"“The way to get started is to quit talking and begin doing.” – Walt Disney","rating":3},{"id":523194743531249660,"text":"The new Ebola czar will report to the WH &amp, NSA adviser Susan Rice. More mismanagement &amp, duplicity with CDC. Obama is terrible executive.","rating":7},{"id":473782083626606600,"text":"That the Obama administration didn't know the facts about who Bergdahl was before making the stupid 5 killers for one trade is pathetic!","rating":8},{"id":408018451362766850,"text":"Denver, Minnesota and others are bracing for some of the coldest weather on record. What are the global warming geniuses saying about this?","rating":8},{"id":388663889572798460,"text":"“If it’s worth doing, it’s worth fighting for. You’ll have lots of people and obstacles in your way. Work &amp, fight to get beyond them.\"\"","rating":4},{"id":472901369255305200,"text":"The U.S. cannot negotiate with terrorists. It is a sad and terrible situation for the family involved, but this can only lead to disaster.","rating":3},{"id":470511519872978940,"text":"Have a great and peaceful Memorial Day - but remember, there are people out there who don't want us to have peace. WE MUST BE STRONG!!!!","rating":7},{"id":458718455186071550,"text":"Always remember, SOMETIMES YOUR BEST INVESTMENTS ARE THE ONES YOU DON'T MAKE!","rating":6},{"id":449613505747251200,"text":"For Entrepreneurs: A good question to ask yourself –“What can I provide that does not yet exist?”","rating":2},{"id":575753986516652000,"text":"Entrepreneurs: Problems are a mind exercise. Enjoy the challenge.","rating":2},{"id":385502616337149950,"text":"Stocks rose yesterday during the first day of government shutdown. Markets like being left alone for a day.","rating":5},{"id":511617278648279040,"text":"If you can’t focus with unyielding resolve, then you will never be successful. Believe in yourself and you can accomplish your goals.","rating":3},{"id":384730915013808100,"text":"No one wants the government to shut down, but if ObamaCare is fully implemented then our country will eventually shutdown anyway!","rating":8},{"id":314838025169416200,"text":"See yourself as an organization. Pay attention to every facet of your life. What’s strong? What’s weak? What’s missing?","rating":2},{"id":289137823976673300,"text":"\"\"Experience is the teacher of all things.\"\" -  Julius Caesar","rating":4},{"id":547060749781434400,"text":"Entrepreneurs: Realize that becoming an entrepreneur is not a group effort. You're in charge. Everything starts with you.","rating":3},{"id":522517324465979400,"text":"I can't believe that Mitt Romney would run for president again. He had his chance and blew it in the last weeks of the race.","rating":6},{"id":459429354192531460,"text":"“Once you know you love your job, never stop and never give up.” – Think Like a Billionaire","rating":3},{"id":260726937352290300,"text":"70% of the Chinese say they are better off than they were 4 years ago http://t.co/pVppYf8l  At least someone has done well under Obama.","rating":5},{"id":326781792340299800,"text":"It’s freezing in New York—where the hell is global warming?","rating":8},{"id":535530498698010600,"text":"Iraq should be paying us while we fight ISIS. Give the money to the families of our brave soldiers.","rating":7},{"id":526841962482389000,"text":"Achievers move forward at all times. Achievement is not a plateau, it's a beginning. Don't waste time treading water.","rating":3},{"id":484768359410831360,"text":"Always bear in mind that your own resolution to succeed is more important than any other. -- Abraham Lincoln","rating":2},{"id":483982205145083900,"text":"Entrepreneurs: Believe in yourself. If you don't, no one else will either.","rating":3},{"id":581498856048844800,"text":"The road to success is always under construction.-- Arnold Palmer","rating":2},{"id":405449178647511040,"text":"Look at the solution, not the problem. Learn to focus on what will give results.","rating":1},{"id":398193185597308900,"text":"Use your intelligence and your education to execute what your imagination presents to you. This is one step to becoming an entrepreneur.","rating":1},{"id":346719075365429250,"text":"A country that does not control or respect its own borders is a country destined for failure. Secure our borders!","rating":5},{"id":502054490678521860,"text":"Our politically correct country will read the ISIS terrorists who beheaded the reporter their Miranda Rights prior to good food &amp, care!","rating":8},{"id":496640871727906800,"text":"Doctors have already died treating Ebola http://t.co/L9DLh09oib  We should not be importing the disease to our homeland.","rating":7},{"id":573223760070746100,"text":"The road to success is always under construction. -- Arnold Palmer","rating":1},{"id":7793032738,"text":"Trump Tycoon App for iPhone & iPod Touch - It's $2.99 but the advice is priceless! http://bit.ly/UGUF0","rating":3},{"id":261227744522821630,"text":"Just stated by a total pro: \"\"You are the only one who has the guts to say what we are all thinking.\"\"","rating":4},{"id":397700983243178000,"text":"I would gain a whole new respect for President Obama if he would say, \"\"look, we made a big mistake, sorry!\"\" No more lies or deception.","rating":6},{"id":306423822477819900,"text":"\"\"Lord, grant that I may always desire more than I can accomplish.\"\" - Michelangelo","rating":3},{"id":477542311115915260,"text":"If you want to be successful in business, you must take risks. Make sure each risk is calculated and can have a positive fallback.","rating":2},{"id":438726471033815040,"text":"Success tip:  Keep the big picture in mind. There are always opportunities &amp, possibilities, &amp, thinking too small can negate a lot of them.","rating":2},{"id":553656481992941600,"text":"Entrepreneurs:  Look at the solution, not the problem. Learn to focus on what will give results.","rating":3},{"id":266674597976485900,"text":"Polls show that the hurricane had a huge positive effect for Obama on his win- isn't that ridiculous?","rating":8},{"id":291186971840241660,"text":"“You can have the most wonderful product in the world, but if people don’t know about it, it’s not worth much.” - The Art of the Deal","rating":4},{"id":506057894622953500,"text":"What is happening in Atlantic City, casino closures, is very sad - but does anybody give me credit for getting out before its demise? Timing","rating":7},{"id":497050105883922400,"text":"Vision remains vision until you focus, do the work, and bring it down to earth where it will do some good.","rating":3},{"id":616687162017345500,"text":"New orders for manufacturing down 9/10 months  http://t.co/RD1blUZyRn Time for fair trade. Stop TPP!","rating":5},{"id":390918762393653250,"text":"A winning attitude will put everything in perspective. Keep negative thoughts and people where they belong--out of the big picture.","rating":3}]