[{"id":525424121937948700,"text":"Double digit premium increases because of ObamaCare. Dems trying to delay showing numbers until after election, but news is spreading fast!","rating":6},{"id":507245220464173060,"text":"Entrepreneurs: Never give up. Be tough. Apply your skills and talent, but above all, be tenacious.","rating":3},{"id":477059623979986940,"text":"I told all of the haters and losers long ago that Iraq would fall, take the OIL or get out fast! Massive waste of lives and trillions of $'s","rating":8},{"id":458649291733889000,"text":"Understand that difficulties, mistakes and setbacks are an inevitable part of business and life...But always look for the opportunities.","rating":3},{"id":440467329227702300,"text":"Ellen was so awkward and insecure last night. The pizza skit was terrible. She should dump Andy Lassner, a guy with no absolutely no talent!","rating":7},{"id":327807087797219300,"text":"Study your area of business. All business involves risk, but risk can be reduced when you learn everything you can about what you’re doing.","rating":2},{"id":323182694320197600,"text":"Did A Rod really try to buy the papers that would implicate him re. drugs - wow, that would be the end, a disaster!","rating":5},{"id":532903385633390600,"text":"Entrepreneurs: Set the bar high. Do the best you possibly can. Apply your skills and talent, but above all, be tenacious.","rating":3},{"id":456153995468230660,"text":"“Don’t toss off your problems, and don’t dwell on them either. Deal with them!” – Think Like a Champion","rating":2},{"id":570245154818408450,"text":"Put the glamour, beauty &amp, mystery back in the Oscars and the ratings will zoom. Also, &amp, most importantly, the Oscars need credibility.","rating":4},{"id":568446290801123300,"text":"Entrepreneurs:  Pay attention to your negotiation skills. It's all about persuasion, and persuasion is power.","rating":3},{"id":562652880629669900,"text":"Are all the illegals pouring into our country vaccinated? I don't think so. Great danger to U.S.","rating":8},{"id":315109659742707700,"text":"When I think big, which is often, you can be sure I’m aware of the enormous amount of little things that we will have to account for.","rating":4},{"id":544869889606184960,"text":"“See yourself as victorious! That will focus you in the right direction.” – Trump Never Give Up","rating":5},{"id":478698969577431040,"text":"I bought the great Turnberry Resort today - considered by many to have the greatest golf course in the World. I will take good care of it!","rating":5},{"id":454681343889506300,"text":"It's not enough that we do our best, sometimes we have to do what's required. -- Winston Churchill","rating":2},{"id":443860643767390200,"text":"\"\"Always bear in mind that your own resolution to succeed is more important than any other.\"\"  -- Abraham Lincoln","rating":2},{"id":284718429011849200,"text":"\"\"True courage is being afraid, and going ahead and doing your job anyhow, that's what courage is. \"\" - Gen. Norman Schwarzkopf (1934-2012)","rating":2},{"id":264413104832667650,"text":"I'm sending lots of bottled water out to Staten Island &amp, Long Island.","rating":3},{"id":244102395838230530,"text":"Unemployment rate only dropped because more people are out of labor force &amp, have stopped looking for work.Not a real recovery, phony numbers","rating":7},{"id":243428620792647680,"text":"Scary thought--is the sexual pervert Anthony Weiner now in Charlotte? Did he bring his phone with him?","rating":8},{"id":215906099172347900,"text":"\"\"Opportunity is missed by most people because it is dressed in overalls and looks like work.\"\" - Thomas Edison","rating":3},{"id":407623473259765760,"text":"“If you don't have time to do it right, when will you have time to do it over?” - John Wooden","rating":2},{"id":404235212487655400,"text":"Snow and ice, freezing weather, in Texas, Arizona and Oklahoma - what the hell is going on with GLOBAL WARMING?","rating":9},{"id":487673622526722050,"text":"The three great essentials to achieve anything worth while are: Hard work, stick-to-itiveness, and common sense.  -- Thomas A. Edison","rating":4},{"id":435883188531896300,"text":"\"\"Coming together is a beginning, keeping together is progress, working together is success.\"\" -- Henry Ford","rating":3},{"id":426837116937453600,"text":"Have the right mindset for the job. See your work as an art form--which means paying attention to every detail.","rating":2},{"id":609823516670693400,"text":"Remember, politicians are all talk and no action - they will never be able to MAKE OUR COUNTRY GREAT AGAIN! Controlled by lobbyists &amp, donors","rating":7},{"id":600751739831095300,"text":"Entrepreneurs: Remember the golden rule of negotiating -- he who has the gold makes the rules.","rating":5},{"id":575755541437419500,"text":"Entrepreneurs: Being stubborn is a big part of being a winner. Never give up!","rating":4},{"id":415539315272216600,"text":"Entrepreneurs: Put everything you've got into what you're doing. Be totally focused--nothing should be haphazard.","rating":3},{"id":409074212645503000,"text":"“After every setback, start thinking big as soon as possible.” - Think Big","rating":2},{"id":377876583958061060,"text":"Many people have asked recently \"\"when do you sleep?\"\"  The answer is -- not much.","rating":4},{"id":535881188750422000,"text":"“Be tough, be smart, be personable, but don’t take things personally. That’s good business.” – Think Like a Champion","rating":2},{"id":507245254370938900,"text":"Entrepreneurs:  See yourself as victorious: Look at the solution, not the problem.","rating":3},{"id":241573094291034100,"text":"I loved watching Clint Eastwood last night--he was terrific!","rating":1},{"id":543060353299808260,"text":"Entrepreneurs:  See yourself as victorious. Look at the solution, not the problem. And never give up!","rating":3},{"id":535180153455136800,"text":"If you don’t publicize your successes, your competitors will be sure to belittle them. Get the word out!","rating":4},{"id":511850251888918500,"text":"I left Atlantic City years ago, good timing. Now I may buy back in, at much lower price,  to save Plaza &amp, Taj. They were run badly by funds!","rating":6},{"id":489808836476538900,"text":"Winning isn't everything, but the will to win is everything. -- Vince Lombardi","rating":1},{"id":275694632875212800,"text":"It’s about time for all Americans (Republicans &amp, Democrats) to force our elected officials to start acting fiscally responsible!","rating":4},{"id":263336959118819330,"text":"How did Obama go to a Las Vegas fundraiser on 9.12, the day after he refused to send help to Americans in Benghazi?","rating":7},{"id":404828011524272100,"text":"Tom Brady has done a great job tonight-amazing New England comeback. Good game- not over yet!","rating":3},{"id":333714410088566800,"text":"I AM PLEASED TO INFORM YOU THAT CELEBRITY APPRENTICE HAS BEEN RENEWED FOR ANOTHER SEASON BY NBC. SEE YOU AT THE NBC UPFRONTS TOMORROW.","rating":5},{"id":310938057769635840,"text":"Re Omarosa: Nasty, tough or smart...or all?","rating":6},{"id":446683553020268540,"text":"\"\"Things turn out best for the people who make the best of the way things turn out.\"\"  --  John Wooden","rating":2},{"id":572483862577717250,"text":"Entrepreneurs: Look at the solution, not the problem. Learn to focus on what will give results.","rating":2},{"id":356848892417024000,"text":"Be careful – sexting pervert Anthony Weiner is upping his campaigning.  When will new pictures be released?","rating":8},{"id":483970125734117400,"text":"\"\"I'm convinced that about half of what separates successful entrepreneurs from the non-successful ones is pure perseverance.\"\" Steve Jobs","rating":2},{"id":454702909943316500,"text":"Learn from yesterday, live for today, hope for tomorrow. The important thing is not to stop questioning. -- Albert Einstein","rating":2},{"id":600104542114480100,"text":"Jeb Bush gave five different answers in four days on whether or not we should have invaded Iraq.He is so confused.Not presidential material!","rating":7},{"id":245518281639862270,"text":"\"\"You need to overcome the tug of people against you as you reach for high goals.\"\"--General George S. Patton","rating":3},{"id":198505724689649660,"text":"In the 1920's people were worried about global cooling--it never happened. Now it's global warming. Give me a break!","rating":6},{"id":535829446264381440,"text":"Entrepreneurs:  Problems are a mind exercise. Enjoy the challenge.","rating":2},{"id":519927979485691900,"text":"Entrepreneurs: See yourself as victorious. Look at the solution, not the problem.","rating":2},{"id":453452490324082700,"text":"It's 4.35 a.m. and I am working on a very exciting (and hopefully very good) deal - a major resort. THE HARDER I WORK, THE LUCKIER I GET!","rating":5},{"id":434434541151735800,"text":"\"\"I never did a day's work in my life. It was all fun.\"\" -- Thomas A. Edison","rating":3},{"id":611934327581077500,"text":"Almost every major dealmaker has used the bankruptcy laws as a business tool. Icahn, Black, Zell—but nobody says they went bankrupt!","rating":6},{"id":127374525338877950,"text":"Why is  crude oil priced at $86/Barrel?  OPEC is  ripping us off. Not worth $30/Barrel.  America needs new leaders.","rating":7},{"id":245587595017478140,"text":"Whatever happened to Obama's 'independent investigation' into national security leaks from his administration? Where's the media?","rating":5},{"id":325268624015233000,"text":"These Tsarnaev brothers did not work alone. They had help and assistance from other cell members. Be vigilant and on the lookout.","rating":7},{"id":322805724545699840,"text":"Always remember that as your success grows, you will be asked for more favors. Learn how to say ‘No.’ It is critical.","rating":3},{"id":303885871793446900,"text":"Be tenacious. Being tenacious means you're tough and patient at once--a formidable combination.","rating":2},{"id":294902448127090700,"text":"President Obama's inaugural had record low ratings. What does that portend?","rating":6},{"id":482540545953521660,"text":"Control your own destiny or someone else will. -- Jack Welch","rating":1},{"id":494142539843530750,"text":"“Be ready for problems-you’ll have them every day. Keep your focus and be as big as your daily challenges.” – Trump Never Give Up","rating":2},{"id":452081126128250900,"text":"\"\"Never let the fear of striking out get in your way.\"\" -- Babe Ruth","rating":1},{"id":603893282104545300,"text":"In the end, you're measured not by how much you undertake, but by what you finally accomplish!","rating":1},{"id":262558532757487600,"text":"Many people are saying that my challenge to Obama is having a huge negative effect on his poll numbers --- I agree.","rating":5},{"id":238991498945908740,"text":"\"\"When your life flashes before your eyes, make sure you've got plenty to watch.\"\" --Anonymous","rating":1},{"id":228232043258081280,"text":"Amazing how fast all of Joe Paterno's friends abandoned him. They ran for the hills.","rating":3},{"id":329700217513451500,"text":"Oil should not cost more than $40 a barrel.  Ideally it should be $25.  Cheap to produce and we protect the OPEC countries.","rating":5},{"id":473572658878349300,"text":"Entrepreneurs: Keep your momentum going! It's a big factor in sustaining your success. Keep moving forward!","rating":2},{"id":458980732967600100,"text":"\"\"To be a visionary you have to chase impossibilities. Few ever get rich easily.\"\" - Think Like a Billionaire","rating":1},{"id":619212651948830700,"text":"“TRUMP BATTLES THE NEW TOTALITARIANS: GOP elites join with leftists at Media Matters in targeting threat to both” http://t.co/Vd9FaOVcjr","rating":6},{"id":588702115616399400,"text":"We have a sacred duty to care for our vets and their families. Our Vets are owed full access to healthcare anytime &amp, anywhere!","rating":3},{"id":520897960717332500,"text":"Remember when I said when Saddam Hussein fell - the new leader of Iraq will be meaner and tougher and hate the U.S. even more. Welcome ISIS!","rating":7},{"id":495704421578190850,"text":"The fact that we are taking the Ebola patients, while others from the area are fleeing to the United States, is absolutely CRAZY-Stupid pols","rating":8},{"id":488813607958757400,"text":"Record cold temperatures in July - 20 to 30 degrees colder than normal. What the hell happened to GLOBAL WARMING?","rating":9},{"id":421914897895940100,"text":"Now that the ObamaCare website contractor has been terminated for obvious incompetence, is the person who hired them going to be fired?","rating":4},{"id":614047677458841600,"text":"Governor Rick Scott of Florida did really poorly on television this morning. I hope he is O.K.","rating":5},{"id":611904788901560300,"text":"George Will was a big Iraq fool.  $2 trillion, thousands of lives lost -- &amp, we got nothing! Dummy.","rating":8},{"id":609099376041058300,"text":"Entrepreneurs:  Review your work habits regularly and make sure they are taking you in the right direction. Keep your focus intact.","rating":3},{"id":581042462115934200,"text":"Pres. Obama was touting Yemen as a great success story - it just fell. Obama doesn't know what he is doing. Saudi Arabia is in big trouble.","rating":7},{"id":395650211717976060,"text":"Four brave Americans died in Benghazi. Administration is still covering up the truth. We deserve to know the full truth.","rating":6},{"id":547508150577135600,"text":"Negotiation is an art. Treat it like one.","rating":4},{"id":494575403974271000,"text":"Home ownership is at a 19 year low. If you can, buy now. You will thank me later.","rating":4},{"id":572483625645678600,"text":"Entrepreneurs: Keep your momentum. Without momentum, a lot of great ideas go nowhere.","rating":3},{"id":261222952010395650,"text":"In light the Benghazi emails released last night, it is apparent that Obama has no problem lying to the American public...","rating":9},{"id":322398196670267400,"text":"Opportunities only present themselves if you are out there looking for them.  Be aggressive and seize them when they come.","rating":3},{"id":471757105297629200,"text":"Entrepreneurs: Be prepared and be tough. Cover your bases! There are a lot of ups and downs, but you can ride them out if you're prepared.","rating":2},{"id":437947764241342460,"text":"We could make America great again by spreading ObamaCare throughout the World while at the same time  dropping it from U.S.!","rating":8},{"id":273540863580323840,"text":"\"\"The best thing you can do is deal from strength, and leverage is the biggest strength you have.” – THE ART OF THE DEAL","rating":3},{"id":417694344401797100,"text":"Cover your bases--know everything you can about what you're doing. Keep your focus by being well informed on a daily basis.","rating":2},{"id":514527690213171200,"text":"“Do more, be more, give more--and everyone will benefit.” – Think Like a Champion","rating":2},{"id":600750431417999400,"text":"Entrepreneurs:  Be tough, be smart, be personable --  but don't take things personally. That's good business.","rating":2},{"id":562289338336415740,"text":"Entrepreneurs: Set your mind on winning and losing won't have a chance.  See yourself as victorious!","rating":2},{"id":404774090843889660,"text":"I will be on Fox &amp, Friends tomorrow morning at 7. Will be discussing basic stupidity and incompetence, of which our \"\"leaders\"\" have plenty!","rating":9},{"id":377871184072671200,"text":"A year ago today a diplomat and 3 security operatives were abandoned by our government while they were under attack.  Never forget!","rating":5},{"id":330354024039735300,"text":"“Most people think small because most people are afraid of success, afraid of making decisions, afraid of winning” The Art of the Deal","rating":3},{"id":482631009075494900,"text":"Ask yourself: What am I pretending not to see? There may be some great opportunities right around you.","rating":3},{"id":461294120385118200,"text":"Commissioner Adam Silver made a strong and very wise decision concerning Donald Sterling.","rating":4},{"id":440825133268480000,"text":"Actually Putin doesn't want Alaska because the Environmental Protection Agency will make it impossible for him to drill for oil!","rating":7},{"id":324590961827143700,"text":"Our gov't is so pathetic that some of the billions being wasted in Afghanistan are ending up with terrorists http://t.co/bso3k1pR7l","rating":6},{"id":306146073481707500,"text":"Our leaders are terrible. The government spends over $50B a day.  It can’t find cuts for less than 2 days of spending?! Sad!","rating":7},{"id":532597030099886100,"text":"“Live Free or Die.” – motto of New Hampshire","rating":2},{"id":514182075457732600,"text":"“Always bear in mind that your own resolution to succeed is more important than any other.” – Abraham Lincoln","rating":2},{"id":492766760308060160,"text":"Making money is art and working is art and good business is the best art. -- Andy Warhol","rating":2},{"id":469452236217544700,"text":"I have been watching and loving the United States for many years and have NEVER seen it look weaker or less effective!","rating":5},{"id":434035975702843400,"text":"A big part of the country, even the southern states, is under massive attack from snow and freezing cold. Global warming anyone?","rating":8},{"id":568863185488511000,"text":"Entrepreneurs: Identify your goals. Know precisely what you want to achieve. Have your own vision and stick with it!","rating":3},{"id":561202819546742800,"text":"Entrepreneurs: Knowledge requires patience, action requires courage. Put patience and courage together and you'll be a winner .","rating":3},{"id":265802378593308670,"text":"Go out and vote--- this will be the most important election of our time!","rating":2},{"id":414092990060052500,"text":"“Every strike brings me closer to the next home run.” - Babe Ruth","rating":2},{"id":351116688038694900,"text":"You mean the fact that my father left me some money (as a good father will) and I multiplied it many, many times to over $10 billion-is bad?","rating":8},{"id":344190912622108700,"text":"“Yesterday's home runs don't win today's games.” - Babe Ruth","rating":2},{"id":527557453756768260,"text":"Entrepreneurs: Look at the solution, not the problem. Learn to focus on what will give results.","rating":3},{"id":521471391556960260,"text":"I will be on Fox &amp, Friends tomorrow morning at 7.00. Ebola and ISIS will be topics.","rating":5},{"id":469813939832750100,"text":"Logic will get you from A to B. Imagination will take you everywhere. - Albert Einstein”","rating":2},{"id":462219439052980200,"text":"China will now pass our economy this year, way ahead of projections. Pres. Obama – China’s greatest asset!","rating":7},{"id":572785094416601100,"text":"Entrepreneurs:  Follow your instincts and keep your focus intact. You alone know where you really want to go.","rating":5},{"id":284048314385711100,"text":"“I’m a great believer in asking everyone for an opinion before I make a decision. It’s a natural reflex.” – The Art of The Deal","rating":4},{"id":246344869809897470,"text":"\"\"Nothing is so permanent as a temporary government program.\"\" -- Milton Friedman","rating":3},{"id":157149168928948220,"text":"\"\"A real president should take pride in saving and spending your money wisely, not funneling it to his cronies (cont) http://t.co/Gy6SVjHK","rating":6},{"id":325996880779698200,"text":"Can you imagine the Boston killer being lovingly tended to in a hospital room right next to his victims who lost their arms, legs and worse!","rating":8},{"id":526332546314174460,"text":"With all that is happening with Ebola, including the doctor who so easily came back to New York, Obama still refuses to stop the flights!","rating":9},{"id":2346367430,"text":"RE: Michael Jackson: \"\"He was a great friend and a spectacular entertainer. It’s a devastating loss!\"\" -Donald J. Trump","rating":4},{"id":398184556005556200,"text":"Success tip: See yourself as victorious. This will focus you in the right direction. Apply your skills and talent--and be tenacious.","rating":3},{"id":302440195150737400,"text":"Success is good. Success with significance is even better. Work on what you will be proud to be associated with--make your work count.","rating":3},{"id":302177141892730900,"text":"Take responsibility for yourself--it's a very empowering attitude.","rating":3},{"id":473813786885775360,"text":"Bowe Bergdahl walked off the base after he was told not to. Solders died looking for him. U.S. should NEVER have made the deal! PUNISHMENT?","rating":8},{"id":468475996057141250,"text":"Entrepreneurs: Get a momentum going. Listen, apply, then move forward. Do not procrastinate. See opportunity as the perk that it is.","rating":3},{"id":583361671156113400,"text":"Entrepreneurs: Practice positive thinking with a lot of reality checks. Know that goals come with obstacles.","rating":2},{"id":250638636696092670,"text":"\"\"Believe and act as if it were impossible to fail.\"\" -- Charles F. Kettering","rating":1},{"id":370596719601258500,"text":"One of Obama’s greatest failures will be his legacy of making millions completely dependent on government handouts, not work.","rating":6},{"id":362663143706603500,"text":"Obama believes Benghazi is a “phony scandal.”  Nothing phony about Americans being killed by Islamists.","rating":7},{"id":334009386919940100,"text":"“Never judge someone by their job title. You’d be surprised at the talents people can have.” – Midas Touch","rating":2},{"id":468856400006119400,"text":"Entrepreneurs: Do your best to your utmost ability every day. Make that your standard.","rating":2},{"id":585748052268490800,"text":"Leaving now - I'm spending the entire day in Iowa - great people, great state!","rating":4},{"id":182184932486033400,"text":"Ron DeSantis, Iraq vet, Navy hero, bronze star, Yale, Harvard Law, running for Congress in Fla. Very impressive. http://t.co/kkPDZv7r","rating":5},{"id":385421859648307200,"text":"#3. Cover your bases. Know everything you can about what you're doing.","rating":3},{"id":332487692052996100,"text":"“The most important thing in communication is hearing what isn't said.” - Peter Drucker","rating":1},{"id":322921029708165100,"text":"Ridiculous that they gave the 14 year old golfer from China a one stroke penalty for slow play at The Masters(see, I can stick up for China)","rating":8},{"id":312306431879680000,"text":"When you think big, you will automatically trigger more details because details are the major component of making anything big.","rating":2},{"id":547416048711249900,"text":"Entrepreneurs: Realize that fear is the exact opposite of faith. Resolve to be bigger than your problems. Who's the boss?","rating":2},{"id":487323351917285400,"text":"“Let your passion for your work carry you through all the setbacks they can throw at you.” – Trump Never Give Up","rating":2},{"id":476510423668113400,"text":"What I am saying is that we never should have been in Iraq in the first place. Bush was terrible, Obama is worse! Make America GREAT again.","rating":7},{"id":466963987851403260,"text":"Be a yardstick of quality. Some people aren't used to an environment where excellence is expected. -- Steve Jobs","rating":1},{"id":585090319055777800,"text":"Congress must stop Obama’s reckless deal with Iran. The framework is a pathway for Iran to develop nukes.","rating":6},{"id":415553026078683140,"text":"“Push yourself again and again. Don't give an inch until the final buzzer sounds.” - Larry Bird","rating":1},{"id":398441213189435400,"text":"I will be going to Asheville, North Carolina, tonight for the 95th birthday party of the GREAT Billy Graham - such a wonderful man!","rating":4},{"id":394181203601149950,"text":"Isn't it amazing that the U.S. and NSA can listen to the highly protected phone conversations of world leaders but can't get O's records!","rating":8},{"id":359687595300626400,"text":"If you've got some problems today, that's a good sign--that's life. So give them some thought and make the most of the situation.","rating":3},{"id":298806875087048700,"text":"I am a cautious optimist. Call it positive thinking with a lot of reality checks.","rating":3},{"id":475634580620197900,"text":"The same \"\"brilliant\"\" negotiators that gave up five Taliban leaders for one traitor  are now making trade deals with China &amp, others.No chance","rating":7},{"id":436964342115086340,"text":"\"\"Great minds have purposes, others have wishes.\"\" --Washington Irving","rating":2},{"id":263750452477321200,"text":"\"\"The successful man will profit from his mistakes and try again in a different way.\"\" -- Dale Carnegie","rating":3},{"id":413048729273245700,"text":"“Big jobs usually go to the men who prove their ability to outgrow small ones.” - Theodore Roosevelt","rating":3},{"id":542512405318610940,"text":"President Obama, Gruber and all of the other Obama cronies got ObamaCare passed by lies and fraudulent statements. Courts should overturn!","rating":7},{"id":261094759320408060,"text":"All predictions re: my 12 o'clock release are totally incorrect.  Stay tuned!","rating":6},{"id":401394977600577540,"text":"Rumor has it Apple is going to release iPhones with bigger screens. That's good news.","rating":3},{"id":396341468249341950,"text":"“Winners see problems as just another way to prove themselves.” – Think Like a Champion","rating":2},{"id":388021883372703740,"text":"“You miss 100% of the shots you don't take.” - Wayne Gretzky","rating":1},{"id":296629149274095600,"text":"Randy Moss should not be bragging about himself—I’m the only one who is allowed to do that!","rating":8},{"id":476092439967850500,"text":"Negotiation tip: Know exactly what you want and focus on that. Trust your instincts, even after you've honed your skills.","rating":2},{"id":490136106210701300,"text":"Always bear in mind that your own resolution to succeed is more important than any other. -- Abraham Lincoln","rating":1},{"id":462751558858715140,"text":"There must be a higher standard of accuracy in the media. Incredible that some so-called \"\"journalists\"\" can make up lies and get away with it","rating":6},{"id":447067384982306800,"text":"\"\"Continuous effort - not strength or intelligence - is the key to unlocking our potential.\"\"  -- Winston Churchill","rating":1},{"id":590530356702539800,"text":"Wow, Hillary and Bill are in deep trouble, but don’t worry, my fellow Republicans will let them off the hook. All talk, no action.","rating":7},{"id":275721482259296260,"text":"“Attitude is a little thing that makes a big difference.” -- Winston Churchill","rating":1},{"id":404420095113715700,"text":"They changed the name global warming to climate change because the concept of global warming just wasn't working!","rating":8},{"id":398271916299272200,"text":"Just sit back and watch, ObamaCare is such a disaster it will fall like a house of broken cards. The website is the best part of this mess!","rating":7},{"id":479982198242967550,"text":"“When you’re at a meeting, monitor your behavior and work at being an observer – of yourself and of others.” – Think Like a Billionaire","rating":3},{"id":476522309860479000,"text":"As I have said, the Tea Party is alive and well and fighting hard for the USA. BIG WIN TODAY!","rating":6},{"id":433709098442309600,"text":"\"\"Always bear in mind that your own resolution to succeed is more important than any other.\"\" -- Abraham Lincoln","rating":2},{"id":108592737472880640,"text":"ObamaCare must be fully repealed or it will destroy America's small businesses.","rating":5},{"id":413776913568505860,"text":"Young Entrepreneurs – the Holiday season is here but that is no excuse not to stay on top of your business prospects. Focus!","rating":4},{"id":379987332000010240,"text":"“Success is getting what you want. Happiness is wanting what you get.” - Dale Carnegie","rating":2},{"id":375721267686412300,"text":"Russia is sending a fleet of ships to the Mediterranean. Obama’s war in Syria has the potential to widen into a worldwide conflict.","rating":9},{"id":473916898825216000,"text":"“The problem is that no government can create real jobs. Only entrepreneurs can do that.” – Midas Touch","rating":3},{"id":466647126932729860,"text":"Be a cautious optimist. Call it positive thinking with a lot of reality checks.","rating":4},{"id":431082394481737700,"text":"\"\"Innovation distinguishes between a leader and a follower.\"\"-- Steve Jobs","rating":2},{"id":248882168431009800,"text":"\"\"The important thing is not to stop questioning. Curiosity has its own reason for existing.\"\" --Albert Einstein","rating":2},{"id":387284372002324500,"text":"Obama is tougher on WWII vets wanting to visit a DC memorial than Iran. He needs to show respect to our vets and not play games.","rating":7},{"id":527558934903935000,"text":"Entrepreneurs: Keep an open mind! Business is a creative endeavor. There are always opportunities and possibilities.","rating":3},{"id":476085362365046800,"text":"“The best luck of all is the luck you make for yourself.” – General Douglas MacArthur","rating":3},{"id":417765789706367000,"text":"Entrepreneurs – be tough, resolute &amp, trustworthy. The most crucial time to build your reputation is when you start making deals.","rating":3},{"id":351794858027008000,"text":"Yesterday Obama compared Nelson Mandela to George Washington in Africa. Do you think he really believes it?","rating":6},{"id":509876756871131140,"text":"Middle Eastern countries must participate militarily (no running away) and big league financially in order for us to go in and save them!","rating":8},{"id":482284225270661100,"text":"I'm leaving now for Ireland, Spain, Scotland and elsewhere--crazy life!","rating":5},{"id":473923539364745200,"text":"“The entrepreneur’s ability to dream, to win, lose and win again and again is often called the entrepreneurial spirit.” – Midas Touch","rating":3},{"id":464136163662782460,"text":"“If you want to be the best, you’d better be the best – in all aspects of business.” - Think Like a Billionaire","rating":3},{"id":606492637881888800,"text":"Entrepreneurs: Negotiation is an art. Treat it like one.","rating":2},{"id":582986844234756100,"text":"Entrepreneurs:  See yourself as victorious. Look at the solution, not the problem. Be tough, be strong, be tenacious.","rating":2},{"id":551952548253696000,"text":"Hope you liked it. Tune in tomorrow night at 8:00 and 9:00 for two episodes and two boardrooms! Will be a great evening of television!","rating":5},{"id":194484731801387000,"text":"Just left Istanbul, Turkey, yesterday where  #TrumpTowers was just opened--magnificent!","rating":4},{"id":532278930284490750,"text":"Today is #VeteransDay. Let us be thankful for our nation’s finest who fight at all corners of the earth to protect our freedoms.","rating":3},{"id":511897193163554800,"text":"Entrepreneurs: Achievers move forward at all times. Achievement is not a plateau, it's a beginning.","rating":2},{"id":575040053304492000,"text":"Being good in business is the most fascinating kind of art. Making money is art &amp, working is art &amp, good business is the best artAndy Warhol","rating":4},{"id":264052120704135170,"text":"My video response to President Obama's lack of transparency. http://t.co/oK9SpIc7","rating":6},{"id":383619856005738500,"text":"Our country needs leadership now. There is total dysfunction in Washington.","rating":3},{"id":532209303495925760,"text":"Happy #VeteransDay to all.  And it is nice to have Sgt. Andrew Tahmooressi back home.","rating":2},{"id":491311890644365300,"text":"Every strike brings me closer to the next home run. – Babe Ruth","rating":1},{"id":598196245971230700,"text":"Entrepreneurs: Look at the solution, not the problem. Learn to focus on what will give results.","rating":1},{"id":582641556357812200,"text":"We have a sacred duty to care for our vets and their families. Veterans deserve universal access to care anywhere and anytime!","rating":2},{"id":375579746996060160,"text":"Tell Congress to straighten out the many problems of our country before trying to be the policemen to the world. Make America great again!","rating":4},{"id":543305177907068900,"text":"The terrorists cut off the heads of Americans and laugh, then want to sell us the bodies for $1,000,000. We fight over sleep deprivation!","rating":9},{"id":486565485035946000,"text":"“Set the example, and you’ll be a magnet for the right people. That’s the best way to work with people you like.” – Think Like a Champion","rating":1},{"id":413788230798958600,"text":"“Build up your weaknesses until they become your strong points.” - Knute Rockne","rating":1},{"id":357671634561286140,"text":"Don't talk about Rolling Stone Magazine but, most importantly, don't buy it. This degenerate killed and maimed so many wonderful people!","rating":8},{"id":349969818897752060,"text":"“Don’t be afraid of mistakes. They can be  learning tools on the way to building something great for yourself.”  Think Like a Champion","rating":4},{"id":173041873198387200,"text":"Debbie Wasserman Schultz is hard to watch or listen to--no wonder our country is going to hell!","rating":8},{"id":294162261789003800,"text":"There is no world problem which cannot be solved if people of good will &amp, intelligence want it to be.","rating":3},{"id":483981774545256450,"text":"Entrepreneurs: See yourself as victorious: Look at the solution, not the problem.","rating":5},{"id":35767358031134720,"text":"It was great to appear on Piers Morgan Tonight last night as his first live guest. Piers won the Celebrity Apprentice and he's fantastic.","rating":2},{"id":373058887404228600,"text":"Let the Arab League take care of Syria. Why are these rich Arab countries not paying us for the tremendous cost of such an attack?","rating":7},{"id":294551971610902500,"text":"“Don't find fault, find a remedy.” -- Henry Ford","rating":3},{"id":511977715181039600,"text":"Every day Mexico continues to hold Sgt. Tahmooressi is an insult to our country.","rating":6},{"id":583359130141913100,"text":"Entrepreneurs: Learn to trust yourself. Being an entrepreneur is not a group effort.","rating":4},{"id":377187904792956900,"text":"“It is hard to fail, but it is worse never to have tried to succeed.” -Theodore Roosevelt","rating":2},{"id":357125624957124600,"text":"“A brand is not a logo. A brand is the promise you put out there and the experience you deliver.” – Midas Touch","rating":3},{"id":351798062265532400,"text":"\"\"You have to love what you do or you are never going to be successful no matter what you do in life.\"\" - Think Big","rating":2},{"id":536968931278598140,"text":"Congratulations to Chuck Hagel on one of the shortest tenures as Sec. of Defense. Another terrible appointee by Obama.","rating":8},{"id":601475176929308700,"text":"Entrepreneurs: Believe in yourself. If you don't, no one else will either.","rating":4},{"id":273907952572846080,"text":"“The most important thing in communication is hearing what isn't said.” -- Peter Drucker","rating":3},{"id":256848991294197760,"text":"When an employee leaves me and begs to come back--I never let them. Loyalty is very important.","rating":6},{"id":288723024771956740,"text":"We are going to ask Katherine Webb to be a judge at the Miss USA Pageant coming up in Las Vegas.","rating":6},{"id":507233768265244700,"text":"\"\"Innovation distinguishes between a leader and a follower.\"\" -- Steve Jobs","rating":3},{"id":504347855944183800,"text":"Young entrepreneurs – be resolute in your drive for success. Gain momentum. Once you succeed, promote yourself!","rating":4},{"id":438721947632144400,"text":"Success tip: Achievers move forward at all times. Achievement is not a plateau, it's a beginning.","rating":3},{"id":593387739460083700,"text":"I am going to Iowa today - sold out crowds. People don't want our country ripped-off anymore. Must stop now!","rating":2},{"id":576473453555032000,"text":"Entrepreneurs: There are no guarantees, but being ready sure beats being taken by surprise. Know everything you can about what you're doing.","rating":1},{"id":568862282450645000,"text":"Entrepreneurs: Difficulties, mistakes &amp, setbacks are an inevitable part of business &amp, life. Remember to keep your equilibrium intact.","rating":1},{"id":558364414978850800,"text":"Entrepreneurs:  Use your imagination. Use your intelligence to execute what your imagination presents to you.","rating":1},{"id":109339819674578940,"text":"Make no mistake---Fast and Furious goes ALL the way to the White House.","rating":5},{"id":339838035195752450,"text":"Military has announced that China has successfully hacked our advanced weapon designs. China is our enemy.Should we offset this on our debt?","rating":8},{"id":326089541641445400,"text":"What do you think of water boarding the Boston killer sometime prior to allowing our doctors to make him well? I suspect he may talk!","rating":10},{"id":322804490065571840,"text":"“Be up front and direct with people, and they will return the favor.” – Think Like a Billionaire","rating":1},{"id":310060985857765400,"text":"Golf is a brain game &amp, is a great way to improve your business skills. Concentration,assessment, technique &amp, passion...it's all there.","rating":1},{"id":527192983066927100,"text":"Keep your momentum. Without momentum, a lot of great ideas go nowhere.","rating":1},{"id":454344956292124700,"text":"Nothing great was ever achieved without enthusiasm.  -- Ralph Waldo Emerson","rating":3},{"id":423179182198104060,"text":"Resilience is part of the survival of the fittest formula--make sure you remain adaptable.","rating":4},{"id":408721705826537500,"text":"Nelson Mandela and myself had a wonderful relationship--he was a special man and will be missed. http://t.co/GVziRpWbkB","rating":5},{"id":390896287949656060,"text":"Apple must make the IPhone screen bigger. Losing major market share.","rating":6},{"id":539873452141076500,"text":"Brainpower is the ultimate leverage. Keep your focus intact!","rating":3},{"id":527083103022776300,"text":"ObamaCare has brought skyrocketing premium increases &amp, unaffordable deductibles which will lead to less care &amp, job losses.","rating":7},{"id":504646055183388700,"text":"Always bear in mind that your own resolution to succeed is more important than any other. -- Abraham Lincoln","rating":2},{"id":489126125101408260,"text":"It's not that I'm so smart, it's just that I stay with problems longer. -- Albert Einstein","rating":2},{"id":477952992541278200,"text":"Iran is moving troops into Iraq under the guise that it is helping out. Actually, they will take over Iraq and all of their oil. Stupid U.S.","rating":9},{"id":310928241328287740,"text":"Gary as the Cat in the Hat? He can work it out.","rating":4},{"id":472406373360484350,"text":"Our vets are the pride of our nation. The VA scandal is a disgrace.If you can get food stamps so fast, our vets should get immediate care","rating":4},{"id":565351161990250500,"text":"Brian Williams, who is not the nice guy that people think he is, has now become totally irrelevant. He will never again hold court!","rating":7},{"id":407615965896003600,"text":"“Build your reputation on intelligence, responsibility, and results. That’s building the right way.” – Think Like a Champion","rating":2},{"id":348176719729012740,"text":"\"\"Coming together is a beginning. Keeping together is progress. Working together is success.\"\" - Henry Ford","rating":1},{"id":293731206997090300,"text":"If the Republicans need a chief negotiator I am always available--or can recommend some really good ones!","rating":5},{"id":525217854489374700,"text":"Tremendous pressure on President Obama to institute a travel ban on Ebola stricken West Africa. At some point this stubborn dope will fold!","rating":8},{"id":463343890335277060,"text":"Congrats to Barack Obama on April’s job report. Over 800,000 left the work force w/average hourly wages &amp, weekly hours staying flat. Bad!","rating":6},{"id":440330089352273900,"text":"Judy Garland was much better, to put it mildly! #Oscars","rating":3},{"id":598195607883350000,"text":"Entrepreneurs: Be passionate. You have to love what you're doing to be successful at it.","rating":2},{"id":119119020967477250,"text":"\"\"Sleepy\"\" Chuck Todd of NBC falls far short of the late great Tim Russert.","rating":7},{"id":265496271794630660,"text":"We can't destroy the competitiveness of our factories in order to prepare for nonexistent global warming. China is thrilled with us!","rating":7},{"id":399753953887666200,"text":"Don't worry, when our country starts hurting bad enough from all of the mistakes that are being made, we will start doing the right things.","rating":5},{"id":398571354187788300,"text":"“Don’t toss off your problems, and don’t dwell on them either. Deal with them!” – Think Like a Champion","rating":2},{"id":363292596686164000,"text":"\"\"Go confidently in the direction of your dreams. Live the life you have imagined.\"\"- Henry David Thoreau","rating":1},{"id":309031481345466400,"text":"It’s important to promote an image of yourself each and every day. It’s part of having a sense of self and a sense of purpose.","rating":3},{"id":507959242608111600,"text":"\"\"Taking risks &amp, making mistakes is the best way to learn something new. Most of the time you will surprise yourself\"\" -Trump Never Give Up","rating":3},{"id":494203189957496800,"text":"Youth unemployment is at a record high. ObamaCare is a job destroyer which is ruining aspiring careers. It must be repealed.","rating":4},{"id":483985768965492740,"text":"Entrepreneurs:  Stay focused and be tenacious. Remain fixed on your goals.","rating":2},{"id":451412881146658800,"text":"Entrepreneurs: Be cautiously optimistic.  Call it positive thinking with a lot of reality checks.","rating":2},{"id":141946031049949180,"text":"Newly released emails prove that scientists have manipulated data on global warming. The data is unreliable. http://t.co/DdW3Hsvn","rating":6},{"id":264375651975458800,"text":"How could Obama leave those American heroes out to die in Benghazi?  And he continues to lie to the public!","rating":9},{"id":360042290753966100,"text":"We all know that chess is a game of strategy. So is business. Think about that and develop a strategy starting today.","rating":3},{"id":319190712107298800,"text":"\"\"You can't tax business. Business doesn't pay taxes. It collects taxes.\"\" ― Ronald Reagan","rating":4},{"id":534804232093057000,"text":"“Remember that some things are worth waiting for. Plans can change, sometimes for good reason.” – Trump Never Give Up","rating":2},{"id":484742961792839700,"text":"\"\"If you want to be successful, two important considerations are passion and efficiency.\"\" - Think Like a Champion","rating":3},{"id":473849124757192700,"text":"Because of our terrible leaders, it is now open season on every American throughout the world. Terrorists are thrilled.","rating":8},{"id":449225960630792200,"text":"Remember, oftentimes the best deal you make is the deal you don't make!","rating":2},{"id":585406176541728800,"text":"Wow, the respected Monmouth University poll has me ahead of most Republican candidates nationwide, and most people don't think I'm running!","rating":6},{"id":580464780777025500,"text":"Entrepreneurs: Negotiation is an art. Treat it like one.","rating":4},{"id":276376579918135300,"text":"We are getting rid of all Glenfiddich garbage alcohol from Trump properties.","rating":7},{"id":534827218770624500,"text":"Entrepreneurs: always remember that deals are fluid. Terms are always negotiable and time can be the best option for success.","rating":4},{"id":596338822373343200,"text":"Huckabee is a nice guy but will never be able to bring in the funds so as not to cut Social Security, Medicare &amp, Medicaid. I will.","rating":6},{"id":368108362531373060,"text":"Myself with mother and father at New York Military Academy. See, I can be very military. High rank!... http://t.co/hEdNppNeMq","rating":8},{"id":354696798759170050,"text":"“Winners never quit and quitters never win.” - Vince Lombardi","rating":2},{"id":322811095112884200,"text":"Remember to take time this weekend to relax and regroup. It will pay major dividends for the next week.","rating":3},{"id":306803184976924700,"text":"\"\"Go confidently in the direction of your dreams. Live the life you have  imagined.\"\" --Henry  David Thoreau","rating":1},{"id":523783171293601800,"text":"The lobbyist and political hack that President Obama just appointed as the \"\"Ebola Czar,\"\" just missed his first major meeting on Ebola-A joke","rating":7},{"id":595404051925307400,"text":"Nobody would fight harder for free speech than me but why  taunt, over and over again, in order to provoke possible death to audience. DUMB!","rating":9},{"id":563393750735810560,"text":"It's not that I'm so smart, it's just that I stay with problems longer. -- Albert Einstein","rating":2},{"id":268076481073278980,"text":"Businesses have already started massive layoffs and reducing employees’ hours due to Obama Care.  Reality is setting in.","rating":5},{"id":260790972236038140,"text":"China will never go to war with us because if they won they would only take over property they already own!","rating":8},{"id":321716462966415360,"text":"It’s Tuesday, how much has China stolen from us today through cyber espionage?","rating":7},{"id":296665722761924600,"text":"“Remember people’s names and small details about them. Use both in conversation...","rating":3},{"id":491571051445641200,"text":"“It takes guts to win, fortunately, most people don’t have guts!\"\" -- Donald J. Trump","rating":5},{"id":433698240081313800,"text":"\"\"Don't sell yourself short on something that is important. Today is just the beginning.\"\"  -- Think Like a Champion","rating":4},{"id":326441540627095550,"text":"“Attitude is a little thing that makes a big difference.” - Winston Churchill","rating":2},{"id":299892694602358800,"text":"Being an entrepreneur is not a group effort. You have to trust yourself and your instincts.","rating":3},{"id":510521408548765700,"text":"ObamaCare has cut workers’ pay by over $22B &amp, eliminated 350,000+ small business jobs http://t.co/AdsN1jVf7I Repeal before it's too late!","rating":6},{"id":440319879954956300,"text":"Do you believe this singing? #Oscars","rating":4},{"id":205752968648200200,"text":"\"\"Attitude is a little thing that makes a big difference.\"\" -- Winston Churchill","rating":2},{"id":190139770251378700,"text":"The Fed should not do QE3. Neither the economy nor the dollar can withstand another round of artificial liquidity.","rating":2},{"id":520060835004420100,"text":"Can you believe this fool, Dr. Thomas Frieden of CDC, just stated, \"\"anyone with fever should be asked if they have been in West Africa\"\" DOPE","rating":8},{"id":487537049222651900,"text":"Rosie is back on the View which tells you how desperate they must be. It is the standard short term fix and long term disaster.","rating":7},{"id":282120284138512400,"text":"\"\"Work hard, play hard and live to the hilt.\"\" - Think Like a Billionaire","rating":3},{"id":212631217022046200,"text":"\"\"Success is not final, failure is not fatal: it is the courage to continue that counts.\"\" --Winston Churchill","rating":1},{"id":382897631434772500,"text":"If Justice Roberts had made the correct decision on ObamaCare, our country would not be in turmoil right now!","rating":6},{"id":521286933973332000,"text":"Here we go - A healthcare worker who treated Thomas Duncan, the man who flew into the U.S. from West Africa infected with Ebola, caught it!","rating":5},{"id":456831887739088900,"text":"\"\"The price of greatness is responsibility.\"\" -- Winston Churchill","rating":1},{"id":615266577282375700,"text":"See story in Fusion and Huff. Post about rape at the border. Beyond terrible! Isn't Fusion owned by Univision?","rating":4},{"id":573227753765404700,"text":"The object of golf is not just to win. It is to play like a gentleman, and win. -- Phil Mickelson","rating":2},{"id":565269354456301600,"text":"Entrepreneurs: Be totally focused. Being successful requires nothing less than 100% of your concentrated effort.","rating":4},{"id":412159674042294300,"text":"They call it \"\"climate change\"\" now because the words \"\"global warming\"\" didn't work anymore. Same people fighting hard to keep it all going!","rating":7},{"id":376897894970040300,"text":"Tony Romo just made a great play-Giants are getting killed!","rating":3},{"id":329719330751250400,"text":"“Don’t let the fear of striking out hold you back.” – Babe Ruth","rating":2},{"id":535830243505090560,"text":"Entrepreneurs:  Keep your momentum. Without momentum, a lot of great ideas go nowhere.","rating":3},{"id":476091489635016700,"text":"Negotiation is an art. Treat it like one. Be open to change--it's another word for innovation.","rating":4},{"id":621750471187935200,"text":"Is this true about Univision and Fusion? Wow!?!  http://t.co/y7nd9BziBP","rating":5},{"id":256117820495126530,"text":"A-Rod must be dropped in the Yankees line-up tonight if they want to win. He simply can't perform without drugs.","rating":8},{"id":251696944492195840,"text":"Be tenacious. Being tenacious means you're tough and patient at once, so it's a formidable combination.","rating":3},{"id":350707091645808640,"text":"\"\"Imagination is more important than knowledge.\"\" --Albert Einstein","rating":2},{"id":294180493887410200,"text":"“We have a system that increasingly taxes work and subsidizes nonwork.” - Milton Friedman","rating":2},{"id":499295001596411900,"text":"Entrepreneurs:  Keep your momentum. Without momentum, a lot of great ideas go nowhere.","rating":2},{"id":433706501132128260,"text":"\"\"If we did all the things we are capable of, we would literally astound ourselves.\"\" -- Thomas A. Edison","rating":1},{"id":563423545322397700,"text":"Entrepreneurs: Be a cautious optimist. I call it positive thinking with a lot of reality checks.","rating":2},{"id":278517871963934720,"text":"\"\"If you love your work, the difficulties will be balanced out by the enjoyment.\"\"  Think Big","rating":1},{"id":398188374642532350,"text":"Job tip: If you were the employer, what kind of person would you most desire as an employee? Be that person.","rating":2},{"id":375472403431702500,"text":"Jay Leno and his people are constantly calling me to go on his show. My answer is always no because his show sucks. They love my ratings!","rating":9},{"id":359756256791117800,"text":"This is the summer of box office bombs.  Who is green lighting this garbage? The scripts are terrible.","rating":5},{"id":357601609733242900,"text":"\"\"Sometimes people spend too much time focusing on problems instead of focusing on opportunities\"\" - Think Like a Champion","rating":1},{"id":422819593120256000,"text":"Anticipate change and embrace it. Recognize new developments that you can capitalize on and use to open new doors.","rating":2},{"id":558364717056806900,"text":"Entrepreneurs:  See yourself as victorious. This will focus you in the right direction. Put everything you've got into what you're doing.","rating":2},{"id":403241751004995600,"text":"$1B down another $1B to go. ObamaCare website is 40% unfinished. This is beyond pathetic.","rating":6},{"id":383322810258427900,"text":"7 million Americans are going to lose their jobs due to ObamaCare. 46 million face 300% premium increases. DEFUND! #MakeDCListen","rating":8},{"id":356180327271641100,"text":"I would invite Edward Snowden to be a judge at the Miss Universe Pageant in Moscow but would be concerned that he would sell results early!","rating":9},{"id":316252016190054400,"text":"They changed the name from “global warming” to “climate change” after the term global warming just wasn’t working (it was too cold)!","rating":7},{"id":310078218860384260,"text":"“You have to be patient as well as enthusiastic when it comes to your goals. Think big, but be realistic.” – Think Big","rating":2},{"id":292360233840414700,"text":"\"\"Take action every day, and stay focused for the long haul.” - Think Big","rating":1},{"id":547060958318067700,"text":"Entrepreneurs:  Use your imagination. Use your intelligence to execute what your imagination presents to you.","rating":2},{"id":495313265560662000,"text":"If you think you can do a thing or think you can't do a thing, you're right. -- Henry Ford","rating":1},{"id":438722349748461600,"text":"Success tip: Don't tread water. Get out there and go for it. There's nothing wrong with bringing your talents to the surface.","rating":3},{"id":403518886982983700,"text":"Today will be a great day at work - have only one word in mind, VICTORY!","rating":3},{"id":546028597719597060,"text":"A Clinton already defeated a Bush. The definition of insanity is doing the same thing twice &amp, expecting a different result.","rating":7},{"id":479718732059906050,"text":"Resolve never to quit, never to give up, no matter what the situation. -- Jack Nicklaus","rating":2},{"id":464433157958561800,"text":"“If it’s worth doing, it’s worth fighting for. You’ll have lots of people &amp, obstacles in your way. Fight to get beyond them.”–Midas Touch","rating":4},{"id":349980152236752900,"text":"“Ability is nothing without opportunity.” - Napoleon Bonaparte","rating":2},{"id":344850299934097400,"text":"If Snowden was such a hero then he would be in America.  He is escaping justice!","rating":8},{"id":299195401955860500,"text":"Keep your momentum. Without momentum, a lot of great ideas go nowhere.","rating":3},{"id":517387434569777150,"text":"Our national security starts at the border. Do you think ISIS &amp, al-Qaeda are just in the Middle East?","rating":6},{"id":494585793164230660,"text":"In any business, there will be ups and downs. If you can weather the rough times your success will be even greater during high times.","rating":2},{"id":569946449695404000,"text":"Entrepreneurs: Review your work habits and make sure they are taking you in the right direction. Don't become complacent!","rating":3},{"id":568387798924963840,"text":"Record setting cold and snow, ice caps massive! The only global warming we should fear is that caused by nuclear weapons - incompetent pols.","rating":9},{"id":360428217670176800,"text":"Don't ever think you've done it all already or that you've done your best. That's a shortcut to undermining your own potential.","rating":3},{"id":322398059554283500,"text":"“Go for the jugular so that people watching will not want to mess with you.” – Think Big","rating":7},{"id":522032800099500000,"text":"If you want more, you have to require more from yourself. -- Dr. Phil McGraw","rating":2},{"id":513021653102919700,"text":"China's the leading exporter of Iraqi oil yet they won’t lift a finger against ISIS. Why should we do the heavy lifting for China’s gain?","rating":8},{"id":580465343933640700,"text":"Entrepreneurs: Trust your instincts, even after you've honed your skills. They're there for a reason.","rating":4},{"id":386142282161717250,"text":"“Life is difficult no matter what, but hard work and perseverance make it a lot easier.” – Think Like a Billionaire","rating":3},{"id":362225476590256100,"text":"\"\"Trust in God and be true to yourself.\"\" Mary MacLeod Trump\"\"Know everything you can about what you're doing.\"\" Fred C. Trump","rating":5},{"id":357501229796040700,"text":"Be totally focused. Being successful requires nothing less than 100% of your concentrated effort.","rating":2},{"id":316652061229998100,"text":"Sometimes we do things to build up experience and stamina to prepare, but it's to prepare us for something bigger.","rating":3},{"id":281496998153162750,"text":"The #MissUniverse women totally blow away the Victoria’s Secret women!","rating":6},{"id":407866128921559040,"text":"With few exceptions, only really smart people are able to make a lot of money. Hard work is also important, but \"\"brains\"\" will supersede.","rating":4},{"id":320161090732433400,"text":"North Korea can't survive, or even eat, without the help of China. China could solve this problem with one phone call-they love taunting us!","rating":5},{"id":306150062474539000,"text":"China is buying gas fields in Texas http://t.co/G6tW5gSKti &amp, stealing our corporate secrets...","rating":7},{"id":530446862051184640,"text":"Fact – every successful GOP Senate candidate just elected ran on repealing ObamaCare. In January, it’s time to move!","rating":3},{"id":519586178719563800,"text":"USMC Andrew Tahmooressi should be freed immediately. He never should have been jailed in the first place. Weak leaders. #FreeOurMarine","rating":4},{"id":509052326817316860,"text":"If amnesty is so popular according to the DC ruling class, then why is Obama delaying his executive action until after the election?","rating":5},{"id":492379582025461760,"text":"It's not whether you get knocked down, it's whether you get up. -- Vince Lombardi","rating":2},{"id":448494108521558000,"text":"Getting to the point is appreciated by everyone. Here's some advice for public speaking: \"\"Be sincere, be brief, be seated.\"\"  F.D. Roosevelt","rating":2},{"id":567471653933051900,"text":"Jusr arrived at the studio - the place is going wild! LIVE AT 8 P.M.  #CELEBRITYAPPRENTICE","rating":3},{"id":552585904112807940,"text":"Big announcement coming soon regarding South Carolina...","rating":3},{"id":281847633297936400,"text":"... So if you want to aim high, you have to have the guts to handle the inevitable bumps in the road.\"\" - Think BIG","rating":2},{"id":265913058692587520,"text":"If you experience any harassment or heckling at the polling places from Obama supporters, make sure you report it immediately.","rating":6},{"id":265132601365368830,"text":"Trump Hotels are delivering lots of food to storm victims...we love doing it!","rating":4},{"id":261221279728824320,"text":"I am happy to donate $5 million to a charity Barack Obama chooses.  All I am asking is that he is transparent with the American people","rating":6},{"id":257293284945322000,"text":"So much for Washington shutting down Strasburg- they deserved to lose.","rating":2},{"id":400590048149905400,"text":"ObamaCare is on LIFE SUPPORT - it will soon be DEAD ON ARRIVAL - A bad concept that was imcompetently administered!","rating":8},{"id":385858136734564350,"text":"Obama administration had 4 years to prepare for the ObamaCare rollout. And of course they failed miserably.","rating":5},{"id":356012775488753660,"text":"I wonder if traitor Edward Snowden will be attending the Miss Universe Pageant in Moscow on November 9th.","rating":7},{"id":342192281136287740,"text":"When it comes to violent crime, and if we are going to solve the problem, we must stop being so politically correct-must tell it like it is!","rating":7},{"id":299542215292756000,"text":"Keep the big picture in mind. There are always opportunites &amp, possibilities &amp, thinking too small can negate a lot of them.","rating":2},{"id":530114792481386500,"text":"Yesterday was a referendum on ObamaCare &amp, all other Obama fiascos. Republicans can now rein him in.","rating":4},{"id":123783204887998460,"text":"The Fed's reckless monetary policy is going to create record inflation.","rating":3},{"id":410516483601477600,"text":"After climbing a great hill, one only finds that there are many more hills to climb.-- Nelson Mandela","rating":1},{"id":399741589792509950,"text":"If Justice Roberts had done the right thing and voted against ObamaCare, our country would be in a lot better shape right now! TOTAL TURMOIL","rating":7},{"id":385130282803675140,"text":"It is crucial for Republicans to remain united during this shutdown","rating":3},{"id":326875628966117400,"text":"The Chinese talk of climate change and carbon footprint but don't clean up their factories-but they sell us the equipment to clean up ours!","rating":6},{"id":312249303437565950,"text":"Congratulations to my Catholic friends on the selection of Pope Francis I to lead the Catholic Church. People that know him love him!","rating":2},{"id":301801582369071100,"text":"You've got something unique to offer--find out what it is. Ask yourself: What can I provide that does not yet exist? Innovation can follow..","rating":2},{"id":525427584717578240,"text":"There is a good possibility that a person who treated patients in West Africa and who FLEW into New York has Ebola. Touched many, bedlam!","rating":8},{"id":484393646914293760,"text":"Achievers move forward at all times. Achievement is not a plateau, it's a beginning.","rating":3},{"id":477121438994804740,"text":"Before I bought the site, the Sun Times had the biggest, ugliest sign Chicago has ever seen. Mine is magnificent and popular.","rating":7},{"id":467385033951838200,"text":"Innovation distinguishes between a leader and a follower. -- Steve Jobs","rating":2},{"id":567105677970391040,"text":"Apprentice will be amazing tomorrow night!","rating":5},{"id":367702452184703000,"text":"Don’t be easily pleased with yourself or with anything else. Be tough &amp, fight to keep your standards high. -Think Like a Champion","rating":4},{"id":364825721836802050,"text":"\"\"By failing to prepare, you are preparing to fail.\"\" --Benjamin Franklin","rating":2},{"id":345636903468548100,"text":"“Don’t find fault. Find a remedy.” – Henry Ford","rating":3},{"id":323934793039499260,"text":"My heart goes out to the people of Boston on this terrible day!","rating":3},{"id":311930401998372860,"text":"Do your homework. Wasting other people’s time due to poor planning and thoughtlessness will only leave a bad impression.","rating":2},{"id":530123735270195200,"text":"Obama’s Amnesty Executive Order can now be stopped by Majority Leader McConnell with riders. That’s one reason we needed the Senate.","rating":6},{"id":502457085351956500,"text":"“You may have to try a lot of things to get just one thing to work. That’s tenacity, and it’s critical to success.” – Trump Never Give Up","rating":2},{"id":448923589409275900,"text":"Some great quotes from the legendary and courageous Winston Churchill: \"\"Never, never, never give up.\"\" ...","rating":1},{"id":572483579034411000,"text":"Entrepreneurs: Keep the big picture in mind. There are always opportunities &amp, possibilities, and thinking too small can negate a lot of them","rating":3},{"id":565582967427571700,"text":"Entrepreneurs: Listen and learn from others, but make your own decisions. Take responsibility for yourself. It's a very empowering attitude!","rating":3},{"id":103174427906277380,"text":"Unemployment is plaguing both Black and Hispanic youths. Very troubling.","rating":5},{"id":265532178077732860,"text":"In ’08, America voted for Hope &amp, Change.  Instead, we got incompetency.  Now it is time to put a real job creator in office. Vote 4 Mitt!","rating":6},{"id":258271235174187000,"text":"Between Libya, the national security leaks and Fast &amp, Furious, Obama has had more national security scandals than any other President.","rating":8},{"id":394925308681261060,"text":"I don’t know why our allies are so surprised Obama is tapping their phones? Nothing changes!","rating":7},{"id":337327147326767100,"text":"\"\"Trust yourself. Create the kind of self that you will be happy to live with all your life.\"\" - Golda Meir","rating":2},{"id":296735349625987100,"text":"\"\"Go with your gut. Take chances. If you think you have the ingredients that you need, take chances, because your biggest successes...","rating":2},{"id":528249571391340540,"text":"Next Tuesday, remember how our president has not lifted a finger for USMC Tahmooressi. He only wants illegals to cross our border.","rating":8},{"id":517254712618672100,"text":"The woman who is the Secret Service Director looks like she is way over her head.Why can't the president appoint the best and the brightest?","rating":7},{"id":462242416226218000,"text":"Never make a concession during negotiations that could lead to more demands. Be prudent. It's best to have your concessions predetermined","rating":4},{"id":448744266811322400,"text":"Not good or smart for Obama to be calling Russia a \"\"regional\"\" power or to mention the concept of a nuclear weapon going off in NYC.","rating":5},{"id":605454865213628400,"text":"Entrepreneurs: There's nothing wrong with bringing your talents to the surface. Having an ego and acknowledging it is a healthy choice.","rating":3},{"id":273823886724968450,"text":"\"\"It’s more important to be smart than tough. I know businessmen who are brutally tough, but they’re not smart.” – Think Like A Billionaire","rating":3},{"id":314115387111374850,"text":"Passion motivates. Passionate people don't give up, their zeal eliminates fear. Passion can also create business opportunities.","rating":2},{"id":563039325617942500,"text":"Entrepreneurs:  See each day as an opportunity to show what you can do at the highest level. Take responsibility for yourself!","rating":2},{"id":553573302183424000,"text":"If you think you can do a thing or think you can't do a thing, you're right. -- Henry Ford","rating":1},{"id":247678087767158800,"text":"If you want to know how to prevail through tough circumstances then read \"\"The Art of the Comeback.\"\"","rating":2},{"id":245254955827597300,"text":"Obama asked a 7 yr old for his birth certificate. He's \"\"in your face\"\" because the Republicans dropped the ball. (cont) http://t.co/FufZD79U","rating":8},{"id":362211694807760900,"text":"Negotiation tip: Think about what the other side wants. Know where they're coming from. Try to create a win/win situation.","rating":3},{"id":338292917259083800,"text":"Sorry folks, got to go to work now - but \"\"I'll be baaaaack\"\"!","rating":5},{"id":330063560308817900,"text":"Why are some more concerned with granting terrorist rights than protecting innocent Americans?","rating":9},{"id":292306855814889500,"text":"Alabama people are saying their team has real football &amp, real girlfriends—not good for Notre Dame—but they’ll be back!","rating":6},{"id":534081738696581100,"text":"So Obama's top people responsible for ObamaCare think the American Public is stupid! All based on lies and deception! Repubs should sue.","rating":7},{"id":505105064227536900,"text":"#IceBucketChallenge For those of you who wanted a picture here it is- http://t.co/H346MidHzR","rating":4},{"id":491323469330907140,"text":"It’s Monday. How many fundraisers will Obama hold today?","rating":6},{"id":565268996476641300,"text":"Entrepreneurs: Be passionate--you have to love what you're doing to be successful at it.","rating":3},{"id":565268429041852400,"text":"Entrepreneurs: Negotiation is an art. Treat it like one.","rating":3},{"id":284766285177442300,"text":"“Leverage: don’t make deals without it.” – The Art of The Deal","rating":4},{"id":264423327655931900,"text":"How about President Obama fixing the gasoline situation instead of taking photo ops in the destruction.","rating":5},{"id":385494084875329540,"text":"Young entrepreneurs across the US are trying to make deals &amp, build businesses daily. Stay positive, think big &amp, big things will happen","rating":4},{"id":304939337588568060,"text":"Drew Peterson just got 36 years for killing his wife - bring back the death penalty!","rating":6},{"id":476190268803530750,"text":"“The best luck of all is the luck you make for yourself.” – General Douglas MacArthur\"\"\"\"","rating":3},{"id":588803158715039700,"text":"Jeb Bush - “I am a conservative” = Barack Obama -“If you like your healthcare plan, you can keep your plan.”","rating":7},{"id":245985117271642100,"text":"Our $16T national debt is now bigger than our $15T GDP. If Obama is re-elected watch for an economic meltdown in 2013.","rating":6},{"id":226305431629332480,"text":"At least 12 dead and 50 wounded in Colorado--bring back fast trials &amp, death penalty for mass murderers &amp, terrorists.","rating":6},{"id":405315122505465860,"text":"President Obama is finally getting hammered, even by his most loyal supporters and the press-I guess they can only take so much!","rating":5},{"id":319174411422928900,"text":"China has control over North Korea!","rating":4},{"id":524836291964575740,"text":"If there is one more Ebola case in the U.S., a full travel ban will be instituted. This common sense move should have been done long ago!","rating":7},{"id":520884578442297340,"text":"If a conservative Republican made the mistake that Mrs. Obama just made by calling Braley by the wrong name, it would be the biggest story!","rating":6},{"id":490168750768144400,"text":"See yourself as having a lot already, and keep your integrity intact. It’s the best path to comprehensive success. -  Think Like a Champion","rating":3},{"id":479644554803810300,"text":"A country that cannot protect its borders is a country destined to fail. Another broken promise by our leaders in Washington.","rating":5},{"id":463683822031495200,"text":"Just had a great legal victory in Ft. Lauderdale -- won trial --  now will receive tremendous $ in legal fees from losers. Love it!","rating":8},{"id":612406758351478800,"text":"My speech is right now on C-SPAN 1","rating":2},{"id":598201131370680300,"text":"\"\"Everything comes to him who hustles while he waits.\"\" -- Thomas Edison","rating":2},{"id":565971801789190140,"text":"Entrepreneurs: See each day as an opportunity to show what you can do at the highest level.","rating":3},{"id":264452740657315840,"text":"\"\"Go as far as you can see, when you get there, you'll be able to see farther.\"\" -- J.P. Morgan","rating":2},{"id":402901354739269600,"text":"\"\"If everything seems under control, you're not going fast enough.\"\" -- Mario Andretti","rating":2},{"id":521664525653643260,"text":"The people of Buffalo should be happy Terry Pegula got the team but I hope he does better w/the Bills than he has w/the Sabres. Good luck!","rating":3},{"id":517813341742714900,"text":"Ebola patient Duncan lied on his exit papers by saying he never came into contact with a person with Ebola. He knew he did, and person died.","rating":5},{"id":477507441299439600,"text":"Jailed USMC Sgt Andrew Tahmooressi should be released immediately. Since when does Mexico care about border security?#BringBackOurMarine","rating":6},{"id":476091024360865800,"text":"Negotiation tip: View any conflict as an opportunity -- this will expand your mind as well as your horizons. Persistence can go a long way.","rating":2},{"id":438763457815773200,"text":"\"\"Experience is not what happens to you, it's what you do with what happens to you.\"\"  -- Aldous Huxley","rating":1},{"id":553655993511710700,"text":"Entrepreneurs: Business is a creative endeavor. Being innovative = being open to new ideas. Keep an open mind!","rating":2},{"id":476521526272225300,"text":"Tea Party takes down Eric Cantor - REALLY BIG WIN!","rating":4},{"id":520500036657238000,"text":"If you are interested in balancing work and pleasure, you will never succeed!","rating":3},{"id":497047079295152100,"text":"Remain open to new ideas. That's where innovation begins.","rating":1},{"id":480127950386241540,"text":"Why isn't Mexico releasing our Marine. U.S. should come down really hard on them. They have ZERO respect for our so-called \"\"leader\"\"","rating":7},{"id":469897688927207400,"text":"Remember our brave men &amp, women who have fallen protecting our country this Memorial Day!","rating":5},{"id":1701461182,"text":"Donald Trump will be appearing on The View tomorrow morning to discuss Celebrity Apprentice and his new book Think Like A Champion!","rating":4},{"id":277096973306327040,"text":"“There are 2 things I’ve found I’m very good at: overcoming obstacles and motivating good people to do their best work.”–The Art of The Deal","rating":3},{"id":352162682784325600,"text":"\"\"Pleasure in the job puts perfection in the work.\"\" - Aristotle","rating":2},{"id":322078572451880960,"text":"“Success breeds success. The best way to impress people is through results.” – Think Like a Billionaire","rating":3},{"id":306235882585870340,"text":"The United States better address China's exchange rate before they steal our country and it is too late! China is laughing at us.","rating":8},{"id":513314663946547200,"text":"The NFL image is really tarnished! Now, if the sponsors start leaving and the ratings go down, the NFL will be in big trouble. Boring games!","rating":6},{"id":489062978806091800,"text":"Mexico sent USMC Andrew Tahmooressi back to jail after court hearing. Mexico does not respect our border or U.S. Boycott! #FreeOurMarine","rating":7},{"id":477966238333693950,"text":"I have been very consistent and always said that Iraq would fall as soon as the U.S. left. What a terrible waste of lives and money!","rating":5},{"id":603265744080625700,"text":"Whether you think you can or think you can't---you are right. -- Henry Ford","rating":2},{"id":258006490915422200,"text":"Based on very popular demand, I will be live tweeting tomorrow night during the Presidential debate.","rating":6},{"id":395685286728204300,"text":"How come Snowden and ObamaCare have access to all records and information but don't have even the smallest tidbits on President Obama?","rating":8},{"id":394245761451700200,"text":"\"\"I try to learn from the past, but I plan for the future by focusing exclusively on the present. That's where the fun is.\"\" ~Donald Trump\"\"","rating":3},{"id":332938792849784800,"text":"“It's not that I'm so smart, it's just that I stay with problems longer.” - Albert Einstein","rating":1},{"id":320229400765415400,"text":"...Who says the death penalty is not a deterrent?","rating":7},{"id":543061508323016700,"text":"Entrepreneurs: Cover your bases. Know everything you can about what you're doing. Then go with your gut. Your instincts r there for a reason","rating":2},{"id":539782712006295550,"text":"“Success is dependent on effort.” - Sophocles","rating":1},{"id":462328985675124740,"text":"Weakness of attitude becomes weakness of character.-- Albert Einstein","rating":1},{"id":600679562515714000,"text":"Remember when Jeb gave Hillary a medal on the 1 year anniversary of Benghazi?! http://t.co/9b4goLdxTO Guess he would have invaded Libya too!","rating":9},{"id":284748270494961660,"text":"Obama wants taxes to go up so he can take credit for lowering them next year.","rating":7},{"id":331876752693547000,"text":"“Mistakes are always forgivable, if one has the courage to admit them.” -- Bruce Lee","rating":1},{"id":305869921177464800,"text":"Lincoln never sounded like that!","rating":5},{"id":474219894134018050,"text":"Obama betrays Israel yet again, our strongest ally in the Middle East. He will recognize Hamas, breaking long standing US policy.","rating":7},{"id":419206803000287200,"text":"“The future is always beginning now.” -  Mark Strand, former Poet Laureate","rating":1},{"id":600750729775591400,"text":"Entrepreneurs: Work on what you will be proud to be associated with. Make your work count.","rating":2},{"id":562005301109743600,"text":"I'm looking forward to the Super Bowl but looking even more forward to Monday night at 8:00 - best episode EVER of Celebrity Apprentice!","rating":4},{"id":561205135255560200,"text":"Entrepreneurs: Success is good. Success with significance is even better. Work on what you will be proud to be associated with.","rating":2},{"id":552263830085320700,"text":"Celebrity Apprentice starts in 15 minutes on NBC. ENJOY!","rating":3},{"id":233625500365508600,"text":"\"\"Americans never quit.\"\" -- General Douglas MacArthur","rating":1},{"id":154670259624882180,"text":"Michelle Obama likes to be addressed as \"\"Your Excellency.\"\"http://t.co/IfFqchF7  She is an excellent spender of taxpayer money on herself.","rating":8},{"id":396012884397805600,"text":"So we can spy on our ally’s leaders but can’t water board terrorists?","rating":8},{"id":304335317194915840,"text":"It is fatal to enter any war without the will to win it.  - Douglas MacArthur","rating":3},{"id":486514983904493600,"text":"\"\"Be a yardstick of quality. Some people aren't used to an environment where excellence is expected.\"\" -- Steve Jobs","rating":2},{"id":423559091961618400,"text":"“Winning takes talent, to repeat takes character.” - John Wooden","rating":4},{"id":412966400357965800,"text":"Under President Obama, do you think America will become a THIRD WORLD COUNTRY?","rating":9},{"id":388837113023954940,"text":"Somebody got rich building the ObamaCare website which doesn't even come close to working - where has the money gone?","rating":7},{"id":368435802167975940,"text":"“Develop success from failures. Discouragement and failure are two of the surest stepping stones to success.” – Dale Carnegie","rating":3},{"id":342639349948633100,"text":"\"\"Inspiration exists, but it must find you working.\"\" -- Pablo Picasso","rating":2},{"id":314494837200150500,"text":"Haters, stop saying I went bankrupt, it is not so. I never went bankrupt...","rating":6},{"id":307528799367602200,"text":"Pay attention to details. If you don't know every aspect of what you're doing, you're setting yourself up for some big surprises.","rating":3},{"id":446358326977110000,"text":"\"\"Entrepreneurs who develop their Midas Touch do not work for money. They work to create or acquire assets. Focus on assets.\"\" -- Midas Touch","rating":3},{"id":439426460064161800,"text":"By popular(extremely) demand, I will be live tweeting the #Oscars2014 on Sunday night. Tell all your friends I will not be pulling punches!","rating":6},{"id":264441602636906500,"text":"Global warming is based on faulty science and manipulated data which is proven by the emails that were leaked http://t.co/5BeAhats","rating":8},{"id":312170246024880100,"text":"I watched Mark Cuban on Jay Leno last night - what a jerk!","rating":7},{"id":290836525938262000,"text":"“I believe in spending what you have to.  But I also believe in not spending more than you should.” - The Art of the Deal","rating":2},{"id":535551178520924160,"text":"You don't necessarily need the best location. What you need is the best deal. -- The Art of the Deal","rating":2},{"id":459651891044311040,"text":"We allow Japan to sell us millions of cars with zero import tax and we can't make a trade deal with them - our country is in big trouble!","rating":7},{"id":429353036385767400,"text":"\"\"The unforgivable crime is soft hitting. Do not hit at all if it can be avoided, but never hit softly.\"\" -  Theodore Roosevelt","rating":4},{"id":258611949053571070,"text":"Obama talks about what he is going to do--why the hell didn't he just do it, especially in the first 2 years when he had all votes necessary","rating":9},{"id":399750145371537400,"text":"The Republicans must be patient and smart - ObamaCare could sweep them into office in far greater numbers than anyone ever thought possible!","rating":5}]