[{"id":363346034602160100,"text":"Do as I say, not as I do. Obama just granted a special ObamaCare exemption for all Congress http://t.co/iy34KnpowZ All are hypocrites!","rating":7},{"id":519824543377268740,"text":"Obama is looking like an incompetent fool in the handling of the war against.ISIS! Why isn't China and Russia helping - they gain so much!","rating":8},{"id":516837092882911200,"text":"It wasn't only that Obama saluted a Marine with a cup of coffee in his hand, but why the hell does he have to exit a heli holding coffee?","rating":9},{"id":449613691986903040,"text":"Entrepreneurs:  Another question to ask yourself—“What am I pretending not to see?” There may be great opportunities right around you.","rating":3},{"id":560547531164500000,"text":"Entrepreneurs:  Achievers move forward at all times. Achievement is not a plateau, it's a beginning.","rating":3},{"id":406741846447362050,"text":"Today is the day that ObamaCare website was supposed to be up and working. WRONG-website is closed down, a total disaster! 90 million doomed","rating":8},{"id":364750661474197500,"text":"\"\"Our greatest weakness lies in giving up. The most certain way to succeed is always to try just one more time.\"\"Thomas A. Edison","rating":2},{"id":311937772254535700,"text":"“You have to have a good reason for doing what you’re doing, because people connect with the why.” – Midas Touch","rating":2},{"id":286553271890497540,"text":"...Remember--I told you so.","rating":5},{"id":534809328352784400,"text":"ObamaCare will continue to stop entrepreneurship, slow growth and halt research &amp, development. Defund, Repeal &amp, Replace!","rating":6},{"id":472407654741323800,"text":"Our country is on the precipice. Washington is broken. Where is the leadership?","rating":4},{"id":263718643068706800,"text":"Today Barack Obama is standing in water in NJ. Remember on election day that he has put the US underwater.","rating":8},{"id":362215996246851600,"text":"Negotiation tip: Be reasonable &amp, flexible. Being open to change could lead you into a fortunate situation and open the door to innovation.","rating":3},{"id":319433637705691140,"text":"The haters and losers that assume I was a non-athlete and know nothing about coaches should look into my past-unlike our President-open book","rating":7},{"id":532902794668544000,"text":"Entrepreneurs: Set the example. You can motivate others as well as yourself by remembering you are setting the example.","rating":2},{"id":520883607913906200,"text":"Michelle Obama made a terrible mistake in Iowa. When endorsing Bruce Braley before a large crowd, she called him Bruce Bailey seven times.","rating":5},{"id":496616063732572160,"text":"So many people are agreeing with me on not creating a \"\"highway\"\" for Ebola to the U.S. Started in small area of Africa and now spreading fast","rating":8},{"id":489466551377342460,"text":"\"\"No matter what you're managing, don't assume you can glide by. You have to work to maintain your momentum.\"\" - Trump: How to Get Rich","rating":2},{"id":296000095692927000,"text":"“A leader does not deserve the name unless he is willing occasionally to stand alone.” - Henry A. Kissinger","rating":1},{"id":291964364209156100,"text":"All time hit leader Pete Rose should now be in the Baseball Hall Of Fame. He has paid his penalty!","rating":3},{"id":486967499788136450,"text":"Obama is in Texas but will not be visiting the border. He is too busy fundraising!","rating":8},{"id":422408343471542300,"text":"Whether you like Obama or not, Bob Gates turned out to be one disloyal dude! Personally, I hate rats.","rating":6},{"id":581156266900369400,"text":"Entrepreneurs: When negotiating, don't be an open book. Know that the only person on your side might be yourself.","rating":4},{"id":418144399252795400,"text":"When it comes to money, finance and even life, PROTECT THE DOWNSIDE AND THE UPSIDE WILL TAKE CARE OF ITSELF!","rating":5},{"id":417431882461347840,"text":"Temperature at record lows in many parts of the country. 50 degrees below zero with wind chill in large area. Global warming folks iced in!","rating":9},{"id":349625936842473500,"text":"\"\"Keep stimulating your mind with big ideas. Be a collector of big ideas. Constantly fill your mind with new information.\"\" - Think Big","rating":3},{"id":322089054034358300,"text":"“You cannot push anyone up the ladder unless he is willing to climb.” - Andrew Carnegie","rating":2},{"id":517846408712704000,"text":"Saw Michael Jordan and Ray Allen today playing golf at Trump National Doral, the Blue Monster. Great guys!","rating":3},{"id":512697639893467140,"text":"Learn, work and think in equal proportions and you'll be going in the right direction.","rating":2},{"id":495383125732896800,"text":"The ObamaCare website is in the news again - it is turning out to cost even more than previously thought, AND IT DOESN'T WORK! Big trouble!","rating":7},{"id":441745482646183940,"text":"Of course I don't think Jimmy Carter is dead-saw him today on T.V. Just being sarcastic, but never thought he was alive as President, stiff!","rating":8},{"id":428720857532600300,"text":"With one of the worst and most prolonged cold spells in history, with Atlanta, Texas and parts of Florida freezing- Global Warming anyone?","rating":7},{"id":603631285777596400,"text":"In business, you make decisions that are in your best interests. Time for the US gov't to do the same. Let’s Make America Great Again!","rating":5},{"id":578951084967751700,"text":"Entrepreneurs:  Let your actions show that you're the best. See each day as an opportunity to show you can do business at the highest level.","rating":3},{"id":127462951014776830,"text":"Why do we continue to sit idly by while China steals our national security and corporate secrets? China is an enemy, not a friend.","rating":6},{"id":416906573089620000,"text":"The rescue icebreaker, trying to free the ship of the GLOBAL WARMING scientists, has turned back-the ice is  massive (a record). IRONIC!","rating":7},{"id":380036814779588600,"text":"\"\"The mind that opens to a new idea never comes back to its original size.\"\" -- Einstein","rating":2},{"id":609099113276297200,"text":"Entrepreneurs: Follow your own path—it will bring you to the places you were meant to be.","rating":3},{"id":606182607857008600,"text":"Just as I predicted, while Obama lifted sanctions 18 months ago, Iran cheated &amp, increased its nuclear fuel by 20%. We must DOUBLE sanctions!","rating":6},{"id":581157492111073300,"text":"Entrepreneurs: Successful negotiation means knowing what the other side wants. You've got to know where they're coming from. Pay attention!","rating":4},{"id":580466517357260800,"text":"Entrepreneurs: Take responsibility for yourself. It's a very empowering attitude.","rating":2},{"id":262962981078458370,"text":"Obama lied 100% about Libya and the killings--emails are absolute. He must release his records on Wednesday and stop the lies.","rating":6},{"id":245604958618148860,"text":"Priorities--while fundraising and campaigning on our dime, Obama has skipped over 50% of his intel briefings  http://t.co/IhiIaKPa","rating":5},{"id":373402760081055740,"text":"So, a woman in Chicago, who never had a job, has 9 kids with 7 different men (she is one of many). These kids will never work. Trouble!","rating":8},{"id":325971381823082500,"text":"Didn't the Boston killer even run over his own brother with a car in order to get away?  We are not dealing with an innocent baby here-DEATH","rating":9},{"id":324237668928086000,"text":"Negotiation is persuasion more than power. Be reasonable and flexible, and never let anyone know exactly where you’re coming from.","rating":3},{"id":594164281207365600,"text":"Whether you think you can or think you can't, you're right. -- Henry Ford","rating":1},{"id":577929490564800500,"text":"Entrepreneurs: See yourself as an organization. Pay attention to every facet of your life. What's strong? What's weak? What's missing?","rating":2},{"id":575042593651834900,"text":"Entrepreneurs: Keep an open mind. Business is a creative endeavor.","rating":2},{"id":119806847921307650,"text":"Everyone should boycott Italy if Amanda Knox is  not freed---she is totally innocent.","rating":7},{"id":387306012979380200,"text":"83% of the government is still running during the shutdown while 41% of nondefense federal workers are furloughed. Room for cuts.","rating":3},{"id":329812944676352000,"text":"Jodi, if you're listening, MAKE A DEAL!","rating":7},{"id":304276320509124600,"text":"Review your work habits &amp, make sure they are taking you in the right direction. Don't tread water--get out there and go for it.","rating":2},{"id":299634313652219900,"text":"Can you imagine if Bush’s administration drafted a memo legalizing the killing of Americans?! Democrats are such hypocrites.","rating":8},{"id":466594612942241800,"text":"Don't wait for dire circumstances to test your quick-thinking ability. Be on alert at all times.","rating":1},{"id":464555770357760000,"text":"I am watching the NFL DRAFT, will be interesting! A lot of talent but only a few will become STARS.","rating":4},{"id":455734281416228860,"text":"If the wind will not serve, take to the oars. -- Latin Proverb","rating":1},{"id":594963283548975100,"text":"I am the only one that knows how to build cities - pols are all talk and no action. Our cities need help, and fast. They are crumbling!","rating":9},{"id":572786484966764540,"text":"Entrepreneurs: Don’t ever think you’ve done it all already or that you’ve done your best. You haven't-- so don't limit yourself!","rating":2},{"id":267289042750672900,"text":"Many political pundits are using the term \"\"Art of the Deal\"\".... they should thank me. That is my term and book title.","rating":6},{"id":217345519398301700,"text":"\"\"Empty pockets never held anyone back. Only empty heads and empty hearts can do that.\"\" -- Norman Vincent Peale","rating":4},{"id":207567745699688450,"text":"The greatest commodity to own is land. It is finite. God is not making any more of it.","rating":3},{"id":382969090312110100,"text":"“Build confidence starting with small successes that lead to greater and greater successes--there is nothing like winning.\"\" -Think Big","rating":2},{"id":358264301678637060,"text":"\"\"If you want to conquer fear, don't sit home and think about it. Go out and get busy.\"\" - Dale Carnegie","rating":3},{"id":298545324467830800,"text":"China is about to acquire 82,800 net acres of a Texas shale oil and gas field http://t.co/T4bu11CK  What are we doing!","rating":7},{"id":499625608423686140,"text":"“When everyone works with the same energy, loyalty and focus, it makes for smooth sailing all around.” – Midas Touch","rating":3},{"id":475657956520775700,"text":"The Miss U.S.A. pageant will be amazing tonight. To be politically incorrect, the girls (women) are REALLY BEAUTIFUL. NBC at 8 PM.","rating":8},{"id":446363944429441000,"text":"Business is an art in itself &amp, powerful negotiation skills are one of the techniques necessary to facilitate success.- Think Like a Champion","rating":3},{"id":432954532427870200,"text":"\"\"Destiny has a part to play in your life and in your business - so give it a chance to work.\"\" - Think Like a Champion","rating":2},{"id":428273502441832450,"text":"Creativity and control can go hand in hand. Brainpower is the ultimate leverage.","rating":3},{"id":427879195503378400,"text":"Passion gives great momentum and can be the catalyst for great achievement.","rating":2},{"id":609445069914042400,"text":"Entrepreneurs: Focus on your goals, not on fixed patterns. Do what's necessary and what's unnecessary will be made clear.","rating":2},{"id":585262729511972900,"text":"How much money is the  extremely unattractive (both inside and out) Arianna Huffington paying her poor ex-hubby for the use of his name?","rating":9},{"id":563039099335237600,"text":"Entrepreneurs: Don't put blinders on or limit yourself. Reach out, seek and explore. The opportunities are always there.","rating":3},{"id":265474730130276350,"text":"Remember, go vote--we need real change this time.","rating":5},{"id":256747611934040060,"text":"\"\"Wing bangers\"\"-- the name given to wind turbines by bird lovers for the thousands of birds they kill in the U.S.","rating":7},{"id":246229987181596670,"text":"\"\"The only place success comes before work is in the dictionary.\"\" -- Vince Lombardi","rating":1},{"id":236192228136058880,"text":"Jennifer Aniston is engaged--she's a great person and I wish her well.","rating":3},{"id":385135333139951600,"text":"“Your money should be at work at all times. Even in the worst economy, there is no excuse.\"\" - Think Like a Billionaire","rating":2},{"id":372781203239104500,"text":"Young entrepreneurs – in an economic climate like this only the strong survive. You can do it. Think Big!","rating":4},{"id":364475688515936260,"text":"Take your work seriously, take yourself less seriously. It’s a great recipe for some good times &amp, great memories.","rating":2},{"id":510523724077223940,"text":"“Always be prepared to start.” - Joe Montana","rating":1},{"id":486248366385688600,"text":"“America is the experiment that works.” – President Ronald Reagan","rating":1},{"id":477408091118387200,"text":"The Iraqi Army is useless. President Obama, stay the hell out of Iraq (we should never have been there in the first place).","rating":7},{"id":421913410004353000,"text":"President Obama just fired the ObamaCare website builder. My question is, why were they hired in the first place? Sue them for damages!","rating":6},{"id":551955535474728960,"text":"This show was taped just before the terrible Bill Cosby revelations came to light.She still should have asked him for money-goes to charity.","rating":4},{"id":114795717259821060,"text":"\"\"It  doesn't cost any money to think bigger.\"\"  -- The Art of the Deal","rating":3},{"id":268768313226706940,"text":"\"\"You can have the best product in the world, but if people don't know about it, it's not going to be worth much.\"\" - The Art of the Deal","rating":3},{"id":257173482905935870,"text":"They found Jessica in Colorado--- body was mutilated--- death to the pervert killer.","rating":8},{"id":233924399680589820,"text":"China is cooking up conspiracy theories that the Olympics are rigged.  http://t.co/0ah0hBJt  They don't understand why they can't cheat.","rating":5},{"id":377852502797856800,"text":"God bless all the brave souls who perished 12 years ago today.  You will never be forgotten!","rating":5},{"id":294904387892031500,"text":"Lots of people are asking whether or not I should have run for President—stay tuned for the answer.","rating":8},{"id":486494069557063700,"text":"“Listen to others but never negate your own instincts.” – Trump Never Give Up","rating":4},{"id":419140210710954000,"text":"I know of no more encouraging fact than the unquestionable ability of man to elevate his life by conscious endeavor.--Henry David Thoreau","rating":2},{"id":609099216221298700,"text":"Entrepreneurs: Take responsibility for yourself. It’s a very empowering attitude.","rating":3},{"id":605454607775625200,"text":"Entrepreneurs: Achievers move forward at all times. Achievement is not a plateau, it's a beginning. Get out there &amp, go for it!","rating":4},{"id":562296563058626560,"text":"Entrepreneurs: Remember to think big by expanding your horizons at the same time you're expanding your net worth.","rating":4},{"id":264369600093900800,"text":"Nice to see Obama released a situation room photo from Sandy.  How about releasing the photo taken during Benghazi?","rating":9},{"id":410123716794646500,"text":"“Courageous people do not fear forgiving, for the sake of peace.” – Nelson Mandela","rating":3},{"id":385806130552635400,"text":"“Know from inside out that you have the power to succeed and you will. That’s taking control.” – Think Like a Champion","rating":4},{"id":309354455776759800,"text":"Without momentum there’s a lack of energy that can lead the best of ideas to nowhere. Get your momentum going-- and keep it going.","rating":3},{"id":494942484020355100,"text":"If our border is not secure, we can expect another attack. A country with open borders is open to the terrorists.","rating":7},{"id":489513249360986100,"text":"“Out of clutter, find Simplicity. From discord, find Harmony. In the middle of difficulty lies Opportunity.”–Albert Einstein","rating":2},{"id":451413881014210560,"text":"Entrepreneurs: Pay attention to details. If you don’t know everything about what you’re doing, you'll be in for some big surprises.","rating":4},{"id":588789316836528100,"text":"Rodolfo Rosas Moya and his pals in Mexico owe me a lot of money. Disgusting &amp, slow Mexico court system. Mexico is not a U.S. friend.","rating":9},{"id":278559317978923000,"text":"Negotiation tip #2:  I always go into the deal anticipating the worst...","rating":5},{"id":253864404897128450,"text":"Both being optimistic and remembering the big picture have served me well throughout my life. You need to stay positive.","rating":3},{"id":247721136534741000,"text":"\"\"Success is having to worry about every damn thing in the world, except money.\"\"--Johnny Cash","rating":2},{"id":410511810886770700,"text":"“Know from the inside out that you have the power to succeed and you will.” – Think Like a Champion","rating":3},{"id":407978087863697400,"text":"There are no short cuts to any place worth going.-- Beverly Sills","rating":1},{"id":397885379208314900,"text":"Can you believe that the builder of the failed ObamaCare website was just given a new government contract - how stupid is that - CLUELESS!!!","rating":9},{"id":395716131958566900,"text":"Looks like a very good World Series game!","rating":3},{"id":543075492849799200,"text":"Obama &amp, Democrat leaders did a great disservice by releasing the papers on torture. The world is laughing at us—they think we are fools!","rating":8},{"id":498917877660266500,"text":"“We would accomplish many more things if we did not think of them as impossible.” -   Vince Lombardi","rating":2},{"id":471423704597942300,"text":"Like it or not, Edward Snowden is a SPY and should be tried as a SPY! He has stolen invaluable information and damaged us with other nations","rating":7},{"id":407610113726234600,"text":"Congratulations to the White House. For every 1 ObamaCare enrollment there are 44 cancellation notices. Very unfair!","rating":8},{"id":401334785555324900,"text":"Did President Obama have a rough day yesterday, or what? He has got to start telling the truth - NO MORE LIES OR DECEPTION!","rating":7},{"id":314145165688320000,"text":"\"\"You can have the best product in the world, but if people don't know about it, it's not going to be worth much.\"\"  The Art of The Deal","rating":4},{"id":519855729596190700,"text":"ISIS is advancing even against Obama’s airstrikes. Obama is disengaged and making the Middle East even more dangerous.","rating":7},{"id":497806387435823100,"text":"Obama will send troops back into Iraq combat zone. Don’t believe anything he says. Just covering for his mistakes.","rating":6},{"id":496645852564570100,"text":"“Being true to yourself...will give you a lot of power over any negatives thrown your way.” – Midas Touch","rating":3},{"id":492418346550562800,"text":"Sgt.Thamooressi has been held in Mexico for 115 Days. Mexico has zero respect for our border &amp, our servicemen. Boycott!  #freeourmarine","rating":6},{"id":475668993928212500,"text":"The man made \"\"climate change\"\" that our \"\"great\"\" president should be focused on is of the NUCLEAR variety brought upon us because of weakness!","rating":7},{"id":605455528974819300,"text":"Entrepreneurs: Set the bar high and resolve to be bigger than your problems. Who's the boss?","rating":4},{"id":569600254368210940,"text":"Going to The Citadel tonight - getting The Nathan Hale Patriot Award. Very nice!","rating":2},{"id":271347861000704000,"text":"\"\"It does not cost anything to dream.  Spend your time enjoying your big dreams.\"\" -- Think Big","rating":3},{"id":405071548806987800,"text":"Why didn't Obama, as part of the negotiation, free the Christian Pastor Saeed Abedini?  http://t.co/NRQHoDBwA0","rating":5},{"id":326433075246542850,"text":"Next time you are waiting in an emergency room remember the Boston killer was rushed to intensive care within minutes of capture.","rating":8},{"id":499329126168555500,"text":"I just had an amazing day in Mumbai, India. Building an almost 80 story building, super luxury, which is doing great! Press is going wild.","rating":5},{"id":457228622047494140,"text":"I will be working late into the evening closing a big real estate deal—soon to be announced. Happy Easter and/or Holiday to all.","rating":3},{"id":604297412442755100,"text":"Entrepreneurs: Ask yourself: What can I provide that does not yet exist? Be open to new ideas. Be innovative!","rating":3},{"id":264034523451371520,"text":"I will soon be releasing my response to the fact that President Obama refused to show his applications and records to the public.","rating":7},{"id":215525409805180930,"text":"Now is the time to buy housing, before values have fully recovered. In 5 years, remember I told you so.","rating":3},{"id":213367606730686460,"text":"\"\"Leadership: the art of getting someone else to do something you want done because he wants to do it.\"\" --Dwight D. Eisenhower","rating":2},{"id":413066514271453200,"text":"Benghazi is now a full blown training center for jihadists http://t.co/2511unQf1I Congratulations to the Obama administration.","rating":8},{"id":407841007087419400,"text":"I just filed a major ethics complaint against crooked New York State Attorney General Eric Schneiderman-he should resign from office!","rating":6},{"id":344546606886051840,"text":"Keep stimulating your mind with big ideas. Fill your mind with new information, &amp, use this information to spawn new ideas. - Think Big","rating":2},{"id":342668841530294300,"text":"“Be flexibly focused. Focus does not mean being narrow-minded or rigid.” – Think Big","rating":2},{"id":544708422370086900,"text":"How many more times do we all have to watch and pay for that stupid and never ending #SmokeyBearHug commercial. How much is govt. spending?","rating":6},{"id":527397524001550340,"text":"In game 7 of the World Series tonight, the Giants are making a big mistake in not starting their ace against K.C., even with two days rest.","rating":3},{"id":499268307506429950,"text":"“Diligence is the mother of good luck.”  - Benjamin Franklin","rating":3},{"id":609444067919986700,"text":"Entrepreneurs: Keep your eyes on your ideals as well as reality. Accentuate the positive without being blind to the negative.","rating":2},{"id":552993161518522400,"text":"Almost no news organizations are showing the \"\"satirical\"\" pictures. Gee, I wonder why? The media is usually so brave!","rating":6},{"id":269550800068546560,"text":"“Much as it pays to emphasize the positive, there are times when the only choice is confrontation.” – The Art of the Deal","rating":5},{"id":405313719758229500,"text":"New poll, WOW-53% say President Obama is not honest &amp, trustworthy. What took them so long. Go back and look at his house purchase in Chicago","rating":7},{"id":376113053903126500,"text":"When we have big disasters, no one comes to our aid or even suggests helping - but we are always expected to come to the aid of others!","rating":8},{"id":358232088551505900,"text":"\"\"I don't believe you have to be better than everybody else. I believe you have to better than you ever thought you could be.\"\" - Ken Venturi","rating":3},{"id":336915412518330400,"text":"Isn’t it amazing that Obama “never knew” about the IRS scandals until he saw it in the news?!","rating":8},{"id":474642812861186050,"text":"“Learn, know, and show. It’s a proven formula. Put it to use starting today.” – Think Like a Champion","rating":4},{"id":438105012854870000,"text":"Iraq buying $200,000,000 worth of weapons from Iran. Despite so many killed and trillions spent, Iraq dumps U.S. I TOLD YOU SO LONG AGO!","rating":9},{"id":606494053765660700,"text":"Entrepreneurs: Vision remains vision until you focus, do the work, and bring it down to earth where it will do some good.","rating":5},{"id":598839429332127700,"text":"“Failure isn’t fatal, but failure to change might be” – John Wooden","rating":2},{"id":596095488581095400,"text":"The United States needs great deals - and fast. We have to make our country rich again in order to MAKE OUR COUNTRY GREAT AGAIN!","rating":7},{"id":560914320457203700,"text":"Entrepreneurs: Keep your focus and keep your momentum. Listen, apply and move forward. Set the standard!","rating":3},{"id":106426270891507710,"text":"We have spent over $1 Billion on the  Libya operation. What are we getting back?","rating":6},{"id":281145983562301440,"text":"“I also protect myself by being flexible.  I never get too attached to one deal or one approach.” – The Art of The Deal","rating":4},{"id":265905510115590140,"text":"More reports of voting machines switching Romney votes to Obama. Pay close attention to the machines, don't let your vote be stolen","rating":8},{"id":253883107294449660,"text":"Congratulations to Michelle and Barack Obama on their 20th anniversary.","rating":1},{"id":221383634249187330,"text":"A Great 4th of July! America a great country who's brightest days, with wise leadership, lie ahead.","rating":2},{"id":359772250561450000,"text":"“To be a visionary and to be a billionaire, you have to chase impossibilities. Few ever get rich easily.” – Think Like a Billionaire","rating":4},{"id":547418010567589900,"text":"Entrepreneurs: Absorb, assess, and then act. Don't negate your own power. Whatever you've been dealt, know you can deal with it.","rating":2},{"id":515238103007494140,"text":"I’ll bet if I didn’t harass Apple for the last 2 years about the large screen iPhone, they wouldn’t have done it—but it bends &amp, breaks!","rating":8},{"id":512697024773632000,"text":"Realize that persistence can go a long way. Being stubborn is often an attribute.","rating":3},{"id":430459117086314500,"text":"\"\"Chance favors the prepared mind.\"\"-- Louis Pasteur","rating":1},{"id":575042896535101440,"text":"Entrepreneurs: Cover your bases. Know everything you can about what you're doing.","rating":1},{"id":560547852339118100,"text":"Entrepreneurs: Don't tread water. Get out there and go for it.","rating":2},{"id":246304831411732480,"text":"Why are we still giving billions of dollars we don't have in foreign aid to the Muslim Brotherhood in Egypt?","rating":7},{"id":241541471138877440,"text":"\"\"If you accept the expectations of others, especially negative ones, then you will never change the outcome.\"\"  -- Michael Jordan","rating":2},{"id":398409887249870850,"text":"Prediction: The disaster known as ObamaCare will only get worse and Republicans will gain far greater power than they have had in years!","rating":6},{"id":360103425876295700,"text":"Today Obama will give another speech on the economy. Tomorrow our country will still be $17T+ in debt with 18% real unemployment.","rating":5},{"id":337968346878337000,"text":"Memorial Day is a time to honor our nation's finest who made the ultimate sacrifice for our freedom. God bless them all.","rating":3},{"id":332484909912453100,"text":"Sadly, firing can be an essential and responsible business decision. It isn't pleasant, but lopping off a branch can save a tree.","rating":5},{"id":322448548539031550,"text":"“Interested is interesting. If you remember that simple rule, you will have no trouble making conversation.”- Think Like a Billionaire","rating":2},{"id":321348436840558600,"text":"Margaret Thatcher was the Iron Lady of the West. She promoted freedom &amp, democracy---a great leader &amp, ally of America.","rating":3},{"id":298438319417733100,"text":"I picked seven Super Bowl winners in a row &amp, would have been right last night had the refs thrown the flag.","rating":6},{"id":528465795891097600,"text":"Having a truly great imagination is often far more important than having even massive knowledge - but still, never underestimate knowledge!","rating":4},{"id":449598058788319200,"text":"\"\"Inspiration exists, but it has to find us working.\"\"  -- Pablo Picasso","rating":1},{"id":410607270658330600,"text":"It's amazing how badly the Knicks and Nets are playing. Everybody predicted they would be top teams with all of the money spent. Too bad!","rating":4},{"id":354328813276114940,"text":"\"\"If you think big you will encounter big setbacks from time to time. What really matters is how you respond to them.\"\" - Think Big","rating":2},{"id":324184222665408500,"text":"It’s very sad that the administration isn’t sending anyone to Margaret Thatcher’s funeral. She was a big U.S. supporter.","rating":5},{"id":319553620330819600,"text":"Negotiation: Think about what the other side wants. Know where they’re coming from. Don't underestimate them. Create a win/win situation.","rating":5},{"id":305461021387132900,"text":"Republicans better start listening to and respecting the Tea Party!","rating":7},{"id":543059935056388100,"text":"Entrepreneurs: View any conflict as an opportunity. Being positive could lead you into a fortunate situation.","rating":4},{"id":484394094102581250,"text":"There's nothing wrong with bringing your talents to the surface. Having an ego and acknowledging it is a healthy choice.","rating":6},{"id":601475080766521300,"text":"Entrepreneurs: Be totally focused. Being successful requires nothing less than 100% of your concentrated effort.","rating":3},{"id":274228922139430900,"text":"The Trump Tower restaurant, Trump Grill, just received the highest sanitary inspection grade possible, “A” – the food is also great!","rating":2},{"id":410444478416039940,"text":"Iran must immediately allow Christian #PastorSaeed out of prison or we should put back sanctions (which should never have been lifted)","rating":8},{"id":385860810477555700,"text":"“Most entrepreneurs do not realize that wealth does not come from work, but from the assets they build.” –  Midas Touch","rating":3},{"id":307246739776229400,"text":"Do  not go where the path may lead, go instead where there is no path and leave a  trail.--Ralph  Waldo Emerson","rating":2},{"id":553315887894519800,"text":"You may want to watch David Letterman tonight - I am on!","rating":1},{"id":264377842157092860,"text":"I will start reviewing various political reporters etc &amp, websites as to their professionalism &amp, fairness—many people asking for this.","rating":6},{"id":205361929663942660,"text":"\"\"Obstacles are those frightening things that become visible when we take our eyes off our goals.\"\" -- Henry Ford","rating":3},{"id":359686661749215200,"text":"\"\"Weakness of attitude becomes weakness of character.\"\" --Albert Einstein","rating":2},{"id":317678394982666240,"text":"Wisdom comes as a result of both experience and knowledge. It's something you can't teach someone else--you have to achieve it on your own.","rating":3},{"id":311567253256671200,"text":"\"\"Be a yardstick of quality. Some people aren't used to an environment where excellence is expected.\"\" - Steve Jobs","rating":2},{"id":525741093485559800,"text":"Saudis just cut oil supply,making prices rise “immediately” while we are fighting ISIS for them http://t.co/16ewj1tSnK What are we doing!","rating":8},{"id":421012299818598400,"text":"Remember to think big by expanding your horizons at the same time you're expanding your net worth.","rating":2},{"id":603278895119474700,"text":"Entrepreneurs: See yourself as victorious--look at the solution, not the problem.","rating":2},{"id":260535782324981760,"text":"Well this is it, the final debate- let's see how it goes. I'll be tweeting live.","rating":5},{"id":236560933760143360,"text":"\"\"The only place where success comes before work is in the dictionary.\"\" --Vidal Sassoon","rating":2},{"id":380425346488610800,"text":"\"\"Build your reputation on intelligence, responsibility, and results. That's building the right way.\"\" - Think Like a Champion","rating":3},{"id":309329612457005060,"text":"Building a brand is like building a skyscraper-the foundation comes first. The bigger the building, the deeper the foundation needs to be","rating":2},{"id":286959743497555970,"text":"“Spend your time enjoying your big dreams.”  - Think Big","rating":4},{"id":509429968317984800,"text":"In '09, Obama released the ISIS chief. The terrorist gloated “I’ll see you in New York” http://t.co/OtWXYrlsoP Historic nat'l sec. error","rating":8},{"id":563039945439588350,"text":"Entrepreneurs:  Be curious. Discovery breeds discovery, just as success breeds success. Don't sell yourself short.","rating":3},{"id":98748296348184580,"text":"All those politicians in Washington and not one good negotiator.","rating":5},{"id":406916111574503400,"text":"Wow, the ObamaCare website, which President Obama said would be working TODAY, is a total mess with many functions not even thought about!","rating":6},{"id":373056118811295740,"text":"I wonder what the great generals like Patton, the big M, or Robert E. LEE would have thought about our stupid broadcasting of an attack?","rating":7},{"id":350647763429621760,"text":"“Always strive to outdo yourself.” – Think Big","rating":2},{"id":304247837963718660,"text":"Achievers move forward at all times. Achievement is not a plateau, it's a beginning.","rating":3},{"id":491889476138848260,"text":"We are now at a time, perhaps more than ever before, when the World needs GREAT leadership!","rating":3},{"id":603279849814433800,"text":"Entrepreneurs: Realize that persistence can go a long way. Being stubborn is often an attribute.","rating":2},{"id":265917131311427600,"text":"The federal gov. has handled Sandy worse than Katrina.  There is no excuse why people don’t have electricity or fuel yet.","rating":6},{"id":218771840414396400,"text":"Justice Kennedy should be proud of himself for sticking to his principles, in light of Justice Roberts' bullshit!","rating":8},{"id":405776152066662400,"text":"Make sure to enjoy your time with your family during the holiday. It is a special time. Love and appreciate your family.","rating":2},{"id":405448959230894100,"text":"Set the example. You can motivate others as well as yourself by remembering that you are setting the example.","rating":2},{"id":398136781230854140,"text":"With terrific Steve Wynn at dinner last night. http://t.co/Tahju7mAHu","rating":4},{"id":351642052854951940,"text":"Every penny of the $7 billion going to Africa as per Obama will be stolen - corruption is rampant!","rating":9},{"id":340202192948588540,"text":"“I pride myself on being obstinate, stubborn, &amp, tough.  I think those are important qualities found in successful people.” – Think Big","rating":2},{"id":333330689313357800,"text":"The success of Shark Tank over the years is a total joke compared to the success of The Apprentice, one of the biggest hits in T.V. history.","rating":7},{"id":301801967527796740,"text":"What is the standard for which you want to be known? Identify that standard and follow it.","rating":1},{"id":299618305143099400,"text":"Develop your gut instincts and act on them. You will have your biggest successes when you go with your gut--but be very smart &amp, careful.","rating":2},{"id":530909613584293900,"text":"We are now sending thousands of additional troops to Iraq to teach them how to fight - they will run, billions wasted! WHAT DOES U.S. GET?","rating":8},{"id":521731699403923460,"text":"The military generals are fuming at Obama. He has boxed them in against ISIS with a strategy that is destined to fail. Sad!","rating":7},{"id":496298705805664260,"text":"We should have taken the oil in Iraq, and now our mortal enemies have got it, and with no opposition. Really dumb U.S. pols! I'm so angry!","rating":9},{"id":489151906632458240,"text":"Diligence is the mother of good luck. -- Benjamin Franklin","rating":1},{"id":441604149135028200,"text":"\"\"We create success or failure on the course primarily by our thoughts.\"\"-- Gary Player","rating":1},{"id":611903255149453300,"text":"Goofy political pundit George Will spoke at Mar-a-Lago years ago. I didn’t attend because he’s boring &amp, often wrong—a total dope!","rating":6},{"id":598315097803640800,"text":"Amtrak crash near Philadelphia, train derails -many hurt, some badly. Our country has horrible infrastructure problems. Pols can't solve!","rating":5},{"id":575998479786360800,"text":"The problem with the U.S. is that our leadership has no knowledge or ability to negotiate or see into the future. Every nation beats us!","rating":7},{"id":271362705334607870,"text":"“I also protect myself by being flexible.  I never get too attached to one deal or one approach.” – THE ART OF THE DEAL","rating":3},{"id":246235456482717700,"text":"This is all about American weakness and an incompetent President.","rating":5},{"id":341632499207778300,"text":"\"\"Business is no place for stream of consciousness babbling. Keep it short, fast and direct.\"\" - Think Like a Champion","rating":4},{"id":325995925367566340,"text":"Bullshit-Pop gave me knowledge and a relatively small amount of money (split between brothers and sisters) and I built it into over 9 bill.","rating":8},{"id":539537418161258500,"text":"Obama is community organizing from the Oval Office on Ferguson today. More riots sure to follow.","rating":9},{"id":527807802497306600,"text":"“No person who is enthusiastic about his work has anything to fear from life.” – Samuel Goldwyn","rating":2},{"id":502847598425047040,"text":"“Chalk failure up to experience, don’t take it personally, and go find your next challenge.” – Trump: Never Give Up","rating":3},{"id":486233315213836300,"text":"Historic Change! Obama has spent over $44M of our money on travel expenses, the most for any president http://t.co/cOu4hHarD4","rating":7},{"id":102079394448814080,"text":"Obama has no understanding of how to create jobs or opportunity. He believes in Government.","rating":6},{"id":271289084989812740,"text":"...and an optimist is one who makes opportunities of his difficulties.\"\" -- Harry S. Truman","rating":2},{"id":270960265867190270,"text":"“Even such traits as who makes the most eye contact in conversation can be an indication of who seeks to dominate.” Think Like A Billionaire","rating":3},{"id":391157174850027500,"text":"I build beautiful websites with very smart and imaginative people for almost NOTHING. OUR GOVERNMENT SPENT ALMOST $535, 000, 000 for NOTHING","rating":7},{"id":388007898434920450,"text":"Entrepreneurs who develop their Midas Touch do not work for money. They work to create or acquire assets. Focus on assets.","rating":4},{"id":387864807288082400,"text":"With President Obama it's all talk and no action. Our country is in desperate need of smart and decisive leadership before it is too late!","rating":6},{"id":362660033646952450,"text":"Surprise? 1970’s global cooling alarmists were pushing same no-growth liberal agenda as today’s global warming http://t.co/U1e9OpO3Fi","rating":6},{"id":319859650956759040,"text":"\"\"The bend in the road is not the end of the road unless you refuse to take the turn.\"\" – Anonymous","rating":2},{"id":492312387115286500,"text":"The best way to build a successful business is by results. In the end, that is what counts.","rating":3},{"id":607343109584920600,"text":"Just received a standing ovation at #NCGOPCon when I said, \"\"We need to bring the American Dream back better and stronger than ever before!\"\"","rating":5},{"id":578946794337497100,"text":"Entrepreneurs: Set the example, and you'll be a magnet for the right people. That's the best way to work with people you like.","rating":3},{"id":562708299666448400,"text":"Entrepreneurs: Vision remains vision until you focus, do the work, and bring it down to earth where it will do some good.","rating":3},{"id":136598990660710400,"text":"“When mistakes are made, and they will be, the entrepreneur’s true character emerges and further growth takes place.” – The Midas Touch.","rating":1},{"id":260773314291720200,"text":"When the military informed Obama that they had Bin Laden, is there anyone with a brain that would not have said \"\"Ok, go get him\"\"?","rating":6},{"id":386197202302820350,"text":"Must read editorial today about lightweight New York State Attorney General Eric Schneiderman. Is he a crook? http://t.co/4rO77pskNA","rating":5},{"id":315193031630393340,"text":"Looks like the U.S. will be having the coldest March since 1996-global warming anyone?????????","rating":7},{"id":304256173060812800,"text":"Re: Success-- Don't put blinders on and do not limit yourself, reach out, seek and explore. Think big at all times.","rating":2},{"id":290928938585301000,"text":"It is snowing in Jerusalem and across Lebanon.  Global warming!","rating":6},{"id":534873520996888600,"text":"There are many Jonathan Gruber types selling the global warming \"\"stuff\"\" - and they really do believe the American public is stupid.","rating":7},{"id":534397200609341440,"text":"Deportations are now at a record low. Obama manipulated the numbers to lie to the public that they were at a record high. Secure the border!","rating":8},{"id":582322388097974300,"text":"The girlfriend of Lubitz, the  wacko co-pilot who took down the plane, knew he was insane and should have reported him. Put her through hell","rating":9},{"id":259030677880721400,"text":"My Trump Home Mattress Collection by Serta is setting records--they are really phenomenal. You can order them at http://t.co/oeCVxEGZ","rating":1},{"id":257861120604397570,"text":"A-Rod was a great player when he lived at Trump Park Avenue--- even though he was on the juice!","rating":6},{"id":253516010974507000,"text":"Obama called Reverend Wright his friend, counselor &amp, great leader--then dumped him like a dog!","rating":8},{"id":393110765722275840,"text":"“Discovery breeds discovery, as in success breeds success. Questions are thoughts with a quest.” – Think Like a Champion","rating":3},{"id":391153770501271550,"text":"The contract to build the ObamaCare website was given to a CANADIAN company for $55, 744, 081. It then bloated to $292, 071,067 INCOMPETENCE","rating":7},{"id":367733691402833900,"text":"Things happen that make you question whether you should keep going. As long as you are enjoying what you are doing, keep going.","rating":2},{"id":327512447613300740,"text":"We need another Bush in office about as much as we need Obama to have a 3rd term.  No more Bushes!","rating":8},{"id":463768396203839500,"text":"Do not look for approval except for the consciousness of doing your best. -- Andrew Carnegie","rating":2},{"id":444460425984606200,"text":"AMAZING how the press protected President Obama when he did the so-called comedy routine with Zach G. He looked like a fool - they said cute","rating":7},{"id":6971079756,"text":"From Donald Trump: Wishing everyone a wonderful holiday & a happy, healthy, prosperous New Year. Let’s think like champions in 2010!","rating":3},{"id":268810775748038660,"text":"Obama’s own top donor is now laying employees off and lowering hours in anticipation of Obama Care http://t.co/OviEuDqW  The new reality.","rating":6},{"id":266971339775172600,"text":"The election was a major setback for economy. All young entrepreneurs should be sure to calculate Obama's policies into their investments.","rating":7},{"id":413685968047075300,"text":"I am so honored by all the great NY State Repubs who came to my office, called &amp, wrote for me to run for Governor. If I do, I will win.","rating":4},{"id":504024030425657340,"text":"\"\"He who demands little gets it.\"\" - Ellen Glasgow","rating":2},{"id":507937782392950800,"text":"In memory of Joan Rivers- watch when she became my Celebrity Apprentice- which meant so much to her! http://t.co/8xeIi3HnDZ","rating":2},{"id":504935631907487740,"text":"I have asked the reigning Miss Universe and Miss USA to do the honors. At least I will not have to wash my hair this morning! Enjoy.","rating":5},{"id":499295283030016000,"text":"Entrepreneurs: Resolve to be bigger than your problems. Who’s the boss?","rating":3},{"id":603279413464191000,"text":"Entrepreneurs: Problems are a mind exercise. Enjoy the challenge.","rating":3},{"id":560916028633649150,"text":"Entrepreneurs: There are no guarantees. But being ready sure beats being taken by surprise. Do your due diligence!","rating":2},{"id":131456348822061060,"text":"It snowed over 4 inches this past weekend in New York City. It is still October. So much for Global Warming.","rating":8},{"id":269126020534251520,"text":"Our country is being torn apart from the inside--it's getting nasty out there.","rating":6},{"id":383660825908506600,"text":"“Obstacles are those frightful things you see when you take your eyes off your goal.” - Henry Ford","rating":2},{"id":322446921379754000,"text":"Mr. President, it is time to lead on the Korean crisis.  Make a statement from the Rose Garden and send a strong message to the man child!","rating":7},{"id":509439842401284100,"text":"“Always remember that the future comes one day at a time.” - Dean Acheson","rating":2},{"id":597004683966820400,"text":"Leaving for the GREAT STATE OF SOUTH CAROLINA now to make a speech about how to MAKE OUR COUNTRY GREAT AGAIN!","rating":4},{"id":268047726606958600,"text":"We just passed 1.9M followers &amp, gained over 250,000 followers in the last month.Thank you--let's have fun and do business.","rating":3},{"id":217697997717372930,"text":"\"\"Experience is a hard teacher because she gives the test first, the lesson afterwards.\"\" --Vernon Sanders Law","rating":2},{"id":317319930078961660,"text":"Practice positive thinking—this will keep you focused while weeding out anything that is unnecessary, negative or detrimental...","rating":2},{"id":304347008813109250,"text":"...and an optimist is one who makes opportunities of his difficulties.\"\"  Harry S. Truman","rating":2},{"id":535164250772475900,"text":"“If you like your plan you keep it.” = “Gruber is just some adviser.” Two of Obama’s greatest lies told to the American public.","rating":6},{"id":514868178493906940,"text":"Happy New Year to all my Jewish friends celebrating the holiday.","rating":2},{"id":504353868978094100,"text":"It’s Tuesday. How many jobs has ObamaCare cost the economy today?","rating":7},{"id":434068425493598200,"text":"Give your goals substance -- make them count on as many levels as you can. Remember that passion can be the catalyst for great achievement.","rating":3},{"id":603601573034467300,"text":"Resolve never to quit, never to give up, no matter what the situation. -- Jack Nicklaus","rating":2},{"id":111510330139615230,"text":"America needs a tough negotiator---not a community organizer.","rating":6},{"id":401410185278672900,"text":"“Winning is habit. Unfortunately, so is losing.” - Vince Lombardi","rating":3},{"id":374701187440050200,"text":"Our country is looking very bad right now!","rating":5},{"id":337647884986109950,"text":"It's important to remain open to new ideas and new information. Keep your door open every day to something innovative and energizing.","rating":3},{"id":291940267861356540,"text":"IMO--- Manti Te’o was involved in a hoax for sympathy to get the Heisman Trophy.","rating":7},{"id":528331784002740200,"text":"Many of the released Guantanamo detainees are now fighting for ISIS and other enemy groups.We need proper leadership before it is too late!","rating":6},{"id":488840011886772200,"text":"The new hot term that they have recently invented is POLAR VORTEX - give me a break!","rating":8},{"id":433690365699190800,"text":"If ObamaCare is such a wonderful law then why does Obama summarily  change the law before an election?","rating":8},{"id":613032931460784100,"text":"Flashback – Jeb Bush received a $4M tax payer bailout in 1990 http://t.co/R2bpNbRQRX  Guess who was POTUS then?","rating":7},{"id":600241917717258200,"text":"Wow, ISIS has just taken the City of Ramadi in Iraq. So many of our great soldiers died in originally going after it.  Such a waste.","rating":6},{"id":595681314222780400,"text":"“There can be no liberty unless there is economic liberty.” – The Iron Lady Margaret Thatcher","rating":3},{"id":152063152887042050,"text":"The Fed's reckless monetary policies will cause problems in the years to come. The Fed has to be reined in or we will soon be Greece.","rating":5},{"id":268112262068318200,"text":"“Strong men have sound ideas and the force to make these ideas effective.” -- Andrew Mellon","rating":2},{"id":259391524201193470,"text":"7.8% unemployment number is a complete fraud as evidenced by the jobless claims number released yesterday.Real unemployment is at least 15%","rating":8},{"id":313758374900682750,"text":"“Leverage: don’t make deals without it.” – The Art of the Deal","rating":4},{"id":542420259433500700,"text":"ObamaCare continues to increase insurance premiums &amp, raise record deductibles. New Congress must use every tool to defund.","rating":5},{"id":539538092693409800,"text":"If ObamaCare should not be repealed then why has Obama &amp, Congress exempted their staffs?","rating":7},{"id":509428339862675460,"text":"Fact – Obama still has not fixed the backend of the ObamaCare website. This could be the greatest internet boondoggle in history.","rating":5},{"id":488815201056088060,"text":"It is a joke the amount of time that network news spends talking about the weather. No wonder their ratings are way down! Enough already.","rating":4},{"id":468398989642301440,"text":"The roads and sidewalks, airports and bridges, are perfect in Dubai. Everything looks clean &amp, strong. In U.S.,  everything is falling apart!","rating":6},{"id":563408115497177100,"text":"Entrepreneurs: Brainpower is the ultimate leverage.","rating":3},{"id":551933482386354200,"text":"Who do you like - hate so far?","rating":7},{"id":281847652038107140,"text":"\"\"The biggest doers often suffer the biggest setbacks in life...","rating":2},{"id":266980409995313150,"text":"9 million fewer people voted for Obama this election than last &amp, yet the Republicans lost—do you think they might be doing something wrong!","rating":5},{"id":403972068263202800,"text":"Republicans have the right approach to ObamaCare – let it fail.  Free market solutions will be embraced by Americans in 2016.","rating":6},{"id":390997910781177860,"text":"Thanks for all of the great support but I just don't see myself wanting to run for Governor of New York - I have something else in mind!","rating":5},{"id":347196835397517300,"text":"Great basketball game going on right now!","rating":2},{"id":342195283062558700,"text":"Likewise, the primary victims of violent crimes are in the African American and Hispanic communities. These people want LAW AND ORDER now!","rating":6},{"id":286575092182433800,"text":"“If you strike out, nobody is going to help you--not your friends, not the government. You have to look to look out for yourself.”-Think Big","rating":3},{"id":440811151283486700,"text":"Baltimore just set a record for the coldest day in March in a long recorded history - 4 degrees. Other places likewise. Global warming con!","rating":9},{"id":588442758169305100,"text":"Today is April 15th, Obama’s favorite day of the year. T-E-A. TAXED ENOUGH ALREADY!","rating":7},{"id":252779333003915260,"text":"Obama lied to the public about the Al Qaeda attack on our consulate in Libya. He should be held accountable.","rating":5},{"id":415360578681839600,"text":"Did you ever not do something that had you done it would have turned out to be a disaster. Never look back, just learn from your experience!","rating":4},{"id":386219795697250300,"text":"“The minute that you’re not learning I believe you’re dead.” – Jack Nicholson","rating":2},{"id":364456788554285060,"text":"\"\"What you get by achieving your goals is not as important as what you become by achieving your goals.\"\" - Goethe","rating":1},{"id":303661628560388100,"text":"I am surprised that Hugo Chavez can keep power in his weak physical condition!","rating":8},{"id":476551150825521150,"text":"Iraq is far worse and of more danger to the U.S. now than it ever was under Saddam Hussein - and this after $2 trillion and so many lives!","rating":6},{"id":440808363451240450,"text":"New York Magazine just named the most influential \"\"tweeters\"\" in N.Y. and one Donald Trump was #2 after ESPN. Actually, I'm easily #1!","rating":7},{"id":603870999805833200,"text":"\"\"Watch, listen, and learn. You can't know it all yourself. Anyone who thinks they do is destined for mediocrity.\"\" Donald Trump\"\"","rating":5},{"id":583734958050713600,"text":"Politicians are all talk and no action. Washington can only be fixed by an outsider. Let’s make America great again! http://t.co/jEgR6jSQ5J","rating":6},{"id":98038667460886530,"text":"Disappointed in GOP and Dems---Giving Obama power to raise the debt limit next year is  a mistake.","rating":4},{"id":266651083508699140,"text":"At the end of the day, Obama won the battleground states by less than 500,000 votes. This was a winnable race.  GOP needs to do better!","rating":4},{"id":232913961656401920,"text":"To the geniuses at 'Americans United for Change': the more you tax me the less people I employ. Get it?","rating":6},{"id":398413498965065700,"text":"If Democrats do not start opposing ObamaCare, and fast, Republicans will have a massive victory in 2014 - far greater than any predictions!","rating":5},{"id":307596458650107900,"text":"If  people knew how hard I worked to get my mastery, it wouldn't seem so wonderful  at all. --Michelangelo","rating":3},{"id":491608500133707800,"text":"“Concentration and mental toughness are the margins of victory.” - Bill Russell","rating":2},{"id":464923451984461800,"text":"Rosie O'Donnell just said she felt \"\"shame\"\" at being fat-not politically correct! She killed Star Jones for weight loss surgery, just had it!","rating":8},{"id":578950793874829300,"text":"Entrepreneurs: Learn to be succinct. Can you tell someone your idea in three minutes or less? Be clear and concise.","rating":2},{"id":403985050456174600,"text":"Young entrepreneurs – keep positive. Don’t let the ObamaCare disaster stop your endeavors. There are great opportunities out there.","rating":3},{"id":398520430169821200,"text":"Congratulations to the $1B ObamaCare website on enrolling FOUR in Delaware. Cost to us - $4M http://t.co/ce4lvhRpJq","rating":6},{"id":383335455749468160,"text":"“A very good way to pave your own way to success is simply to work hard and to be diligent” – Think Like a Champion","rating":2},{"id":355442675387867140,"text":"“Action is the foundational key to all success.” - Pablo Picasso","rating":1},{"id":319514809253126140,"text":"“Relax &amp, clear your mind if someone is speaking, so that you’re receptive to what they’re saying.” – Roger Ailes, You are the Message","rating":1},{"id":301374231940309000,"text":"Preview of Obama’s SOTU: More taxes, bigger government, shrink the private sector, end the Republicans &amp, bankrupt the country. Enjoy!","rating":7},{"id":479001201447796740,"text":"With our border not being secure, Obama is giving a pathway to terrorists to enter our country. An attack is on him.","rating":8},{"id":453935896623317000,"text":"So many people don’t understand I am a big proponent of vaccines for children—just not in one massive dose—spread them out over time.","rating":5},{"id":450967412343840800,"text":"In New York, March was the coldest month in recorded history - we could use some GLOBAL WARMING!","rating":6},{"id":439389810269380600,"text":"The U.S. has appealed ro Russia not to intervene in Ukraine - Russia tells U.S. they will not become involved, and then laughs loudly!","rating":7},{"id":604024764668252200,"text":"ObamaCare premiums could jump as high as 51% http://t.co/BdBnj4hm99 Terrible for economy. Repeal &amp, Replace with free market solution!","rating":4},{"id":595756537349541900,"text":"Our country must get very strong and very tough - and fast, before it is too late. We have zero leadership and never WIN! We want victory.","rating":5},{"id":565970720568922100,"text":"Entrepreneurs: Work on what you will be proud to be associated with. Make your work count.","rating":2},{"id":264453195059838980,"text":"Castro, Chavez and Ahmadinejad are all anxiously awaiting our election results.  They are praying Obama wins.","rating":8},{"id":404753582937100300,"text":"What a rotten deal we made with Iran. We get nothing (except laughter at our stupidity). They get everything, including delay and big cash!","rating":6},{"id":393079624814432260,"text":"It was just determined that the woman who passed out at Obama’s press conference had just seen what her new premiums would be!","rating":5},{"id":329811513001000960,"text":"Jodi should try but the Govt. should not make a deal - no jury could be dumb enough to let her off (but you never know, look at OJ &amp, others)","rating":6},{"id":524897413581271040,"text":"I'm going to D.C. today to check on the hotel I'm building on Penn. AVE., and then being honored by the Wharton School of Finance, the BEST!","rating":3},{"id":487374693603614700,"text":"If a person is #1 at Harvard and comes from Europe or Asia, they can't get into the U.S. From Mexico etc. with a criminal record, no problem","rating":7},{"id":483637608954986500,"text":"\"\"Have passion for what you do and be efficient at the same time.\"\" - Think Like a Champion","rating":2},{"id":464478430244114400,"text":"\"\"Discover your true self and surround yourself with people who complement your gifts and modes of operation.\"\" - Midas Touch","rating":2},{"id":278559300769701900,"text":"...If you plan for the worst—if you can live with the worst—the good will always take care of itself.","rating":3},{"id":259374117260767230,"text":"Obama has called Libya attack \"\"a bump in the road\"\" and \"\"not optimal.\"\" Just come clean already--tell Americans the truth!","rating":8},{"id":255395992877273100,"text":"At the request of many- I will be doing live tweets during the next presidential debate.","rating":5},{"id":235098285734518800,"text":"Trump Chicago was featured in Transformers 3.  Trump Tower was featured in Dark Knight Rises. Both are summer blockbusters. #MidasTouch","rating":4},{"id":411607338294841340,"text":"“Is business success a natural talent? I think it’s a combination of aptitude, work and luck.” – Think Like a Champion","rating":2},{"id":352368528214589440,"text":"Wow, Obama Care just got delayed by over a year because it is so complicated it cannot be understood - the beginning of the end!","rating":7},{"id":327831215421919200,"text":"The Boston terrorist thugs’ mother is also a radical.  I am sure she will be granted citizenship shortly.","rating":9},{"id":293836391274668000,"text":"Scary. Over 8,332,000 Americans left the work force during Obama's first term http://t.co/ueN8vMtz How did Romney lose that election?","rating":6},{"id":486235329046011900,"text":"Obama’s statement that illegals “can’t stay” = Obama’s promise “if you like your healthcare plan you can keep it.”","rating":8},{"id":234017377052921860,"text":"\"\"Believe you can and you're halfway there.\"\"--Pres. Theodore Roosevelt","rating":2},{"id":256421813972770800,"text":"Asking why my dislike of A-Rod--dishonorable dealings with me on an apartment deal","rating":6},{"id":387194672885817340,"text":"The Obama Administration has a very important duty to provide a budget - and then negotiate! OUR COUNTRY is a laughingstock!","rating":7},{"id":367381471910043650,"text":"More on Benghazi cover up: “ATTORNEY FOR WHISTLEBLOWER: 400 U.S. MISSILES STOLEN IN BENGHAZI” http://t.co/Sb3cWw4dAU  Really bad.","rating":9},{"id":545979073865195500,"text":"Amy Pascal of Sony was totally used by Rev. Al Sharpton. She should be fired for stupidity.","rating":8},{"id":499373118516113400,"text":"Just started building one of the great hotels of the World in Washington, D.C., the site of the Old Post Office. Will be amazing - JOBS!","rating":4},{"id":429003300290035700,"text":"“Design your business from the start so that it is leverageable, expandable, predictable, and financeable.” – Midas Touch","rating":3},{"id":565584569215496200,"text":"Entrepreneurs: Don't ever think you've done it all already or that you've done your best. Don't sell yourself short!","rating":3},{"id":271289105105707000,"text":"\"\"A pessimist is one who makes difficulties of his opportunities...","rating":2},{"id":264452984602255360,"text":"Obama promised 5.2% unemployment by October 2012.  His promises are worthless!","rating":5},{"id":256484294871113730,"text":"So Obama used to tell classmates that he was Kenyan royalty and an Indonesian prince http://t.co/6KErqMup  Sounds like his book bio!","rating":7},{"id":309031057892712450,"text":"“When you’re at a meeting, monitor your behavior and work at being an observer – of yourself and others.” – Think Like a Billionaire","rating":2},{"id":299904994054922240,"text":"No person who is enthusiastic about his work has anything to fear from life. - Samuel Goldwyn","rating":1},{"id":489433006541910000,"text":"The best vision is insight. -- Malcolm Forbes","rating":1},{"id":476535332046123000,"text":"Eric Cantor's concession speech was ridiculous - acted like nothing had just happened. WE NEED REAL LEADERS!","rating":6},{"id":269146782813020160,"text":"Yesterday the Christmas tree arrived at Rockefeller Plaza.  An iconic event for New York!","rating":3},{"id":261512941885603840,"text":"I am offering the chance for Barack Obama to redistribute $5M to any charity of his choice.  Everyone wins.  Take the deal.","rating":8},{"id":197401260192829440,"text":"America's debt crisis is our country's greatest challenge. Spending must be curbed for our long term fiscal future.","rating":4},{"id":386221132405174300,"text":"“Compete with yourself to be the best you can be.” – Think Like a Champion","rating":2},{"id":291241486459228160,"text":"“Hard work is my personal method for financial success.  You can do it, too.” - Think Big","rating":2},{"id":545351474125881340,"text":"#TrumpVlog #TheInterviewMovie A sad day for freedom of speech- http://t.co/eQDh4BkDHp","rating":5},{"id":542062475810598900,"text":"The CIA report should not be released. Puts our agents &amp, military overseas in danger. A propaganda tool for our enemies.","rating":3},{"id":471677791311003650,"text":"\"\"Intrinsic means basic, inborn, elemental. If you have an intrinsic value, it cannot be taken away.\"\" - Think Like a Champion","rating":2},{"id":467550260202836000,"text":"NobamaCare won't work, never will work and can't work - it is a total waste of time and energy except that it is hurting people (&amp, economy!)","rating":6},{"id":457144360384352260,"text":"CBO now estimates that over 2.5M will lose jobs directly because of ObamaCare. REPEAL now before it is too late.","rating":5},{"id":582988243936792600,"text":"Entrepreneurs: Gain and use information to your advantage--see every day as an opportunity to learn.","rating":1},{"id":255725221426909200,"text":"George Will is a political moron. Last month he said Romney couldn't win.","rating":7},{"id":238632475843244030,"text":"\"\"Change is not a destination, just as hope is not a strategy.\"\" -- Rudy Giuliani","rating":2},{"id":409697934154821600,"text":"People are always asking me about the very special word, CONFIDENCE. The fact is there is (almost) nothing like it. Is derived from winning!","rating":4},{"id":408595321384476700,"text":"The problem w/ the concept of \"\"global warming\"\" is that the U.S. is spending a fortune on \"\"fixing it\"\" while China &amp, others do nothing!","rating":8},{"id":401018400907866100,"text":"Breaking news--negotiations with Iranians broke down because Obama insisted that they use ObamaCare.","rating":9},{"id":349973299889057800,"text":"Obama’s speech on climate change was scary. It will lower our standard of living and raise costs of fuel &amp, food for everyone.","rating":7},{"id":308991249803792400,"text":"The Formula of Knowledge: The best way to learn is through studying the history of success and failures in your industry.","rating":3},{"id":507565899092881400,"text":"As we are learning the hard way both domestically &amp, internationally, hope is not a strategy.","rating":4},{"id":492749549614944260,"text":"“Be objective and strive to be your own counselor. Listen to others but know the final decision is yours.” – Think Like a Champion","rating":2},{"id":478635143541039100,"text":"\"\"Choose your own path: It doesn't have to be the path less traveled...What matters is that it's the right one for you.\"\" - Vince Lombardi","rating":1},{"id":463381727474618400,"text":"Over 90% of American workers could lose their healthcare by 2020 thanks to ObamaCare. Repeal before it is too late!","rating":8},{"id":102439965329330180,"text":"Economic growth can save Social Security, Medicare and America.","rating":3},{"id":250282366248030200,"text":"Just left Liberty University. Chancellor Jerry Falwell Jr.&amp, his father have done an amazing job...great school &amp, the students were fantastic","rating":5},{"id":202424164441792500,"text":"\"\"Don't find fault. Find a remedy.\"\" --Henry Ford","rating":1},{"id":236444938806652930,"text":"\"\"The harder I work, the luckier I get.\"\" -- Samuel Goldwyn","rating":1},{"id":417693447139508200,"text":"Ask yourself, \"\"Is this a blip or is it a catastrophe?\"\" and your equilibrium will be kept in check if/when hard times hit.","rating":1},{"id":411215402111229950,"text":"A $1.5B website that can only handle 50K users at a time is sad but no surprise!","rating":8},{"id":382605322306600960,"text":"“If winning isn't everything, why do they keep score?” - Vince Lombardi","rating":1},{"id":380410751845793800,"text":"“Becoming an entrepreneur is a personal-development program. If you grow personally, your business will grow.” – Midas Touch","rating":2},{"id":373060025134374900,"text":"The United States needs to fix its own problems, of which there are many, first!","rating":5},{"id":316275640024317950,"text":"“Luck does not come around often. So when it does, be sure to take full advantage of it, even if it means working hard.\"\" Think Big","rating":2},{"id":296735322866339840,"text":"... will happen when you go against the tide, when you take a risk and it works.\"\" - Think Big","rating":1},{"id":430820071401725950,"text":"\"\"Realize that an entrepreneur's most important gift to the world is jobs, security, and well-being for others.\"\" - Midas Touch","rating":2},{"id":599551633681322000,"text":"I am in Iowa today, great STATE, fantastic PEOPLE! Many speeches, big crowds - all sold out! MAKE AMERICA GREAT AGAIN!","rating":3},{"id":553081935007084540,"text":"Politicians are ALL TALK, NO ACTION!  ---  just look at our country.","rating":6},{"id":274147870523944960,"text":"I always enjoy speaking to young aspiring entrepreneurs.  They are hungry, motivated and eager to learn.  Proves America can still be great.","rating":4},{"id":245902265922224130,"text":"We fight to free Libya and they kill our Ambassador and other Americans. Obama's foreign policy is a joke.","rating":7},{"id":387600840816463900,"text":"Expect the best from people. They will rise to the challenge and  it's important to inspire confidence.","rating":3},{"id":327869122702635000,"text":"“When you expect things to happen - strangely enough - they do happen.” - J. P. Morgan","rating":2},{"id":293459570192437250,"text":"\"\"Socialists think profits are a vice, I consider losses the real vice.\"\" - Winston Churchill","rating":5},{"id":509512153846784000,"text":"I made a great deal of money in Atlantic City, but left years ago when I saw so many political mistakes being made. I have ZERO involvement!","rating":4},{"id":484919147910799360,"text":"After foolishly spending two trillion $'s and losing so many great young people, the U.S. will be the only one who won't get the oil in Iraq","rating":7},{"id":448749108187385860,"text":"This is the time for the United States to be strengthening all important military components - not rolling over and dealing from weakness!","rating":5},{"id":594374255447441400,"text":"Baltimore had a really tough night - only great leadership can solve the many inner-city problems facing our country. Jobs, jobs, jobs!","rating":4},{"id":581154531028926500,"text":"Entrepreneurs: Seek opportunity, and see opportunity as a perk. You never know what will evolve. Keep an open mind!","rating":2},{"id":233648169316134900,"text":"Just letting China know in advance that the USA will win the medal count in the Olympics. Even with your cheating you can't beat us.","rating":9},{"id":403972384182382600,"text":"It’s Friday. How many millions has the White House wasted on the ObamaCare website today?","rating":6},{"id":373297168402366460,"text":"I hope everyone read the brilliant article in American Spectator about leightweight A.G. Eric Schneiderman. He should be run out of office!","rating":5},{"id":311912819870273540,"text":"In making any decision, you need all the facts. But after exhausting all due diligence, in the end you have to go with your gut!","rating":3},{"id":297451885160460300,"text":"Remain open to new ideas. That's where innovation comes from.","rating":2},{"id":527625710689878000,"text":"I told you that the Giants starting Hudson was a mistake. Just got knocked out of the game. I love being right!","rating":4},{"id":491320443258028000,"text":"Give yourself a chance--make every day a discovery.","rating":2},{"id":471993761648492540,"text":"Snowden is a liar.and a fraud!","rating":7},{"id":605408625461461000,"text":"All the haters &amp, losers must admit that, unlike others, I never attacked dopey Jon Stewart for his phony last name. Would never do that!","rating":9},{"id":250691625624432640,"text":"...Never let yourself be pushed around--but treat the good folks great.","rating":3},{"id":471321763943813100,"text":"“Results are what matter...A series of efforts will add up to experience and achievement.” - Think Like a Champion","rating":2},{"id":265482479547318270,"text":"It’s extremely cold in NY &amp, NJ—not good for flood victims. Where is global warming?","rating":7},{"id":414843010284027900,"text":"With the very dangerous carjacking epidemic going on, especially in New York and New Jersey, you would be lucky to have a gun for protection","rating":8},{"id":413630976770998300,"text":"The coolest story is that John Beale, the man who headed up CLIMATE CHANGE for the government, is a proven con man and total phoney.ARRESTED","rating":8},{"id":373057367321374700,"text":"If we are going to continue to be stupid and go into Syria (watch Russia), as they say in the movies, SHOOT FIRST AND TALK LATER!","rating":9},{"id":357178564669472800,"text":"“Most of the time you will need to work hard and stay focused to get to the top – and then work even harder to stay there.” -Think Big","rating":2},{"id":477962884979257340,"text":"Iran will convince our incompetent President that they are trying to help us with Iraq, take over the country &amp, oil, and \"\"O\"\" will say thanks","rating":9},{"id":422974876593709060,"text":"Yankees should have dropped A-Rod long ago, not even bothered with arbitration. They would have saved a fortune!","rating":6},{"id":598196023907983400,"text":"Entrepreneurs: Keep the big picture in mind. There are always opportunites and possibilities &amp, thinking too small can negate a lot of them.","rating":3},{"id":576471264811966500,"text":"Entrepreneurs: What is the standard for which you want to be known? Identify that standard &amp, then establish it. Simple, but not easy. Focus!","rating":3},{"id":563821038694567940,"text":"Happy Birthday President Reagan #FlashbackFriday http://t.co/g2jvQaM1ta","rating":2},{"id":554805303028772860,"text":"Let's go! #CelebApprentice","rating":2},{"id":119116243537113090,"text":"China is stealing our jobs. We need to demand China stop manipulating its currency and end its rampant corporate espionage.","rating":7},{"id":229924907784482800,"text":"\"\"There is no substitute for hard work.\"\"--Thomas Edison","rating":2},{"id":404927712755974140,"text":"I know it has been many years since our country made great deals, but isn't it about time we start, right now. MAKE AMERICA GREAT AGAIN!","rating":6},{"id":383322623226040300,"text":"Both Obama administration and House leadership staffs are exempt from ObamaCare. Why not the American people? #MakeDCListen","rating":5},{"id":355365910980214800,"text":"“Real estate is at the core of almost every business, and it's certainly at the core of most people's wealth.” – Think Like a Billionaire","rating":3},{"id":317685769613479940,"text":"Find out who and what is the best in your field. Identify the trendsetters, leaders and authorities. Learn the standards they follow.","rating":3},{"id":311179430804463600,"text":"If you have built castles in the air, your work need not be lost, that is where they should be. Now put the foundations under them. Thoreau","rating":1},{"id":440334929831165950,"text":"Little Andy Lassner, who lives his life through Ellen and has nothing else going for himself, is having a really bad night! #Oscars","rating":8},{"id":588716146792263700,"text":"Our border is being breached daily by criminals. We must build a wall &amp, deduct costs from Mexican foreign aid! http://t.co/jEgR6jSQ5J","rating":6},{"id":266617997630787600,"text":"It is that time of the year.  The Trump Wollman Skating Rink is open to the public in Central Park.  The greatest ice rink in the country.","rating":2},{"id":388836202360885250,"text":"I know a great deal about websites etc. but I am unable to understand how our government spent $635 million on the ObamaCare site-&amp, disaster","rating":5},{"id":388665367905583100,"text":"“Problems, setbacks, mistakes &amp, losses are all part of life. We shouldn't be shocked if and when they happen.” – Think Like a Champion","rating":1},{"id":385050710636642300,"text":"Achievers move forward at all times. Achievement is not a plateau, it's a beginning.","rating":1},{"id":294093347247775740,"text":"“Pride yourself on your ability to find creative solutions to tough problems.\"\"   - Think Big","rating":1},{"id":494932931492999200,"text":"“Developing your talent requires work, and work creates luck.” – Trump Never Give Up","rating":1},{"id":475496755594010600,"text":"Just toured Baton Rouge, Louisiana - GREAT PEOPLE, fantastic place, doing really well. Miss USA Pageant totally sold out.Tomorrow night, NBC","rating":2},{"id":451011343009591300,"text":"Yesterday in front of Rockefeller Center http://t.co/Gki5bk0RH7","rating":3},{"id":428131099932647400,"text":"Apple's iPhone sales fell way short-they must go to a larger screen, as alternative, fast (as I said long ago)! Samsung's size much better.","rating":5},{"id":589212610391846900,"text":"I do what I do out of pure enjoyment. Hopefully, nobody does it better. Theres a beauty to making a great deal. It's my canvas.","rating":4},{"id":149228635323252740,"text":"Joe Biden said that the Taliban 'is not our enemy.' I wonder how our troops in Afghanistant that are under attack view Biden's statement.","rating":7},{"id":141611015581339650,"text":"The banks were bailed out by us. They should start lending to private entrepreneurs. The banks are slowing American growth.","rating":4},{"id":225599574524440580,"text":"Dark Knight Rises is projected to gross over $180 million this weekend. Remember to watch for Trump Tower!","rating":2},{"id":387621198558818300,"text":"If you are steadfast in your efforts and self respect, critics will be harmless. Keep your focus!","rating":2},{"id":355053036617469950,"text":"“A people that values its privileges above its principles soon loses both.” - Dwight D. Eisenhower","rating":1},{"id":508197340210286600,"text":"I just started construction of The Old Post Office on Pennsylvania Avenue in D.C. Many jobs. Will be finest hotel in U.S. Watch it happen!","rating":4},{"id":483688617278439400,"text":"Business is a creative endeavor. Cultivate a sense of discovery and start thinking big.","rating":3},{"id":565342022090129400,"text":"I have long stated that Brian Williams was not a very smart guy - all you have to do is look at his past. Now he has proven me correct!","rating":7},{"id":89005438619758600,"text":"THe Art of the Deal--\"\"The best thing you can do is deal from strength, and leverage is the biggest strength you have.\"\" CUT, CAP and BALANCE.","rating":5},{"id":266975925642608640,"text":"I received such a nice letter today from someone who took refuge in Trump Tower during Sandy. It was my pleasure to help.","rating":3},{"id":259291974887145470,"text":"I'll be making a major announcement on President Obama next week--stay tuned!","rating":7},{"id":200221896082595840,"text":"\"\"It's not that I'm so smart, it's just that I stay with problems longer.\"\"  Some good words from Albert Einstein. It pays to be tenacious.","rating":2},{"id":365203513736835100,"text":"Do not underestimate yourself, and know you are able to handle what comes your way by increasing your leverage.","rating":4},{"id":361854036560986100,"text":"Don't tread water. Get out there and go for it. There's nothing wrong with bringing your talents to the surface.","rating":3},{"id":482543172384747500,"text":"Realize that persistence can go a long way. Being stubborn is often an attribute.","rating":3},{"id":480672486342664200,"text":"I'd bet the lawyers for the Central Park 5 are laughing at the stupidity of N.Y.C. when there was such a strong case against their \"\"clients\"\"","rating":9},{"id":457336991676633100,"text":"Have to go now to sign a great and job producing deal! Good night.","rating":2},{"id":436603371315671040,"text":"Individual commitment to a group effort  is what makes a team work, a company work, a society work, a civilization work.-- Vince Lombardi","rating":2},{"id":278272513778266100,"text":"\"\"I believe in spending what you have to.  But I also believe in not spending more than you should.\"\"-The Art of The Deal","rating":3},{"id":266287781486141440,"text":"It has been a pleasure to make so many friends and meet so many great people on the trail this past cycle.  We will fight on!","rating":4},{"id":397918845727678460,"text":"Our NOBEL PRIZE FOR PEACE president said \"\"I'm really good at killing people\"\" according to just out book Double Down. Can Oslo retract prize?","rating":9},{"id":377258172039569400,"text":"Do you believe what is going on in Washington with respect to Syria - these people don't have a clue!","rating":7},{"id":321931942746521600,"text":"Sorry losers and haters, but I LOVED the great energy in Madison Square Garden during my speech. The WWE thought it was incredible - it was!","rating":8},{"id":317634854655250400,"text":"Take the time to be thorough in whatever you undertake. Remain open to new ideas. Remain fluid, not fixed, in your expectations.","rating":3},{"id":306422473660985340,"text":"\"\"Set your sights and aim high. You never know what you can achieve until you focus on achieving it.\"\" - Midas Touch","rating":2},{"id":523824605245743100,"text":"I just returned from Iowa - what a beautiful state. The people are amazing and the event for Congressman Steve King was a great success!","rating":4},{"id":486875421846548500,"text":"“As you go through life, you've got to see the valleys as well as the peaks.” – Neil Young","rating":2}]