[{"id":458706132035309600,"text":"China is closing a massive oil deal w/ Russia, taking advantage of the Ukraine conflict http://t.co/tItkQ0PmZH Smart, unlike our leaders.","rating":7},{"id":260807345070813200,"text":"Barack Obama said absolutely not 3 times before he agreed to go after Bin Laden--- now he wants all of the credit!","rating":6},{"id":356852537749553150,"text":"Ready to get mad?! We are sending foreign aid to China, our greatest threat http://t.co/ljj6DcWb3Z We are financing our enemy.","rating":8},{"id":335039301870043140,"text":"Obama &amp, his people did a brilliant job of delaying these scandals until after the election. Mitt must be going wild thinking about it!","rating":5},{"id":305853036989906940,"text":"Here we go with the Oscars!","rating":2},{"id":542422623800422400,"text":"Glad to see RomneyCare/ObamaCare architect Gruber being eviscerated on the Hill today. He should return all taxpayer money he was paid.","rating":4},{"id":514363929666261000,"text":"According to many, ISIS was given so much time and so many signals as to when we would start bombing that they were able to prepare and hide","rating":3},{"id":482072705068331000,"text":"Boycott Mexico until they release our Marine. With all the money they get from the U.S., this should be an easy one. NO RESPECT!","rating":9},{"id":144136183562252300,"text":"President Reagan put it best: \"\"Welfare's purpose should be to eliminate, as far as possible, the need for its own existence.\"\"","rating":3},{"id":250623040776445950,"text":"\"\"Even if you're on the right track, you'll get run over if you just sit there.\"\" --Will Rogers","rating":2},{"id":241158082376388600,"text":"I was putting together my early deals in New York &amp, I was advised by many that I was too young. Believe in yourself &amp, you can do anything.","rating":2},{"id":402913699242856450,"text":"Broken promises. A broken billion dollar website. ObamaCare can’t be fixed. Repeal!","rating":6},{"id":384744953726775300,"text":"Business is an art in itself, and powerful negotiation skills are one of the techniques necessary to facilitate success.","rating":3},{"id":363323181156663300,"text":"\"\"If once you forfeit the confidence of your fellow citizens, you can never regain their respect and their esteem.\"\"  Abraham Lincoln","rating":1},{"id":521651877352857600,"text":"Wow, China exports rise 15% in September. They are laughing at USA!","rating":5},{"id":464873674659880960,"text":"Obama told his donors this past week “public opinion” is on his side. Don't believe that one either.","rating":4},{"id":606125803420700700,"text":"The Trans-Pacific Partnership will increase our trade deficits &amp, send even more jobs overseas. This is a bad deal. Time for smart trade!","rating":5},{"id":263354106930950140,"text":"Maybe Obama should donate my $5M to the families of the 17 who have lost loved ones during the storm?","rating":7},{"id":393406404494520300,"text":"You've got something unique to offer. Find out what it is. Ask yourself: What can I provide that does not yet exist?","rating":2},{"id":374121577350463500,"text":"President Obama's weakness and indecision may have saved us from doing a horrible and very costly (in more ways than money) attack on Syria!","rating":6},{"id":362279593870229500,"text":"\"\"Even a mistake may turn out to be the one thing necessary to a worthwhile  achievement.\"\" - Henry Ford","rating":2},{"id":519503190904287200,"text":"Just put in ad for a real estate executive: “Hard work, low pay, mean boss!”","rating":6},{"id":609444113541394400,"text":"Entrepreneurs: Don’t sell yourself short. Don’t ever think you’ve done it all already or that you’ve done your best.","rating":3},{"id":562709224925720600,"text":"Entrepreneurs: Is the problem a blip or a catastrophe? Keep things in perspective. Learn to expect problems and keep moving forward.","rating":2},{"id":1280234064356794400,"text":"Why does the a Lamestream Fake News Media REFUSE to say that China Virus deaths are down 39%, and that we now have the lowest Fatality (Mortality) Rate in the World. They just can’t stand that we are doing so well for our Country!","rating":9},{"id":273507540669698050,"text":"With the economy still on a downward trajectory, the best investment young people can make now is buying property...","rating":3},{"id":256852657069756400,"text":"\"\"Leadership is the capacity to translate vision into reality.\"\" -- Warren G. Bennis","rating":2},{"id":235451148503486460,"text":"By the US winning the Olympic medal count, we proved that both the American spirit &amp, talent is greater than a 1.4B population. USA!","rating":5},{"id":405776707992305660,"text":"Tell Iran to let our Christian Pastor go--and I mean right now. If they don't, there will be hell to pay.","rating":8},{"id":401386087102169100,"text":"“A true business only exists to solve a problem and to make life better.” – Midas Touch","rating":2},{"id":394431840188395500,"text":"President Obama should bring Secretaty Sebelius into his office, look right into her beautiful blue eyes and say,with emotion, YOU'RE FIRED!","rating":8},{"id":489832630687641600,"text":"Problems are never truly hardships to winners, &amp, if you haven’t got any, then you must not have a business to run.","rating":5},{"id":436933049629294600,"text":"\"\"Great works are performed not by strength but by perseverance.\"\"-- Samuel Johnson","rating":3},{"id":600117133184467000,"text":"I laugh when I see Marco Rubio and Jeb Bush pretending to \"\"love\"\" each other, with each talking of their great friendship. Typical phony pols","rating":7},{"id":596770592088526800,"text":"I've dealt w/politicians throughout the world. My deals are multi-faceted  transactions which involve many issues. I know the process &amp, win!","rating":4},{"id":405562162867105800,"text":"President Obama said, over and over again, if you like your plan, you can keep your plan, PERIOD! This turned out to be a total lie-90 mill.","rating":6},{"id":392749172085903360,"text":"If you want to succeed, keep your edge. Staying on top of all new developments in your sector = major advantage that pays dividends.","rating":3},{"id":324925644372860900,"text":"“One reason many people do not do well in business is because they do not do well with people.” – Midas Touch","rating":4},{"id":509067530951217150,"text":"“Learning is a new beginning we can give ourselves every day.” – Trump: How to Get Rich","rating":2},{"id":496297121956765700,"text":"Isis terror group has now fully taken over large sections of Iraq, and will soon have control of massive oil reserves. I told you so.","rating":7},{"id":462414188783345660,"text":"Seth Myers is so unnatural and uncomfortable doing his show that you have to feel sorry for him. Bad interviewer, marbles in his mouth!","rating":7},{"id":335573252099428350,"text":"Why didn't President Obama just go inside when it started raining yesterday - common sense! The two Marines looked very uncomfortable-&amp, wet.","rating":8},{"id":310926555763318800,"text":"What do you think of Gary's definition of    f-u-n?","rating":2},{"id":266629339330773000,"text":"Obama's administration is now openly admitting it expects US credit downgraded again http://t.co/v7RwPT0P Thanks for letting us know now","rating":5},{"id":264880505613328400,"text":"Obama's war on women has lead to the biggest decline in female employment in 40 years. 4 more years??","rating":6},{"id":365934725854019600,"text":"“Watch what people are cynical about, and one can often discover what they lack.” -   General George S. Patton","rating":3},{"id":359650257451229200,"text":"Baseball player Ryan Braun turned out to be a total con man after so vociferously proclaiming his innocence only to be guilty as.hell!","rating":5},{"id":543310458946850800,"text":"Isn't it interesting that immediately after September 11th, everybody was asking for, and indeed demanding, torture of any kind. No reports!","rating":9},{"id":529706792729997300,"text":"Today is referendum on ObamaCare, Amnesty, slow growth, having your healthcare dropped &amp, all the other lies.","rating":6},{"id":514133411200782340,"text":"Now Obama is having our army coordinate with Iran against ISIS. What’s next?","rating":7},{"id":486236729083719700,"text":"Your tax dollars well spent. Over 1.295M ObamaCare enrollees will also be illegal immigrants http://t.co/VE85kBl3VT  Are you surprised?","rating":8},{"id":477507702373892100,"text":"W/ the ransom Obama paid for deserter Bergdhal, getting Mexico to release USMC Sgt Andrew Tahmooressi is much harder. #BringBackOurMarine","rating":7},{"id":475134318478503940,"text":"Will be in Louisiana for the Miss USA Pageant which will be on NBC on Sunday night. Watch Miss Pennsylvania,an interesting and amazing story","rating":3},{"id":589603824609923100,"text":"Just returned from New Hampshire where the crowd was great-and got a beautiful standing ovation! Wonderful people who truly love the U.S.A.","rating":4},{"id":565584005899497500,"text":"Entrepreneurs: Having an ego and acknowledging it is a healthy choice. There's nothing wrong with bringing your talents to the surface.","rating":2},{"id":562289970489348100,"text":"Entrepreneurs: Paying attention is a cost effective way of protecting yourself.","rating":2},{"id":105739460074938370,"text":"We don't need another stimulus. The first one was a complete failure. Why repeat the same mistake?","rating":5},{"id":273106532877602800,"text":"If you treat people right they will treat you right...ninety percent of the time. -- Franklin D. Roosevelt","rating":3},{"id":257663638708563970,"text":"Who says Obama will do better in the next debate- has he gotten smarter in 2 weeks!","rating":6},{"id":253950831685140480,"text":"\"\"To every action there is always opposed an equal reaction.\"\" --Isaac Newton","rating":1},{"id":351490159444901900,"text":"Just watched Facebook COO Sheryl Sandberg on 60 Minutes. She should spend more time trying to get the F stock price up &amp, less on her ego!","rating":8},{"id":304347023757430800,"text":"\"\"A  pessimist is one who makes difficulties of his opportunities...","rating":3},{"id":507584209796730900,"text":"China continues to be on the move both technologically and militarily. Obama is sitting by and watching.","rating":6},{"id":598462317945315300,"text":"TRAIN WRECK just the beginning. Our roads, airports, tunnels, bridges, electric grid - all falling apart.I can fix for 20% of pols, &amp, better","rating":9},{"id":95497050229182460,"text":"Ronald Kessler's new book \"\"The Secrets of the FBI\"\" is a great book that should be read by everyone.","rating":4},{"id":261926062093651970,"text":"If my offer is refused, every undecided OH voter will be fully aware that Obama denied $5M to charity all because he is hiding something!","rating":7},{"id":251767534234238980,"text":"If you live in a state with early voting, you should be voting as soon as possible. Bring your friends and family with you.","rating":3},{"id":227757760878624770,"text":"\"\"Sometimes your best investments are the ones you don't make.\"\"The Art of The Deal","rating":2},{"id":359636340666675200,"text":"China is taking the oil from Iraq after we spent 1.5 trillion dollars and thousands of lives for their \"\"freedom\"\". Our leaders are so stupid!","rating":9},{"id":496713364635389950,"text":"It’s Tuesday. How many fundraisers, travelling on the taxpayer dime, will Obama hold today?","rating":5},{"id":459408497508360200,"text":"“Get to know yourself.You can’t improve upon something you don’t understand.The more you ask, the better you'll know.” Vince Lombardi","rating":1},{"id":264021186990731260,"text":"Why is Obama’s auto bailout now creating jobs in China?  He is ruining American industry.","rating":9},{"id":263719827552759800,"text":"In the spirit of transparency, Obama should immediately release the 9.11 tape of Tyrone Woods pleading for military support in Benghazi.","rating":8},{"id":226059039988142080,"text":"Breitbart gets it! Vote now--Obama should release his college application records &amp, grades. He says he loves (cont) http://t.co/YJxA91PI","rating":7},{"id":378352836494778400,"text":"Most people do not know what Presient Obama is going to do to save his legacy. I do! He's got to get back to basics.Forget Syria-FIX THE USA","rating":6},{"id":375073730105733100,"text":"The great GENERALS MacArthur and Patton, real leaders and fighters, are spinning in their graves as we give Syria info &amp, time to prepare.","rating":5},{"id":362253987065499650,"text":"The best way out is always through. - Robert Frost","rating":1},{"id":296665707800821760,"text":"... People love to hear their names and their stories said out loud.” – Think Like a Billionaire","rating":2},{"id":476899786063228900,"text":"Iraq is falling apart fast - two trillion dollars and so many deaths - Bush got us in and Obama took far too long to get us out!","rating":6},{"id":590977355662946300,"text":"Congratulations to the Republicans in Congress. You are the only people Obama can out negotiate. #TimeToGetTough","rating":8},{"id":577927414942150700,"text":"Entrepreneurs: Success is good. Success with significance is even better. Make your work count.","rating":2},{"id":264365260213981200,"text":"If I would have offered Obama a billion dollars to show his records, he would have refused.","rating":7},{"id":258389924456312830,"text":"Obama weak on immigration. All words, no action. He's been Prez 4 years.","rating":6},{"id":220984530348154880,"text":"\"\"Never confuse a single defeat with a final defeat.\"\" ― F. Scott Fitzgerald","rating":1},{"id":403289037315661800,"text":"\"\"Results are what matter. The bottom line is clearly the bottom line.\"\" --Think Like a Champion","rating":2},{"id":399751865346588700,"text":"While I was in Moscow I see that President Obsma apologized for his lie, I mean statement, on ObamaCare! How nice of him to be so forthright","rating":8},{"id":325411902777860100,"text":"Read my tweets you dopes-of course he should get a trial-but fast (not a 12 year disaster).","rating":6},{"id":514133055234388000,"text":"Obama’s rollout of his ISIS war plan is another unmitigated disaster. The Generals must be furious.","rating":5},{"id":502955047421231100,"text":"The Greater Miami area and numerous others are fighting hard to get the Miss Universe Pageant. A decision will be made very soon!","rating":3},{"id":492020707975774200,"text":"Wow, Obama really put it to Israel by canceling flights there. This puts them at a tremendous disadvantage. Tourism and more will just stop.","rating":7},{"id":487337019740553200,"text":"“Don't fight the problem, decide it.” – General George C. Marshall","rating":1},{"id":481490652031897600,"text":"The Benghazi terrorist is getting speedier care than our Vets at the VA. Obama has his priorities.","rating":8},{"id":475599057138638850,"text":"By the end of this year China will be the number one economic power on earth and the U.S. will owe 20 trillion dollars, much of it to China!","rating":7},{"id":440919637220278300,"text":"Live on the edge--no complacency is allowed--and keep an open mind. Business is a creative endeavor.","rating":2},{"id":573914684434300900,"text":"I have a tip that can take 5 strokes off anyone's golf game. It's called an eraser. -- Arnold Palmer","rating":3},{"id":2266041769,"text":"- Wishing a Happy Father's Day to all the Dad's out there - YOU are a champion today and everyday! http://tinyurl.com/kn95ju","rating":2},{"id":142320749271719940,"text":"The Fed continues to recklessly flood the market with dollars. This will eventually create record inflation. It has to stop. #TimeToGetTough","rating":5},{"id":281458563031904260,"text":"This is a buyers’ market.  Buy now.  You will thank me in 3 years.","rating":4},{"id":260775748900618240,"text":"The military and Navy Seals should be given more credit for Bin Laden's death, not Obama, who works hard to take (cont) http://t.co/Awn3F7tS","rating":6},{"id":408629701058392060,"text":"Why is it that when Warren Buffett uses the bankruptcy laws to his benefit, nobody cares, but with me they go nuts!","rating":6},{"id":352157226540081150,"text":"“Having an ego and acknowledging it is a healthy choice. Our ego gives us a sense of purpose.” – Think Like a Champion","rating":2},{"id":451734763544793100,"text":"\"\"If Trump became president he would do an amazing job, if Obama took over Celebrity Apprentice, he'd fail.\"\"  What's your opinion? I agree!","rating":8},{"id":586514141764051000,"text":"Off to Nashville and the NRA.","rating":5},{"id":274148144722350080,"text":"\"\"One of the keys to thinking big is total focus.” – THE ART OF THE DEAL","rating":3},{"id":260805521542619140,"text":"My announcement is tomorrow!","rating":4},{"id":247756452440199170,"text":"Occupy Wall Street is at it again- go out and get a job. It's actually easier work and far more rewarding.","rating":6},{"id":405365308082229250,"text":"Vision remains vision until you focus, do the work, and bring it down to earth where it will do some good.","rating":3},{"id":320022283643133950,"text":"I have gotten to know many Spanish speaking people as the owner of Trump National  Doral in Miami. They are smart, hard working and great","rating":5},{"id":301688361079414800,"text":"Every business has surprises, hidden dangers beneath the surface, and little known opportunities that can lead to huge success.","rating":2},{"id":547589967954706400,"text":"Dummy Bill Maher did an advertisement for the failing New York Times where the picture of him is very sad-he looks pathetic, bloated &amp, gone!","rating":7},{"id":524490506995531800,"text":"Wow, one of the all-time greats in fashion, OSCAR DE LA RENTA, has just died at 82. Great fashion achievements but also a really nice guy!","rating":4},{"id":494210401513386000,"text":"When in doubt, Obama fundraises. He has held 393 fundraisers in six years. Another record.","rating":6},{"id":481512106886709250,"text":"Another cover-up. Obama won’t disclose how many illegal immigrants he has released into our country http://t.co/h8WhM3htvF No surprise.","rating":6},{"id":462188692275490800,"text":"Wow, Vanity Fair was totally shut out at the National Magazine Awards - it got NOTHING. Graydon Carter is a loser with bad food restaurants!","rating":8},{"id":431052920738816000,"text":"Wow, just in - ObamaCare projected to cause large scale drop in jobs - even Dems are shocked by 2.5 million number. DISASTER!","rating":7},{"id":608069074984304600,"text":"Amazing NH poll released! We are getting ready to Make America Great Again! http://t.co/gdRpkRwySd","rating":5},{"id":575753750444400640,"text":"Entrepreneurs: Having an ego and acknowledging it is a healthy choice. There's nothing wrong with bringing your talents to the surface.","rating":3},{"id":367373192186191900,"text":"Obama has exempted businesses, his staff and all of Congress from ObamaCare.  Why is he still forcing the monstrosity on the U.S.?","rating":7},{"id":340286768630865900,"text":"The Yankees really have to be embarrassed losing all four games to the Mets - my great friend George Steinbrenner would be going nuts!","rating":5},{"id":319377285687939100,"text":"Another freezing day in the Spring - what is going on with \"\"global warming\"\"?  Good move changing the name to \"\"climate change\"\" - sad!","rating":8},{"id":468282200132055040,"text":"We must stop releasing hard core criminals all over the United States. Our country must be strong again!","rating":3},{"id":462216701162295300,"text":"ObamaCare not only has brought higher premiums, decreased care &amp, loss of jobs but now .1% Q1 growth. REPEAL BEFORE IT IS TOO LATE!","rating":5},{"id":565970917797666800,"text":"Entrepreneurs: Success is good. Success with significance is even better.","rating":2},{"id":116494623500795900,"text":"Rick Perry is right when he says we must stand by Israel in the UN.","rating":2},{"id":273884361798086660,"text":"Why do the Republicans always negotiate against themselves in public?  Watching them operate these fiscal negotiations is painful.","rating":4},{"id":240191842665259000,"text":"Look what happened to the autism rate from 1983-2008 since one-time massive shots were given to children-http://t.co/lpq2SveJ","rating":8},{"id":204675610738556930,"text":"Will Smith did a great job by smacking the guy \"\"reporter\"\" who kissed him on the lips at a red carpet event. (cont) http://t.co/tvUKqx9O","rating":6},{"id":202114217854242800,"text":"Facebook billionaire gives up his U.S. citizenship in order to save taxes. I guess 3.8 billion isn't enough for (cont) http://t.co/xaPBfxlm","rating":6},{"id":199941656726867970,"text":"What's the primary ingredient for success? Passion. You have to love what you're doing or you won't get too far.","rating":2},{"id":349231954396332000,"text":"We are being embarrassed by Russia and China on Snowden (and much more) yet Obama is talking about global warming on Tuesday.","rating":7},{"id":461877280013561860,"text":"“Concentration comes out of a combination of confidence and hunger.” - Arnold Palmer","rating":2},{"id":594163516266938400,"text":"Entrepreneurs: Achievers move forward at all times. Achievement is not a plateau, it's a beginning.","rating":2},{"id":590285304457797600,"text":"We are stupidly paying Iran billions of dollars that we should not be paying. Why isn't this part of the nuclear negotiations? Really dumb!","rating":8},{"id":403265092721991700,"text":"\"\"If you want to kill any idea in the world, get a committee working on it.\"\" -- Charles Kettering","rating":3},{"id":397676880729759740,"text":"Lies and incompetence - the two words that are most closely associated with ObamaCare!","rating":7},{"id":327882631431745540,"text":"“Being true to yourself and your work is an asset. Remember that assets are worth protecting.” – Think Like a Champion","rating":2},{"id":318827483698982900,"text":"Are you expanding your business? Interview returning soldiers. Give them strong consideration. Their sacrifices deserve it.","rating":3},{"id":317700194269552640,"text":"Have a great Good Friday and a Happy Easter.","rating":1},{"id":310134021332025340,"text":"Get the big picture but be prepared for the picture to change. Be persistent and alert every single day.","rating":2},{"id":304697825395089400,"text":"... It is all about incorporating a sense of optimism into everything you do while also acknowledging the negative.” – Think Big","rating":2},{"id":519912794808795140,"text":"Stop the flights! http://t.co/cyhrbbApV3","rating":6},{"id":464030305431470100,"text":"Won $5,000,000 against Miss Pennsylvania, Sheena Monnin, for her terrible and untrue statements about Miss USA Pageant. Not a nice person!","rating":8},{"id":433269354877030400,"text":"Great purchase in Ireland--- will be a top spot! http://t.co/RNiCQTitXW","rating":4},{"id":587698517856149500,"text":"Entrepreneurs: In the best negotiations, everyone wins. This is a possibility, and it's the ideal situation to strive for.","rating":3},{"id":582976905235836900,"text":"“Simply take a big goal and mold yourself to become the person who can accomplish that goal.” – Think Big","rating":2},{"id":281113506475024400,"text":"The tragedy in Newtown really makes you understand how life is so fragile. Must appreciate every minute!","rating":3},{"id":213002780141555700,"text":"\"\"The measure of who we are is what we do with what we have.\"\" --Vince Lombardi","rating":2},{"id":187573782687391740,"text":"My twitter account is now reaching more people than the New York Times--not bad. And we're only going to get better!","rating":7},{"id":301415246868934660,"text":"SEAL who shot Bin Laden is unemployed &amp, can’t feed his family http://t.co/hENySoiT Everyone can get welfare but this SEAL can’t eat!","rating":8},{"id":501799505394925600,"text":"Re Negotiation: Persistence can go a long way. Being stubborn can be good. The key is to know when to loosen up.","rating":3},{"id":421095421134786560,"text":"Tomorrow is the 10 year anniversary of the Apprentice, one of the biggest hits in television history. How time flies!","rating":4},{"id":604296923844059100,"text":"Entrepreneurs: Set the example. You can motivate others as well as yourself by remembering that you are setting the example.","rating":2},{"id":594163626988204000,"text":"Entrepreneurs: Don't tread water. Get out there and go for it.","rating":3},{"id":587697939201585200,"text":"Entrepreneurs: Resolve to be bigger than your problems. Who's the boss? Don't negate your own power.","rating":3},{"id":573224483730792450,"text":"Concentration is a fine antidote to anxiety. -- Jack Nicklaus","rating":2},{"id":569957282303348740,"text":"I told you the Oscars were terrible—bad look, bad talent—and among the lowest ratings in show’s history.  http://t.co/AOc5aQdVvk ...","rating":6},{"id":116209368185307140,"text":"\"\"If you're going to think--think big\"\" --- The Art of the Deal","rating":3},{"id":412591535033966600,"text":"Wow, just in-John Beale, the top person in government on climate change (EPA), is a total fraud, and just admitted it! What can they say now","rating":7},{"id":393789039486054400,"text":"First Titantic sunk on its maiden voyage.Next the Hindenburg explodes on its first flight to America.Now we suffer the ObamaCare rollout!","rating":9},{"id":390919190556598300,"text":"Gain and use information to your advantage--see every day as an opportunity to learn.","rating":2},{"id":385106796500635650,"text":"Obama &amp, the Democrats want this shutdown. They think it helps their electoral prospects for 2014. Don’t believe!","rating":6},{"id":301747605220769800,"text":"Gain and use information to your advantage--see every day as an opportunity to learn.","rating":3},{"id":544292787324469250,"text":"The Jets should have let them score to get the number one draft pick, who will be really good. It will just never change for them!","rating":8},{"id":511514557568012300,"text":"Good luck to the people of Scotland, whatever their decision may be on Thursday. The whole world is watching—really exciting!","rating":4},{"id":505403994525945860,"text":"Obama once said he “would be ignoring the law” by granting amnesty through executive action. Now he’s about to do it. What will Congress do?","rating":7},{"id":458346453535322100,"text":"“There can be no liberty unless there is economic liberty.” - Margaret Thatcher","rating":3},{"id":266661755520970750,"text":"China's submarines will soon be carrying nukes http://t.co/oX6JYnqE  They will be sent to patrol our coasts, Obama won't do anything.","rating":9},{"id":260029154127392770,"text":"Fort Hood shooting should be declared a terror attack. Respect the wounded and dead.","rating":5},{"id":417064175983403000,"text":"We're coming up on the NEW YEAR-It is really important that, despite so many stupid decisions being made in Washington, we make it BEST EVER","rating":6},{"id":542786338274435100,"text":"RomneyCare/ObamaCare architect Gruber apologized for his comments. He should apologize for the $2T monstrosity &amp, return all taxpayer money.","rating":7},{"id":512246203967619100,"text":"Great article on so-called climate change, formerly known as global warming. http://t.co/fEYAhQ7lGB","rating":5},{"id":458329525911556100,"text":"The biggest winner of Obama’s ’08 win --- Vladimir Putin. Ultimately he could be tied with Iran after Tehran becomes a nuclear power.","rating":6},{"id":552583752384520200,"text":"Congress must repeal ObamaCare. Obama will veto while Americans continue to lose their doctors &amp, pay rising premiums.","rating":4},{"id":248453332493013000,"text":"Oil would be $25 a barrel if our government would let us drill. Our country would be rich again--who needs OPEC.","rating":7},{"id":392058935962005500,"text":"Why doesn't President Obama just get the people from Google to fix the failed website. In fact, why didn't he use them in the first place!","rating":6},{"id":385846460945690600,"text":"Obama and the Democrats have no respect for WWII vets trying to get into the memorial.","rating":5},{"id":375742327689453600,"text":"“If you plan for the worst – if you can live with the worst – the good will always take care of itself.” – The Art of the Deal","rating":3},{"id":350696868201758700,"text":"\"\"Sometimes when you innovate, you make mistakes. It is best to admit them quickly, and get on with other innovations.\"\" - Steve Jobs","rating":2},{"id":326086644258181100,"text":"Make the Boston killer talk before our doctors make him better. Once he is well he will say, \"\"speak to my lawyers.\"\"","rating":8},{"id":305883648568209400,"text":"Anne Hathaway is a good winner!","rating":3},{"id":539901021456465900,"text":"In the very least, Congress must defund Obama’s unconstitutional amnesty order.","rating":6},{"id":451414869544562700,"text":"Entrepreneurs: Watching you could be the motivation for your employees.Make it an example that will best serve the success of your business.","rating":3},{"id":601475946064060400,"text":"Entrepreneurs: In the best negotiations, everyone wins. This is a possibility and it's the ideal situation to strive for.","rating":3},{"id":586728165688610800,"text":"The NRA in Nashville today was amazing. Packed house and standing ovation for Trump. THANKS!","rating":5},{"id":578282613896572900,"text":"THE DONALD J. TRUMP PRESIDENTIAL EXPLORATORY COMMITTEE-http://t.co/WARAdFgrrF","rating":4},{"id":561203202394447900,"text":"Entrepreneurs: What is the standard for which you want to be known? Identify that standard and then establish it.","rating":3},{"id":98783201190875140,"text":"I believe America can be great only with proper leadership.","rating":2},{"id":233668717542776830,"text":"Received a beautiful letter from Joe Paterno's son, Jay. He really loved and respected his father.","rating":2},{"id":303981093432991740,"text":"Now China is helping Iran smuggle nuclear parts http://t.co/H6nGFh8l . China is not an ally but our country's greatest threat &amp, rival.","rating":7},{"id":493742761930010600,"text":"So many major problems for the U.S., and no answers by our leaders. When will it all change?  Many of our difficulties are so easy to solve!","rating":5},{"id":488999558002008060,"text":"Deserter Bergdahl returns to active duty as parents of brave soldiers killed looking for him grieve. Obama trying to play this mistake down!","rating":7},{"id":458651898187644900,"text":"Get the big picture--but be prepared for the picture to change. Where there's a will, there's a win. Think positively!","rating":3},{"id":606493170675929100,"text":"Re Negotiation: Think about what the other side wants. Know where they're coming from. View any conflict as an opportunity. Be flexible.","rating":2},{"id":274158551155482620,"text":"\"\"It’s often necessary to boast, but it’s even better if others do it for you.” – Think Like A Billionaire","rating":4},{"id":261812357771178000,"text":"\"\"The dealmaker is cunning, secretive, focused and never settles for less than he wants.\"\" --The America We Deserve","rating":4},{"id":377640360983658500,"text":"I fought hard against Spitzer and Weiner, and both lost. For a while, when Spitzer was way up, it seemed that I was a lone voice! Good power","rating":6},{"id":349256689700175900,"text":"“Some events will wipe out one person but will make another even more tenacious.” – Think Like a Champion","rating":3},{"id":504250209262919700,"text":"Emmy Awards show was terrible last night. Same shows winning over and over again (politics). Amazing race a joke. Host Seth Meyers bombed!","rating":5},{"id":479717049938493440,"text":"“Hook your career to a big trend. There are huge opportunities for profits if you can create big solutions.” – Think Big","rating":3},{"id":458220509680107500,"text":"Obama through his cronies said the Keysyone pipeline was \"\"not political\"\" - how much can one man lie about even the most obvious things?","rating":8},{"id":264022096538120200,"text":"Obama is a terrible negotiator. He bails out Chrysler and now Chrysler wants to send all Jeep manufacturing to China--and will!","rating":8},{"id":258375096064950270,"text":"Then how come gasoline is hitting record high prices?","rating":5},{"id":251688377651441660,"text":"Keep the big picture in mind. There are always opportunities &amp, possibilities, &amp, thinking too small can negate a lot of them.","rating":4},{"id":410006741162922000,"text":"The Unaffordable Care Act, sometimes referred to as ObamaCare, is not working. Millions of people are losing their plans and doctors-fraud!","rating":7},{"id":381929720310681600,"text":"Referees are destroying the enjoyment of NFL games. Slowing down the fun. Big shots. Jets game is ridiculous!","rating":7},{"id":364773836236931100,"text":"“I’ve found that people work harder when they are held accountable, and their confidence rises along with that.” – Midas Touch","rating":3},{"id":362939361840476160,"text":"“What the mind can conceive and believe, and the heart desire, you can achieve.” -  Norman Vincent Peale","rating":2},{"id":299575627449761800,"text":"Karl Rove is a total loser. Money given to him might as well be thrown down the drain.","rating":9},{"id":513046592652591100,"text":"“Effective leadership is putting first things first. Effective management is discipline, carrying it out.” - Stephen Covey","rating":2},{"id":562708598112124900,"text":"Entrepreneurs: Money is not always the bottom line: it can be a score card, not the final score.","rating":3},{"id":89369211993985020,"text":"House GOP wants to cut Medicare, Obama took $500 billion from Medicare for Obamacare. Both Wrong!","rating":5},{"id":258642133098049540,"text":"Can you imagine how embarrassing it would have been for the country if the candidates actually did get into a fist fight?","rating":9},{"id":219894731520475140,"text":"David Wright of the NY Mets should have been on the 1st Team All Stars. He's having a great year.","rating":3},{"id":405754706267349000,"text":"“Learn, know, and show. It’s a proven formula. Put it to use starting today.” – Think Like a Champion","rating":2},{"id":363037924935204860,"text":"It is a great victory for NYC that A-Rod will never wear pinstripes again.","rating":6},{"id":347773590436986900,"text":"Our debt is about to reach $17T. Iraq has $20T in oil reserves. Interesting.","rating":7},{"id":298846966853546000,"text":"Ask: Is there anyone else who can do this better than I can?That’s just another way of saying know yourself &amp, know your competition.","rating":3},{"id":291285510511530000,"text":"Our country, under President Obama, is on life support! Great leaders must bring people together.","rating":5},{"id":475702882671812600,"text":"Heading over to the Miss USA Pageant. The young women participating are amazing and accomplished. Competition is very tough. ENJOY THE SHOW!","rating":4},{"id":604296730402758700,"text":"Entrepreneurs: Get--and keep--your momentum going. Without momentum, a lot of great ideas go nowhere.","rating":2},{"id":20595488004775936,"text":"WIshing everyone a happy, healthy and prosperous New Year!","rating":2},{"id":154952126567694340,"text":"\"\"Obama's plan to have Russia stand up to Iran was a horrible failure that turned America into a laughingstock.\"\"  #TimeToGetTough","rating":8},{"id":395250630387716100,"text":"Fact – all the countries complaining about us spying on them spy on us. They just don't get caught--stupid!","rating":8},{"id":339162245651107840,"text":"I like John McCain but we have to start rebuilding the United States instead of countries who hate us and want us to fail - be smart!","rating":5},{"id":530430546913271800,"text":"The new Congress must restore military spending &amp, stop Obama budget cuts. Also, hold Obama accountable on the VA.","rating":4},{"id":468628444192845800,"text":"A classic - China just signs massive oil and gas deal with Russia giving Russia plenty of ammo to continue laughing in U.S. face.","rating":7},{"id":246295943752859650,"text":"What a coincidence that Obama's good friends in Libya and Egypt picked 9/11 to attack our embassies.","rating":9},{"id":330071268856586240,"text":"“How much money can you stand to lose? That’s how much risk you should assume.” –   Think Like a Billionaire","rating":3},{"id":266224044527992830,"text":"The voting booth process was a total disaster—it could and should be much better and more efficient—tremendous room for error!","rating":6},{"id":264034130772254720,"text":"President Obama missed the deadline!","rating":5},{"id":217690546490195970,"text":"Scary--now China's Development Bank is looking to buy U.S. homes and developments http://t.co/Y50nOI5R They will own our country soon.","rating":8},{"id":369569740542337000,"text":"“Tomorrow hopes we have learned something from yesterday.” - John Wayne","rating":3},{"id":294808844108972000,"text":"It all comes down to one simple question: How much money can you stand to lose? That’s how much risk you should assume.","rating":4},{"id":528286220418564100,"text":"Crazy - Election officials saying that there is nothing stopping illegal immigrants from voting. This is very bad (unfair) for Republicans!","rating":7},{"id":502440654233149440,"text":"The ISIS thug who murdered American journalist James Foley may have been Gitmo detainee http://t.co/RnHnrtA4tv If so, why was he released?","rating":6},{"id":494182641663737860,"text":"Obama spoke to the Mexican president last week &amp, did not mention UMC Sgt. Tahmooressi. Sad!","rating":5},{"id":573580929299583000,"text":"The mark of a great player is in his ability to come back. The great champions have all come back from defeat. -- Sam Snead","rating":2},{"id":256078510467215360,"text":"I just had to fire someone, he didn't have a clue--he reminded me of Obama on Wednesday night.","rating":9},{"id":208624252230963200,"text":"Over $1T in annual deficit spending and adding over $6T to the debt for what? May jobless numbers are horrendous. The great Obama recovery.","rating":6},{"id":195957597407412220,"text":"The Obama's Spain vacation cost taxpayers over $476K http://t.co/W6kIpd5x They love to spend money.","rating":7},{"id":400588100847824900,"text":"President Obama is under pressure from Democrats to undo his lie on ObamaCare. His problem is that such a move would end ObamaCare.","rating":4},{"id":393046858471178240,"text":"Where’s the accountability for the $635M website fiasco in the Obama administration? Heads should roll and officials should be fired","rating":5},{"id":377889432327561200,"text":"“Take calculated risks. That is quite different from being rash.” - George S. Patton","rating":2},{"id":375356418208960500,"text":"“To keep momentum, keep challenging yourself.” – Think Big","rating":2},{"id":327100901271691260,"text":"The Boston killer applying today for ObamaCare. He demands that medical bills be taken care of immediately. Does this include dental?","rating":8},{"id":303998029097209860,"text":"Too many people rely on auto correct...an assistant of mine apologizes!","rating":3},{"id":302076845430542340,"text":"Paying attention is a cost effective way of protecting yourself and your interests.","rating":2},{"id":540251859194486800,"text":"“You can’t wear a blindfold in business. A regular part of your day should be devoted to expanding your horizons.” – Trump: How to Get Rich","rating":3},{"id":523528960899285000,"text":"I'm leaving for Iowa now - will be great!","rating":2},{"id":438265681889755140,"text":"With the World hating us and wanting to destroy the U.S., we have just cut the hell out of the military budget, making it smallest since '39","rating":7},{"id":587699442003943400,"text":"Entrepreneurs: Don't be confined by expectations. There are no exact rules for negotiation--try to remain flexible and open to new ideas.","rating":4},{"id":266643926134452220,"text":"With taxes set to go up and Obama about to cut the mortgage deduction, now is the time to buy a house if you can.  Can get a great deal.","rating":3},{"id":266212028593602560,"text":"Trump volunteers were out early today to offload cases of food and supplies for hard-hit Rockaways residents #Sandy","rating":2},{"id":261866799732228100,"text":"One of my many Twitter followers suggested Obama should take my offer &amp, give $1,250,000 to each family of the four... http://t.co/TMPHmSy7","rating":6},{"id":348107340970606600,"text":"Vision remains vision until you focus, do the work, and bring it down to earth where it will do some good.","rating":3},{"id":308350274920149000,"text":"Losers and haters are invited to watch Celebrity Apprentice along with the many great and productive people in the hope that you will learn.","rating":7},{"id":520792336612466700,"text":"Do you notice that because of Ebola, ISIS etc., ObamaCare has gone to the back burner despite horrible results coming out. A disaster!","rating":8},{"id":488670411119267840,"text":"Again, for all of the haters and losers, I have NOTHING to do with Atlantic City - got out a long time ago!","rating":6},{"id":482089006104973300,"text":"Now Syria is bombing Iraq and Secy. Kerry, after we blew the hell out of the place, says please don't do that. Syria is a front for Iran.","rating":5},{"id":428961998269726700,"text":"The NY SAFE Act is an unconstitutional attack on 2nd Amendment rights. Will also increase crime.","rating":5},{"id":427879113055932400,"text":"Give your goals substance. Imbue them with a value that exceeds the monetary. Make them count on as many levels as you can.","rating":3},{"id":598475321856385000,"text":"My major hotel conversion of The Old Post Office on Pennsylvania Avenue in D.C. is under budget and ahead of schedule. Should be U.S.A.","rating":4},{"id":567005722702278660,"text":"As a former host of Saturday Night Live, I look forward to attending tonight!","rating":2},{"id":559853818352255000,"text":"Two of the best ever episodes of Celebrity Apprentice tonight at 8. Totally vicious and crazy! I will live tweet.","rating":6},{"id":555366353985495040,"text":"Charlie Hebdo reminds me of the \"\"satirical\"\" rag magazine Spy that was very dishonest and nasty and went bankrupt. Charlie was also broke!","rating":8},{"id":14171725850,"text":"Congratulations to our new Miss USA,  the beautiful Rima Fakih.  Rima will represent us well at Miss Universe and be a wonderful Miss USA .","rating":3},{"id":264440759858638850,"text":"Obama has destroyed the middle class.  In ’09, median household income was $55,198.  Now it is $50,678.  Four more years?","rating":7},{"id":252770694323126270,"text":"\"\"If we did all the things we are capable of, we would literally astound ourselves.\"\" -- Thomas Edison","rating":1},{"id":218068783586226180,"text":"\"\"The secret of success in life is for a man to be ready for his opportunity when it comes.\"\" --Benjamin Disraeli","rating":1},{"id":305897597267230700,"text":"The Oscar broadcast is really boring - where is the glamour and beauty?","rating":5},{"id":298833212254339100,"text":"To entrepreneurs: Watching you could be the motivation for your employees, so make it an example that will best serve your success.","rating":3},{"id":286930131841335300,"text":"The Republicans look so weak and foolish—what the hell are they doing?","rating":7},{"id":516688617696399360,"text":"Jeanne Shaheen wants amnesty for illegals, placed the deciding vote for  ObamaCare &amp, opposes the 2nd Amendment. Vote her out in November!","rating":6},{"id":503877134793076740,"text":"We will now be helping Syria and Iran by attacking ISIS - ironic, isn't it!","rating":8},{"id":491909993218600960,"text":"Going to D.C. for big groundbreaking on Old Post Office site. Will be spectacular new hotel. Lots of jobs!","rating":4},{"id":441618007639748600,"text":"\"\"Is business success a natural talent? I think it's a combination of aptitude, work and luck.\"\"  -- Think Like a Champion","rating":2},{"id":1126809698085285900,"text":"Tariffs will bring in FAR MORE wealth to our Country than even a phenomenal deal of the traditional kind. Also, much easier &amp, quicker to do. Our Farmers will do better, faster, and starving nations can now be helped. Waivers on some products will be granted, or go to new source!","rating":5},{"id":261942137367719940,"text":"I want to end the day by saying there is no check I would rather write than that to a good charity designated by our President.","rating":4},{"id":256584882434748400,"text":"Pretty even debate- no knockouts. However Ryan's closing statement somewhat stronger. What do you think? #VPDebate","rating":3},{"id":408340462194663400,"text":"A special message for Martin Bashir- http://t.co/7PpOJclyeR","rating":5},{"id":346072654962380800,"text":"A family in Las Vegas just stopped a violent home invasion by shooting one of the perpetrators-the other fled and will be captured. Great!","rating":6},{"id":486162824339943400,"text":"Buy at the point of maximum pessimism, sell at the point of maximum optimism. -- Sir John Templeton","rating":3},{"id":603543448545812500,"text":"A quote from the late, great golfer, Sam Snead: \"\"Practice puts brains in your muscles!\"\" THIS IS TRUE ALSO IN LIFE.","rating":4},{"id":572784976200134660,"text":"Entrepreneurs: Paying attention can be a cost effective way of protecting yourself.","rating":2},{"id":30735120168128510,"text":"THe people at shouldtrumprun.com have got it right! How are our factories supposed to compete with China and other countries...","rating":5},{"id":260487521430040580,"text":"Everybody is asking about my announcement this Wednesday concerning Barack Obama---just wait and see!","rating":8},{"id":238702061011734530,"text":"In any business venture, remember that branding is one of the most crucial aspects of your enterprise. Fight hard for that brand of yours.","rating":3},{"id":395904883401834500,"text":"“Learn, work, and think in equal proportions, and you’ll be going in the right direction.” – Think Like a Champion","rating":2},{"id":369922250989789200,"text":"ObamaCare is an absolute disaster which will destroy 16% of the economy and ultimately more!","rating":7},{"id":344481942709870600,"text":"Please don’t pay attention to all of those phony tweets that mention my twitter handle relative to “diet” -- it is a total scam.","rating":4},{"id":332870147847114750,"text":"Whether you have someone managing your finances or you're doing it yourself, money, like anything, takes maintenance &amp, planning to grow.","rating":1},{"id":329700067479019500,"text":"ObamaCare is a disaster. Americans will see record increases in their premiums and inferior care services.","rating":5},{"id":503314957614604300,"text":"Secretary of Defense Chuck Hagel seems so lost and, frankly, dumb. He can't even speak properly. Poor leader in these very dangerous times!","rating":9},{"id":372380500406448100,"text":"Has AG Schneiderman been extorting his targets and their lawyers for contributions? We will find out.","rating":4},{"id":357300298202615800,"text":"Give a lot of credit to Carlos Beltran for developing into a terrific baseball player and total winner for the Cardinals-great going Carlos!","rating":2},{"id":337981916106063900,"text":"\"\"If I'd started in business thinking I knew everything, I'd have been sunk before I got started.\"\" - Think Like a Champion","rating":1},{"id":294823159088164860,"text":"“One of the keys to thinking big is total focus.” – The Art of The Deal","rating":1},{"id":540235446006345700,"text":"State Department has not revoked a single passport of ISIS Americans http://t.co/ixwdZ9Uo1N  We should send them to Gitmo for some R&amp,R.","rating":8},{"id":536892449181147140,"text":"Defense Sec.Hagel has quit. Great news for our country. The guy didn’t have a clue—grossly outmatched by our enemies. Couldn't even speak","rating":8},{"id":441603001602822140,"text":"\"\"The more predictable the business, the more valuable it is. Predictability also means consistency of brand experience.\"\" --Midas Touch","rating":1},{"id":561238925050920960,"text":"I will take full credit for Mitt Romney dropping out of the race—looks like he won’t be endorsing Trump any time soon.","rating":8},{"id":252881545369628670,"text":"\"\"Life is very fragile, and success doesn't change that. If anything, success makes it more fragile.\"\" --The Art of the Deal","rating":3},{"id":417751353851519000,"text":"“The more predictable the business, the more valuable it is. Predictability also means consistency of brand experience.” - Midas Touch","rating":2},{"id":360137637119533060,"text":"\"\"Entrepreneurs are all unique. One way to build a business and turn it into a  brand is to know who you are.\"\" - Midas Touch","rating":2},{"id":322819924517085200,"text":"Our country should be worried about nuclear control far more than gun control--&amp, that one's not even close!","rating":7},{"id":303963197210259460,"text":"“Being an entrepreneur is a big task. So what can you do to prepare? First and foremost, expand your focus.” - Midas Touch","rating":1},{"id":534416334961246200,"text":"ObamaCare/RomneyCare architect Gruber was paid over $6M with our tax dollars yet Obama only claims he ‘was some adviser.’","rating":6},{"id":476319641221210100,"text":"Five U.S. soldiers killed in Afghanistan by so-called friendly fire. What are we doing?","rating":5},{"id":560071656681791500,"text":"President Obama, our great leader, wants to declare martial law in New York City as a means of helping out with the \"\"massive\"\" storm.","rating":9},{"id":96311241231962110,"text":"People ask me every day to pose for pictures but the camera never works the first time--they are never prepared or maybe just very nervous!","rating":6},{"id":349976390461960200,"text":"As hard as it is to believe, sexting pervert Anthony Weiner is leading in some polls for Mayor of NYC.","rating":9},{"id":349192067777437700,"text":"Even liberals &amp, Democrats think Eric Schneiderman’s use of the Atty General’s office is unfair &amp, unethical.  http://t.co/38ZYbpj4t3","rating":5},{"id":320672843702607900,"text":"When is South Korea going to start paying us for the massive amounts of money we are spending to protect them from the North?","rating":7},{"id":299173930114105340,"text":"“You should always feel comfortable bargaining for goods and services. I do it all the time.” – Think Like a Billionaire","rating":3},{"id":289455016983539700,"text":"\"\"Good investors are good students. It's as simple as that.\"\" - Think Like a Billionaire","rating":2},{"id":476799528809820160,"text":"Shameful. After trading 5 senior Taliban for a deserter, the White House is now attacking Bergdahl’s platoon http://t.co/MmbfJTEUuP","rating":8},{"id":430769185237368800,"text":"\"\"Experience, knowledge, and prescience are a formidable combination of powers. Do not underestimate them.\"\" - Think Like a Champion","rating":1},{"id":149571947141922800,"text":"The WH yesterday defended Biden's comments that the Taliban aren't our enemy. When did the American people decide this? http://t.co/vP4bo45p","rating":6},{"id":270901151162064900,"text":"... It is time to get out and rebuild our own nation.","rating":4},{"id":261564030613856260,"text":"Six days and counting until my offer to Barack Obama expires...","rating":8},{"id":256072913789284350,"text":"27 days until America's greatest test since our founding. In this election, we decide whether we become great again.","rating":7},{"id":405787377597034500,"text":"US froze $8B in Iranian assets during ’79 Hostage Crisis. Now Obama is giving it back to Iran while Christian Pastor is jailed. Don't do it!","rating":8},{"id":399179993789374460,"text":"I was just given a great tour of Moscow - fantastic, hard working people. CITY IS REALLY ENERGIZED! The World will be watching tonight!","rating":5},{"id":382241492942610400,"text":"The Democrats in Congress don’t want ObamaCare for themselves or big businesses. So why are they forcing it on the American people?","rating":6},{"id":379117250546241540,"text":"When I say I would end Obamacare, I would also come up with a plan that would be far better, much easier to understand, and cost less!","rating":7},{"id":373504938451550200,"text":"\"\"It's not that I'm so smart, it's just that I stay with problems longer.\"\" -- Albert Einstein","rating":2},{"id":307149567198101500,"text":"\"\"Being the best requires full-time attention and application.” – Midas Touch","rating":3},{"id":294151779652874240,"text":"Exxon donated $250g to Obama's inaugural http://t.co/ny2KsoLs I guess the Democrats have no problem accepting money from 'big oil.'","rating":6},{"id":522544210759909400,"text":"I just had a great victory against lightweight A.G. Eric Schneiderman. Most of his case re Trump U. was thrown out or gutted. Little remains","rating":8},{"id":483690706071207940,"text":"What can you learn today that you didn't know before? Set the bar high -- do the best you possibly can.","rating":4},{"id":582965669211344900,"text":"There is only one fix for ObamaCare - REPEAL &amp, REPLACE with a free market oriented alternative!","rating":5},{"id":556397957155946500,"text":"Monday night at 8:00 will be must see television. Our wonderful Joan Rivers plays a major role as my advisor on the Apprentice. AMAZING!","rating":4},{"id":284756552445997060,"text":"I always enjoy watching young entrepreneurs enter the business world.  I can tell who reads my books and who doesn’t.  #MidasTouch","rating":3},{"id":256133095034601470,"text":"Must read article on Obama's illegal fundraising from abroad http://t.co/VQI57pcd  Foreign candidate getting foreign donations.","rating":6},{"id":396330234493939700,"text":"“Do your duty and a little more and the future will take care of itself.” - Andrew Carnegie","rating":2},{"id":392990408843984900,"text":"Why doesn't President Obama call upon the NSA to fix the badly broken website-then they could spy on all of the many cheaters &amp, arrest them!","rating":7},{"id":384271418512666600,"text":"Obamacare is far toooo expensive, far toooo complicated (thousands of pages) and, most importantly, doesn't work. WE CAN DO MUCH BETTER!","rating":5},{"id":321951327301296100,"text":"I hope everyone (especially the haters and losers) goes to Macy's today and buys some DJT ties, shirts and suits-and SUCCESS Fragrance-love!","rating":8},{"id":320267398974418940,"text":"“The great question is not whether you have failed, but whether you are content with failure.” - Laurence J. Peter","rating":2},{"id":319527325085610000,"text":"Obama just bought the Afghan Police $288M in ammo http://t.co/PpW4oXKM0K  Make no mistake,  some of these will be shot at our troops.","rating":7},{"id":297081766009765900,"text":"“Let other people talk.  Any business conversation should be two-sided.” – Think Like a Billionaire","rating":3},{"id":288721181182423040,"text":"Miss Alabama, Katherine Webb, has been a truly great representative of the Ms. USA Organization ..We are proud of her!","rating":2},{"id":458700769961971700,"text":"Last Thursday Obama said \"\"investing in infrastructure would improve our economy for the long term\"\" The next day he again stopped Keystone","rating":6},{"id":49887944063991810,"text":"I want to see people make lots of $$ and live better lives. I really think they can do that through TheTrumpNetwork http://trumpnetwork.com/","rating":4},{"id":251355988374978560,"text":"\"\"Money was never a big motivation for me, except as a way to keep score. The real excitement is playing the game.\"\" -- The Art of the Deal","rating":3},{"id":246253814880038900,"text":"If Obama was smart, he would cancel the Muslim Brotherhood's WH visit later this month. He won't.","rating":8},{"id":223058412546691070,"text":"\"\"However beautiful the strategy, you should occasionally look at the results.\"\" -- Winston Churchill","rating":2},{"id":395151575779639300,"text":"Does anybody really think that President Obama didn't know about our spying on the leaders of allies around the world - not possible!","rating":6},{"id":331981378063327200,"text":"Just watched Jon Stewart(?) jumping up and down and screaming like a madman - nothing funny or smart, just loud and obnoxious, a pushy dope!","rating":9},{"id":317962835974053900,"text":"North Korea is reliant on China. China could solve this problem easily if they wanted to but they have no respect for our leaders.","rating":5},{"id":304697838808490000,"text":"“Positive thinking is not merely wishful thinking...","rating":1},{"id":544456909731147800,"text":"No wonder Sony is doing so badly. Really stupid leadership that wants Al Sharpton to help. Watch him turn the tables on chief Amy Pascal.","rating":8},{"id":465034717117812740,"text":"Time Warner cable out AGAIN in Manhattan - no television. They have a real problem!","rating":4},{"id":398270528588636160,"text":"When Obama tried to tweak his previous statement on ObamaCare he made it an even greater lie-even the Senate Democrats are angry with him!","rating":7},{"id":398093454418268160,"text":"“Recognize that the world needs more entrepreneurs. Everyone is counting on you.” – Midas Touch","rating":1},{"id":355045587277721600,"text":"Just as I predicted, ObamaCare is a complete disaster which is failing on its own. May never be fully implemented.","rating":6},{"id":326874524576526340,"text":"Wrong, used to be called global warming and when that name didn't work, they deftly changed it to climate change-because it's freezing!","rating":7},{"id":326001318806319100,"text":"If the Boston killer applies for Obama Care the paperwork will be too complicated for him to understand!","rating":8},{"id":317278844149178400,"text":"\"\"Once you consent to some concession, you can never cancel it and put things back the way they are.\"\" - Howard Hughes","rating":2},{"id":534730356524855300,"text":"Just like Jonathan Gruber viciously lied &amp, called Americans “stupid” on ObamaCare, many consultants are doing the same on Global Warming.","rating":6},{"id":511860898949267460,"text":"Does anybody notice that Atlantic City lost its magic after I left years ago. I had the big boxing, introduced UFC (ask Dana),the best shows","rating":6},{"id":483129595940450300,"text":"I am in Ireland inspecting my great and very beautiful Atlantic Ocean property. It is one of the most spectacular hotels anywhere! DOONBEG","rating":4},{"id":445671755487936500,"text":"5 year old Trey has terminal cancer. I'm helping him go to Disney, won't you? http://t.co/nxJkcDxZg1","rating":3},{"id":833050081641234400,"text":"Getting ready to leave for Melbourne, Florida. See you all soon!","rating":2},{"id":271259331775827970,"text":"\"\"We are not retreating--we are advancing in another direction.\"\" --  Douglas MacArthur","rating":1},{"id":260805179161575420,"text":"Tomorrow I will be tweeting on only one subject!","rating":1},{"id":236158329372680200,"text":"The Huffington Post is such a loser--it will die just as AOL is dying, What a stupid deal AOL made to buy it!","rating":7},{"id":189460778011725820,"text":"Now they say obese women may cause Autism in children- nonsense, they use any excuse. The FDA should immediately (cont) http://t.co/ZtaDb6dh","rating":8},{"id":395902864607817700,"text":"“The best entrepreneurs believe the true measure of success has to do with the number of jobs their business creates.” – Midas Touch","rating":2},{"id":388742804953784300,"text":"How do you spend over $635M on websites and they don't work?","rating":5},{"id":524963465904291840,"text":"If Mitt Romney were in the private sector &amp, he suffered the horrendous loss of 2012, do you think he’d rehire himself for 2016?—I don’t!","rating":7},{"id":496752403442860000,"text":"“The belief that security can be obtained by throwing a small state to the wolves is a fatal delusion.”-Winston Churchill","rating":2},{"id":438053983551516700,"text":"Building a personal brand? Then focus on being great. Focus on being the best at what you do. Excellent article: http://t.co/5GlFlzUcuk","rating":2},{"id":421355571166474240,"text":"Thanks everybody for the Happy Birthday greetings, but it’s actually the 10th birthday of The Apprentice. My birthday is June 14th....","rating":3},{"id":590613051625332700,"text":"The reason Ed Schultz said nice things about me is that I’m the only Repub who won't cut Social Security, etc. I’ll make America rich again!","rating":6},{"id":25988176664,"text":"Tune in tonight at 10 pm on NBC for another exciting episode of The Apprentice -- and see the Dog Whisperer make an appearance.","rating":3},{"id":270974533563977730,"text":"\"\"The best luck of all is the luck you make for yourself.\"\" -- Douglas MacArthur","rating":1},{"id":263335955677712400,"text":"\"\"Without focus, it's just impossible to be successful at anything.\"\" --Midas Touch","rating":1},{"id":410444169253879800,"text":"Naghmeh Abedini, the lovely wife of the Christian Pastor Saeed being held in an Iranian jail, just left my office. #savesaeed","rating":4},{"id":397517383017193500,"text":"Wow, just watching the news.ObamaCare and the website are TOTALLY OUT OF CONTROL. Costs are through the roof. This could be ruinous to U.S.!","rating":5},{"id":373406887112622100,"text":"Pervert Weiner is dead in his race for mayor of NYC but WOW, Eliot Spitzer has dropped way down in recent poll for comptroller. SLEAZE!","rating":9},{"id":357204995038384100,"text":"“Do whatever it takes to improve your public-speaking skills. You’ll absolutely need them.” – Midas Touch","rating":3},{"id":325407463799140350,"text":"You must be kidding-zero chance he is innocent!","rating":7},{"id":322290543969329150,"text":"I feel so badly for Mark Cuban-the Dallas Mavericks were just eliminated from the playoffs and his partners are pissed. Very sad!","rating":5},{"id":320661420377264100,"text":"I'm getting ready to be inducted tonight into the WWE Hall of Fame at Madison Square Garden - a great honor for me and the Trump family!","rating":6},{"id":291241183760482300,"text":"“Do your homework before you invest.  A dumb investor is a dead investor.”  – Think Like a Billionaire","rating":4},{"id":501798887288758300,"text":"Re Negotiation: Patience is an enormous virtue &amp, needs to be cultivated for successful negotiations on any level.","rating":3},{"id":469907149897101300,"text":"The ObamaCare websites have cost over $5B &amp, many still do not work http://t.co/PlhYDjwPKA One of the greatest fiascos in modern history!","rating":8},{"id":607336443401388000,"text":"Just received applause at #NCGOPcon when I said  \"\"People ask me why I may run for President-- I might so we can Make America Great Again!","rating":10},{"id":582986167622209500,"text":"Entrepreneurs: Ask yourself: What am I pretending not to see? There may be some great opportunities right around you.","rating":4},{"id":263676632466866180,"text":"Kevin Garnett's response to Ray Allen last night was that of a great competitor--nothing wrong--in fact it was terrific. A champion!","rating":3},{"id":263649063847739400,"text":"The President has until tomorrow at 12 noon to pick up $5M for his favorite charity. Looking like he won't be doing it. What is he hiding?","rating":8},{"id":260380411492986880,"text":"\"\"They succeed, because they think they can.\"\" -- Virgil","rating":2},{"id":253119663570055170,"text":"\"\"I've learned that mistakes can often be as good a teacher as success.\"\" --Jack Welch","rating":2},{"id":409886929178869760,"text":"Just got back to New York from California. Will be on Fox  &amp, Friends tomorrow morning at 7.00. ObamaCare and other disasters to be discussed","rating":5},{"id":400944844904095740,"text":"In a new poll a majority of people felt  the president \"\"knowingly lied\"\" about health care pledge. Who are the fools who don't think he lied?","rating":6},{"id":392987582638063600,"text":"Honestly, whether you're for or against ObamaCare, the 635 million dollar website fiasco is bad for the U.S. It makes us look totally inept!","rating":5},{"id":375575931009900540,"text":"President Obama put himself in a very bad position when he talked about Syria crossing the RED LINE. Amazingly, now he denies he said that!","rating":5},{"id":357854683315965950,"text":"\"\"Enthusiasm is a vital element in individual success.\"\" ― Conrad Hilton","rating":2},{"id":302181477943214100,"text":"If you can count the amount of time you put into a project on your fingers, then you haven’t spent enough time on it.","rating":3},{"id":286486041836265470,"text":"This is a terrible deal for the country and an embarrassment for Republicans!","rating":6},{"id":526354895985971200,"text":"Yes, I won the right to have my name taken off Trump Plaza in A.C. because it was not operated up to a very high standard and NO involvement","rating":5},{"id":481491698607202300,"text":"The 9.11.12 attack on the Benghazi consulate was a sophisticated, multi-prong wave attack. When will all the 50+ fighters face justice?","rating":4},{"id":599198219856388100,"text":"I cannot believe how bad Jeb Bush looks with his insane answer on Iraq, and then his numerous corrections which made him look even worse.","rating":7},{"id":590982593736286200,"text":"The Trans-Pacific Partnership is an attack on America's business. It does not  stop Japan's currency manipulation. This is a bad deal.","rating":5},{"id":149136594455117820,"text":"Dummies left Iraq without the oil--not believable!","rating":8},{"id":261094409330905100,"text":"Story will be released today at 12 noon EST on Twitter and Facebook.","rating":2},{"id":400640029791236100,"text":"The same people that built the ObamaCare website used, as the face of the website, someone who is not a US citizen. Incompetent.","rating":6},{"id":400639951831724000,"text":"Can you believe it—the model who mysteriously disappeared from the ObamaCare website is not a US citizen—she’s from Colombia.","rating":7},{"id":395154334507618300,"text":"There are so many blatant lies coming out of the ADMINISTRATION - healthcare, spying, NSA, IRS, brutally killed Americans -WILL IT EVER END?","rating":6},{"id":501798238035652600,"text":"Re Negotiation: Know exactly what you want &amp, focus on that. View conflict as an opportunity--this will expand your mind and your horizons.","rating":5},{"id":494870652323897340,"text":"I support K-9’s for Warriors, a wonderful organization that trains service dogs for veterans. Please contact http://t.co/tD7WOa23um","rating":3},{"id":494174152807698400,"text":"Get our Marine out of Mexico. http://t.co/cWPFfbXab7","rating":6},{"id":577928816422711300,"text":"Entrepreneurs: We win in our daily lives by being careful with every day, every moment.","rating":4},{"id":265832209129304060,"text":"The Apprentice was the #1 show on television last season on Sunday from 10 to 11 --- congratulations Donald!","rating":5},{"id":237920371926528000,"text":"\"\"I dream for a living.\"\" --Steven Spielberg","rating":2},{"id":220188480528064500,"text":"Tomorrow we celebrate Independence Day, America's 236th birthday. Here is America's actual birth certificate http://t.co/0Dnwgi5p","rating":8},{"id":394931567266512900,"text":"Like your current health care plan? Too bad, you’re going to lose it under ObamaCare. Hope, Change &amp, a  300% Increase in Your Premium.","rating":7},{"id":355708826244218900,"text":"“Destiny has a part to play in your life and in your business – so give it a chance to work.” – Think Like a Champion","rating":4},{"id":348107401150468100,"text":"The best investors are visionaries—they look beyond the present.","rating":3},{"id":540234232275406850,"text":"Congress must pass a budget and hold Obama to it. No more continuing resolutions and no more excuses. Republicans soon hold both houses.","rating":7},{"id":535480463964766200,"text":"“Success in golf depends less on strength of body than upon strength of mind and character.” - Arnold Palmer","rating":3},{"id":507992304737865700,"text":"China is going to complete 59 new theme parks by 2020, over $23B in expansion. That would take over 100 years in our country.","rating":6},{"id":421041728989061100,"text":"While I am a critic of President Obama, I hate it when someone (Robert Gates) writes a self serving negative book about his boss.","rating":5},{"id":573939334006571000,"text":"Golf is a game of respect and sportsmanship, we have to respect its traditions and its rules. -- Jack Nicklaus","rating":2},{"id":69120590535081980,"text":"Guests are raving about our exclusive hotel mattress and so we’ve made it available for purchase!  http://bit.ly/sertahotel","rating":1},{"id":284741754018754560,"text":"Any deal completed before the fiscal curb must have tangible cuts on expenditures, in baseline spending, so we can get our credit back.","rating":4},{"id":278556002893303800,"text":"China is buying so many of our companies-- it’s really getting bad.","rating":6},{"id":389961782246531100,"text":"Thanks to all for the wonderful congratulation sent to me on the birth of Ivanka's little boy - so nice!","rating":3},{"id":364492508719362050,"text":"\"\"Action speaks louder than words but not nearly as often.\"\"--Mark Twain","rating":1},{"id":326430912881516540,"text":"Our enemy China is illegally buying oil from our enemy Iran http://t.co/HCndC36H2Z China loves it!","rating":8},{"id":307338583990214660,"text":"Thank you - so nice.","rating":2},{"id":494199025626009600,"text":"Watch – Obama will not fix the illegal immigrant loophole. Instead he will sign another executive action giving more amnesty.","rating":7},{"id":434317310330171400,"text":"My new club on the Atlantic Ocean in Ireland will soon be one of the best in the World - and no-one will be looking into ugly wind turbines!","rating":6},{"id":573223638591143940,"text":"We create success or failure on the course primarily by our thoughts. -- Gary Player","rating":1},{"id":269117272537317380,"text":"Just signed contract to purchase the Ritz Carlton in Jupiter, Florida--great land, great location, great future!","rating":5},{"id":256566001385209860,"text":"Biden's sarcastic smiling may or may not be effective depending on who is watching. #VPDebate","rating":4},{"id":255770772101009400,"text":"“In order to build your wealth and improve your business smarts, you need to know about real estate.” - Think Like a Billionaire","rating":3},{"id":253513620334460930,"text":"See June 2007 speech--is Obama a total racist?","rating":9},{"id":413652016318406660,"text":"Go to Macy's today and buy Trump ties, shirts, suits and cufflinks as a Christmas or holiday present.Great style, great price! ONLY THE BEST","rating":6},{"id":376019499645816800,"text":"No surprise. Woman being cited by Kerry &amp, McCain on Syrian rebels is a paid consultant of the rebels http://t.co/pavhGj9cIf","rating":5},{"id":356873704044638200,"text":"“Learn, work, and think in equal proportions, and you’ll be going in the right direction.” – Think Like a Champion","rating":3},{"id":350319652242591740,"text":"There are huge opportunities for profits if you can think big &amp, create big solutions for the human needs brought by trends. -Think Big","rating":2},{"id":526356367851130900,"text":"I would absolutely consider investing in Atlantic City again, great and hard working people, but much would have to change-taxes, regs., etc","rating":4},{"id":489381851350319100,"text":"Tremendous cold wave hits large part of U.S. Lucky they changed the name from global warming to climate change - G.W. just doesn't work!","rating":7},{"id":478601428517548000,"text":"The VA scandal will only get worse over the time. Our vets deserve the best care possible. We must be open to private solutions.","rating":4},{"id":472668585387499500,"text":"I am in Toronto checking the great Trump International Hotel - highest rated hotel in Canada. It is a beauty!","rating":3},{"id":468272428138119200,"text":"I cannot believe how well certain areas are doing relative to the U.S. There is no reason for this other than poor leadership.WE SHOULD BE 1","rating":6},{"id":563409153813934100,"text":"Entrepreneurs:  Having a product requires something very important--you have to think about the market. Do your due diligence.","rating":2},{"id":242973742836375550,"text":"\"\"Be  yardstick of quality. Some people aren't used to an environment where excellence is expected.\"\" -- Steve Jobs","rating":1},{"id":240860733926154240,"text":"It's Wednesday, how much money is China stealing from us today?","rating":8},{"id":397474521306759200,"text":"The ObamaCare website will cost over $1.5B when all is said and done. Crazy!","rating":7},{"id":317320101470801900,"text":"...At the same time, go through a worst-case scenario but keep it short.  Focus on your goal—look at the solution, not the problem.","rating":3},{"id":298911100609654800,"text":"“Don't bunt. Aim out of the ball park. Aim for the company of immortals.” - David Ogilvy","rating":2},{"id":607281766479601700,"text":"Going to North Carolina to make keynote speech - sold out crowd!","rating":4},{"id":590983309779406800,"text":"Republicans should not be giving Obama fast track authority on trade. The Trans-Pacific Partnership will squeeze our manufacturing sector","rating":5},{"id":573580122516820000,"text":"Placing the ball in the right position for the next shot is eighty percent of winning golf. -- Ben Hogan","rating":2},{"id":568798459261788160,"text":"Receiving the Algemeiner Liberty Award--a great honor. http://t.co/SgNDSLZgsG","rating":3},{"id":282165347052843000,"text":"Washington is in total gridlock—no trust, no leadership—very interesting!","rating":6},{"id":265526910891733000,"text":"Obama’s policies have led to food stamp rolls growing 75X faster than job production http://t.co/VMJy9XjJ  We can't afford 4 more years.","rating":8},{"id":374676161957478400,"text":"Each time I see one of Anthony Weiner's television ads for mayor I ask, what the hell is he doing just wasting money &amp, time-go get a job!","rating":8},{"id":352149868799725600,"text":"“You have to have a good reason for doing what you’re doing because people connect with the why.” – Midas Touch","rating":3},{"id":335039172232478700,"text":"If these scandals happened before the election, Obama could not have won.","rating":6},{"id":314457013981696000,"text":"The NFL has just barred ball carriers from using helmet as contact.  What is happening to the sport? The beginning of the end.","rating":5},{"id":509775768554332160,"text":"Flashback from October, 2013: “Donald Trump demands larger iPhone screen” http://t.co/5CCg8p8N2O You’re welcome! Apple listened.","rating":7},{"id":482511973339656200,"text":"Our Q1 GDP was -2.9%. Worst in memory --  ObamaCare killing jobs, stopping growth and making small business insecure.","rating":6},{"id":459055101370712060,"text":"The ObamaCare enrollment numbers are a lie.They will be ‘readjusted’ by the White House at an opportune time, probably after ’14 election","rating":7},{"id":570258104434233340,"text":"I could fix tv talk shows that are doing poorly—there is tremendous talent out there waiting to be tapped—and nobody sees it!","rating":4},{"id":551939129500770300,"text":"This boardroom gets CRAZY! These people are wild","rating":6},{"id":260850671576829950,"text":"This is not a media event or about Donald J. Trump--- this is about the United States of America. I will be... http://t.co/RXTnZI1o","rating":5},{"id":345625597076197400,"text":"\"\"Work often becomes problem solving.  Problems come with the territory, and they should never surprise you.\"\" - Think Like a Champion","rating":2},{"id":290938105077329900,"text":"If someone says “I’ll bet you ten dollars” and loses the bet, it’s pay up time.","rating":3},{"id":478645959506026500,"text":"I know about the “rustic” look on golf courses—but see photo of highly rated Trump National Philadelphia—a real gem. http://t.co/pgSW9kWVck","rating":1},{"id":446383417060778000,"text":"Re Negotiation: Know what you want &amp, think about what the other side wants. Know where they’re coming from &amp, do not underestimate them.","rating":2},{"id":270567614382755840,"text":"Does anyone really believe that President Obama found out about Petraeus immediately after the election?","rating":6},{"id":213710266343493630,"text":"\"\"Things work out best for those who make the best of how things work out.\"\" -- John Wooden","rating":1},{"id":162665104754737150,"text":"“It’s sad—truly sad and disgraceful—the way Obama has allowed America to be abused and kicked around (cont) http://t.co/tHXcRowx","rating":8},{"id":378649875640225800,"text":"I truly hope President Obama doesn't do something irrational and dangerous for our country in order to save face. He must sit back and chill","rating":5},{"id":363008114582229000,"text":"A sad day for America with Snowden being granted asylum in Russia.  Putin is laughing at Obama.","rating":7},{"id":341756178096848900,"text":"The Miami Heat looked great tonight - congratulations from all of your friends at your favorite place in Miami, Trump National Doral.","rating":4},{"id":540245737939161100,"text":"“Keep your focus global and you may very well find yourself ahead of the game.” – Trump Never Give Up","rating":3},{"id":479971403173990400,"text":"“Competitive golf is played mainly on a five-and-a-half-inch course... the space between your ears.” - Bobby Jones","rating":2},{"id":607337555277840400,"text":"Just said at #NCGOPCon that \"\"I'm not beholden to lobbyists and donors! No special interest would control me if I were in office.\"\"","rating":6},{"id":586855795188441100,"text":"Heading to South Carolina now - meeting with fantastic people!","rating":4},{"id":263743692781809660,"text":"President Obama, if it is important to you, I will substantially increase the $5M offer!","rating":7},{"id":262954327822446600,"text":"I'm not hearing much from Obama or his administration about my $5M offer to charity or to which charity the money will go.","rating":6},{"id":258565793749544960,"text":"At the debate, the President kept talking of what he is going to do. I kept saying, why didn't he do it?  He lost me a long time ago.","rating":5},{"id":384987984342581250,"text":"The Republicans can absolutely win if they stick together-but they are NOT sticking together. Sen. McCain just said \"\"we can't win\"\".Very bad!","rating":6},{"id":332312566330179600,"text":"Jodi thought she outsmarted the system - it didn't work!  Congratulations to the jury on a job well done!  Now, will it be life or death?","rating":5},{"id":325970245489680400,"text":"When the stupid people start feeling sorry for the Boston killer and want to release him and give him medals, remember the killings-maimings","rating":8}]