[{"id":303649244814901250,"text":"I said gas prices would sky rocket after election - Opec payback!","rating":7},{"id":512341618217979900,"text":"The Iraqi army has squandered the majority of the weapons &amp, training we gave them for 10 long years. When will we learn?","rating":6},{"id":493861754888151040,"text":"Obama can sign an illegal executive action anytime for ObamaCare but he can’t fix the illegal loophole.","rating":8},{"id":607336969350324200,"text":"Just made the point at #NCGOPcon that \"\"we have to protect our border &amp, I think everyone here knows, nobody can build a wall like Trump!\"\"","rating":7},{"id":587805039374114800,"text":"Marco Rubio should pick a location that has working air conditioning next time - especially when in Miami - proper plan. Sweating profusely!","rating":8},{"id":1166494465357439000,"text":"Can you believe it? I’m at 94% approval in the Republican Party, and have Three Stooges running against me. One is “Mr. Appalachian Trail” who was actually in Argentina for bad reasons....","rating":9},{"id":129611165952245760,"text":"When will our nation's sacrifices  be respectfully appreciated? Iraq and Libya should reimburse us in oil.","rating":7},{"id":95932236490223620,"text":"America's debt is greater than our GDP. Time for new thinking.","rating":5},{"id":273122351191822340,"text":"\"\"Most people can learn from their own experiences quite well, but many ignore the experiences and lessons of others.\"\" -- The Way To The Top","rating":3},{"id":265905702978068480,"text":"Make sure to verify the voting machine does not switch your vote. If you have any problems, notify the poll workers.","rating":5},{"id":253134031984664580,"text":"Big cancer risk from new \"\"environmental\"\" light bulbs\"\"--a big price to pay!","rating":8},{"id":403950220871876600,"text":"Hypocrite. Watch Senator Obama defend \"\"democratic debate' of Senate filibuster rules in 2005  http://t.co/Z8Sh1Yopn1","rating":6},{"id":397840497030332400,"text":"Not only does Obama spy on German leaders, he criticizes their trade surplus http://t.co/jX2ZzAEwuw We should have a trade surplus!","rating":7},{"id":377512957472542700,"text":"For all of my millions of followers, and at your request, I will be tweeting tonight during President Obama’s speech!  9pm ET","rating":5},{"id":364388300519243800,"text":"A good question for would-be entrepreneurs to ask themselves:  What am I pretending not to see? There are a lot of opportunities out there.","rating":3},{"id":528898433789460500,"text":"Wow, so far everyone running for office who I did a ROBOCALL for has taken the lead in the polls -- the smart pols know this. GREAT!","rating":4},{"id":474140733398450200,"text":"Chris McDaniel looks like he will win in Mississippi - GREAT NEWS and big victory for Tea Party!","rating":6},{"id":583352700164771800,"text":"Obama’s offer to Iran will not stop Iran’s breakout capability. It is a bad, desperate deal negotiated from weakness. Pass sanctions!","rating":5},{"id":268069314572197900,"text":"Yesterday was Veterans Day.  I hope our armed service members felt appropriately honored.  This nation loves and respects all of you.","rating":2},{"id":231092414985687040,"text":"\"\"Capital isn't scarce, vision is.\"\" --Sam Walton","rating":1},{"id":206883140462055420,"text":"George Will may be the dumbest(and most overrated) political commentator of all time. If the Republicans listen to him, they will lose.","rating":9},{"id":387677362919178240,"text":"Did you ever think our country would  become an economic basket case? So much for Hope &amp, Change.","rating":7},{"id":375373304799846400,"text":"“Appreciate your property, and your property will appreciate for you.” – Think Like a Billionaire","rating":3},{"id":368423571116159000,"text":"Keep an open mind--business is a creative endeavor. Strive for innovative ideas.","rating":2},{"id":354645129384034300,"text":"“You don't necessarily need the best location. What you need is the best deal.” – The Art of The Deal","rating":3},{"id":603751406831607800,"text":"Politicians are all talk and no action. Bush and Rubio couldn't answer simple question on Iraq. They will NEVER make America great again!","rating":8},{"id":586498726228787200,"text":"I will be speaking at the NRA event today in Nashville. Many friends will be there.","rating":4},{"id":12535153342,"text":"Tune in to The Marriage Ref onThursday night at 10 p.m. on NBC--I'm on the panel of experts along with Gloria Estefan & Adam Carolla.","rating":3},{"id":273839299907170300,"text":"\"\"You can benefit from others’ wisdom. Not just their mistakes but the good decisions and insight they have to offer.” -- The Way To The Top","rating":2},{"id":385129636792782850,"text":"There have been 17 shutdowns since 1976, 14 under Reagan and Bush with Democrat Congresses who wanted more spending.","rating":5},{"id":349973845228269600,"text":"China loved Obama’s climate change speech yesterday. They laughed! It hastens their takeover of us as the leading world economy.","rating":8},{"id":305162369435328500,"text":"I hope Oprah gives Lance Armstrong 100 million dollars because that's what that ridiculous interview will cost him!","rating":7},{"id":472913311596441600,"text":"At some point Sgt. Bergdahl will have to explain his capture. In 2009 he simply wandered off his base without a weapon. Many questions!","rating":5},{"id":437944626709016600,"text":"Whether you like it or not, the Russians did a great job in hosting the Olympics! Remember when Obama went to Europe to get Olympics-fourth.","rating":6},{"id":258645188120027140,"text":"What is never said is that people take a big risk with their money and can lose it all. We should be given credit for taking this risk.","rating":3},{"id":347408974892654600,"text":"I salute all Tea Party Patriots for marching on DC today.  Stand strong!","rating":4},{"id":319187653784371200,"text":"I think it was terrible that Tim Cook of Apple apologized to China. What the hell is he apologizing for? Steve Jobs wouldn’t.","rating":8},{"id":304313180807630850,"text":"...While I fully agree, it is not politically correct!  http://t.co/SpE1Y14w","rating":2},{"id":544456034572857340,"text":"Can you believe that Sony chief Amy Pascal wants to meet with Al Sharpton to seek forgiveness for her racial slurs. Al is laughing at her!","rating":7},{"id":475495103532773400,"text":"I am in Baton Rouge where the Miss USA Pageant will be shown live on NBC on Sunday night for 3 hours starting at 8 P.M. INCREDIBLE SHOW!","rating":3},{"id":103521940848914430,"text":"Amazing--Obama speaks, market goes  DOWN---Trump tells CNBC he's buying stock---market goes UP --- should not be that way!","rating":8},{"id":273155322082893820,"text":"\"\"In war there is no substitute for victory.\"\" -- Douglas MacArthur","rating":2},{"id":160083387774799870,"text":"Rick Perry--a good man, a great family and a patriot.","rating":2},{"id":369920100398166000,"text":"Our country needs to reestablish the work ethic. In NY, welfare pays better than jobs http://t.co/RL0fd2SJJm Zero incentive.","rating":5},{"id":353737518329499650,"text":"Anderson Silva just got knocked out by new champion Chris Weidman! Congrats to Chris.","rating":3},{"id":334354296638410750,"text":"“Circumstances are beyond human control, but our conduct is in our own power.” -- Benjamin Disraeli","rating":1},{"id":445598059557576700,"text":"\"\"The best vision is insight.\"\" -- Malcolm Forbes","rating":1},{"id":96237915633483780,"text":"Higher Taxes kill job creation---cut wild government spending and waste.","rating":4},{"id":251393026369392640,"text":"A resort in Arizona is using sewage to make snow. Environmentalists are going crazy--I won't be skiing in that snow.","rating":6},{"id":373747038938480640,"text":"Did anyone notice that Obama failed to get a coalition of other countries to go along with us. He couldn't even get Britain! NO LEADERSHIP.","rating":7},{"id":353319352566685700,"text":"To all of those who asked, I predicted two weeks ago and again last night that Dwight Howard would go to Houston.Do I get congrats-insight?","rating":2},{"id":350349435496169500,"text":"Keep difficulties in perspective. Ask yourself \"\"is this a blip or is it a catastrophe?\"\"","rating":3},{"id":327487236616630300,"text":"After tearing W Bush down for 12 years, now the media loves him. Why not? He gave them Obama.","rating":6},{"id":276003555519909900,"text":"The Democrats have zero intention of coming to any deal on the \"\"fiscal cliff.\"\"  They will raise taxes and blame it on the Republicans.","rating":5},{"id":228234959331155970,"text":"By folding, Penn State leadership made things worse. The deal is ridiculous &amp, punishes the wrong people. I hope the alumni sue to overturn.","rating":4},{"id":413071703112028160,"text":"FRACK NOW &amp, FRACK FAST!!! American prosperity depends on it. Our economic renaissance is here.","rating":6},{"id":386208703533178900,"text":"While the Pres. of Iran tweets sweet nothings to Obama he forbids the Iranians to use twitter. Very revealing.","rating":7},{"id":377603764422975500,"text":"We will have to see what Russia's next move will be. They may have given him an out of an embarrassing situation or drove into deeper mess!","rating":3},{"id":362547437484773400,"text":"Poll numbers have nosedived for pervert NYC mayoral candidate Anthony Weiner- good news for New York!","rating":8},{"id":339843767123185660,"text":"“Is business success a natural talent? I think it’s a combination of aptitude, work and luck.” – Think Like a Champion","rating":3},{"id":339474822780289000,"text":"“We have a system that increasingly taxes work and subsidizes nonwork.” - Milton Friedman","rating":2},{"id":332119712022528000,"text":"I'm giving away money! 11AM Trump Tower. Be there or be left behind!","rating":9},{"id":467545737602301950,"text":"Sorry, for all of the millions of people who long to hear my brilliant words of wisdom on Fox &amp, Friends on Monday A.M., no go - in Dubai.","rating":7},{"id":452508840752607200,"text":"For China, of all nations, to search the massive Indian Ocean and pick up the ping from the black box of flight 370 sounds a bit far fetched","rating":6},{"id":1836131903,"text":"\"\"We win in our lives by having a champion's view of each moment.\"\" --Donald J. Trump http://tinyurl.com/pqpfvm","rating":3},{"id":263320657767567360,"text":"The Trump Tower atrium is such a great place &amp, kept thousands of people warm &amp, safe during the storm--thanks, staff!","rating":5},{"id":259283724347273200,"text":"\"\"A penny saved is a penny earned.\"\" -- Benjamin Franklin","rating":1},{"id":258630587487772670,"text":"Last Saturday A-Rod was 0-3 and left 6 stranded. But he was still hitting on girls from the dugout  http://t.co/ocd4ZHlD He is very selfish!","rating":8},{"id":194492099167658000,"text":"\"\"More than anything else, I think deal-making is an ability you're born with. It's in the genes.\"\" #TheArtofTheDeal","rating":4},{"id":410512076340092900,"text":"A beautiful view from my office today- http://t.co/shwLiuXF2H","rating":2},{"id":391283025339613200,"text":"No surprise Saudis turned down spot on UN Security Council. They don’t want  responsibility. Just have us do their heavy lifting.","rating":5},{"id":320861289058533400,"text":"True, America is rapidly losing it's SPIRIT, and when that's gone, we will only be going in one direction - and that direction is down!","rating":6},{"id":317679210602827800,"text":"Achievers go for the challenge, so the next deal is what they're thinking about. They have an obligation to best themselves.","rating":3},{"id":303984203333259260,"text":"$5 a gallon gas and we have yet to approve the Keystone XL Pipeline.  OPEC is laughing at us.","rating":4},{"id":302089100310216700,"text":"Remember to think big by expanding your horizons at the same time you’re expanding your net worth.","rating":2},{"id":294548524845113340,"text":"The Republicans better be careful.  Obama is out to destroy them!","rating":7},{"id":520322089312481300,"text":"The residential real estate market continues to provide opportunities for first time home owners. Buy now if you can!","rating":3},{"id":519850645990674400,"text":"Obamacare premiums continue to rise and bend up the cross curve. And the back-end of the website does not even work.","rating":4},{"id":419202452936601600,"text":"Welcome to the new ObamaCare reality – Doctor spent 2 hours on hold w/insurance company to get approval for surgery http://t.co/W2Lru0takZ","rating":4},{"id":277161182761205760,"text":"This is such a special time to be in New York City.  No better city in the world to celebrate Christmas!","rating":2},{"id":264884389639491600,"text":"We don’t want to have a recount in any of the battleground states. Obama will steal it. Make sure all your friends and family vote.","rating":8},{"id":264365573520101380,"text":"Everybody knows why Obama would not show his college applications --- they are just not willing to say!","rating":7},{"id":403543667144523800,"text":"\"\"Figure out what really moves you. You've got to have the 'FIRE' in order to have the Midas Touch.\"\" -- Midas Touch","rating":3},{"id":357207321920802800,"text":"Traitor Snowden has requested asylum in Russia.  Why would Russia grant it?  Snowden already gave them all the intel he stole!","rating":6},{"id":319550745164800000,"text":"Look for good ideas outside of your own areas of expertise. Find innovations, approaches, and practices that you could adapt in your field.","rating":2},{"id":305056783335030800,"text":"...then he who continues the attack wins.” - Ulysses S. Grant","rating":2},{"id":540145845505904640,"text":"“Each excellent thing, once learned, serves for a measure of all other knowledge.” - Philip Sidney","rating":1},{"id":519460162231611400,"text":"Kentucky has a chance to have the Senate Majority Leader, Mitch McConnell, representing it in Washington. Big power for State. Don't blow it","rating":3},{"id":495380307911385100,"text":"Just as I have been predicting for years, Iraq will fall to the people that hate  the U.S. the most - just outside of Baghdad.\"\"Keep the oil\"\"","rating":7},{"id":457787929969324000,"text":"Look, Snowden is bad, done tremendous damage to our country and standing - but we have far worse in our government (guess who?).","rating":6},{"id":557340608684380160,"text":"Joan Rivers on The Apprentice tonight at 8:00. I will be live tweeting. JOAN WAS GREAT!","rating":3},{"id":128842852439564290,"text":"Printing money is neither a short or long term solution to our country's economic woes. The Fed is destroyin... (cont) http://t.co/ndVdVB88","rating":5},{"id":264432824575221760,"text":"Obama our Welfare &amp, Food Stamp President, is praising himself for expanding welfare http://t.co/cAOUnJT0  He doesn't believe in work.","rating":8},{"id":260810521421414400,"text":"Last night was the first time Obama said \"\"we\"\" instead of \"\"I\"\" in respect to Bin Laden's killing.","rating":6},{"id":243433630976847870,"text":"\"\"Change before you have to.\"\" --Jack Welch","rating":2},{"id":358234093181354000,"text":"“Be flexibly focused. Focus does not mean being narrow-minded or rigid.” – Think Big","rating":3},{"id":353352493947830300,"text":"For all of those that were hoping I was wrong, and this is a very unimportant subject to me, Dwight Howard just officially announced Houston","rating":4},{"id":540239698099437600,"text":"Broken borders, $18T debt, ObamaCare failing &amp, over budget. Don’t worry our president is still fundraising http://t.co/s4z0EzWQPN Priorities","rating":7},{"id":520243592225652740,"text":"Great news from Ireland—Clare County Council turned down massive windfarm near my hotel &amp, golf course in Doonbeg. http://t.co/oSvVFgM70M","rating":5},{"id":519866561591787500,"text":"“Today's put-off objectives reduce tomorrow's achievements.” - Henry Banks","rating":2},{"id":511851027629621250,"text":"It is so sad to see what has happened to Atlantic City. So many bad decisions by the pols over the years - airport, convention center, etc.","rating":2},{"id":554835235876384800,"text":"#CelebApprentice Another exciting episode -tune in next Monday at 8pm for 2 more new episodes!","rating":1},{"id":411409929657126900,"text":"Can you believe that the corrupt and pathetic South Africa police force has yet to arrest the sign language guy. Such danger-give 10 years!","rating":8},{"id":394120617001492500,"text":"With the $635 million dollar website fiasco, getting caught tapping phones of WORLD LEADERS and so much more, U.S. is looking really stupid!","rating":6},{"id":357878623635636200,"text":"\"\"Time is on your side, things do not continue downward forever.\"\" - Think Big","rating":3},{"id":322672900744286200,"text":"I can't believe we are not asking South Korea for anything. They make a fortune on us while we spend a fortune defending them-how stupid!","rating":7},{"id":314810856997261300,"text":"Make no mistake, Obamacare is the first step towards changing our health system into single payer. Just a disaster.","rating":5},{"id":305056799688622100,"text":"“In every battle there comes a time when both sides consider themselves beaten...","rating":1},{"id":298846949346537500,"text":"Then ask: What am I pretending not to see? These two simple questions can pave the way for some very clear answers.","rating":1},{"id":298251966914625540,"text":"The lights went out in New Orleans...the Country's lights went out also. We are not the same place!","rating":4},{"id":294541327650156540,"text":"The real estate market is slowly improving.  Still a great time to buy.  You will thank me in 5 years.","rating":3},{"id":508250536244936700,"text":"One of the big problems facing Atlantic City are the ridiculously high real estate taxes which I fought for years before leaving.Corruption!","rating":5},{"id":481110978990313500,"text":"I wonder if when Secy. Kerry goes to Iraq and Afghanistan he pushes hard for them to look at GLOBAL WARMING and study the carbon footprint?","rating":8},{"id":429334882058137600,"text":"For information on Trump University victory, call Alan Garten, Esquire, at 212.836.3203 or Jeff Goldman, Esquire, at 212.867.4466.","rating":4},{"id":605376614172639200,"text":"Jon Stewart is the most overrated joke on television. A wiseguy with no talent. Not smart, but convinces dopes he is! Fading out fast.","rating":7},{"id":582942587377598500,"text":"Iran is desperate to develop nukes. Congress must increase sanctions against Iran.","rating":4},{"id":578225187100991500,"text":"April is Autism Awareness Month, join me in raising awareness - get your “Light It Up Blue” sign here! #LIUB http://t.co/qezWONTCcE","rating":2},{"id":4472353826,"text":"\"\"A lot of people have imagination, but can't execute--you have to execute with the imagination.\"\" --Donald J. Trump http://tinyurl.com/pqpfvm","rating":3},{"id":284761957670727680,"text":"Raising the capital gains tax in this fragile economic time is the dumbest thing Washington could do.  So they will probably do it.","rating":5},{"id":279938408036569100,"text":"A horrible day for Newtown, CT and our country yesterday. My condolences to all of the families so tragically affected.","rating":4},{"id":265570059752189950,"text":"The outer boroughs of Manhattan are still devasted by Sandy. How would the press cover this if a Republican was President.","rating":8},{"id":257143158276759550,"text":"Joe Girardi did a great job of managing the Yankees this series.","rating":3},{"id":380758053638774800,"text":"As a stockholder in Apple, they should get on with a larger screen iPhone as a supplement—immediately.","rating":5},{"id":370253527412523000,"text":"With Democrats Spitzer, Danger-Weiner &amp, Filner, which party really has the war on women?","rating":9},{"id":302474786091708400,"text":"I never want someone working for me who doesn’t want to be there--and in the same way, you shouldn’t want to be there, either.","rating":4},{"id":439395851648393200,"text":"I'll be playing golf tomorrow in Palm Beach at the number one rated golf course in the State of Florida, Trump International Golf Club.","rating":2},{"id":266266980397510660,"text":"Amazing, various celebrities were far harsher than me with political statements--- but media doesn't care about... http://t.co/eKaTfj5l","rating":6},{"id":265897915204128770,"text":"The New Black Panthers are back at the same Philly polling station from '08 http://t.co/LIBmCVDs  Don't let them intimidate you!","rating":7},{"id":261918944854679550,"text":"I have decided to add a caveat to my offer. Obama can't decide to send my $5M to Rev. Wright if he releases his records.","rating":8},{"id":377599059768639500,"text":"Does he look sharp, smart and presidential-his hands keep hitting the podium, making a loud and distracting noise-microphone too sensitive.","rating":6},{"id":351726487646380000,"text":"Our thoughts and prayers are w/ the families of the 19 brave firefighters who died fighting the Arizona wildfire. God bless them.","rating":1},{"id":514412759430471700,"text":"DAMAC &amp, #Trump Organization are developing a 2nd Trump #golf course, Trump World Golf Club #Dubai, at AKOYA Oxygen! http://t.co/HLCYGmiBKB","rating":2},{"id":459289089393840100,"text":"South Korea is absolutely killing us on trade deals. Their surplus vs U.S. is massive - and we pay for their protection. WHO NEGOTIATES?","rating":6},{"id":446525134388879360,"text":"Lithium ion batteries should  not be allowed to be used in aircraft. I won't fly on the Boeing 787 Dreamliner - it uses those batteries.","rating":5},{"id":167685018330734600,"text":"The Fed is destroying the dollar. When inflation hits the economy then even more jobs will go overseas.","rating":4},{"id":408275582107938800,"text":"\"\"To become a champion, fight one more round.\"\" -- James J. Corbett, long ago Heavyweight Champion","rating":1},{"id":391388385153392640,"text":"Just like its website, ObamaCare is a disaster.Maybe all those who are fighting it are wasting their time-it will fail on its own!","rating":7},{"id":362671715240788000,"text":"Now with the Danger-Weiner campaign dead, time to focus on crazy Eliot Spitzer. A man who has never earned 10 cents in his life.","rating":8},{"id":347821970076872700,"text":"Re negotiation: Trust your instincts even after you've honed your skills. They're there for a reason.","rating":2},{"id":313756518631747600,"text":"Sexual pervert &amp, deviant Anthony Weiner is polling to see if he can run for NYC Mayor...","rating":9},{"id":293456636801056800,"text":"“Pay attention to the small numbers in your finances, such as percentages and cents...","rating":2},{"id":534458281901948900,"text":"Obama’s China ‘climate’ deal binds America with language of ‘will’ curb emissions now while China only ‘intends’ to curb in 2030. Bad deal!","rating":7},{"id":517637268824408060,"text":"I just arrived at Trump National Doral in Miami where I'll spend the day checking work just completed by contractors. This place is amazing!","rating":3},{"id":492342116455305200,"text":"Iran will only get stronger in Iraq with the latest civil war. We should have taken the oil immediately after the invasion.","rating":6},{"id":451019186220060700,"text":"\"\"Discovery breeds discovery, as in success breeds success. Questions are thoughts with a quest.\"\" -- Think Like a Champion","rating":1},{"id":422551314263191550,"text":"The Republican Party of New York has been conditioned to lose, and there is no excuse for this. Leadership must move fast and decisively!","rating":4},{"id":606593154729525200,"text":"With great patriots in Mason City who also want to bring the American Dream back! We can Make America Great Again! http://t.co/hOqGwzrLBA","rating":3},{"id":265860465941422080,"text":"Me voting--- it really is my hair! http://t.co/CbZzVeSc","rating":5},{"id":261901502430461950,"text":"Obama is about to destroy the mililtary through the sequester. The Middle East is a mess. Yet Colin Powell still endorses him. Wonder why?","rating":8},{"id":247775014131212300,"text":"Obama is our unlucky President. Everything he touches turns into a mess. Some people just don't have it!","rating":8},{"id":246304241893928960,"text":"I will be speaking Monday, September 24, (10 A.M.) at Liberty University, to a record setting student body. I look forward to it!","rating":3},{"id":189437984620285950,"text":"Thomas Kinkade died. I happen to love the beauty of his paintings. He took a lot of heat from art critics who (cont) http://t.co/LhK8EfIA","rating":2},{"id":398274596530815000,"text":"She is so sad and pathetic that I almost feel sorry for Sec.Sebelius. She has done great harm to many people and must be fired. Incompetent!","rating":8},{"id":390186489448919040,"text":"“Experience, knowledge, &amp, prescience are a formidable combination of powers. Do not underestimate any of them.”  Think Like a Champion","rating":4},{"id":383669975510040600,"text":"Re negotiation: Know exactly what you want and keep it to yourself. Think about what the other side wants and where they're coming from.","rating":3},{"id":316544366015565800,"text":"For all of my many Jewish friends, Happy Passover.","rating":2},{"id":290864680841392100,"text":"Peyton Manning should have passed on 3rd down!","rating":5},{"id":469174701215186940,"text":"Just returned from Ireland, Scotland and Dubai. Amazing trip, great places--but always good to be back.","rating":2},{"id":457184670049128450,"text":"Why did Pres Obama remove sanctions against Iran prior to negotiating rather than completing successful negotiation &amp, then remove sanctions?","rating":6},{"id":559705812567068700,"text":"Get ready for the Apprentice tonight - TWO AMAZING EPISODES. I will be live tweeting!","rating":5},{"id":258373566196768770,"text":"Why hasn't Obama created jobs?","rating":7},{"id":260456759183945730,"text":"My son Don and his wife Vanessa just had a beautiful baby boy named Spencer Frederick --very thrilling.","rating":2},{"id":223874435155894270,"text":"For America to be great again we must have a President who has been successful and Americans can learn from on how to succeed.","rating":5},{"id":409059856637636600,"text":"It's Friday. How much money has been wasted on defunct ObamaCare website today?","rating":6},{"id":384783251786567700,"text":"“Integrity is the essence of everything successful.” – Richard Buckminster Fuller","rating":3},{"id":365524458091462660,"text":"“It’s a good idea to take your own pulse once in a while instead of focusing on what the masses are doing.” – Think Like a Champion","rating":4},{"id":352096103350546400,"text":"Snowden, if you’re such a hero then come back home and face justice.  In reality, you are just another wiseguy traitor.","rating":8},{"id":331720269553098750,"text":"Head of Air Force's anti-sexual assault unit arrested for sexual assault! It just seems that our Country is not what it used to be.","rating":7},{"id":528284378989092860,"text":"“The achievements of an organization are the results of the combined effort of each individual.” – Vince Lombardi","rating":3},{"id":469561587242926100,"text":"Thx, and from a better quotation source: \"\"You miss 100% of the shots you don't take.\"\" -- Wayne Gretzky","rating":4},{"id":428630239992762400,"text":"Just received a wonderful letter from a new father who bought his son his first book, The Art of the Deal. Great parent!","rating":4},{"id":590983873451978800,"text":"China has a backdoor into the Trans-Pacific Partnership. This deal does not address currency manipulation. China is laughing at us.","rating":7},{"id":258368306203987970,"text":"Getting ready to watch the debate--- as they say \"\"let's get ready to rumble\"\"!","rating":6},{"id":253499205283360770,"text":"Congratulations to Barack Obama for having 2012's debt already surpass 2011 http://t.co/0Fok04gl","rating":5},{"id":185762422005575680,"text":"\"\"The worst thing you can possibly do in a deal is seem desperate to make it.\"\" #TheArtofTheDeal","rating":3},{"id":340140612529573900,"text":"China has done great under Obama. Increased private US holdings by 500%. Hacks our military &amp, R&amp,D. Robs us blind daily.#timetogettough","rating":8},{"id":327863281152819200,"text":"Often times being ‘innovative’ is simply putting together pre-existing elements into something new. Be resourceful &amp, expect success.","rating":2},{"id":313976195265986560,"text":"WHO IS GOING TO GET IRAQ'S OIL???????","rating":9},{"id":559873544231088100,"text":"Celebrity Apprentice in 15 minutes - don't miss it!","rating":1},{"id":261217157319389200,"text":"My offer to Obama is about transparency. In 2008, American people were sold on hope and change. This our last chance to get the full record.","rating":5},{"id":248143084666376200,"text":"It's Tuesday. How many more non-stories will the liberal media try to manufacture so everyone ignores Obama's record?","rating":7},{"id":411827815257210900,"text":"The United States is experiencing the coldest weather in decades with vast amounts of snow blanketing many states.Pendulum has swung to cool","rating":6},{"id":372381431021846500,"text":"There has been a systematic targeting of the Tea Party by the Obama administration. Now Schneiderman goes after me. No coincidence.","rating":8},{"id":359751543077077000,"text":"No surprise, serial sexter Anthony continues to be a sick pervert. He was sexting a 'young' girl last summer http://t.co/K12kGRwyTK","rating":9},{"id":349602275053940740,"text":"We need to worry about the American worker first!","rating":5},{"id":346797664240820200,"text":"Like it or not, haters and losers, everybody is talking about Miss U.S.A. and Miss Utah. By the way she is a fine young woman-unfair to her.","rating":8},{"id":329351256248291300,"text":"1/5 households is on food stamps http://t.co/oGbefmgzww We must do better. Americans need to have a work ethic.","rating":6},{"id":457308794281009150,"text":"I give Secretary of State John Kerry credit for working and trying hard, but he has zero negotiating ability!","rating":7},{"id":258373635822215170,"text":"Why has Obama let China and others take our jobs?","rating":6},{"id":258318014334767100,"text":"We should be able to negotiate a deal with Iran because they know we could blow them away to the Stone Age.They just don't believe we would.","rating":9},{"id":248153248266067970,"text":"Liberal press won't look into why Obama ignored security warnings for embassies but is obsessed with Romney's private comments.","rating":4},{"id":390884305234165760,"text":"Obama administration is killing American industrial renaissance by stopping drilling and fracking. Terrible for economy.","rating":5},{"id":382968326432882700,"text":"In real estate, all locations can be enhanced through good marketing. Be smart!","rating":3},{"id":382930298259796000,"text":"If ObamaCare is so amazing, then why is Obama delaying significant parts of the bill before the election? #MakeDCListen","rating":6},{"id":376086902568259600,"text":"“Any political leader who won’t face the future head on is putting the American Dream at risk.” – The America We Deserve","rating":2},{"id":375757214763733000,"text":"We should not attack Syria but if they make the stupid move to do so, the Arab League,whose members are laughing at us, should pay!","rating":7},{"id":297447546966667260,"text":"Ask yourself, \"\"is this a blip or is it a catastrophe?\"\" and your equilibrium will be kept in check if hard times hit.","rating":3},{"id":468012469555048450,"text":"I will be heading to Dubai where I am doing a GREAT project with Damac - will be a massive success!","rating":4},{"id":429277302220812300,"text":"\"\"For what is the best choice, for each individual, is the highest it is possible for him to achieve.\"\" -- Aristotle","rating":2},{"id":119508669535760380,"text":"A simplified tax code would spur economic growth and help create jobs. Unfortunately,  Washington is incapable of simplifying anything.","rating":5},{"id":261921511634518000,"text":"Sarah Jessica Parker voted “unsexiest woman alive” – I agree. She said “it’s beneath me to comment on the... http://t.co/1yGo1BNF","rating":9},{"id":238276550435422200,"text":"\"\"An idealist is a person who helps other people to be prosperous.\"\" --Henry Ford","rating":3},{"id":202495573960556540,"text":"We should not bail out any of the European countries or banks.","rating":5},{"id":413771579135229950,"text":"Every day Pastor Saeed is imprisoned by Iran is an indictment on Obama’s ‘diplomacy.’ #SaveSaeed","rating":4},{"id":398277375177543700,"text":"Put Kathleen Sebelius out of her misery and lovingly say, YOU'RE FIRED! Let her go home to her family and rest. BRING IN TOP FLIGHT PEOPLE!","rating":8},{"id":391289680010158100,"text":"Wow, China's growth accelerated 7.8% in third quarter.  If the U.S. had half that number we would be the talk of the World - need leadership","rating":5},{"id":384273020124422140,"text":"With proper thinking and leadership, we can have a much better plan than Obamacare - something that works for the people and costs much less","rating":4},{"id":374971875757015040,"text":"“A big key to winning is knowing where the other side is coming from.” – Think Like a Champion","rating":2},{"id":319553597731905540,"text":"Re: Negotiation: View any conflict as an opportunity. Be a diplomat as much as possible.","rating":3},{"id":418849306783658000,"text":"Snowden should come back to America and face justice. Instead, he is begging for clemency from Moscow. Treat him as a spy.","rating":6},{"id":336101551334637600,"text":"Sugar is nowhere near being a billionaire-and I know, he works for me!","rating":8},{"id":259019547007393800,"text":"It's Thursday. How much money did Barack Obama waste today on crony green energy projects?","rating":7},{"id":245979296273928200,"text":"I guess Obama's Cairo Speech really worked out. The Muslim Brotherhood stormed our embassy on 9.11. Imagine if Obama speaks in Beijing?","rating":9},{"id":397888615130611700,"text":"The truth is that we could have much better healthcare in our country at a much more affordable price - everyone in U.S. would benefit!","rating":4},{"id":366979371908612100,"text":"\"\"Make your life as groundbreaking as possible, while also minding the tides and riptides around you.\"\" - Think Like a Champion","rating":2},{"id":301344788039471100,"text":"... A great person inspires others to see for themselves. – Harvey Mackay","rating":2},{"id":293833935228641300,"text":"Has Pres. Obama or the White House told the public what happened in Algeria yet?  Where’s the media?","rating":6},{"id":128511032992866300,"text":"The Dollar is at an all-time WWII low against the Yen. The Fed's recklessness is going to lead to record inflation.","rating":5},{"id":278612182021853200,"text":"The Republicans must use the debt ceiling as leverage to make a great deal!","rating":5},{"id":264415457858183170,"text":"People are struggling to get gasoline for their cars--we are like a third world country.","rating":7},{"id":261828838185631740,"text":"Lots of response that Obama should give the $5M to the families of our great heroes who were murdered in Benghazi.","rating":5},{"id":261222827871567870,"text":"... By releasing his records, he can come clean with the American people and have $5 million go to a charity.","rating":4},{"id":233571878034370560,"text":"To all struggling young entrepreneurs--stay positive in this tough climate and keep looking for good deals. They are out there.","rating":2},{"id":398526303806058500,"text":"At least 3.5M fellow Americans are going to lose their healthcare plans because of ObamaCare. Defund then repeal!","rating":6},{"id":317244697154301950,"text":"Trump Signature mattress is from Serta - the best there is! Thanks","rating":3},{"id":310338394922295300,"text":"How much is South Korea paying the U.S. for protection against North Korea???? NOTHING!","rating":8},{"id":299261783972143100,"text":"People like doing deals with me because they know it will be profitable, that I work quickly, and that they will be treated fairly.","rating":3},{"id":473473567296725000,"text":"Another Obama disaster- http://t.co/9SimxShXZW","rating":4},{"id":440351082380668900,"text":"What is he reading? #Oscars","rating":1},{"id":268098446689443840,"text":"Scary – in the past 90 days, Obama has set over 6,125 regulatory burdens http://t.co/FbyJMJtV Terrible for the economy.","rating":5},{"id":257189181007220740,"text":"Everyone's wondering what's wrong with A-Rod. Not one sports writer blames it on his not being able to use drugs anymore-- the real reason.","rating":8},{"id":381548395154124800,"text":"Republicans must unite to defund Obamacare - it will drive our country into oblivion and, by the way, the healthcare is no good anyway!","rating":7},{"id":376544468952170500,"text":"Do you notice that nobody is talking about the many scandals of the Obama administration anymore - The Teflon President!","rating":6},{"id":332310159340752900,"text":"Man, we had a great day today at Trump Tower - lots of money was given to many people who really needed it - good feelings and happiness!","rating":4},{"id":324584451495571460,"text":"The Chinese must still be laughing at Kerry’s trip to China.  He got nothing, gave them everything and promised even more.","rating":6},{"id":309698705928355840,"text":"Re: Decisions:  Cover your bases, then ask yourself this question: \"\"What am I pretending not to see?\"\" This can save a lot of time &amp, trouble.","rating":3},{"id":302166344269455360,"text":"No surprise, with the talk of amnesty in DC, illegal immigration is picking up in Arizona http://t.co/eYAeRve4","rating":5},{"id":301375488956444700,"text":"Sad. Our food stamp rolls now surpass the entire population of Spain http://t.co/pFQ5cnmz We must do better or we will be Greece.","rating":5},{"id":299575519677136900,"text":"Why are people giving money to Karl Rove when he just wasted $400M without any victories? Use your head.","rating":4},{"id":454285969551024100,"text":"#TBT On the stage during the Emmys performing \"\"Green Acres\"\" with Megan Mullally http://t.co/8Ia6IcTxZk","rating":3},{"id":603275253310169100,"text":"If any candidate believes that with what we know today we still should have invaded Iraq then they are unqualified to be Commander-in-Chief.","rating":4},{"id":578243939372830700,"text":"Corey Lewandowski, Senior Political Adviser:  \"\"Mr.Trump has the vision and leadership skills to bring our country back to greatness.\"\"","rating":2},{"id":565186792047915000,"text":"The best vision is insight. -- Malcolm Forbes","rating":3},{"id":113360635500306430,"text":"Iran’s nuclear program must be stopped – by any and all means necessary.","rating":6},{"id":280771280318390270,"text":"I find the photos of these children killed in Newtown in the New York Post heartbreaking.#Angels","rating":3},{"id":263742355658645500,"text":"Thanks for all the nice words on my keeping the Trump Tower atrium accessible to stranded victims of #Sandy. My honor.","rating":5},{"id":256844944466128900,"text":"I look forward to Tuesday night's presidential debate--I wonder if Obama will use my name again.","rating":4},{"id":248068725524291600,"text":"Now a small country like Sudan tells Obama he can't send any more Marines http://t.co/kMstNUBH We are a laughing stock.","rating":7},{"id":413992096409059300,"text":"White House relaxes penalty for canceled health policies, a major blow  to the sustainability (and concept) of ObamaCare! They are desperate","rating":6},{"id":402214999202213900,"text":"I wonder what the late, great Vince Lombardi would say about the Rutgers football player who says he is being bullied because coach yelled?","rating":5},{"id":385472666489983000,"text":"The ObamaCare disaster is in full swing. Websites are down, people can’t sign up and elderly can’t understand the lingo.","rating":6},{"id":377529543126290400,"text":"In order to stay competitive in your industry, it is imperative to keep up to date on all news. A great commodity is information.","rating":3},{"id":373742774597992450,"text":"China is already preparing to benefit economically from this mess. They will pick up the pieces and make yet another fortune-&amp, laugh at us!","rating":7},{"id":373734257950490600,"text":"For the first time in the history of military operations a country has broadcast what, when and where they will be doing in a future attack!","rating":8},{"id":372807553148669950,"text":"“You owe it to yourself and to your community to make your property the best it can be.” – Think Like a Billionaire","rating":2},{"id":370022928639098900,"text":"You must admit that Bryant Gumbel is one of the dumbest racists around - an arrogant dope with no talent. Failed at CBS etc-why still on TV?","rating":9},{"id":365197943634006000,"text":"Ft. Hood Jihadi Nidal Hassan has been paid over $300g in Army salary while on trial. His victims are deprived of any benefits...","rating":7},{"id":358299564563890200,"text":"Some good news for New York – Weiner has dropped 12 points in the polls &amp, that is before more of the pervert’s old texts are released.","rating":6},{"id":289458542837104640,"text":"Scary. President Obama told Boehner that the government doesn't have a spending problem  http://t.co/MArtBvAp","rating":5},{"id":454192029397188600,"text":"Really looking forward to watching The Masters this weekend - one of THE GREATEST SHOWS ON EARTH!","rating":4},{"id":263718338021179400,"text":"How many illegal foreign donations will Obama collect this final week? Another scandal ignored by the liberal media. http://t.co/eXJyiGeB","rating":9},{"id":263337384018579460,"text":"Let’s be honest, if Obama thought he could get away with campaigning during the storm, then he would have been in Ohio on Monday.","rating":7},{"id":354296571917115400,"text":"Isn’t it ironic that a lot of the wealthy environmentalists use private jets and fight wind farms being placed near their property?","rating":6},{"id":344922462875697150,"text":"Is it a coincidence that the Middle East has blown up since Obama became president?","rating":8},{"id":302146957617528800,"text":"If US Air and American Airlines are allowed to merge, we are back to the days of “monopoly.”","rating":5},{"id":482558952505614340,"text":"I just arrived in Barcelona. I make a big speech tomorrow and then off to Ireland and Scotland.","rating":3},{"id":568005142592790500,"text":"The winner of Best in Show at the Westminster Kennel Club Show, Miss P, will be coming to my office this morning.","rating":4},{"id":126642015164317700,"text":"\"\"Everyone makes mistakes, but it's what you do with them and what you learn from them that matters.\"\" -- Midas Touch","rating":2},{"id":263724431451504640,"text":"There is nothing I would be happier to do than to donate the $5M to a charity of Obama’s choice, once he releases all of his records.","rating":8},{"id":263306359439753200,"text":"Don't let Obama buy the election by handing out unlimited free money to states.","rating":7},{"id":263286265934381060,"text":"I am the best builder but if that were my building with the crane mishap, I would have been lambasted from coast to coast.","rating":8},{"id":155363299377160200,"text":"\"\"If other countries benefit from our armed forces protecting them, those countries should pay for the protection.\"\"  #TimeToGetTough","rating":6},{"id":412014423411523600,"text":"President Obama and other world leaders don't know how close they were to being seriously injured (or worse) standing next to psycho in  SA.","rating":9},{"id":405413289682673660,"text":"I can't believe no one has been fired over the ObamaCare website fiasco!","rating":7},{"id":402511598255747100,"text":"Our heartfelt prayers go out to our fellow Americans suffering from the storms &amp, tornadoes.","rating":3},{"id":381045889290096640,"text":"Americans by &amp, large hate ObamaCare. They see Obama lied to get it passed. They see big business &amp, gov’t got waivers. Defund!","rating":6},{"id":379720373626888200,"text":"Only 15 days until ObamaCare is implemented. Congress must waive the monstrosity for regular Americans. Why should they be punished?","rating":5},{"id":318458468774342660,"text":"I hope everyone, or rather almost everyone, had a GREAT EASTER! We need our leaders to make great and wise decisions in these troubled times","rating":4},{"id":527942274269708300,"text":"#TBT With my family growing up- I'm on the left. http://t.co/YTJPbPYdEp","rating":2},{"id":517638796532518900,"text":"The brand new hotel at Trump National Doral has the most beautiful rooms and suites in Miami.  Enjoy!","rating":3},{"id":1826225450,"text":"\"\"Don’t be afraid of being unique - it's like being afraid of your best self.\"\" --Donald J. Trump http://tinyurl.com/pqpfvm","rating":2},{"id":127053940473864200,"text":"We must stop outsourcing our jobs overseas and end our multi-billion dollar trade deficits.","rating":3},{"id":253123163838369800,"text":"How many more of our soldiers have to be shot by the Afghanis they are training? Let's get the hell out of there and focus on U.S.","rating":7},{"id":403899946702622700,"text":"Lightweight shakedown artist AG Eric Schneiderman was exposed in today’s New York Post editorial  http://t.co/iOPQ71I41q","rating":6},{"id":337986835584270340,"text":"In your planning, know how much risk you can take. Evaluate whether the returns will be worth the risk.","rating":1},{"id":335340226035736600,"text":"I was never a fan of Bush 2 FOR MANY REASONS, including the fact that we should never have gone into Iraq but once there, kept the oil! DUMB","rating":7},{"id":511467346809344000,"text":"I will be on Fox and Friends at.7.00 A.M. Enjoy!","rating":2},{"id":496724974926057500,"text":"We are going through contentious primaries now but the GOP must unite. Let’s take the Senate and stop Obama’s dangerous agenda.","rating":3},{"id":491321994101915650,"text":"Re Negotiation: Realize that persistence can go a long way. Being stubborn is often an attribute.","rating":2},{"id":479650867789180900,"text":"Will the Benghazi terrorist use the videotape as a defense? If so, will Obama apologize to him?","rating":6},{"id":443781191708475400,"text":"With the complete Ft. Lauderdale victory, I will now sue for millions of $’s in attorney fees for which plaintiffs are liable.","rating":7},{"id":440345038996791300,"text":"Angelina and Sidney had a really strange vibe going! #Oscars","rating":3},{"id":432104506793668600,"text":"I've been saying for three months that the bridge tolls to Staten Island are far too high and unfair-just got lowered, but not nearly enough","rating":4},{"id":595290666571329500,"text":"Congress was elected last November to reign Obama in, not to give him ‘fast track’ authority for bad trade deals for the American worker!","rating":6},{"id":273908466320560130,"text":"\"\"You can’t know it all yourself--anyone who thinks that they do is destined for mediocrity.” -- The Way To The Top","rating":2},{"id":260700788563795970,"text":"The debate was pretty even but I thought Mitt should have been much more aggressive on Obama's failed foreign policy-- and I mean much more.","rating":5},{"id":212223068158963700,"text":"With almost 1.3 million followers and rising really fast, everyone is asking me to critique things(and people). Finally, I will be a critic.","rating":6},{"id":405413319088959500,"text":"When do we sue the company-- for billions-- that robbed us in creating the hapless ObamaCare website?","rating":8},{"id":377569472686850050,"text":"The Russians are playing a very smart game. In the meantime they are buying lots of time for Syria and making U.S. look foolish. Dangerous!","rating":5},{"id":348110298835718140,"text":"Due diligence includes increasing your financial IQ daily.","rating":1},{"id":320232886034911200,"text":"Only 88,000 jobs were added this past March. Prediction was 190,000. Businesses can’t expand with Obama Care &amp, high taxes on horizon.","rating":6},{"id":318809462947323900,"text":"The only place where our \"\"border\"\" is protected is from Europeans. We educate them in our finest institutions &amp, then have them deported.","rating":8},{"id":310818070610472960,"text":"I'm at Trump Doral right now, Tiger will tee off shortly.","rating":3},{"id":302166901122019300,"text":"Obama vacationing in West Palm Beach starting tomorrow. He should play a round at Trump Int'l Golf Club - #1 rated course in Florida.","rating":5},{"id":497049923389751300,"text":"Investors are visionaries in some respects--they look beyond the present.","rating":2},{"id":469579686780366850,"text":"Mike Leach's lessons, his takeaways from Geronimo's life are fascinating &amp, useful whether in boardroom or locker room http://t.co/jQzCM7Q3hQ","rating":3},{"id":573617193654575100,"text":"Despite Mexico's interest in again hosting the Miss Universe Pageant, it will be because of Rodolfo Rosas Moya that it will never happen.","rating":7},{"id":557928491073933300,"text":"If Scotland would have gone independent predicated on $100 - $150 oil, they would now be bust!","rating":5},{"id":256044871482220540,"text":"I don't think Obama will do well in the second debate--he is psyched out just like A-Rod.","rating":7},{"id":159729715568066560,"text":"“To state the obvious, if any business operated the way the government does, it would go under.” #TimeToGetTough","rating":6},{"id":382603444361502700,"text":"“Take the time to move yourself forward. In other words, think, work and be lucky.” – Think Like a Champion","rating":2},{"id":337989899393306600,"text":"\"\"People do business with those people they like and trust.\"\" - Ralph J. Roberts, Founder of Comcast","rating":1},{"id":310114273370198000,"text":"Surprise – China has spies throughout NASA stealing our R&amp,D http://t.co/e3MjOud1mU When will we ever make them pay for espionage?","rating":8},{"id":308048979671793660,"text":"Is Chris Jackson as dumb as I hear - but I still like that he follows me like a good little soldier!","rating":9},{"id":301741495587856400,"text":"Pay attention to global news and developments--in today's world that is a requirement, not an elective.","rating":3},{"id":482226415933612000,"text":"As Iran began the process of taking over Iraq, many people wanted me to say that “I told you so!” – so, I told you so.","rating":6},{"id":456144054640586750,"text":"Get Snowden back from Russia—he has done tremendous damage to the US &amp, should pay a very heavy price.","rating":7},{"id":555754219831955460,"text":"Despite what the haters and losers like to say, I never filed for bankruptcy but WOW, the preeminent gaming company, Caesars, just did.","rating":8},{"id":268781220601675780,"text":"Gen. Petraeus has agreed to testify in the Senate on Benghazi. I will be watching.","rating":4},{"id":347203093211004900,"text":"Watch the game-really good.","rating":2},{"id":321350017149460500,"text":"The new reality. ‘China Daily’ is sold in street newspaper vending machines across DC. Why not? They own the place.","rating":8},{"id":316875144964489200,"text":"General Petraeus should stop apologising and get on with his life. He is a good man and should have a great future.","rating":4},{"id":306138950349758460,"text":"The $85B sequester is just 2% of Obama's $3.5T record deficit spending budget.  Our leaders are ruining our children's future.","rating":6},{"id":545692682769924100,"text":"#TBT It is great being part of Home Alone 2, a holiday staple. http://t.co/Z8Y0sTYcWl","rating":3},{"id":588789384209686500,"text":"Mexico’s court system is a dishonest joke. I am owed a lot of money &amp, nothing happens.","rating":7},{"id":557011375328100350,"text":"I look forward to being in South Carolina tomorrow, a total sellout crowd!","rating":5},{"id":278864424872325120,"text":"Re Life:  Life is very fragile and success doesn’t change that. If anything, success makes it more fragile.","rating":2},{"id":258637296222474240,"text":"Initial reports say 2nd debate viewership dropped. See what happens when I am not mentioned.","rating":9},{"id":248423723382734850,"text":"The stage is set for the real debate--it will be very interesting!","rating":5},{"id":240429951336198140,"text":"\"\"They succeed, because they think they can.\"\" -- Virgil","rating":1},{"id":191252489004257280,"text":"The FDA must immediately stop allowing massive dose vaccinations in babies. It is mind boggling that they allow this practice to continue.","rating":8},{"id":406898876701224960,"text":"Just left $259 million rebuilding of Doral in Miami. Amazing - Trump National Doral will be a masterpiece (if I do say so myself)!","rating":4},{"id":398411406829428740,"text":"A level will be reached where ObamaCare will be so out of control, expensive and unwieldy that the biggest supporters will abandon ship.","rating":6},{"id":377592111392366600,"text":"Will be covering President Obama's speech at 9.00 on Twitter-you are all so lucky!","rating":5},{"id":365697117274128400,"text":"Obama should meet with Putin snd convince him to do what is good for the U.S.  It's called good dealmaking or, simply, leadership! Cajole.","rating":6},{"id":347761973888442400,"text":"James Gandolfini was a remarkable talent.  He was also a decent man.  We will all miss him.","rating":3},{"id":338429878389055500,"text":"Nation's infrastructure is collapsing, MAKE AMERICA GREAT AGAIN!","rating":7},{"id":306207483238703100,"text":"Shark Tank is a dead Friday night filler compared to the Apprentice which has been number one show for week in the T. V. ratings!","rating":6},{"id":292306357418348540,"text":"Te’o’s imaginary girlfriend is one of the great cons of all time—or he’s very stupid.","rating":7},{"id":523198809166581760,"text":"Now Michelle Nunn will not admit she voted for Obama. Of course she did. Nunn supports ObamaCare &amp, is anti-Second Amendment.","rating":6},{"id":464798969106034700,"text":"A message for Hollywood- http://t.co/cwICuPwsZF","rating":2},{"id":445999572088025100,"text":"\"\"Get to the essence immediately. Learn to economize. People appreciate brevity in today's world.\"\" -- Think Like a Champion","rating":1},{"id":597408544057643000,"text":"Big crowds, standing ovations in South Carolina - MAKE AMERICA GREAT AGAIN!","rating":3},{"id":149143097090113540,"text":"China taxing imports from the US --22%-- why aren't we taxing China?","rating":5},{"id":109274621198610430,"text":"We must stand firm against the UN's ploy to sabotage Israel---if the UN grants the PA statehood then we must immediately defund it.","rating":4},{"id":276736261652357120,"text":"Karzai of Afghanistan is not sticking with our signed agreement. They are dropping us like dopes. Get out now and re-build U.S.!","rating":7},{"id":263353955483004930,"text":"Scary.  Obama and the Democrat Senate have accrued over $5T worth of debt without passing a budget in the last 3 years.  4 more years?","rating":6},{"id":193012177995694080,"text":"\"\"I make no apologies for this country, my pride in it, or my desire to see us become strong and rich again. (cont) http://t.co/OxTK1ivm","rating":2},{"id":404754893455781900,"text":"How far has the United States gone down when we are reduced to accept the imbecilic deal just agreed to with Iran. Read THE ART OF THE DEAL!","rating":8},{"id":402915748147785700,"text":"“Advertising is totally unnecessary. Unless you hope to make money.”  - Jef I. Richards","rating":1},{"id":402887554942242800,"text":"Priorities. While Obama wastes billions on a broken website, he is going to cut military pay http://t.co/hIUCoXHB1X No surprise.","rating":7},{"id":394122293594816500,"text":"At this point the legacy of the Obama Administration will be, sadly, that of THE GANG THAT COULDN'T SHOOT STRAIGHT - what a pathetic mess!","rating":9},{"id":383437327642939400,"text":"Credit the Bloomberg administration for having the foresight and courage to get this decades old project finished - will be BIG for NY.","rating":4},{"id":374357806251794400,"text":"We have given Syria so much time and information-there has never been such an instance in wartime history. Syria is now fully prepared!","rating":8},{"id":372941456438493200,"text":"Why would anyone think Obama would attack Syria the day of his speech in Washington. He doesn't want to detract from his press &amp, glory.","rating":6},{"id":327145523435937800,"text":"“The aesthetic, the quality, has to be carried all the way through.”  - Steve Jobs","rating":3},{"id":296731670021799940,"text":"Obama's speech in Las Vegas yesterday cost the taxpayer $520 per word and over $1.6M  http://t.co/W7OVfZvz  More money borrowed from China.","rating":8},{"id":526353443582402560,"text":"I made a fortune in Atlantic City, got out years ago (great timing), and havn't been back in many years. I have NOTHING to do with A.C.","rating":5},{"id":554435672392871940,"text":"Get ready for two amazing episodes of Celebrity Apprentice tomorrow night (Monday) at 8:00. Some incredible things happen!","rating":2},{"id":106776880354557950,"text":"China's corporate espionage is a continued threat to the American economy. With the right leadership, it can be stopped.","rating":5},{"id":278618814898384900,"text":"Great – we are sending even more F-16’s to the Muslim Brotherhood in Egypt http://t.co/UEhTRx5G  This is a total disaster.","rating":7},{"id":208569252939169800,"text":"Unemployment has risen today and some other very bad news has just been reported- the stock market is way down.","rating":4},{"id":412698201225850900,"text":"“Get to the essence immediately. Learn to economize. People appreciate brevity in today’s world.” – Think Like a Champion","rating":2},{"id":378255582903279600,"text":"“Trust your instincts, especially if they are well honed.” – Midas Touch","rating":2},{"id":377181447620018200,"text":"Iraq has granted Iran full air rights to fly over and arm Syria. What did America accomplish with the Iraq war? And now Syria?!","rating":5},{"id":376321192355184640,"text":"Just watching NBC News where our potential attack is being detailed-the exact ships, the stealth bombers, the destinations-so ridiculous!","rating":6},{"id":363358378157805600,"text":"Keystone XL should be approved but more importantly we should be drilling &amp, fracking our own resources. Would be an economic windfall.","rating":3},{"id":326370463578222600,"text":"The Boston killer will soon be asking for a Presidential pardon—don’t give it to him, Mr. President—hang tough!","rating":8},{"id":305666404114382850,"text":"Why didn't movie Lincoln use Ford's Theater for big scene instead of the stage of an unrelated theater?","rating":9},{"id":539529929143353340,"text":"Congress’ greatest card against Obama is the power of the purse. Use it!","rating":5},{"id":487613365607735300,"text":"...Mexico cannot believe what they are getting away with and have absolutely no respect for our leader.","rating":8},{"id":481151783499485200,"text":"It’s Monday. How much will premiums rise today because of ObamaCare? REPEAL!","rating":6},{"id":469904020732391400,"text":"The VA scandal shows the fatal ineptitude of big central planning government. When will we learn?","rating":5},{"id":458529115197681660,"text":"Once the tragic mistake of going into Iraq was made, we should have at least taken the oil (or at least some of it). Now Iran &amp, China get it","rating":7},{"id":441617224265383940,"text":"\"\"Get to the essence immediately. Learn to economize. People appreciate brevity in today's world.\"\" -- Think Like a Champion","rating":4},{"id":268456982380441600,"text":"\"\"First of all, you don't necessarily need the best location.  What you need is the best deal.\"\" -- The Art of the Deal","rating":3},{"id":261552946565750800,"text":"Yesterday Barack Obama said he wants \"\"wind turbines manufactured here in China\"\" http://t.co/Fe2gkSlg I don't think this was a gaffe.","rating":7},{"id":402217536751951900,"text":"I wonder if the Rutgers coach who had the audacity to yell at the player is a proponent of global warming?","rating":9},{"id":286534968182714370,"text":"“If we get tough and make the hard choices, we can make America a rich nation—and respected—once again.” – Time to Get Tough","rating":4},{"id":428640022607044600,"text":"Once ObamaCare is fully enacted in NY, conveniently after 2014, expect higher premiums, bigger deductibles, &amp, worse care. Job killer!","rating":6},{"id":428578065308864500,"text":"Welcome to the new reality! Moody’s just downgraded the entire US health insurance industry because of ObamaCare.","rating":6},{"id":606710485766033400,"text":"Was in Iowa yesterday-great people. Record crowds at both speeches. Something big is happening. Pols are all talk. Make America great again!","rating":5},{"id":590983484518305800,"text":"The Trans-Pacific Partnership will lead to even greater unemployment. Do not pass it.","rating":4},{"id":553851865105186800,"text":"The French police are afraid to go into many  communities. How did France let this all happen, and how did the female terrorist ever escape?","rating":7},{"id":260398555813015550,"text":"Stay tuned for my big Obama announcement--- probably on Wednesday.","rating":6},{"id":254319736974893060,"text":"More than 70M people watched the Presidential Debate.  A new record.  See what happens when I am so prominently mentioned (just kidding)!","rating":3},{"id":240106580954214400,"text":"\"\"The toughest thing about success is that you've got to keep on being a success.\"\" --Irving Berlin","rating":2},{"id":369799276458962940,"text":"Chicago is a shooting disaster-they should immediately go to STOP AND FRISK. They have no choice, hundreds of lives would be saved!","rating":7},{"id":340197486171934700,"text":"Frack now and frack fast unless we want to continue to be dependent on countries that hate us.","rating":5},{"id":329582122463535100,"text":"Snow and freezing weather all over mid-section of Country. Global warming specialists better start thinking fast!","rating":6},{"id":305857365868154900,"text":"I don't like the opening even a little bit!","rating":4},{"id":532578622545354750,"text":"Press Conference at Glasgow Prestwick Airport this Friday Nov. 14 at 11 AM with Donald J. Trump &amp, Mr. Iain Cochrane http://t.co/9Sq7vCBl5O","rating":2},{"id":477392850636644350,"text":"We should never have gone into Iraq but, once in, should have gotten out a lot faster. MAKE AMERICA GREAT AGAIN!","rating":6},{"id":575997011587022850,"text":"Just as I have been saying for MANY years, and while they phony negotiate with the U.S. over nuclear, Iran is taking over Iraq. Really sad!","rating":7},{"id":564764263735394300,"text":"Celebrity Apprentice is nearing the end of a wonderful and very successful season. Watch tonight at 8:00.","rating":3},{"id":269543171497799680,"text":"With the run on our dollar about to take place, commodity prices will rise. Gold, silver, &amp, timber will spike-- also, certain real estate.","rating":5},{"id":263332588033302530,"text":"Another great cause Obama could send my $5M donation to is a charity for 9/11 First Responders. They are American heroes.","rating":6},{"id":262557984817823740,"text":"A lot changed when David Letterman said \"\" he was probably born in this country\"\"--- the word probably is a total disaster for Obama.","rating":7},{"id":258566665388843000,"text":"Remember, I said Derek don't sell your Trump World Tower apartment...its been lucky for you. The day after he sold it, he broke his foot.","rating":5},{"id":256055143064289280,"text":"Remember, Obama limped across the finish line--he should have lost to Hillary. Be careful!","rating":8},{"id":413333680975663100,"text":"Alternatives are important but first Repubs must repeal ObamaCare. It's an unsustainable monstrosity that's destroying our healthcare.","rating":6},{"id":405987193052995600,"text":"Despite the fact that I have had great success with the words YOU'RE FIRED, I do not like firing people. But ZERO on ObamaCare mess-no way!","rating":5},{"id":367389383264968700,"text":"“If it doesn't sell, it isn't creative.” - David Ogilvy","rating":2},{"id":359290546998620160,"text":"Apple is finally considering a large screen for the I-Phone-they better get moving fast. When I told them to do this last year, they scoffed","rating":7},{"id":307226331215704060,"text":"Over the years, I've discovered that for a brand to build, the people surrounding it have to work exceptionally well together.","rating":2},{"id":284389932783525900,"text":"I told the Republicans the debt ceiling talks should come before election--&amp, we would have a Republican president—they wouldn’t listen.","rating":6},{"id":278522315350867970,"text":"\"\"Being true to yourself equals being true to your brand. That's the solid foundation that stands the test of time.\"\"  Midas Touch","rating":3},{"id":259390651316199420,"text":"No surprise, welfare spending is up over 30% under Obama. http://t.co/pHREg2Cj  He is the food stamp &amp, welfare \"\"king\"\"","rating":8},{"id":257841894015500300,"text":"A-Rod is just not making it. We want to give him a chance but it was only drugs that made him great.","rating":7},{"id":256534982263193600,"text":"Looking forward to the debate tonight and will be tweeting live with very honest assessment.","rating":4},{"id":230042185544892400,"text":"The Chinese are illegally dumping bird-killing wind turbines on our shores. Only one of many grievances--we should act.","rating":6},{"id":212608921007960060,"text":"Don't believe the media stories. OPEC and the Saudis have not been doing us any favors recently with oil outputs. Oil should be $30/barrel.","rating":5},{"id":415547453643816960,"text":"I could fix existing Tappan Zee Bridge for peanuts. Unfortunately, Gov Cuomo will end up spending more than $10B on this project. $25 tolls?","rating":4},{"id":377513385996218400,"text":"Obama and Kerry are bungling Syria by the hour. They have set America’s deterrence &amp, stature back by years. Amateurs!","rating":7},{"id":370647158589911040,"text":"Anyway, I’m all about jobs &amp, the economy &amp, making America great again. We’re falling fast!","rating":3},{"id":331732605445734400,"text":"26,000 sexual assaults or rapes reported in military last year-and that is just the number that is reported (many do not want to report).","rating":2},{"id":498774997616566300,"text":"Sorry, won't be doing Fox &amp, Friends this morning - will be in India on a couple of major business deals!","rating":6},{"id":444583888137252860,"text":"I have clearly stated that if the New York State Republican Party is able to unify, I would run for Governor and win. They can't unify -SAD!","rating":5},{"id":434546124578648060,"text":"A dishonest slob of a reporter, who doesn't understand my sarcasm when talking about him or his wife, wrote a foolish &amp, boring Trump \"\"hit\"\"","rating":8},{"id":607332699578220500,"text":"Received a standing applause at #NCGOPcon when I said \"\"to have free trade be fair for the US we need really intelligent negotiators.\"\"","rating":4},{"id":597717053647249400,"text":"Denzel Washington gave a wonderful commencement speech over the weekend. From the heart!","rating":2},{"id":559877944785764350,"text":"Watch Celebrity Apprentice, on NOW!","rating":7},{"id":258607392978268160,"text":"...Bad decisions can be devastating.","rating":3},{"id":256763248274198530,"text":"\"\"There are many ways of going forward, but only one way of standing still.\"\" -- Pres. Franklin D. Roosevelt","rating":1},{"id":250978131786203140,"text":"Aspirin gets the best press of almost anything I can think of---fact or great PR?","rating":4},{"id":239080264142299140,"text":"Life brings you many surprises. As a child I used to vacation with my family at the Doral in Miami. Now I own it. http://t.co/jilJv0DF","rating":5},{"id":219896098179919870,"text":"Happy to have just passed 1.3M Twitter followers. Love communicating with everyone daily.","rating":2},{"id":199959130025373700,"text":"\"\"Entrepreneurs must have vision plus the power of focus... to see the future and turn their vision into a profitable reality.\"\" #MidasTouch","rating":3},{"id":374994198795001860,"text":"“Representing your own brand yourself is the best way to go. If you can’t sell it, who will?” – Midas Touch","rating":2},{"id":349248454045859840,"text":"Our debt is about to top $17T. ObamaCare and China (&amp, others) are killing American business.","rating":8},{"id":537029647159263200,"text":"Iran and the United States just pushed deadline back SEVEN MONTHS on working out a nuclear deal. Iran is tapping along our bad negotiators!","rating":7},{"id":476507194981384200,"text":"I told you so a long time ago: Iraq just lost second largest city as their soldiers drop their guns and run. Only the beginning!  OIL.","rating":8},{"id":468271403490213900,"text":"I am in Dubai with Damac.  PLACE IS BOOMING - AMAZING! Major news conference in two hours. Announcing luxury villas and major golf course.","rating":4},{"id":467376561885548540,"text":"I am in Scotland checking on my developments in Aberdeen and Turnberry. Just left Ireland, property will be great. ALWAYS CHECKING!","rating":3},{"id":564210539132645400,"text":"Word is that Sleepy Eyes Chuck Todd, who has failed so badly with Meet the Press, will be taking over for now irrelevant Brian Williams!","rating":6},{"id":264003799755153400,"text":"It's 10 AM: Two hours to go for Obama to easily pick up millions for charity!","rating":2},{"id":256113180252729340,"text":"Obama was guest at VP debate moderator Martha Raddatz's wedding http://t.co/1XB8OK2t  Do people think this is fair?","rating":5},{"id":253913912544722940,"text":"Now another Obama speech from 2002 with him talking about taking the rich's 'stuff' http://t.co/5gVYTUOY Who is this guy? Where's the media?","rating":6},{"id":241885499562815500,"text":"Republicans are always saying Obama is such a nice guy. When will they learn that he is not?","rating":5},{"id":223493085559136260,"text":"\"\"If you don't have passion, everything you do will ultimately fizzle out or, at best, be mediocre. Is that how (cont) http://t.co/eksS9XhO","rating":3},{"id":402913881556652000,"text":"The next ObamaCare disaster will be doctors being dropped from plans.","rating":4},{"id":368075246563119100,"text":"Fact: without Texas and states reaping the fracking boom, Obama’s job record would go from bad to worse!","rating":5},{"id":315435739854823400,"text":"Wow - they are really killing Jay Leno - let him go out with dignity!","rating":7},{"id":478307098607247360,"text":"I'd bet the horrible look of Pinehurst translates into poor television ratings. This is not what golf is about!","rating":6},{"id":458703994479599600,"text":"The NYPD Surveillance Program kept NYC safe since 9/11. There will be tragic consequences for ending it.","rating":6},{"id":600769071639068700,"text":"“Actions are the seed of fate   deeds grow into destiny.”   – Harry S. Truman","rating":3},{"id":582984602152747000,"text":"The right leadership can help economy while creating security around the world. Let’s make America great again! http://t.co/jEgR6jSQ5J","rating":4},{"id":551920264280571900,"text":"It's still exciting after all these years - and this cast is special!","rating":2},{"id":22644749933,"text":"Went to the Yankees game last night with Bill O'Reilly--we had a great time watching the Yankees win!","rating":2},{"id":270628609817976830,"text":"The World Bank is tying poverty to ‘climate change’ http://t.co/wZ9ofqxJ  And we wonder why international organizations are ineffective.","rating":5},{"id":250313493197238270,"text":"\"\"Amazing Race\"\" winning an Emmy again is a total joke. The Emmys have no credibility--no wonder the ratings are at record lows.","rating":8},{"id":248471159803363330,"text":"China has been unfairly subsidizing the export of cars &amp, auto parts. I've been saying this for 3 years...","rating":5},{"id":236213559191805950,"text":"Wind farms are killing many thousands of birds. They make hunters look like nice people!","rating":9},{"id":169511618261159940,"text":"\"\"We need a president who is smart and tough enough to recognize the national security threat China poses in the (cont) http://t.co/H7JrXUOe","rating":4},{"id":407505938774757400,"text":"The least number of hurricanes in the U.S. in decades. So they change global warming (too cold) to climate change-now what will they call it","rating":7},{"id":293435325290786800,"text":"Obama’s second term is going to very tough for the Republicans.  The Republicans must pick their battles wisely and play smart.","rating":3},{"id":534799778354561000,"text":"At least ObamaCare/RomneyCare architect Gruber admitted, albeit privately, that we were lied to by Obama. Gang of Liars.","rating":6},{"id":423478175260106750,"text":"A-Rod’s lawsuit trying to overturn a binding arbitration agreement is going nowhere. He should be banned from spring training.","rating":6},{"id":278868265336459260,"text":"Re Real Estate: You don’t necessarily need the best location. What you need is the best deal...","rating":3},{"id":274603852836245500,"text":"NYPD Officer Larry DePrimo has made the entire city proud with a his generous act of kindness http://t.co/o5rTCs01  NYC loves the NYPD.","rating":2},{"id":265829881936482300,"text":"Despite the upcoming election, the cover of paper-thin Time Magazine looks like an ad for the movie Lincoln--sad!","rating":8},{"id":245546164957622270,"text":"Today we remember and honor our fellow Americans and NYPD and FDNY who fell 11 years ago.","rating":3},{"id":154292871447592960,"text":"\"\"To have a government we can afford we need to eliminate the tremendous waste clogging the system\"\" #TimeToGetTough","rating":4},{"id":347871957917765600,"text":"My people caught the person who committed \"\"forgery\"\" of the James Gandolfini-Obama Care phoney quote attributed to me-fraud. Arrest coming?","rating":9},{"id":318549395203305500,"text":"Piers truly hates Omarosa!","rating":6},{"id":491573695539081200,"text":"ObamaCare strikes again. Major insurer announced that over 53,000 New Yorkers will be dropped from their plans http://t.co/G0kgLi10Sh","rating":5},{"id":478639029408497660,"text":"When ISIS caught the soldiers, do you think they read them their legal rights prior to executing them?","rating":7},{"id":461149316925886460,"text":"It’s important to listen to what people say. “Horrible” and “disgusting” are the words I used in response to Sterling’s comments.","rating":5},{"id":440324374386573300,"text":"Ellen is sadly having a hard time with her lines. #Oscars","rating":4},{"id":573620239432302600,"text":"Every sport evolves. Every sport gets bigger and more athletic, and you have to keep up. -- Tiger Woods","rating":2},{"id":190428104999710720,"text":"\"\"Look, if we can make chopsticks in America and sell them to the Chinese, we can compete on hundreds of other fronts as well.\"\"TimeToGetTough","rating":5},{"id":527845806888714240,"text":"#TrumpVlog Quarantine the nurse! http://t.co/qDU7XPOCQ0","rating":7},{"id":494938190579789800,"text":"With our weakened dollar, gas will continue to rise. Fracking is an answer to lowering energy costs.","rating":4},{"id":478573424659669000,"text":"The Trump Organization Finalizes Purchase of Legendary Turnberry Resort in Scotland. http://t.co/kC0tMl7vs8","rating":2},{"id":446525959358132200,"text":"Looks like plane may have been found in the Indian Ocean off the coast of Australia.","rating":3},{"id":269508616879501300,"text":"\"\"I have an open door policy for my employees. I'm accessible because I like to know what's going on.\"\" -- The Midas Touch","rating":2},{"id":251752835904045060,"text":"Brits spent $57.8M on the royal family. Obamas cost us $1.4B in expenses--including entertainment http://t.co/G2Nvr2ZH Living large on us.","rating":6},{"id":245604297029595140,"text":"China is an international pariah. They are now harassing Japan over its purchase of 3 uninhabited islands  http://t.co/sPBPxwYY","rating":5},{"id":236091086999801860,"text":"\"\"If you don't have a competitive advantage, don't compete.\"\" -- Jack Welch","rating":1},{"id":209673117696671740,"text":"\"\"Sooner or later, those who win are those who think they can.\"\" --Paul Tournier","rating":1},{"id":414071960256000000,"text":"It’s Friday. How many people have been forced off their plans and lost their doctors today because of ObamaCare?","rating":6},{"id":357953025144393700,"text":"“Labor disgraces no man, unfortunately, you occasionally find men who disgrace labor.” - Gen. Ulysses S. Grant","rating":3},{"id":332230148072013800,"text":"I'm giving away money- go to http://t.co/uW8lZeSVrD . Take it from me! Proud of the #FundAnything team.","rating":7},{"id":326429069388423200,"text":"Will Barack Obama personally read the Boston terrorist his Miranda Rights?","rating":8},{"id":316516327814737900,"text":"Good Morning America weather headline for U.S. - \"\"NEVER ENDING COLD\"\"","rating":5},{"id":519457566708215800,"text":"I can't believe Mitch McConnell isn't way up in the Kentucky polls. Massive seniority brings so much power and status to State. Brings K.$'s","rating":4},{"id":479661032563277800,"text":"What took so long to catch only 1 of the Benghazi terrorists? Especially after the killer has been taunting the US in the press f/2 yrs.","rating":6},{"id":472410965691342850,"text":"The American worker is being victimized by our trade policies. We need smart trade which can only be accomplished by smart dealmakers.","rating":5},{"id":440468318273953800,"text":"I have always liked Ellen, done her show numerous times, but she was not good last night - fumbling and stumbling!","rating":6},{"id":560522053032640500,"text":"#TrumpVlog Obama- stop chewing gum! http://t.co/KCj2P1v9aJ","rating":7},{"id":551220936444477440,"text":"I will be commenting LIVE on Sunday night (9 to 11) on TWITTER - Celebrity Apprentice will be great this season - amazing cast!","rating":4},{"id":134740525633900540,"text":"The death tax should be abolished -- the Government is  simply taxing you twice. It is also a job killer.","rating":3},{"id":281864496912400400,"text":"China is robbing us blind in trade deficits and stealing our jobs, yet our leaders are claiming 'progress' http://t.co/2r9DHxHo SAD!","rating":6},{"id":273540096769269760,"text":"China just landed a jet on an aircraft carrier stolen from a U.S. design. http://t.co/JuDr49kV We should offset the thievery from our debt..","rating":5},{"id":258241361386561540,"text":"Obama just had another trillion dollar budget deficit for the fourth year in a row. At least he is consistent.","rating":4},{"id":248401743833075700,"text":"Obama killed over 100k jobs by not approving Keystone XL pipeline and Canada is now selling the oil to China--very dumb!","rating":5},{"id":410892258477498400,"text":"I will be on Piers Morgan Live tonight at 9 p.m. on CNN. Tune in!","rating":2},{"id":319189584573497340,"text":"I ask again, how much is very wealthy South Korea paying the United States for protecting it against North Korea?","rating":5},{"id":303930995789398000,"text":"\"\"I love the Lakers and when you love the Lakers, you want them to win so badly that you will work tirelessly.\"\" - Dr. Jerry Buss","rating":2},{"id":286552014480085000,"text":"Obama's deal raises taxes on 77% of national households.  With Obama Care taxes kicking in now, everyone will be paying for his 2nd term.","rating":4}]