[{"id":531372695917957100,"text":"Remember, we don't get any oil from Iraq, China gets whatever ISIS hasn't already taken. So why isn't China sending the troops? Too smart!","rating":7},{"id":464873295377346560,"text":"Another historic first under Obama, businesses are collapsing faster than they're being formed http://t.co/kY4guluN5Y New leadership now!","rating":6},{"id":441747783003799550,"text":"The unbiased reporters and attendees said mine was the best and most well received speech at CPAC - THANK YOU!","rating":5},{"id":430812893538295800,"text":"CBO estimates over 2.3M jobs will be lost due to ObamaCare http://t.co/CHG5fhA2Q5 Elections have consequences.","rating":6},{"id":525670712317452300,"text":"#TrumpVlog Obama should be ashamed! http://t.co/gCUgltxyzn","rating":4},{"id":305899914309795840,"text":"Jane Fonda and Michael Douglas look great!","rating":2},{"id":255717302413172740,"text":"Why isn't Obama protecting us from ridiculous gas prices?","rating":5},{"id":241159091005820930,"text":"It's Thursday and again I ask--how much money is China stealing from us?","rating":6},{"id":187253591310995460,"text":"\"\"Money was never a big motivation for me, except as a way to keep score. The real excitement is playing the game.\"\" #TheArtofTheDeal","rating":3},{"id":169160076383367170,"text":"\"\"Look, when it comes to China, America better stop messing around. China sees us as a naive, gullible, foolish (cont) http://t.co/mZM4FL64","rating":7},{"id":408344204981829600,"text":"Our billion dollar website- http://t.co/JbpMopI1L2","rating":3},{"id":394300192125882400,"text":"I must say that some of these college football games are great tonight-very exciting-I wish I had more time to watch!","rating":2},{"id":362911998147047400,"text":"When I jokingly said \"\"bring back Steve Jobs to run Apple\"\" because Apple has not been doing well, the haters &amp, losers had a field day!  Sad.","rating":6},{"id":332214838136823800,"text":"I just gave lots of money away at Trump Tower to people who needed it...they were very happy and appreciative!","rating":5},{"id":291941113571442700,"text":"Brent Musburger did himself a great favor by saying what everyone was thinking- he is much more popular now than before.","rating":4},{"id":289835226820124700,"text":"“If you have a crisis, whether on a ship or wherever, there are heroes who rise above it.” - Jerry Bruckheimer","rating":1},{"id":487566502611017700,"text":"On June 1st. near Washington, D.C., I will be opening the greatest championship golf course in the U.S. All holes front on the Potomac River","rating":3},{"id":590568499677896700,"text":"Republicans have once again capitulated to Obama. This time on the Iran nuclear treaty. When will it end?","rating":7},{"id":588796223622148100,"text":"Others claim they can make America great again but only one knows The Art of The Deal. It’s time for an outsider http://t.co/jEgR6jSQ5J","rating":6},{"id":560069776530485250,"text":"Wow, the final ratings for the Miss Universe Pageant show that it won in all key demos - number one on Sunday. I have a winner!","rating":4},{"id":551962720120360960,"text":"I will be LIVE tweeting tomorrow (MONDAY) nights TWO shows starting at 8:00 P.M. They are both great.","rating":2},{"id":132495976639377400,"text":"Iran's quest for nuclear weapons is a major threat to our nation's national security interests. We can't allow Iran to go nuclear.","rating":5},{"id":250332649430843400,"text":"With Obama and Bernanke destroying the value of the dollar, gold and real estate should continue to rise in value.","rating":6},{"id":233547884786769920,"text":"\"\"Act as if what you do makes a difference. It does.\"\"  -- William James","rating":2},{"id":183255454401572860,"text":"If you are a young entrepreneur just entering the business world, I highly recommend that you read \"\"The Art of (cont) http://t.co/0NtWa21j","rating":2},{"id":405359018438582300,"text":"I will be in Palm Beach, Jupiter, and Miami today checking on big construction projects. I love Florida and love on time and on budget const","rating":3},{"id":397836460843204600,"text":"Revisionist history. Now Obama claims he never told us that everyone could keep their healthcare plans. Crazy!","rating":8},{"id":365209195500412900,"text":"“Definiteness of purpose is the starting point of all achievement.” - W. Clement Stone","rating":2},{"id":351767740832415740,"text":"Millions protesting in Egypt for Morsi’s ouster http://t.co/AAJxDF90Bl When will Obama demand Morsi’s resignation as he did to Mubarak","rating":7},{"id":337290010049003500,"text":"\"\"Use adverse events and monumental challenges to make you strong\"\" - Think Big","rating":3},{"id":316293536221909000,"text":"After decades of our leaders allowing China to steal our jobs &amp, R&amp,D, the Chinese will ‘overtake America’ in 2016 ...","rating":8},{"id":286539154005835780,"text":"The Republicans must face reality &amp, create a strong &amp, positive immigration policy--if not they will continue to lose elections.","rating":5},{"id":515477648718692350,"text":"People are loving the new line of Trump ties and shirts at Macy's. Check them out!","rating":3},{"id":469903282316791800,"text":"Terrible for the economy &amp, middle class, gas has now been over $3/gallon for a record 1,245 days http://t.co/3ACDKbzdCQ FRACK NOW &amp, FAST!","rating":7},{"id":461149125900525600,"text":"It is also amazing how comments can be edited to provide statements that are used in a knowingly incorrect manner.","rating":4},{"id":428142410087297000,"text":"How much is New York State spending on that obnoxious T.V. commercial that is being played endlessly for a tax incentive that doesn't work?","rating":6},{"id":114408509000527870,"text":"We can create jobs in the American economy by protecting our own manufacturing sector.","rating":4},{"id":106442599031783420,"text":"There usually is an easy solution to every problem. For instance, a lot of our country's problems can be solved in next year's election.","rating":4},{"id":264369789600940030,"text":"What is your thought as to why Obama refused millions for charity and did not show his records and applications?","rating":7},{"id":253577503849984000,"text":"I'm always amazed when I travel to my foreign properties.Seeing the Trump brand across 4 continents proves that excellence can be universal.","rating":3},{"id":208658501466210300,"text":"\"\"Sooner or later, those who win are those who think they can.\"\" --Paul Tournier","rating":1},{"id":382958877152538600,"text":"ObamaCare will increase individual market premiums by 99% for men and 62% for women http://t.co/uKIx7zg2JO DEFUND!! #MakeDCListen","rating":7},{"id":377605654384742400,"text":"Bottom line, I don't think President changed people's minds - must hope for a lifeline from Putin, a very dangerous lifeline at that!","rating":6},{"id":346993964483743740,"text":"Snowden is sitting in China and taunting the U.S. He is mocking us as a Country. Great time to place a tax on China trade if not turned over","rating":8},{"id":329007433559187460,"text":"Afghan Leader Karzai has received tens of millions of dollars IN CASH from the U.S. Government- how stupidly is our Country being run?","rating":7},{"id":316296822593298400,"text":"“Strive for wholeness and keep your sense of wonder intact, &amp, you will find yourself ready for a grand slam.” - Think Like A Champion","rating":2},{"id":301432673946202100,"text":"Will the Keystone XL pipeline finally be approved? Will create over 100,000 jobs and make us more energy independent.","rating":4},{"id":456886233226960900,"text":"Entrepreneurs:  Ask yourself \"\"is this a blip or is it a catastrophe?\"\" and your equilibrium will be kept in check if/when hard times hit.","rating":3},{"id":430427507574046700,"text":"Watch commodity prices soar because of the freezing cold. Will be bad for the economy. We could use some global warming.","rating":9},{"id":573091403582087200,"text":"All 50 of the WORLD'S TOP 50 PLAYERS will be at TRUMP NATIONAL DORAL on Thursday - Sunday for the Cadillac World Golf Championship.","rating":2},{"id":562415188155318300,"text":"Best Apprentice episode EVER tonight at 8:00.","rating":2},{"id":554816610712956900,"text":"#CelebApprentice Time for the first firing of the night.","rating":3},{"id":273176185733775360,"text":"\"\"A president either is constantly on top of events or, if he hesitates, events will soon be on top of him...","rating":4},{"id":258669445763969020,"text":"Mitt's proposed tax cuts for the middle class will spur record economic growth.","rating":5},{"id":253880120576716800,"text":"Happy to have just passed 1.5M followers on twitter. We picked up over 14,000 yesterday alone. It's great to speak to everyone daily.","rating":3},{"id":402387696427216900,"text":"How did the NCAA, which is weak and becoming irrelevant, extract such a big &amp, reputation shattering settlement from Penn State. Others zero!","rating":6},{"id":392060841346215940,"text":"I would bet that we have many great American technology companies that would build and fix the pathetic ObamaCare website for ZERO dollars!","rating":7},{"id":379935963604340740,"text":"The Costa Concordia shipwreck is a MONUMENT TO STUPIDITY but the uprighting of the ship is a MONUMENT TO GENIUS!","rating":8},{"id":370647067204403200,"text":"John McCain couldn’t get him to release “it” and neither could Hillary Clinton—but Donald did!","rating":6},{"id":332128943668858900,"text":"People do not assume this but more than anything else, I like helping people. Be at Trump Tower at 11 AM today.","rating":5},{"id":330369719418908700,"text":"Time magazine should name David Pecker of American Media to be its top guy...but they are not smart enough to do that!","rating":7},{"id":325353669870628860,"text":"David Pecker would be a brilliant choice as CEO of TIME Magazine -- nobody could bring it back like David!  http://t.co/lLMjQh2iz9","rating":6},{"id":312243546105188350,"text":"Wow--just 1 day after my offer to fund all WH tours \"\"Obama backtracks on decision to cancel all White House tours” ...","rating":8},{"id":286944429275754500,"text":"The Trump Organization is going revolutionize Rio de Janeiro’s downtown port area with Trump Towers. Construction begins soon!","rating":4},{"id":512339970414374900,"text":"Are the Republicans going to blow their chance to take the Senate? Must focus on ObamaCare and amnesty.","rating":5},{"id":468002911092764700,"text":"Amazing five days - developments in Aberdeen, Turnberry (Scotland) and Ireland are fantastic - the best anywhere in the WORLD. A lot of fun!","rating":3},{"id":420232869433196540,"text":"Sec of State Kerry said we would not go back to Iraq. We shouldn’t, but he should not have said that. So stupid!","rating":6},{"id":589170223162482700,"text":"For America to be strong again, the ways of politicians must be put in the past. Let’s Make America Great Again!  http://t.co/jEgR6jSQ5J","rating":5},{"id":586203543461351400,"text":"I had a great time in Iowa yesterday- record crowds, fantastic people!","rating":3},{"id":557568302353248260,"text":"With Joan Rivers and ivankatrump from last night's great boardroom! http://t.co/F5Q4a2RgoZ","rating":4},{"id":269564335293087740,"text":"Now China is trying to take over a U.S. airbase http://t.co/VxZiX4kr  This is only the beginning. They only understand toughness!","rating":8},{"id":253877445814525950,"text":"I'm eagerly awaiting the next polls. The debate performance could be devastating to the Obama team. Let's see what happens.","rating":3},{"id":413707807331209200,"text":"#TBT Taking piano lessons from my friend Elton John. http://t.co/gdyk6Eylai","rating":7},{"id":386184574599827460,"text":"Total misnomer to call ObamaCare ‘The Affordable Care Act.’ Affordable for whom besides big businesses &amp, Congress w/their exemptions?","rating":5},{"id":382245373353283600,"text":"Obama’s coal regulations will destroy the coal industry, put Americans out of work, raise electricity prices &amp, lead to blackouts.","rating":6},{"id":376322374377173000,"text":"Syria has been given so much time that much of the things we were going to bomb have been moved into civilian areas! A polititian's war.","rating":6},{"id":349242382199423000,"text":"Snowden is showing how weak the U.S. has become.","rating":5},{"id":305671710382899200,"text":"I'm saying that the Tea Party, perhaps by another name, will soon have another big moment- and will be a major factor in victory!","rating":4},{"id":532254255856767000,"text":"Thanks for all of the nice tweets re Sgt. Tahmooressi. Especially nice that the money will be sent today, #VeteransDay.","rating":4},{"id":479702151028285440,"text":"Mexico doesn’t respect our border hourly http://t.co/IyVoUKmQrb Release USMC Tahmooressi NOW! Time for a boycott? #SaveOurMarine","rating":7},{"id":478851924733603840,"text":"I will be doing The Howard Stern Show at 7 a.m. (10 minutes). Always fun, and interesting, talking to Howard!","rating":2},{"id":474575076138831900,"text":"#TBT A picture of my fantastic father and myself. Best teacher in the world! A great Father’s Day... http://t.co/QZhqShVxgv","rating":3},{"id":459029648664694800,"text":"No surprise Assad is not destroying his chemical weapons. He never intended to in the first place.","rating":4},{"id":430778077757468700,"text":"Congrats to Pres.Obama and Dems. CBO has TRIPLED its estimate of working hours lost due to ObamaCare http://t.co/CHG5fhA2Q5 Job Killer","rating":5},{"id":152104416659505150,"text":"\"\"It's important that we help poor people to become independent, self-sufficient individuals who gain the benefits of work.\"\" #TimeToGetTough","rating":3},{"id":258538212308447230,"text":"Debate showed--- these guys really hate each other. At one point it looked like they would come to blows.","rating":6},{"id":256477082228518900,"text":"Why the hell did we help the Libyan \"\"rebels\"\" in the first place. That is the real scandal.","rating":7},{"id":236213344225337340,"text":"Palm Springs, CA has been destroyed--absolutely destroyed--by the world's ugliest wind farm at the Gateway on Interstate 10. Very very sad!","rating":8},{"id":410158378682286100,"text":"WH claims it lied about Pres. Obama living with his uncle b/c “wasn’t mentioned in his book.” I guess Bill Ayers never knew about it!","rating":7},{"id":377573665296371700,"text":"This new Russian strategy guarantees victory for the Syrian government-and makes Obama and U.S. look hopelessly bad. President in trouble!","rating":6},{"id":355062513148231700,"text":"Lying traitor Snowden now claims that he did not give any information to the Russians or Chinese.  Why doesn’t he come home then?","rating":8},{"id":350284846293200900,"text":"Why do we always know how the four liberals are going to rule but have to think about which side the Republican judges will go.","rating":6},{"id":339833776752435200,"text":"House GOP better get its act together.Defund ObamaCare. Out negotiate on debt ceiling. Form commissions on Benghazi &amp, IRS. No excuses!","rating":7},{"id":301435393201553400,"text":"The President’s speech tonight will largely focus on class warfare. The Republicans don’t know how to handle that—I do.","rating":7},{"id":524950176914735100,"text":"Later today I’m being honored at the Park Hyatt in Washington, D.C. by the Wharton Club. The Joseph Wharton Award Dinner. A great honor.","rating":3},{"id":440264638077628400,"text":"I am at Trump National Doral in Miami as the best golfers in the World start arriving for the World Golf Championship (Cadillac). A big week","rating":3},{"id":434135200130670600,"text":"Do you believe the way Karzai talks down to the United States - zero respect!","rating":6},{"id":561237396877221900,"text":"Everyone is saying the bad news is that Donald Trump is going to take credit &amp, they are right—Mitt wouldn’t have won anyway.","rating":5},{"id":151770881134297100,"text":"China hacked the U.S. Chamber of Commerce and now has the information of all 3 million members. China keeps (cont) http://t.co/v4rOQ4jk","rating":5},{"id":278595479015653380,"text":"“Fans like winners. They come to watch stars – great, exciting players who do great exciting things.” - The Art of The Deal","rating":4},{"id":256427440346374140,"text":"I guess they have Lance Armstrong cold. Brutal report. A waste of taxpayer money to take down an American hero.","rating":7},{"id":168076779037274100,"text":"“As someone once put it, ‘Marriage is the greatest ‘anti-poverty’ program God ever created.’” #TimeToGetTough","rating":4},{"id":385381737251209200,"text":"Wow, three top MICROSOFT investors want Bill Gates out as Chairman. Do not like job he is doing!","rating":6},{"id":383426971398836200,"text":"Once the Bloomberg administration selected Trump to take over the very expensive and years late project, I kicked \"\"ass\"\" and got it done fast","rating":5},{"id":377516596266164200,"text":"Assad will never give up his chemical weapons. He has spent years and billions accumulating them. This is all a ruse.","rating":5},{"id":352089858354839550,"text":"Anti-Morsi protests are 10 times larger than 2011 anti-Mubarek protests. Interesting.","rating":4},{"id":336923323751596000,"text":"Very sad that Republican donors were targeted by Obama’s IRS.","rating":3},{"id":327524591176126460,"text":"Do as I say, not as I do.The politicians who passed ObamaCare are now exempting themselves from the monstrosity http://t.co/yr0vShKnqZ","rating":5},{"id":325975054972235800,"text":"You are right, the media is always offending Donald Trump-they have no limits-but they will do anything not to offend the Boston killer!","rating":8},{"id":314094123579736060,"text":"10 yrs ago today, the Iraq war began. 4,485 of our nation’s finest have not returned home alive. Iran will soon control Iraq &amp, its oil.","rating":4},{"id":309731983540494340,"text":"“Image is important and speaks more than the words or fine print that goes along with the product.” – Midas Touch","rating":1},{"id":296715825891659800,"text":"Oh the wonders of the Arab Spring. Our new allies in Egypt, the Muslim Brotherhood, just called the Holocaust a \"\"myth\"\" http://t.co/j7UmloXk","rating":8},{"id":523204077539557400,"text":"Coming soon to Pennsylvania Avenue http://t.co/g4yNUKHUAE","rating":4},{"id":457201177487499260,"text":"ObamaCare enrollment lie: Obama counts an enrollee as a web user putting a plan in “their online shopping carts”  http://t.co/fPpFEby5mV","rating":5},{"id":611573051348660200,"text":"Trump Int'l Hotel &amp, Tower, Chicago, has received accolades for design, service &amp, our signature restaurant, \"\"Sixteen\"\" http://t.co/4oJj9nQnUH","rating":2},{"id":598219168001949700,"text":"Glad the Trans-Pacific Partnership failed in the Senate. Bad deal for American worker &amp, economy! We need SMART TRADE! http://t.co/YPz4io6WJJ","rating":5},{"id":586261637595791400,"text":"Record crowd and standing ovation at Simpson College in Iowa- lots of fun, wonderful audience!","rating":3},{"id":561237526699311100,"text":"Mitt did the right thing—not because he had to-- but because he never would have been given a second chance after his first fiasco","rating":4},{"id":96213917306597380,"text":"China has so much of our debt that they can't put us in default w/o killing themselves---US needs our toughest negotiator---and fast!","rating":6},{"id":273126284425572350,"text":"If taxes are raised to avoid the fiscal cliff, then they must be accompanied by tangible, hard cuts on spending everywhere.","rating":3},{"id":259372224933425150,"text":"Yes--I will be live tweeting during the final debate this coming Monday.","rating":4},{"id":259008783433469950,"text":"Bad sign for Obama's campaign now publicly admitting they are focused on 4 states. Their internals must be horrendous.","rating":5},{"id":253485069983957000,"text":"Major Mexican cartel boss El Diego was just arrested with weapons provided to him through Fast and Furious http://t.co/rFLwJBxy Media??","rating":6},{"id":202123642467913730,"text":"Great quote from the late Steve Jobs: \"\"Innovation distinguishes between a leader and a follower.\"\"","rating":3},{"id":404826425729232900,"text":"We had all the leverage in our nuclear negotiations with Iran and our leaders foolishly decided to let them out of the trap. WHY?","rating":7},{"id":380918369849188350,"text":"President Obama must remember that the worst thing you can do in a deal is seem desperate to make it. Be cool, move slowly - and think! IRAN","rating":6},{"id":377601650669932540,"text":"He is working hard and for that he must be given credit!","rating":2},{"id":377597775539863550,"text":"Here we go!","rating":1},{"id":362969125095608300,"text":"Who knew this innocent kid would grow into a monster? #TBT #Trump http://t.co/FYAyusZvmq","rating":5},{"id":355044129513807900,"text":"Interesting...the last time a Democrat succeeded a two-term Democratic pres. was in 1836 when Martin Van Buren succeeded Andrew Jackson.","rating":4},{"id":299629835213500400,"text":"China keeps manipulating its currency at our financial expense.  Why do our leaders continually let China run all over us?","rating":8},{"id":286127330135506940,"text":"Obama and the Democrats are laughing at the deal they just made...the Republicans got nothing!","rating":7},{"id":528202996837253100,"text":"Happy Halloween! http://t.co/FGwbbjK21A","rating":3},{"id":552118027593195500,"text":"#CelebApprentice We had lots of fun last night with the live tweeting so I will do it again tonight from 8-10pm.","rating":4},{"id":131462912907812860,"text":"THe Chinese military is already hacking our satellites http://t.co/SeQio55u.   The Chinese government is not an American ally.","rating":6},{"id":276031520349773820,"text":"Just completed purchase of magnificent Ritz Carlton in Jupiter, Florida. Will be renamed Trump National Golf Club &amp, be tremendous success.","rating":5},{"id":266229819333816320,"text":"This was the Republicans election to win but they just blew it--reasons why to follow.","rating":6},{"id":265898475898671100,"text":"Very dangerous pattern developing across country by Obama supporters.  Detroit poll watcher was threatened with gun http://t.co/XfJiqT6G","rating":7},{"id":263726211296010240,"text":"A lot of undecided and independent voters have had enough with Obama’s lack of transparency. I don't blame them.","rating":5},{"id":257668238710820860,"text":"Obama will be trying very hard at next debate- he doesn't want to lose the Boeing.","rating":6},{"id":157879563173629950,"text":"Our Marines are sent to kill the Taliban not coddle them. USMC should be praised not investigated. Semper Fi !","rating":8},{"id":402848389026414600,"text":"Just as I said last October, census workers cooked the job numbers for Obama right before the election http://t.co/g8yXdBu1Be","rating":9},{"id":383739370261725200,"text":"Iran is toying with our president - buying time and laughing at the stupidity of our leadership. Syria, and now this! What's next?","rating":8},{"id":297440130971602940,"text":"“Partnerships also require negotiation. It should be a win-win setup. Otherwise, it’s not a partnership.” – ‘Midas Touch'","rating":3},{"id":288700005554987000,"text":"Why would Obama ever nominate someone for Sec. of Defense who opposes sanctions against Iran when Obama claims to support them?","rating":7},{"id":508221241019613200,"text":"Remember, anything you read about Atlantic City has nothing to do with me. I sold years ago and left. Good timing but very sad!","rating":5},{"id":607335271089250300,"text":"Just said at #NCGOPcon that \"\"politicians are all talk and no action and we are all tired of it! We need action and results to move forward!\"\"","rating":4},{"id":833761537525444600,"text":"Meeting with Generals at Mar-a-Lago in Florida. Very interesting!","rating":6},{"id":149562165236477950,"text":"\"\"The sad truth is some Republicans in Congress are clueless when it comes to negotiation.\"\"  #TimeToGetTough","rating":7},{"id":116895784603107330,"text":"Government waste, fraud and abuse should be immediately addressed. This will help solve our deficit crisis both short and long term.","rating":4},{"id":258917220846018560,"text":"Alert--US jobless claims up 46,000 to 388,000. Really bad news. 7.8% is now a fraud--not possible!","rating":7},{"id":256031437160054800,"text":"By popular request I will also be tweeting live during the Vice Presidential debate  Thursday night. It will be very interesting, I promise.","rating":3},{"id":210096130204241920,"text":"\"\"A market is never saturated with a good product, but it is very quickly saturated with a bad one.\"\" -- Henry Ford","rating":2},{"id":180366857914683400,"text":"I'm not a hunter and don't approve of killing animals. I strongly disagree with my sons who are hunters, but (cont) http://t.co/eE5G0Eo8","rating":5},{"id":413404741436067840,"text":"I just left the Trump Tower atrium--it is packed with great people. #1 tourist attraction in NYC-- Fun!  #TrumpTower","rating":4},{"id":377037314389966850,"text":"Why are we fighting for the \"\"rebels\"\" that hate us-only to save face for Obama!","rating":8},{"id":374356124583342100,"text":"Why isn't the Arab League paying for everything and sending troops? They want us to do their dirty work with no involvement by themselves!","rating":7},{"id":336563000314052600,"text":"We may get out of ObamaCare because the train wreck is impossible to implement http://t.co/7l2utHI3JC  It is a disaster.","rating":6},{"id":298790836789989400,"text":"“I also plan to keep making deals, big deals, and right around the clock.” – The Art of The Deal","rating":2},{"id":474213293717200900,"text":"US trade deficit hit $64B+ in April, 2 yr record high http://t.co/e5RuDJxexp We must do better. China is ripping us. Bring the jobs home!","rating":5},{"id":445244778289303550,"text":"I won't be doing Fox &amp, Friends tomorrow morning in that I have a big breakfast meeting on a deal. I will be back next week at 7. Thank you!","rating":3},{"id":443872126676631550,"text":"Trump Victorious in Fort Lauderdale Litigation http://t.co/WqurUItUJH","rating":2},{"id":588449882110726100,"text":"Had a great time in Myrtle Beach and Charleston this past Saturday and Monday. Looking forward to going back soon.","rating":1},{"id":587002298045431800,"text":"South Carolina and the audience were GREAT - THANKS!","rating":1},{"id":560489692387631100,"text":"#IndianaJones and #Ghostbusters- what's wrong??? http://t.co/2nNFF6cwlI","rating":5},{"id":557144177876930560,"text":"The Apprentice will be very exciting and interesting tonight at 8:00. Joan Rivers puts on a great show!","rating":2},{"id":147339218149056500,"text":"\"\"Let me put this as plainly as I know how: Iran's nuclear program must be stopped--by any and all means necessary. Period.\"\" #TimeToGetTough","rating":8},{"id":274610404116807680,"text":"France is losing its businesses and wealth rapidly and day by day.","rating":4},{"id":268075768905617400,"text":"Surprise-In a post-election delayed release, food stamp rolls surged to biggest monthly increase and an all-time high http://t.co/P3qdhiNo","rating":6},{"id":406401107821613060,"text":"Work begins on the Old Post Office in Washington D.C. in 3 months. It will soon become one of the great hotels of the world.","rating":3},{"id":388301443569963000,"text":"“My advice to you regarding momentum is definitive: Get yours going!” – Think Like a Champion","rating":3},{"id":382576725508378600,"text":"Obama promised premiums would lower $2,500/yr for family of 4. In truth, healthcare will increase by $7,450 http://t.co/OYNdom1xvJ","rating":4},{"id":339440503361773600,"text":"John Menard of Menards home improvement stores in Midwest treats employees horribly -- should they form a union?  http://t.co/ETm9mxCash","rating":5},{"id":318113046822273000,"text":"China is the biggest environmental polluter in the World, by far. They do nothing to clean up their factories and laugh at our stupidity!","rating":7},{"id":314494224227778560,"text":"For the haters, out of hundreds of deals or transactions, I have used the bankruptcy laws 4 times in order to cut better deals.","rating":6},{"id":496719225978122240,"text":"The $200M in renovations of Trump Int’l Washington DC are on track. The Old Post Office is being transformed into true luxury.","rating":2},{"id":471398276080865300,"text":"The Amateur. On his trip to Afghanistan, our commander-in-chief disclosed the CIA Chief’s name. Unsafe disaster! http://t.co/1mT4JGUghR","rating":5},{"id":459404166541352960,"text":"As I predicted, Obama already caught lying on Ocare enrollment # by CBO who’s sticking w/ “6 million enrollments” http://t.co/LoVuJhXWEB","rating":4},{"id":420232649660059650,"text":"Another one of my predictions just came true-- Iraq is a total disaster with government losing all control—so sad.","rating":5},{"id":126388935223029760,"text":"Iraq's government is treating us like fools. We should demand their oil.","rating":8},{"id":266211532554252300,"text":"P.S. 42 in Queens is getting a truckload of food and much needed supplies for Rockaway residents #HurricaneSandyRelief","rating":3},{"id":250597251800522750,"text":"Scary--Obama's budget deficits are so out of control that he has to borrow 40 cents on every dollar he spends.","rating":6},{"id":244093700559499260,"text":"Drew Peterson, a real sleaze, just convicted of killing wife. Change the law so he gets death penalty.","rating":8},{"id":239042816628645900,"text":"Terrible tragedy at the Empire State Building today. Must have fast trials and death penalty for the animals.","rating":8},{"id":232909540725780480,"text":"I have founded and run one of the largest real estate empires in the world. I employ thousands of people. Why am I the enemy?","rating":4},{"id":416910668798111740,"text":"The global warming  scientists don't want to be airlifted off the ship-they are having too much fun and that is too simple a solution-FAME!","rating":7},{"id":395946040408285200,"text":"The ObamaCare website is unfixable &amp,  rumor has it that they will stop checks &amp, balances—a free-for-all that will cost the country trillions","rating":8},{"id":318122658745159700,"text":"No, I'm saying that the World is paying the price for China's pollution while they make a fortune with their dirty factories! Very sad.","rating":7},{"id":296303180432678900,"text":"Two years ago I told everybody to start looking &amp, buying houses—I hope you listened! (but there is still time).","rating":3},{"id":478349441569533950,"text":"Congratulations to Martin Kaymer for winning the 2014 #USOpen. #USGA\"\" Great playing from beginning to end!","rating":2},{"id":439426797395279900,"text":"China has just intervened to lower the yuan- in other words, they will continue to screw the U.S.!","rating":8},{"id":607332047523336200,"text":"Just Introduced at #NCGOPcon as the country's highest paid speaker. Told the record crowd of 650 I am to be speaking here for free!","rating":6},{"id":591291012091351000,"text":"Fact – while Jeb was governor &amp, Rubio was House Majority Leader, Florida’s debt more than doubled. Conservatives?","rating":5},{"id":591257360653545500,"text":"Excited to be travelling to New Hampshire on Monday. The Granite State is a model for the country. Live Free or Die!","rating":4},{"id":590980065380425700,"text":"I want to negotiate my own, and much better, trade deals for our country. MUST INCLUDE CURRENCY MANIPULATION (and more). DO NOT LET PASS!","rating":7},{"id":306596003878928400,"text":"Jimmy Fallon show will be great tonight - I'm on!","rating":3},{"id":273863645291753470,"text":"Anthony Hopkins is a truly great actor--I love everything he does!","rating":2},{"id":264787348032733200,"text":"Undecideds in OH,PA and WI will make the difference. All should ask themselves if they want $6/gallon gas because it will come under Obama.","rating":6},{"id":264389666608926720,"text":"It was announced this morning that unemployment rose--this can't be good for Obama.","rating":3},{"id":245961358473048060,"text":"What did we get for fighting in Libya besides a dead Ambassador. Demand their oil.","rating":9},{"id":223800861430775800,"text":"Seth Meyers was terrible co-hosting with Kelly. Marbles in his mouth-&amp, he must stop picking at his hands--insult to the great Regis Philbin!","rating":7},{"id":208294233063424000,"text":"\"\"The difference between a successful person and others is not a lack of strength, not a lack of knowledge, but (cont) http://t.co/FEQvzsRZ","rating":3},{"id":386133770601918460,"text":"“Going with your instincts requires tuning in to everything around your decision.” – Think Big","rating":2},{"id":382924815574634500,"text":"Obama wanted to meet with the Iranian president, yet the Iranians denied the request. So much for Hope &amp, Change.","rating":5},{"id":375650504778346500,"text":"I have just lost my beautiful &amp, elegant long time exec. assistant  Norma Foerderer. She passed away yesterday – a truly magnificent woman.","rating":2},{"id":360386640067301400,"text":"“There are no environments where you're only going to win, because life just isn't like that.” -  Bobby Orr","rating":3},{"id":356014823353499650,"text":"Perhaps Miss USA can lure Snowden back?","rating":6},{"id":341994790436626400,"text":"The two dumbest interviews in history may go down as Lance Armstrong, who is being sued by everyone in the world, &amp, Michael Douglas.","rating":8},{"id":335232727391547400,"text":"Looks like we will have a pervert running for mayor after all - just what New York City needs - and he will revert back to form, always do!","rating":9},{"id":332214204926939140,"text":"What a great time we just had in the atrium of Tump Tower for http://t.co/tSLfuNNAPI. The place was happy and packed!","rating":3},{"id":314778362088415200,"text":"It won’t stay a buyer’s market forever. If you can, take advantage and buy property asap. You’ll thank me!","rating":3},{"id":307643192432525300,"text":"Joseph Kennedy is really being used by Venezuela and Hugo C. in oil commercial!","rating":6},{"id":495260564986527740,"text":"Obama’s war on women. “Number of Unemployed Women Increased in July by 227,000” http://t.co/k4jrpL5WJ9","rating":4},{"id":139089731710488580,"text":"Why are we giving China foreign aid? Couldn't the Super Committee have agreed to at least cut that outlay? #TimeToGetTough","rating":5},{"id":279654434999525380,"text":"Windmills are destroying every country they touch--- and the energy is unreliable and terrible. http://t.co/wxrkXRsv","rating":7},{"id":277060120683376640,"text":"\"\"A general is just as good or just as bad as the troops under his command make him.\"\" --Douglas MacArthur","rating":1},{"id":273518170554388480,"text":"Want to know why China is growing?  They can build the world’s tallest building in 90 days http://t.co/DMjMeKQR Red tape would kill it here.","rating":3},{"id":265546276182036480,"text":"Obama is angry, frustrated and desperate.  He said “voting is the best revenge” http://t.co/HFQiGRDb  He is divisive.","rating":5},{"id":245980291775209470,"text":"Deja vu - I can remember a time when our embassies were stormed under another failed President. Obama=Carter.","rating":6},{"id":413782479049207800,"text":"Can’t fool Americans. 57% of uninsured hate ObamaCare http://t.co/U1Du47apAs Reality is less will be insured b/c of this monstrosity.","rating":4},{"id":403156118576578560,"text":"Afghanistan leaders want the U.S. to keep 20, 000 troops there for many more years, fully paid for by the U.S., but first they want apology.","rating":8},{"id":385860384994762750,"text":"“Great effort springs naturally from great attitude.” - Pat Riley","rating":2},{"id":377184267735818240,"text":"Our economy is in trouble. The unemployed are more likely to drop out of the workforce than find a job. We need growth-- and now!","rating":4},{"id":316269857584840700,"text":"Cyprus is seizing private bank accounts as collateral for €10bn bail-out. We owe $17T. Think it can’t happen here?","rating":5},{"id":291939301057499140,"text":"Not believable that Manti Te’o was in love for one year with a girl he never met- she then died. He is either very stupid....","rating":7},{"id":488076093979492350,"text":"I have nothing to do with the Plaza Casino in Atlantic City. I have not been involved with Atlantic City for many years. Used to love A.C.!","rating":3},{"id":479015671616258050,"text":"I was right—TV ratings for US Open are way down from last year. People don’t want to look at a burned out, ugly course!","rating":6},{"id":555762089575194600,"text":"The episode of the Apprentice that everyone has been waiting for....Joan Rivers stars, and she is and does GREAT!  Next Monday night at 8:00","rating":3},{"id":1878373267,"text":"\"\"Keep it fast, short and direct - whatever it is.\"\" --Donald J. Trump http://tinyurl.com/pqpfvm","rating":2},{"id":137271646301065220,"text":"China is complaining about 2,500 marines being placed in Australia.  Meanwhile they are building bases across Latin America. #TimeToGetTough","rating":4},{"id":96961112343445500,"text":"I just got Mike Leach's new book,  Swing Your Sword. He's a great coach, and he's written a great book. It's definitely worth reading.","rating":2},{"id":248150707931320320,"text":"None of Romney's leaked comments change the fact that Obama is a complete disaster. 20% real unemployment and $6T in deficit spending.","rating":5},{"id":401027149433274400,"text":"Obama friend got a no-bid $635M contract to build website http://t.co/AA1Q7Bo0kP And now she will get more to fix it.","rating":6},{"id":377180657702559740,"text":"This week will mark the 1 year anniversary of the attack in Benghazi that left 4 Americans dead.  No answers!","rating":4},{"id":365540258282090500,"text":"Being true to yourself equals being true to your brand.That’s the solid foundation that will keep your brand flourishing. -Midas Touch","rating":3},{"id":332165871101440000,"text":"I gave away money. Go to http://t.co/uW8lZeSVrD to see how I'm helping people. #FundAnything #Entrepreneurs #GiveBack","rating":4},{"id":311554040125329400,"text":"“Whether you realize it or not, your brand can be many times more valuable than your business.” – Midas Touch","rating":2},{"id":304622408134950900,"text":"If you think we have a problem with Social Security and Medicare now, try taking in millions of new citizens all at once.","rating":5},{"id":529419704549789700,"text":"#TrumpAdvice http://t.co/BRQal0Yfg8","rating":1},{"id":471424584944594940,"text":"Thank you for all of the really nice comments and reviews concerning my speech today at the National Press Club. It was my great honor!","rating":3},{"id":554812468829376500,"text":"#CelebApprentice Selfies- yes or no?","rating":5},{"id":550547634218614800,"text":"The Mar-a-Lago Club was amazing tonight. Everybody was there, the biggest and the hottest. Palm Beach is so lucky to have best club in world","rating":3},{"id":1924074459,"text":"\"\"Your higher self is in direct opposition to your comfort zone.\"\" --Donald J. Trump http://tinyurl.com/pqpfvm","rating":2},{"id":74124433735958530,"text":"Wishing everyone a Happy Memorial Day, and a thank you to all the soldiers who protected our great country.","rating":1},{"id":275703911292219400,"text":"Gold just set another record high on price with the largest physical gold sales on record http://t.co/fjiOnw2g  Inflation is coming...","rating":4},{"id":264010129106665470,"text":"You know the world is crazy when New York gets hit by a hurricane-- and Florida doesn't.","rating":6},{"id":263743481091084300,"text":"President Obama, please take the $5M check for charity tomorrow. It is so easy and could do so much good!","rating":7},{"id":156402387970560000,"text":"\"\"Government needs to stop pick-pocketing your wallet. Every time it does, it slows growth and kills jobs.\"\" #TimeToGetTough","rating":3},{"id":377373836947496960,"text":"This George Zimmerman is really a mess - he really has to just disappear! (He attacked his wife last night).","rating":8},{"id":374967222512267260,"text":"China, OPEC and Russia laugh at us. But now thanks to Obama so does Syria. Very sad!","rating":6},{"id":357670444976967700,"text":"Sad thing is Rolling Stone was (is) a dead magazine with big downward circulation and now, for them at last, people are talking about it!","rating":5},{"id":331725888355975200,"text":"Sexual assault and rape in the Armed Forces is a Massive problem that nobody wants to talk about or do anything about-the big dark secret!","rating":6},{"id":318085997000806400,"text":"We have tremendous economic power over China if our leaders knew how to use it, which they don't! China's economy would collapse without us.","rating":7},{"id":484921289715376100,"text":"Do these very stupid politicians who got us involved in Iraq look bad, or what? Everybody wants their oil - only made possible by U.S.!","rating":8},{"id":456906839960346600,"text":"#TBT WrestleMania 23 http://t.co/99dCdxArXm","rating":4},{"id":551941676445741060,"text":"How do you like the boardroom so far?","rating":3},{"id":1894284587,"text":"Did you know Donald Trump is on Facebook? http://www.facebook.com/DonaldTrump - Become a fan today!","rating":2},{"id":138738046018404350,"text":"Egypt is turning into a hot bed of radical Islam. The current protest is another coup attempt.  We should never have abandoned Mubarak.","rating":6},{"id":260546105601830900,"text":"Bob Schieffer will do a great job tonight. Always treated me fairly.","rating":3},{"id":251682520515633150,"text":"\"\"Having a vision for something can be a very powerful force for accomplishment.\"\"--Midas Touch","rating":2},{"id":241584383235088400,"text":"We have all the cards. Now is the time to make a great deal with Iran.","rating":2},{"id":185074709111644160,"text":"Global warming has been proven to be a canard repeatedly over and over again. http://t.co/RK1UoS8e  The left needs a dose of reality.","rating":5},{"id":370235771292110850,"text":"Congress must defund ObamaCare.  It is destroying Medicare and breaking promises to our Seniors, including veterans.","rating":3},{"id":359632513569783800,"text":"China is building 50 brand new airports while our country continues to rott! Very sad.","rating":6},{"id":340293513658912800,"text":"Serious stuff-IRS Commissioner visited White House 157 times, far more than Sec. of State or Defense. What a big story this is!","rating":4},{"id":309729442094276600,"text":"Notice the first word in my Think Big credo: Think = the 1st step. Use everything in your power to utilize &amp, develop that capacity.","rating":1},{"id":292306618668957700,"text":"I still say Te'o did this in order to get sympathy for the Heisman vote—thankfully he did not win.","rating":7},{"id":494216300739448800,"text":"Environmental regulations stop Border Patrol from protecting 40% of the border http://t.co/4ZuKRMBWt6 A coup for the migrant Democrats.","rating":5},{"id":460870764112392200,"text":"Obama’s 2014 budget “eyes $1 trillion hike in tax revenue” http://t.co/9xUS7oPepE He loves taxes. T-E-A. Taxed Enough Already.","rating":4},{"id":583065540962451500,"text":"Each day that Iran delays the deal, if that is what you call it, we must add another sanction, and make them progressively tough.","rating":3},{"id":144089254027468800,"text":"Illegal immigration is a wrecking ball aimed at US taxpayers. Washington needs to get tough and fight for \"\"W... (cont) http://t.co/tblJ9PWm","rating":7},{"id":273520503090733060,"text":"The Muslim Brotherhood dictator in Egypt is bad news.  He will never be our true ally!","rating":6},{"id":272492999383076860,"text":"The dying NY Daily News put out a false report about my kids not wanting me to criticize Obama...totally false!","rating":8},{"id":411593523234750460,"text":"Now Sebelius is “'urging' insurers to cover people who haven't paid” http://t.co/tdZnSWiJHf  Complete mess. Enrollment Numbers are a sham.","rating":5},{"id":379928139285422100,"text":"The Navy Yard shooting is a horrible disaster. If we don't clean up OUR COUNTRY of the garbage soon, we are just going to do a death spiral!","rating":9},{"id":332226990646100000,"text":"We continue to lose our nation’s finest in Afghanistan almost daily. The Rules of Engagement are costing lives.","rating":4},{"id":331813659754000400,"text":"Tired of being bullied by the economy? I'm going to help people. Wednesday 11 AM at Trump Tower","rating":6},{"id":329272117994594300,"text":"Congratulations to Michael Jordan on his marriage over the weekend.","rating":2},{"id":316251857502740500,"text":"It’s springtime and it just started snowing in NYC. What is going on with global warming?","rating":5},{"id":311469150214189060,"text":"Our economy has had worst recovery under Obama since the Depression. Results of his policies speak for themselves. No new taxes!","rating":4},{"id":286869987447152640,"text":"I can't believe Republican leadership allowed such a stupid deal to be made. They are rapidly giving up all of their cards.","rating":6},{"id":542074495276945400,"text":"Obama opposes sanctions on Iran http://t.co/SGqN0gmc5y They are laughing at Kerry &amp, Obama!","rating":7},{"id":482223313260122100,"text":"Secy John Kerry has a tough job but he looks so totally lost negotiating w/ those characters who are cleaning his clock. Sad to watch...","rating":5},{"id":472667067447918600,"text":"#TheArsenioHallShow   Well, it had to happen. People that are disloyal, in the long run, never make it. Arsenio was just cancelled!","rating":5},{"id":456143828991213600,"text":"On top of the disrespect shown by Russia, don’t forget they still have Snowden, who has given them (&amp, everyone) massive US secrets.","rating":4},{"id":598835103507324900,"text":"I call Jeb Bush the reluctant warrior --- he just doesn't want to be doing this, he is not having fun!","rating":8},{"id":284717566444830720,"text":"Sorry to hear of yesterday’s passing of General Norman Schwarzkopf.  He was a terrific general and leader--we could use more like him.","rating":3},{"id":265480543238512640,"text":"Get out tomorrow and vote so that we can all finally say those magic words--- http://t.co/Thv9Mu8E","rating":5},{"id":245517710811861000,"text":"Why has Barack Obama repeatedly told inconsistent stories about his religious background?  http://t.co/ywQEJZok Who is he?","rating":6},{"id":405775974324654100,"text":"The $1B failed website is the tip of the iceberg on the ObamaCare. Over 90 million estimated will lose their plans next year.","rating":4},{"id":395237171214311400,"text":"1.5M have already lost their health care plans thanks to ObamaCare http://t.co/3e8yW46znl  Defund now and Repeal later!","rating":5},{"id":383765935930503200,"text":"Our country and it's leadership has to be so careful and so smart - these are treacherous times, like no other. The world is a crazy place!","rating":3},{"id":326777412337676300,"text":"In three years people won’t be building wind turbines anymore - they are obsolete &amp, totally destroy the environment in which they sit.","rating":8},{"id":306091700437282800,"text":"The media is so in the tank for Obama that it is amazing—the funny thing is, he can’t stand them!","rating":7},{"id":468281421144920060,"text":"Getting ready for the big news conference in Dubai. It should all be happening in the U.S., but it isn't - SAD!","rating":6},{"id":423533440386883600,"text":"Where is the progress in the state of New York over the last three years? There is none--only backwards.","rating":4},{"id":421041850384785400,"text":"Why didn’t Gates resign if he was so unhappy about what he was being told by Obama? The fact is, Iraq etc. have always been disasters!","rating":6},{"id":611607511670616000,"text":"Trump Nat'l Golf Club Philadelphia, 360 beautiful acres as designed by Tom Fazio with views of the Philly skyline.  http://t.co/jha0m0W4Kk","rating":2},{"id":552270342702764000,"text":"I will be live tweeting!","rating":1},{"id":278929802075992060,"text":"You get what you vote for.  21% of small business owners planning to cut their workforce in 2013 http://t.co/ws2ITHkM","rating":5},{"id":274164043021967360,"text":"... where he raised 2 million dollars for the wonderful kids. Eric has a great heart!","rating":2},{"id":273172926897991680,"text":"\"\"Democracy cannot succeed unless those who express their choice are prepared to choose wisely...","rating":1},{"id":255721242101940220,"text":"In the end, Andy Pettitte did not rat out his friend Roger Clemens. I like him again, a lot.","rating":3},{"id":197349216643846140,"text":"\"\"Our Founding fathers got it. They understood that nothing good in life--religious freedom, economic freedom, (cont) http://t.co/tTKxpAnc","rating":1},{"id":377745339945844740,"text":"Assad hit the jackpot!","rating":6},{"id":375960370957262850,"text":"Did you ever see a situation so ridiculous as our President explaining what, when and where to Congress about a Syrian attack. Far too late!","rating":8},{"id":370217256086552600,"text":"Glad to see that the Egyptian Army is releasing Mubarek. As we see, Obama never should have abandoned him. He was an ally.","rating":5},{"id":364530078895837200,"text":"We.signed our deal to take over the historic Old Post Office on Pennsylvania Ave. from the U.S. and convert it into super luxury hotel-jobs!","rating":3},{"id":358002216692482050,"text":"For the disciples of global warming, in 150 summers (years) there have been 20 heat waves as bad or worse than current-this has happened b4!","rating":4},{"id":317965135283093500,"text":"What do we get from our economic competitor South Korea for the tremendous cost of protecting them from North Korea? - NOTHING!","rating":7},{"id":305859638857977860,"text":"Very tacky set!","rating":5},{"id":290845284215431200,"text":"Wow, I have just exceeded 2 million followers--and in such a short time!","rating":3},{"id":460878347103637500,"text":"Is everyone enjoying ObamaCare’s 21 new 2014 taxes? http://t.co/iFZRjKmWjP It’s Obama’s special gift added on to your rising premium.","rating":7},{"id":446523629204156400,"text":"Plane was carrying those terrible lithium ion batteries, which are highly combustible, as cargo. Fire could have started in cockpit.","rating":4},{"id":421379721490726900,"text":"The Trump Organization continues to expand internationally at a record pace. Many new announcements to come soon.","rating":3},{"id":22003109005,"text":"Congratulations to Miss Mexico, Jimena Navarrete, our new Miss Universe 2010, and congratulations to everyone for a fantastic show.","rating":2},{"id":264432455593906180,"text":"Unemployment is now 7.9%.  Four years and $6.5T later, that is really bad!","rating":6},{"id":258591443256475650,"text":"Wind turbines are not only killing millions of birds, they are killing the finances &amp, environment of many countries &amp, communities.","rating":5},{"id":253138753479122940,"text":"Venezuelan leader Hugo Chavez said in a television interview that aired on Sunday \"\"If I were American, I'd vote for Obama.\"\"","rating":6},{"id":245955590147424260,"text":"Obama is a disaster at foreign policy. Never had the experience or knowledge. He is not capable of doing the job.","rating":7},{"id":240453638357671940,"text":"The US Navy wants to go \"\"green.\"\" Our Navy should use the best &amp, most powerful fuel &amp, not play games. Give me a break!","rating":7},{"id":197744990997331970,"text":"The new Dark Knight Rises Trailer is great  http://t.co/C1ZY0tP2 The movie filmed scenes in Trump Tower last October.","rating":3},{"id":155342271691243520,"text":"\"\"People who have the ability to work should. But with the government happy to send checks, too many of them don't.\"\" #TimeToGetTough","rating":5},{"id":401686004635303940,"text":"The real J.P.Morgan is spinning in his grave at the ridiculous settlements the bank is making to settle disputes. A settler is a soft target","rating":4},{"id":375341257007968260,"text":"Happy New Year to all of my Jewish friends and supporters. Shana Tova. Hopefully it will be a great year!","rating":2},{"id":349628495711834100,"text":"\"\"If you have a hard time communicating, one way to overcome it is to turn your focus onto your audience.\"\" - Midas Touch","rating":1},{"id":294894585287700500,"text":"Wind turbine syndrome is affecting tremendous numbers of people in their wake—stop ugly turbines.","rating":8},{"id":444949110001369100,"text":"Frumpy and very dumb Gail Collins, an editorial writer at The New York Times, is so lucky to even have a job. Check her out - incompetent!","rating":9},{"id":552223587453927400,"text":"Remember, tonight (Monday), the second and third episodes of The Apprentice are on at 8:00 &amp, 9:00. Great ratings last night 18 - 49. FUN!","rating":2},{"id":266995527919489020,"text":"Price gouging at many gas stations, $10 a gallon--welcome to the new world.","rating":6},{"id":261192751935279100,"text":"Virtually all Presidents and candidates including John McCain, Bill Clinton, George H.W. Bush, and George W. Bush... http://t.co/V6VJbfzt","rating":3},{"id":256752629068226560,"text":"ObamaCare is a complete disaster. Many of my friends have to scale down their businesses because they can't afford it. Terrible.","rating":5},{"id":379714169563385860,"text":"I can’t believe my friend Derek Jeter is out for whole season--injured day he left Trump World Tower. Lucky bldg.-- Move back fast!","rating":8},{"id":354673952389464060,"text":"Pakistani intelligence had full knowledge that Bin Laden was living in Abbottabad.  They were sheltering him.","rating":6},{"id":324209288161677300,"text":"The world economy is under deep stress with growth slowing everywhere.  Yet crude is over $87/barrel. Should be $25 at the most.","rating":4},{"id":313975824808308740,"text":"Bombings all over Iraq today.That country is falling apart-such a horrible waste of lives and 1.5 trillion dollars (and I told you so!).","rating":7},{"id":297076699844190200,"text":"The real estate market in Vietnam is booming.  Growth is everywhere in the world, except for the US.","rating":3},{"id":286527813597679600,"text":"“I always follow my own instincts, but I am not going to kid you: it’s also nice to get good reviews.” - The Art of the Deal","rating":2},{"id":423810643712417800,"text":"Department of Homeland Security has spent $3.5 billion dollars building their new headquarters and is years late and billions over budget!","rating":4},{"id":419868320180219900,"text":"Most of the world's great riders are at Mar-a-Lago today for the Trump Invitational, one of the most important equestrian events of the year","rating":3},{"id":607655425064992800,"text":"Loved doing #NCGOPConvention keynote speech last night! Unbelievable reception. Had the biggest crowds by far of any of the GOP candidates.","rating":4},{"id":284408899849822200,"text":"It’s Thursday.  How much time did Washington waste today trying to find a solution on the so-called fiscal cliff?","rating":3},{"id":270589184031469570,"text":"Reports are out there that many CEOs of charities are getting overpaid, while their causes are seeing very little...","rating":2},{"id":258542382667149300,"text":"George Will said \"\"best debate he ever saw\"\". If you ever heard George Will speak(boring) anything is exciting.","rating":6},{"id":212552920317706240,"text":"\"\"The entrepreneur builds an enterprise, the technician builds a job.\"\" --Michael Gerber","rating":1},{"id":411579355760848900,"text":"If Graydon Carter's very dumb bosses would fire him for his terrible circulation numbers at failing Vanity Fair-his bad food restaurants die","rating":7},{"id":378614818527137800,"text":"Prayers go out to the victims of the terrible fire in New Jersey. Stay strong and remember it will soon get better.","rating":2},{"id":377635513051922400,"text":"Wow, Eliot Spitzer has lost - great news for New York City!","rating":3},{"id":370645030349701100,"text":"“To keep your momentum going you must have intrinsic values as well as monetary values. Know when to give back.” – Think Big","rating":1},{"id":347207382671188000,"text":"Amazing comeback by The Heat - your friends at your favorite golf club, Trump National Doral, are proud of you. NOW for game 7!","rating":2},{"id":323216293031460860,"text":"South Korea must in some form pay for our help-the U.S. must stop being stupid!","rating":8},{"id":304358898889003000,"text":"\"\"The Job\"\" on CBS, the 15th copy of The Apprentice, was just cancelled - I love it!","rating":7},{"id":299233386009075700,"text":"Oh the wonders of the Arab Spring. Our new 'ally' the Muslim Brotherhood hosted Ahmadinejad yesterday http://t.co/KO4Ptps3  No more aid.","rating":6},{"id":489031043744153600,"text":"Iran looks like it is toying with John Kerry on nuclear talks - he is begging for a deal to save face. Negotiation is just not his thing!","rating":5},{"id":445666661451169800,"text":"There are many editorial writers that are good, some great, &amp, some bad. But the least talented of all is frumpy Gail Collins of NYTimes.","rating":9},{"id":434652087470022660,"text":"The brand new Blue Monster Golf Course at Trump National Doral is doing fantastic business. Also, the new driving range is open at night!","rating":3},{"id":109671130721300480,"text":"The White House is predicting 9% unemployment throughout 2012 – and when Obama Care takes effect in 2014 expect it to go even higher.","rating":4},{"id":275998837166972930,"text":"Michael Forbes lives in a pigsty and bad liquor company Glenfiddich gave him Scot of the Year award...","rating":8},{"id":253562547985338370,"text":"My daughter Ivanka is being honored by the Wharton School of Finance with the 2012 Young Leadership Award. Also (cont) http://t.co/mraKH93c","rating":2},{"id":245546743285030900,"text":"An impromptu interview I did with German TV on 9/11 down by Ground Zero discussing the attack and WTC Towers http://t.co/HAQJOEZN","rating":1},{"id":198498197616869380,"text":"Mariano Rivera, Yankee pitcher, is the greatest ever. Get well fast.","rating":2},{"id":406402717960400900,"text":"My ties, shirts and cufflinks have never been more beautiful-THE BEST-available at Macy's!","rating":3},{"id":395157092220559360,"text":"Maybe if Obama knew too much about the spying it would be worse than knowing nothing - but either way it is just another disaster!","rating":5},{"id":347679928386478100,"text":"Some dope said I deleted a tweet about James G. There was no tweet and there was no delete-a totally fabricated story (nobody saw tweet).","rating":6},{"id":477091784754225150,"text":"People are LOVING the Trump sign on the Chicago building. Big league tweets, letters and calls...","rating":4},{"id":598836996400934900,"text":"Going to New Hampshire, all sold out crowds. People want real change - POLS WILL NEVER MAKE OUR COUNTRY GREAT AGAIN!","rating":4},{"id":586417115248271400,"text":"Exclusive–Donald Trump: Obama 'Totally Out-Negotiated' by Iran, Taliban, 'Virtually Every Country in the World' - http://t.co/FrtuGriGUo\"\"","rating":5},{"id":1266379480890773500,"text":"The National Guard has been activated In Minneapolis. They have arrived on the seen. George Floyd will not have died in vain. Respect his memory!!!","rating":7},{"id":2475429091,"text":"Here's to a safe and happy Independence Day for one and all - Enjoy it! --Donald J. Trump","rating":2},{"id":123767488335978500,"text":"New study shows 80% of Congress have no business experience--it shows!","rating":6},{"id":270589146152706050,"text":"... ...Do your research before donating this holiday season!","rating":1},{"id":253930695955730430,"text":"Bill Clinton has been Obama's most effective surrogate out on the trail.","rating":2},{"id":253566581387440130,"text":"Can't wait for tonight's debate--actually delayed my trip to Europe so I can watch. This is going to be a great night.","rating":3},{"id":251350717443498000,"text":"How long will it take for chants-- \"\"bring back the replacement refs\"\" -- when a bad call is made?","rating":4},{"id":250695880007614460,"text":"\"\"Selfishness ultimately begets only unhappiness. Unselfishness begets happiness.\"\"  -- B.C. Forbes","rating":1},{"id":227518153930981380,"text":"Fast trial and death penalty for maniac in Colorado--- immediately pass speed up legislation.","rating":8},{"id":199937379539226620,"text":"\"\"You can't build a reputation on what you're doing to do.\"\"  Great quote by Henry Ford.","rating":2},{"id":414738574190579700,"text":"I am going to Trump National Doral in Miami today to check out the brand new and just opened BLUE MONSTER and the spectacular driving range.","rating":3},{"id":320674283372302340,"text":"China is pushing North Korea!","rating":2},{"id":546012950277136400,"text":"Pigs get slaughtered ... again.  Ft Lauderdale plaintiffs must pay me close to $400k in legal fees after Trump trial victory.","rating":7},{"id":423937130927120400,"text":"Senate concludes “Benghazi could have been prevented” http://t.co/mBJwc4IrDr","rating":6},{"id":561239245046947840,"text":"When I broadly proclaimed Mitt “choked” – and would do it again—everybody said yeah, he’s right.","rating":7},{"id":278931017186803700,"text":"I have helped many friends and colleagues in their business ventures.  They always thank me after they succeed. #MIDASTOUCH","rating":3},{"id":262996677466652670,"text":"If authorities need direct view from top of Trump Tower, call office.","rating":5},{"id":247694357384278000,"text":"Weekly jobless claims are up once again. The economy cannot recover with Obama in office.","rating":4},{"id":223825720869273600,"text":"America's Olympic uniforms are manufactured in China. Burn the uniforms!#U.S.OlympicCommittee","rating":8},{"id":398547441433075700,"text":"Upstate New York needs jobs. Frack Now &amp, Frack Fast! Pay off NY State debt.","rating":5},{"id":391259071854022660,"text":"The 2013 MISS UNIVERSE® Pageantwill take place in Russia for the very first time in the 62 year history of the contest.","rating":3},{"id":385128983785783300,"text":"Remember when Obama promised “you can keep your health care plan?” Not in these 10 states. http://t.co/4vxsEvPdon Another lie.","rating":6},{"id":372813033489182700,"text":"\"\"A general is just as good or just as bad as the troops under his command make him.” - Gen. Douglas MacArthur","rating":2},{"id":350272955785285600,"text":"What a surprise! Newly released audit proves that the IRS only targeted Tea Party groups http://t.co/ASIzGZlaWT","rating":5},{"id":342898132172025860,"text":"I hope everybody goes to Macy's today to get Donald J.  Trump shirts, ties, suits and cufflinks - they are really beautiful at low price","rating":6},{"id":335410681048334340,"text":"The sexual abuse that is so rampant has, according to generals, greatly weakened our military. They have failed to stop it.","rating":7},{"id":311849965590827000,"text":"Help fight autism--go to http://t.co/QLmCf48aWb,  website for http://t.co/MQeWJcNir3, donations &amp, government activation.","rating":3},{"id":535888416509292540,"text":"Congratulations to Bill O’Brien on being named the Republican Speaker of the NH House. Well-earned &amp, well-deserved. A great guy.","rating":2},{"id":526689523720548350,"text":"Fox &amp, Friends, going on now - enjoy!","rating":2},{"id":497819123708350460,"text":"Same CDC which is bringing Ebola to US misplaced samples of anthrax earlier this year http://t.co/aX7ihXdcMz  Be careful.","rating":8},{"id":479700375810109440,"text":"Manufacturing is now less than 9% of US GDP. The Rust Belt, heart of our country’s factory sector, has been destroyed by our leaders.","rating":7},{"id":458194390834749440,"text":"I will be doing Fox &amp, Friends at 7 (15 minutes). Enjoy it and your day!","rating":3},{"id":441746990569779200,"text":"Actually I was very nice to Jimmy Carter during my standing room only (&amp, standing ovation) speech for CPAC - stated better Pres. than Obama!","rating":8},{"id":601026339110592500,"text":"I now see John Kasich from Ohio- who is desperate to run- is using my line “Make America Great Again”. Typical pol- no imagination!","rating":8},{"id":593751071530602500,"text":"I have been a guest on The View many times when it was  successful show. Now the show is dying for lack of ratings. Too bad!","rating":7},{"id":533015168478089200,"text":"#TrumpAdvice http://t.co/U83aDNTVVP","rating":4},{"id":284735836258451460,"text":"The Republicans once again hold all the cards with the debt ceiling.  They can get everything they want.  Focus!","rating":5},{"id":284421034621415420,"text":"Republicans remember—debt ceiling, debt ceiling, debt ceiling—be smart and you will win!","rating":5},{"id":261938362137587700,"text":"The TODAY Show should call me about who to put on the show— I know more about people who get ratings than anyone.","rating":6},{"id":256483626026426370,"text":"Our foreign policy decisions are dumbest in U.S. history","rating":7},{"id":253847285853724670,"text":"Wind farms are ugly, not cost effective and don't produce worthwhile returns or energy. No wonder governments are giving up on them.","rating":7},{"id":246700974964625400,"text":"First Obama says Egypt is not an ally. Then he promises to keep handing over aid  http://t.co/AQVEdKZn Incompetent and unqualified.","rating":6},{"id":227407409939877900,"text":"Who else could take 16 vacations, play over 100 rounds of golf and hold over 300 fundraisers while serving as (cont) http://t.co/HMtyFeFB","rating":8},{"id":207823112262266880,"text":"\"\"For what is the best choice, for each individual, is the highest it is possible for him to achieve.\"\" Aristotle","rating":2},{"id":201032113686974460,"text":"Terrible. Wind farms are provided permits by the US government, which causes the \"\"programmatic\"\" killing of bald eagles.","rating":6},{"id":387677977749643260,"text":"The White House has just admitted Al Qaeda was involved in Benghazi http://t.co/nDVIfOLM96 What about the video tape?","rating":5},{"id":377185804407164900,"text":"So much for ‘global warming.’ Earth is cooling at a record pace http://t.co/Kig0fLOWRK","rating":4},{"id":342253099928399900,"text":"I can't believe the Yankees continue to pay A Rod - they have a perfect right to stop paying (and should have stopped a long time ago).","rating":3},{"id":316275143158669300,"text":"I hope everyone enjoyed Palm Sunday!","rating":1},{"id":292343377037508600,"text":"New York should Frack. Thousands of jobs and millions in revenue. NY would be a truly rich state.","rating":2},{"id":546013080186912800,"text":"Not so smart after all ... Man with name on Duke law library must pay me legal fees after Trump trial victory.","rating":6},{"id":528279814747476000,"text":"\"\"The Art of the Deal\"\" = #1 business book. Over 3 million copies sold. Forbes Article from Oct. 20, 2014. http://t.co/OktCSRX6dq","rating":2},{"id":497483466385412100,"text":"ObamaCare premiums rising 13.2% in 2015 http://t.co/778bc2kJxe Elections have consequences!","rating":4},{"id":480668639201198100,"text":"N.Y. City is paying FORTY MILLION DOLLARS to five men that many think are guilty as hell. So many facts -  should have been trial. Politics!","rating":8},{"id":469551057740521500,"text":"\"\"beepee2004 Thank you very much Donald. Here is another. http://t.co/KfYYCh93V9\"\" Thanks--both do justice to a fantastic place.","rating":2},{"id":436201303601979400,"text":"NY State Republican Party must unify or November will be another disaster.","rating":3},{"id":433648720517681150,"text":"My sons Don and Eric are right now at Doonbeg in Ireland. There will be nothing like it!","rating":4},{"id":422536437217898500,"text":"I will be doing Fox &amp, Friends tomorrow morning at 7.00. Will be discussing all sorts of current disasters!","rating":5},{"id":125923291591475200,"text":"China's military buildup is a major threat to the Free World. We must remain resolute and maintain our national defense at all costs.","rating":5},{"id":88617765589630980,"text":"Congress is back.TIME TO CUT, CAP AND BALANCE.There is no revenue problem.The Debt Limit cannot be raised until Obama spending is contained.","rating":6},{"id":256571678237282300,"text":"Biden's statements on Medicare are very effective. Ryan must now come back and combat. #VPDebate","rating":4},{"id":168087421479694340,"text":"“Our country is the greatest force for freedom the world has ever known. We have big hearts, big brains, and (cont) http://t.co/aqekhSle","rating":3},{"id":396000802449289200,"text":"Not only did the $1B ObamaCare website not work, it can’t even protect your personal information http://t.co/H6Ge0N5tZW A disaster.","rating":7},{"id":385517245180284900,"text":"“Study: Insurance costs to soar under Obamacare” http://t.co/KakYqO8Xbb Men in NC get 305% hike. Women in NE suffer an average 237% hike.","rating":5},{"id":367591514463293440,"text":"Looks like Anthony Weiner Is through-most recent poll has him deeply in last place. GOOD NEWS","rating":6},{"id":350602182237753340,"text":"How did Snowden, with not even a high school education, get access to top secret U.S. records. He then gave, or sold, those records-traitor!","rating":7},{"id":344142983848923140,"text":"A coincidence that the NSA leaker is living openly in Hong Kong?! At the same time the Chinese Pres. met with Obama in CA.","rating":6},{"id":336112904946454500,"text":"How badly will the Country be hurt by the three scandals and the very poor implementation and cost of Obama Care?","rating":5},{"id":295914823991037950,"text":"“60 Minutes” treats President Obama with kid gloves--- Mike Wallace is spinning in his grave!","rating":7},{"id":509060715777654800,"text":"With the labor participation rate at a 36 yr. low, over 92M Americans are out of the work force.","rating":4},{"id":468411809121468400,"text":"Hitting the first ball at Trump International Dubai, 272 right down the middle. http://t.co/oMKlrSA2Iv","rating":3},{"id":449403304163156000,"text":"Coach W to his basketball players - BE QUICK BUT DON'T HURRY!","rating":2},{"id":131793462830956540,"text":"The greatest threat to our security is our debt. It is already past 100% GDP. We need to make real budget cuts.","rating":4},{"id":123816136189030400,"text":"If the Prez wants to create jobs talk to some business people---not liberal intellectuals.","rating":6},{"id":281126956987199500,"text":"Many people advised me not to buy the Miss Universe pageant.  They were all wrong. The deal worked out to be a great one!","rating":4},{"id":265895616658415600,"text":"In the 1950’s our climate was far more unstable than it has been over the last 5 years.","rating":5},{"id":263708757593296900,"text":"An amazing article by Kevin Gabriel-  http://t.co/yt7LPuME A must read by friends and foes of President Obama. End date is tomorrow at noon.","rating":3},{"id":250327830947303420,"text":"Despite all of China's cheating, they are not doing that well--we can beat them--our country has great potential!","rating":5},{"id":165513947812855800,"text":"\"\"We have to combat the welfare mentality that says individuals are entitled to live off taxpayers.\"\" (cont) http://t.co/JKrLfFs3","rating":4},{"id":414957005749899260,"text":"Will be on Fox &amp, Friends tomorrow morning at 7.00 - hope you enjoy!","rating":2},{"id":393483717563273200,"text":"The Audacity of Ineptitude – ObamaCare website will cost over $1B  http://t.co/w71bC1ryzy  When will someone finally be held accountable?","rating":7},{"id":377357719709421600,"text":"I'll be going to the Old Post Office Building on Pennsylvania Avenue in D.C. today. Will create one of world's great hotels. Lots of jobs!","rating":3},{"id":350688087300509700,"text":"Obama’s carbon tax plan will finance more windmills in America. More real estate depreciated, wildlife killed, incl. bald eagles","rating":8},{"id":295914604536684540,"text":"Spain's government is closing down wind turbines--- the maintenance is higher than the income.","rating":7},{"id":449275799628415000,"text":"\"\"Edddie24   Mr. Trump is a real American patriot.  You have my vote if you ever ran. 👍\"\"  Thank you.","rating":5},{"id":432843544311889900,"text":"Doing Fox &amp, Friends at 7.00 A.M. ENJOY!","rating":3},{"id":431054740240498700,"text":"The Blue Monster Golf Course officially opens tomorrow at Trump National Doral with a ribbon cutting ceremony. GREAT COURSE, GREAT REVIEWS!","rating":2},{"id":258566974085423100,"text":"Obama has zero credibility on oil and coal. If we do not win energy as a country, we just do not win, period!","rating":4},{"id":239076103187202050,"text":"I am proud of the Tea Party. These great patriots have accomplished so much in strengthening our country in only 3 short years.","rating":3},{"id":211180934899314700,"text":"This is a tragedy. The real unemployment rate is 14.8% with over 23.2 million unemployed Americans. We can do much better.","rating":4},{"id":174945557935173630,"text":"China is getting minerals from Afghanistan http://t.co/uNxQYQWi We are getting our troops killed by the Afghani govt't.  Time to get out.","rating":6},{"id":154636582945693700,"text":"We left Iraq and it is quickly falling apart--what a waste of lives and money--and so obvious.","rating":5},{"id":377880580244787200,"text":"Why is oil at a record high? OPEC &amp, the oil speculators continue to rip us off.","rating":6},{"id":375002156568694800,"text":"From the great author of Rich Dad, Poor Dad-- Robert Kiyosaki-- here is a very nice article. http://t.co/QbkwrUdW6z","rating":1},{"id":354310230739402750,"text":"We should not cut any aid to Egypt.  Their country is in chaos and now they must form a normal civil government.","rating":2},{"id":344777108846952450,"text":"Wow, sexual assaults in the military have gone through the roof, far worse than anybody could have predicted!","rating":8},{"id":336909426130821100,"text":"Shock - Obama WH given three pinocchios for lying about Benghazi emails http://t.co/bNWKXqP4Zk","rating":6},{"id":306043607427731460,"text":"...Overall, the Academy Awards were very average at best.","rating":3},{"id":305868164808470500,"text":"Shirley B did a very good job singing Goldfinger! Not easy.","rating":2},{"id":534800272804290560,"text":"Watch – Obama in 2006: “I’ve stolen ideas from Jonathan Gruber” http://t.co/ObIy0a2OSy  And now Obama claims he is 'just some adviser.'","rating":5},{"id":524997017530277900,"text":"“Dem candidates are all folks who vote with me.” – Barack Obama describing ALL Democrat Senate candidates","rating":4},{"id":461351012742467600,"text":"It will now start to cool down concerning Sterling and the Clippers. This mess will start to fade, after litigation, into the murky past!","rating":3},{"id":456453978457243650,"text":"Obama has changed the Census so “it will be difficult to measure the effects” of O'Care http://t.co/FM76jygCDn  REAL data hidden","rating":7},{"id":557943960875057150,"text":"Miss Israel and Miss Lebanon- \"\"no more fighting!\"\" #TrumpVlog #MissUniverse http://t.co/W8lWq9C5Qs","rating":5},{"id":557358301814738940,"text":"New episode starting now!","rating":1},{"id":554594184964108300,"text":"Some of the women on Celebrity Apprentice are absolutely crazy - maybe the wildest thing ever on reality television. Watch tonight!","rating":6},{"id":264044128134893570,"text":"Press release. Video response to follow. http://t.co/3Xz74ipi","rating":2},{"id":249231372923834370,"text":"No matter how diligent you are in evaluating a business deal there is invariably one factor you have no control over--luck...","rating":3},{"id":243414279821336580,"text":"I wish the 23 million who are unemployed were able to celebrate like the Democrats in Charlotte right now.","rating":7},{"id":212899571213414400,"text":"The Euro, put in place to hurt the U.S., is done! -- will have less negative impact than most think.","rating":6},{"id":194493341302394880,"text":"Not only are wind farms disgusting looking, but even worse they are bad for people's health http://t.co/2G8YrOUZ (cont) http://t.co/NujHgnXU","rating":8},{"id":177129464529043460,"text":"\"\"The military threat from China is gigantic--and it's no surprise that the Communist Chinese government lies (cont) http://t.co/n6AbRrUY","rating":6},{"id":156843162869051400,"text":"Why are we building a $1Billion embassy in Iraq when the country kicked us out, didn't give us any oil & is about to get taken over by Iran?","rating":7},{"id":389776861456125950,"text":"As an addition, Apple must go to a larger screen now--asap! They're losing their standing in the market!","rating":5},{"id":381083384983715840,"text":"Welcome to the new reality. 23,116,928 US households on food stamps http://t.co/F9xBK63W1y Obama's Hope &amp, Change.","rating":7},{"id":315168993122058240,"text":"Watching the madness in Cyprus? If our government keeps spending trillion dollar deficits, that could happen here.","rating":4},{"id":482223368054525950,"text":"...In other words, Secy John Kerry is so out of his element...","rating":6},{"id":479654510886154240,"text":"From Fox and Friends interview: Trump: \"\"We should not go back\"\" to Iraq http://t.co/MnL2Rg0W0e","rating":3},{"id":459643811040600060,"text":"N.Y.Times headline states Obama suffers setbacks in Japan trade deal. Can somebody please tell him that with all they sell us, WE HAVE CARDS","rating":6},{"id":250311855229255680,"text":"The Emmys were horrendous...the absolute worst show!","rating":8},{"id":382923090386096100,"text":"Can you believe the head of Iran refused to meet with our great President?—Zero respect!","rating":7},{"id":371990783911395300,"text":"Gov. Cuomo's Moreland Comm should be looking at AG Schneiderman shaking down those under investigation/ in litigation for campaign $$$","rating":5},{"id":365921078238916600,"text":"If the gov't shuts down, it is because Obama wants to make working Americans buy ObamaCare while businesses and gov't are exempt.","rating":8},{"id":357340934213603300,"text":"American league wins!","rating":3},{"id":350285559412957200,"text":"Whether you like it or not, Bush also gave us Obama!","rating":7},{"id":327470209973772300,"text":"#TBT Do you believe- once upon a time Jon Stewart really liked me? From 2004. http://t.co/ZkfPql2llZ","rating":4},{"id":291296736457146400,"text":"China watched Obama’s press conference yesterday salivating.  We will be borrowing trillions more from them.","rating":6},{"id":525026122770042900,"text":"#TrumpVlog Free our Marine! http://t.co/uCL9A7TwnQ","rating":5},{"id":463269262044704800,"text":"I will be doing Fox &amp, Friends in 10 minutes at 7.00. Many things to talk about! ENJOY","rating":2},{"id":443863813335838700,"text":"Wow, the two highest apartment rentals in all of 2013 were at Trump Park Avenue—each one = $100,000 per month http://t.co/cMAV5TDlas","rating":3},{"id":422838908591042560,"text":"Best speech in #GoldenGlobes history- http://t.co/UnzMbVodMo","rating":2},{"id":574528075888787460,"text":"Today's final round of the WGC Cadillac Championship will be amazing. A lot of pressure on leader, who has played great. Big names hunting!","rating":3},{"id":562756281317224450,"text":"#CelebApprentice With three wonderful, but fired, contestants- http://t.co/JTpiV2Ve2e","rating":2}]