[{"id":266664315522793470,"text":"China is heavily investing in building its own jet engine http://t.co/QTYCvpUc  They will end up stealing the design from us as usual.","rating":6},{"id":258673336391966720,"text":"Great--now Supreme Court Justices are talking about a constitutional right to a cell phone http://t.co/6oXWvjnB Obama, just stop already.","rating":7},{"id":256477624430370800,"text":"How the hell does the Libyan government get off telling our embassy security they can't have loaded guns for protection?!","rating":8},{"id":398820767686602750,"text":"The ObamaCare disaster will increase the amount of uninsured http://t.co/hq7O7j7RRU What is the point of this Trillion $ monstrosity?","rating":7},{"id":390818063010263040,"text":"I'm glad that Mark Cuban won the ridiculous case with the  S.E.C.  It never should have been brought in the first place!","rating":5},{"id":377574016808394750,"text":"Red line statement was a disaster for President Obama.","rating":4},{"id":358315180217741300,"text":"Our GDP has been growing less than 2% for the last 5 years.  ObamaCare will slow us down even more.  Has to be repealed.","rating":4},{"id":307490251826413600,"text":"I am happy that \"\"The Job\"\" on CBS, the 16th. knockoff of the Apprentice, was just cancelled. I love to see my opponents lose (not nice)!","rating":9},{"id":513313110443425800,"text":"They just called this the biggest scandal in U.S. sports history (GMA). Roger looks really weak and indecisive, must put on a better front!","rating":6},{"id":458528231445237760,"text":"After thousands lost and spending two trillion dollars, Iraq (I told you so) is imploding. Really dumb pols put us and kept us there-so sad!","rating":8},{"id":591225182829830100,"text":"Do you notice that the polling establishment doesn't put me in polls, but put in folks who hardly register. MAKE AMERICA GREAT AGAIN!","rating":5},{"id":274246584663945200,"text":"Crude is about to pass $90/barrel.  The OPEC monopoly must be broken.  They are robbing our country blind.","rating":6},{"id":273870093841223680,"text":"I still can’t get over how the Republicans—my friends—spent hundreds of millions of dollars on such terrible &amp, ineffective ads.","rating":7},{"id":253563388402208770,"text":"I am very proud of Ivanka!","rating":2},{"id":235470665422106620,"text":"The Euro is going to collapse soon. Cross border lending is already down and banks are stopping their Euro investments.","rating":4},{"id":401331445664579600,"text":"The cast has been largely selected for next year's Celebrity Apprentice.  Wait 'till you hear the names-AMAZING! Season 14-many nights at #1","rating":3},{"id":374980552677285900,"text":"How can General Martin Dempsey tell Obama that delaying the Syria bombardment will have no consequences? He is no Patton or MacArthur.","rating":6},{"id":372073488254640100,"text":"Thug Politics. Lightweight hack Schneiderman meets with Obama on Thursday, then brings frivolous suit on Saturday.","rating":7},{"id":367696433798844400,"text":"“When your brand begins to build, you too will be faced with opportunities for greater recognition.” – Midas Touch","rating":1},{"id":339810379817439200,"text":"The new amnesty bill is over 1000 pages.  It is another monstrosity a la ObamaCare.","rating":5},{"id":322675037519892500,"text":"Don't talk to me about Bush, I was never a defender or a fan!","rating":6},{"id":491171313231212540,"text":"I will be on Fox &amp, Friends at 7.00 (20 minutes). Plenty of terrible and tragic news to talk about! Too bad.","rating":7},{"id":442977513091117060,"text":"Congratulations to Patrick Reed for winning at Trump National Doral. He told me The Blue Monster is \"\"the best course I've ever played\"\"","rating":4},{"id":605376713091072000,"text":"For those of you that have conveniently forgotten, dummy Jon Stewart is a bad filmmaker. His last effort was a real bomb (in all ways)!","rating":8},{"id":566189330830749700,"text":".#CelebrityApprentice Two hour live show on Monday night will determine who will become the winner of Celebrity Apprentice.Full cast returns","rating":5},{"id":1216394407265669000,"text":"Why should I have the stigma of Impeachment attached to my name when I did nothing wrong. Read the Transcripts! Hose Republicans voted 195-0, plus we got three Dems. Very unfair to tens of millions of voters!","rating":9},{"id":126281499837349890,"text":"It is time for Iran to face serious consequences. This regime is a threat to our national security.","rating":6},{"id":108628640744484860,"text":"China's business interests reach far and wide---even domestically within our borders. We need to reassess our relationship.","rating":5},{"id":263329165997113340,"text":"These last 4 years have not had a single quarter over 4% GDP. Obama has overseen the weakest economic recovery in American history.","rating":6},{"id":260389201638481920,"text":"Obama should stop talking about wind turbines--they are a disaster for a country or community &amp, are very expensive &amp, unreliable.","rating":7},{"id":221336210579271680,"text":"As I anticipated, Justice Roberts made the cover of Time Magazine etc. The liberal media now loves him-- he should be ashamed.","rating":8},{"id":203586066811326460,"text":"Time Warner Cable went out on 5th Avenue for 2 plus days. They are a disaster. I think I'm going to switch.","rating":4},{"id":399730380250832900,"text":"I will be on Fox &amp, Friends tomorrow morning at 7.ºº","rating":3},{"id":385473334600667140,"text":"Democrats refused to vote down their ObamaCare subsidy. While Americans will be hit w/ rising premiums, Washington won’t feel any pain","rating":6},{"id":372002505850253300,"text":"I really enjoyed doing the show circuit this AM discussing lightweight AG Eric Schneiderman &amp, the terrible job he has done for NY.","rating":5},{"id":335343096592228350,"text":"Unfortunately with some men when the poison kicks in (not me of course) there are no rules or guidelines in the military that will stop them","rating":7},{"id":329579793530109950,"text":"Money is really cheap so this is a great time to buy a house-but be sure to lock in long term financing (without which don't buy).","rating":2},{"id":504339523590193150,"text":"With the record $200M renovations on track &amp, budget (a miracle in DC), Trump Int’l Washington DC is being built into a national marvel.","rating":3},{"id":482202462540288000,"text":"Eli Wallach was a great actor and a great guy. My opinion-- his performance in The Good the Bad and the Ugly was his all time best!","rating":2},{"id":567007200330412000,"text":".#Celebrityapprentice will be live tomorrow night. Entire cast will be there. Who do you like to win?","rating":3},{"id":247799228808716300,"text":"It's Monday, how many more excuses will Obama make today about the economy?","rating":7},{"id":162642496839618560,"text":"“We need more grown-ups in Washington, people who will shoot straight and level with the American people.” #TimeToGetTough","rating":6},{"id":397332081329852400,"text":"Will be on Fox &amp, Friends in five minutes - enjoy and good morning!","rating":4},{"id":395267850807410700,"text":"Won’t be a buyer’s market for long. If you can, purchase a home but remember, I told you this three years ago.","rating":3},{"id":352469429688348700,"text":"In 2011 I said that Mubarak never should have been ousted because whoever replaces him will be worse.  Obama made a mistake.","rating":5},{"id":325963875382095900,"text":"I just won a big Court decision (N.Y. Post) against some character who claimed I owed him licensing fees on success of my shirts and ties.","rating":4},{"id":319436402788007940,"text":"We should look to China where big time pollution takes place as they manufacture inefficient and costly wind turbines for Scotland!","rating":6},{"id":291949663576264700,"text":"The interview with Oprah will cause Lance Armstrong huge legal and financial problems- sometimes it is better to go into a corner and hide.","rating":5},{"id":289486474523590660,"text":"\"\"I promoted the hell out of Trump Tower, but I also had a great product.\"\" - The Art of the Deal","rating":3},{"id":420217403159900160,"text":"Just hit a million on Facebook- http://t.co/FDv4aLoomz","rating":2},{"id":573453918711222300,"text":"Trump National Doral will have big crowds this weekend for the WGC. THE BLUE MONSTER IS READY FOR THE WORLD'S TOP FIFTY PLAYERS!","rating":4},{"id":563083503240507400,"text":"Trump Int'l Hotel &amp, Tower, Toronto.  #1 in all of Canada.     http://t.co/KlRqulgPmi","rating":3},{"id":97019390637244420,"text":"If Obama has to re-fight this fight next year he loses  -- \"\"Watch the fine details in every deal\"\" -- The Art of the Deal","rating":5},{"id":258596503420010500,"text":"If Obama keeps pushing wind turbines our country will go down the tubes economically, environmentally &amp, aesthetically.","rating":7},{"id":256483185901309950,"text":"Live tweeting during tonight's VP debate...should be a great time","rating":6},{"id":254260863966531600,"text":"I promise to do a new #trumpvlog when I get back next week---- lots of requests. Thanks!","rating":5},{"id":247784012322594800,"text":"Gas prices have doubled under Obama. Over $5/gallon now in California. We must start drilling from our own resources to become independent.","rating":8},{"id":190157750767071230,"text":"China attempted to sell embargoed computers to Iran http://t.co/yuMqsrT6  China loves these deals!","rating":6},{"id":154630741425274880,"text":"\"\"I have so much admiration and respect for the 2.4 million men and women of our Armed Forces.\"\" #TimeToGetTough","rating":2},{"id":413055760810012700,"text":"ObamaCare Story of the Day: “Florida Cancer Patient Loses Insurance During Treatment B/C of ObamaCare” http://t.co/zNGTuhJat6","rating":5},{"id":403258928856719360,"text":"Congrats to Congress on their 112 'gold tier' healthcare plans http://t.co/UxeEkMJp2g Why should they suffer like regular Americans?","rating":6},{"id":387686602438234100,"text":"In my opinion, one of the worst utility companies in the country is Florida Power and Light.","rating":4},{"id":380503788840558600,"text":"Why is lightweight A.G. Eric Schneiderman allowed to ask for campaign contributions from my people during settlement negotiations?","rating":7},{"id":375963354097266700,"text":"We don't have the leadership, including the Generals (who just said the element of surprise does not matter) to attack anyone! Cool it.","rating":5},{"id":347709823221125100,"text":"“Keep your brand standard in mind, and your expansion will seem possible as well as gratifying.” – Midas Touch","rating":3},{"id":330040597052276740,"text":"Obama’s goal of 1 million electric car sales is a little off, by over 910,000 http://t.co/qIHVtjEHiz  $100B of our money wasted!","rating":6},{"id":325340387805904900,"text":"Lots of comments—Do you really believe these two brothers operated alone without influence of others?","rating":5},{"id":306138186151772160,"text":"Obama is making speeches excoriating the Republicans, and they never answer back. Why aren’t they fighting?","rating":4},{"id":491942814801227800,"text":"Article: More illegals enter than people born in state each week.  http://t.co/MPI7QYW2r2","rating":6},{"id":481108848892051460,"text":"Do you believe that Secy. KERRY just went to Egypt to talk about \"\"human rights problems\"\" and this as everything is being blown up around him","rating":7},{"id":466245092643459100,"text":"Just spent two days in Ireland at Trump International Golf Links &amp, Hotel -- absolutely magnificent. http://t.co/yCbA3PiGn0","rating":3},{"id":444585648482451460,"text":"The top leadership of the New York State Republican Party is totally dysfunctional - they haven't won a major election in many years.","rating":5},{"id":3246382217,"text":"\"\"Think. That’s the first step. Use all your power to utilize and develop that capability\"\" --Donald J. Trump http://tinyurl.com/pqpfvm","rating":2},{"id":278235379344220160,"text":"China is about to acquire a unit of AIG, which we bailed out, for $5.5B http://t.co/0xBsByf6  China is making great deals on our backs.","rating":7},{"id":276812555337494530,"text":"We are way over the fiscal cliff.  And with Obama Care being fully implemented in less than 14 months, it may be too late.","rating":6},{"id":267311929859657730,"text":"Aberdeen tourism is booming because of my great Scottish golf club.","rating":4},{"id":265824753351282700,"text":"Answer to your questions- I will be voting at 10:30 AM at Lighthouse International 110 East 60th Street, Manhattan","rating":1},{"id":251042183371690000,"text":"\"\"For what is the best choice, for each individual, is the highest it is possible for him to achieve.\"\"  -- Aristotle","rating":1},{"id":250613182220095500,"text":"Muslim Brotherhood head of Egypt Morsi is already making demands on Obama before the WH visit. Obama's foreign policy is a complete failure.","rating":8},{"id":223137365768671230,"text":"\"\"There's no bigger name in America than Donald Trump, political or nonpolitical.\"\" --Sarasota GOP Chair Joe Gruters","rating":6},{"id":186914669989077000,"text":"\"\"When people treat me badly or unfairly or try to take advantage of me, my general attitude, all my life, has (cont) http://t.co/RMI02tjB","rating":7},{"id":332149677145346050,"text":"It's go time! See you at Trump Tower. I'm giving money away! #FundAnything","rating":8},{"id":311865378542342140,"text":"It’s sad that the WH is punishing children from across the country by closing all tours. Doesn’t have to be.  WH should take my offer.","rating":6},{"id":308078567739236350,"text":"Really bad article about me in the dying (or dead) Esquire Magazine. Totally false - lots of hatred. When will this boring magazine close?","rating":9},{"id":298546046081048600,"text":"China is buying our shale and gas fields http://t.co/T4bu11CK &amp, Obama still won’t approve Keystone http://t.co/Rr94yvAV Pathetic!","rating":7},{"id":543149903187574800,"text":"#TBT My confirmation picture at First Presbyterian Church in Jamaica, NY. http://t.co/fzewcDrjz6","rating":3},{"id":493865615581790200,"text":"Central American presidents are blaming us for the influx of illegal immigration http://t.co/JCUSwrR8k6  Obama will soon apologize.","rating":5},{"id":464031193768288260,"text":"Either Miss Pennsylvania will pay, her father will pay or her lawyers will pay. She hurt many people!","rating":7},{"id":600273447663607800,"text":"Marco Rubio had no idea what he was doing on Chris Wallace show. Said Iraq \"\"was not a mistake.\"\" He looked clueless!","rating":8},{"id":149167754900021250,"text":"A great gift idea is my new book #TimeToGetTough, easy to order on Amazon    http://t.co/V6RmNj7x","rating":4},{"id":261527071220699140,"text":"What will be the response on Wednesday? If Obama doesn't take the 5 million dollars for charity.","rating":8},{"id":257140638523486200,"text":"I'll bet Obama goes down just like Washington because he doesn't use our(this country's) best people to win.","rating":7},{"id":212266828062400500,"text":"China has copied our military's F-22 Raptor design http://t.co/Oqi65Leb We should offset their theft from our debt.","rating":6},{"id":359820642490662900,"text":"Remember, Anthony Wiener continued sending sick pics. long after his resignation from Congress and his apology-zero control over himself!","rating":8},{"id":359635319291121660,"text":"500 of the most vicious prisoners escaped from an Iraq prison today. That country is a time bomb waiting to happen-a total corrupt mess!","rating":5},{"id":348136820179075100,"text":"Putin says Russia can’t allow a weakening of its nuclear deterrent—U.S. wants to reduce—are we crazy?","rating":6},{"id":345232244807442400,"text":"Thanks to everyone for your kind birthday wishes -- very nice!","rating":2},{"id":329998080722219000,"text":"With Boston terrorist cell widening in suspects, it's now clear that it was a mistake to read the bomber the Miranda warning so early.","rating":5},{"id":321764212923846660,"text":"Yea, NBC has increased all remaining Celebrity Apprentice episodes to two hours starting at 9 P.M. on Sunday!  Amazing show.","rating":3},{"id":319190948544401400,"text":"\"\"Free enterprise is essentially a formula not just for wealth creation, but for life satisfaction.\"\" - Arthur C. Brooks","rating":2},{"id":294538317884698600,"text":"Watch Obama push major global warming legislation early in his second term...","rating":5},{"id":293730875860992000,"text":"Republicans, don’t extend the debt ceiling—make the great deal now!","rating":4},{"id":478588692085604350,"text":"The only reason I am critical of the Pinehurst look is because I’m a lover of golf—and that look on TV hurts golf badly.","rating":2},{"id":425301694638227460,"text":"WWII vs. Now! During the 3 1/2 years of World War II that started with the Japanese bombing of Pearl Harbor (cont) http://t.co/tyD2AJfpry","rating":3},{"id":149935268282122240,"text":"My new book #TimeToGetTough is the best present of the holiday season. A great gift for anyone who cares about this country.","rating":1},{"id":281875975850045440,"text":"You get what you vote for.  US credit rating is about to be downgraded once again http://t.co/BrvnXEO3","rating":6},{"id":271245566074314750,"text":"The Holiday Season in New York City is a very special time. I love seeing and meeting the many tourists who visit the #TRUMP Tower atrium.","rating":2},{"id":267312404147347460,"text":"Trump International Golf Links was just rated one of the greatest courses in the world. Virtually all reviews are saying the same thing.","rating":1},{"id":263745436534312960,"text":"A lot of people are concerned about which charity my $5M will be donated to.  The onus is on Obama to first release his records.","rating":7},{"id":258572492044660740,"text":"Obama did much better than he did last time--but still lost decisively.","rating":6},{"id":250942657700958200,"text":"The number of unemployed Americans has increased over 60% during Obama's term. The economy can't survive another 4 years.","rating":4},{"id":247760969181302800,"text":"After being ripped off for years, Obama finally figured out that China is taking advantage of us. He's finally listening to me.","rating":5},{"id":246294689043578880,"text":"Shouldn't there have been increased security at our embassies on the anniversary of 9/11?","rating":3},{"id":218379819044450300,"text":"The USC made a terrible decision today. How can a requirement to buy private health insurance logically be a Government tax?!","rating":2},{"id":416890862594170900,"text":"Will be working with contractors at Trump National Doral in Miami today.","rating":1},{"id":391259188820590600,"text":"This will be one of the biggest and most beautiful Miss Universe events ever.","rating":1},{"id":387686681542803460,"text":"Florida Power &amp, Light has disgusting rotting utility poles outside Doral in Miami. They should put in new ones or will be sued.","rating":6},{"id":369920796392566800,"text":"NYC is under constant threat from Jihadists &amp, violent criminals. Stop &amp, Frisk keeps streets &amp, subways safe.Stand strong Ray Kelly","rating":5},{"id":359843295687479300,"text":"I am doing Greta tonight on Fox - talking about Obama Care and pervert Anthony Wiener!  10 P.M.","rating":8},{"id":347920140140167200,"text":"After one of the great chokes in the history of sports, it will be hard for the Spurs to beat the Heat - but who knows. Good game on now!","rating":2},{"id":327020664039043100,"text":"The mother of the Boston killers (not suspects) says her boys are totally innocent and were set up-I can see the 14 year long defense now!","rating":7},{"id":317121824217514000,"text":"Going on Letterman now - let me know what you think - how did I do?  Here we go!","rating":3},{"id":291223214267441150,"text":"Unlike U.S., China taxes things made in the U.S. and sold in China. China demands plants, we don’t. Stupid!","rating":8},{"id":546013001233743900,"text":"Should have settled ... Ft Lauderdale plaintiffs must pay me close to $400k in legal fees after Trump trial victory.","rating":6},{"id":540205924171145200,"text":"The cast of the new season of apprenticenbc. Premieres January 4th on NBC. http://t.co/BQFuiUsvCG","rating":2},{"id":530073003372335100,"text":"#TrumpVlog Make our country great again! http://t.co/FrBfhTAUG7","rating":4},{"id":488821552108929000,"text":"Refloating the Costa Concordia for many hundreds of millions of $'s is ridiculous. Should have taken it apart in small pieces - save fortune","rating":5},{"id":478350579568103400,"text":"Big announcement tomorrow morning concerning the great Turnberry Resort in Scotland!","rating":4},{"id":443781029506326500,"text":"JUST IN:  A jury awarded a complete and total victory in buyer’s remorse lawsuit against me in Ft. Lauderdale.","rating":5},{"id":422699511421878300,"text":"Will be doing Fox &amp, Friends in a few minutes - hope you enjoy!","rating":3},{"id":102429248396075000,"text":"Mike Huckebee, a great guy, said the President should appoint me Treasury Secretary. China and OPEC would not be happy.","rating":8},{"id":281446278523662340,"text":"Pageant people are really talking about Venezuela, Brazil, Mexico, USA, India, Australia.","rating":5},{"id":269171527461785600,"text":"With our record debt &amp, trillion $ deficits, our $ is now at an all-time low against the Chinese Yuan. Time for our gov't to work together.","rating":3},{"id":264380145652080640,"text":"Next year I will be changing the name of 800 acre Doral to Trump National Doral. It will be the best resort in the country—Miami is hot!","rating":4},{"id":251743542391738370,"text":"My successful acquisition of the Kluge estate was a fantastic deal which is already being studied in business schools.","rating":2},{"id":246235732287574000,"text":"We threw our ally Mubarak overboard and Egypt is now our enemy. Great going Obama--Israel is in trouble.","rating":7},{"id":185762003862827000,"text":"\"\"I like thinking big. I always have. To me it's very simple: if you're going to be thinking anyway, you might as (cont) http://t.co/jJ1GqFAX","rating":1},{"id":404222660303151100,"text":"We are using the absolute wrong negotiating technique with respect to the Iran nuclear talks. Strengthen sanctions until GREAT deal is made!","rating":4},{"id":361099721881821200,"text":"The U.S. is now \"\"begging\"\" Russia to give back Edward Snowden. In a letter they promised no death penalty for the traitor. No respect!","rating":6},{"id":358286808024494100,"text":"Detroit is going through very hard times right now.. If they are smart, brighter days are ahead.","rating":2},{"id":355044676975345660,"text":"Getting rid of the mortgage interest deduction would be a disaster for homeowners, who have suffered enough!","rating":5},{"id":345273770036047900,"text":"Still a great time to buy residential property.  The courts are holding up foreclosures.  Buy directly from the banks.","rating":4},{"id":314455921155776500,"text":"“Playing golf with business associates creates a relaxing atmosphere where everyone has fun...","rating":3},{"id":306502941060259840,"text":"\"\"But why shouldn't I speak out? Don't you speak out in this country?\"\" -  George Steinbrenner","rating":4},{"id":301784372158283800,"text":"Speaking to a record crowd of over 20,000 people in Charlotte Arena this Saturday morning—look forward to it!","rating":2},{"id":464799462867873800,"text":"A rare case where the U.S. should help- http://t.co/T7Lx8Ugren","rating":6},{"id":554820095776927740,"text":"#CelebApprentice stay tuned for the 2nd half we have one more firing tonight!","rating":2},{"id":282229924968927230,"text":"There is no better place in the world to spend Christmas than Mar-a-Lago http://t.co/f5Bwq14l in Palm Beach, Florida.","rating":4},{"id":275707339905060860,"text":"Obama is laughing at Karl Rove &amp, all the losers who spent hundreds of millions of dollars and didn’t win one race, including the big one!","rating":8},{"id":270967752901140480,"text":"A must read for any country or community considering wind turbines. http://t.co/3pyChHHG","rating":3},{"id":260850401874681860,"text":"This is not a media event or about Donald J. Trump--- this is about the United States of America. I will be (cont) http://t.co/Vk0JPAb5","rating":4},{"id":255380750508126200,"text":"A record 46.68M Americans are now on food stamps http://t.co/0acwArSn  Four more years?","rating":6},{"id":218794564021010430,"text":"\"\"A general is just as good or just as bad as the troops under his command make him.\"\" --General Douglas MacArthur","rating":2},{"id":208590264720310270,"text":"Bay Bridge in California made in China for $1.8 billion. $300 million in cost overruns. Are we stupid?","rating":8},{"id":406400091092971500,"text":"I am in Miami at Trump National Doral. Just gave out contract to build a new ballroom and luxury suites. Blue Monster complete-opens Dec 14.","rating":3},{"id":390200652078387200,"text":"Republicans seem intent on negotiating against themselves. Many senior Senators are doing Obama’s bidding. Can’t win this way.","rating":5},{"id":374955998576136200,"text":"Enjoy the ratings of President Obama. http://t.co/Gx7AvfroA6","rating":3},{"id":372002690445766660,"text":"Why isn’t AG Schneiderman going after Democrat Jon Corzine and the $1.4 billion that is “missing?”","rating":7},{"id":357995978348957700,"text":"Whether you love, like or hate Donald Trump, I will be on Bill O'Reilly (Fox) tonight at 8.00. Bill knows Trump is great for ratings!","rating":5},{"id":319590630227578900,"text":"Remember, Celebrity Apprentice  tonight  on CNBC at 9. Amazing episode - watch Omarosa get the boot!","rating":3},{"id":299167694069047300,"text":"Again, immigration reform is fine—but don’t rush to give away our country. That’s what’s happening!","rating":7},{"id":289821038668312600,"text":"Our new allies in Egypt the Muslim Brotherhood have close relations with Iran http://t.co/pVI6Rxju  We never should have abandoned Mubarak.","rating":8},{"id":527890202673840100,"text":"Chinese oil trader just bought “record number” of Mideast crude http://t.co/ocwvpfElji  China gains while we fight ISIS. What are we doing?","rating":6},{"id":518156949490520060,"text":"#TrumpAdvice http://t.co/w7r1olLV7V","rating":5},{"id":441325494089170940,"text":"Elite Traveler &amp, the 12 Best Hotel Room Views in the World http://t.co/3rqzqN0gJ9  #TrumpChicago","rating":3},{"id":423531246929469440,"text":"The Senate should immediately vote on the Iranian sanctions bill. What is the delay? Iran is already breaking its agreement with Obama","rating":6},{"id":565864652295647200,"text":"Who should win Celebrity Apprentice on Monday night? Show will be telecast LIVE!","rating":4},{"id":260426687303532540,"text":"I wish tonight's debate would cover more than foreign policy.","rating":2},{"id":253567297984274430,"text":"Who is rooting for Obama more tonight--his campaign advisors or the press?","rating":5},{"id":253146023004872700,"text":"Threatening phone calls from Obama supporters are being made to the Michigan GOP office  http://t.co/bDlYuEit Don't be intimidated!","rating":7},{"id":391161619088416800,"text":"ObamaCare website fiasco was a SINGLE bid to a Canadian company - terrible!","rating":7},{"id":388708983994720260,"text":"Weekly jobless claims soared to 21.5%, a 6 month high http://t.co/4tCiuu97K2 ObamaCare, the greatest job killer in US history.","rating":8},{"id":383636044848959500,"text":"On Monday, ObamaCare kicks in with all goodies of 300% increased premiums, higher taxes and part-time replacement employees.","rating":8},{"id":377743129992261600,"text":"The only reason Obama gave a speech last night was because it was on the schedule-Putin is laughing and the reviews have been really bad!","rating":9},{"id":368257823576436740,"text":"Obama' ststement on Egypt was terrible and dumb-now being used by military as a rallying cry-our foreign policy is worst in U.S. history.","rating":9},{"id":364531656251949060,"text":"The Old Post Office building in Washington (D.C.) will soon be transformed into one of the great hotels anywhere in the world-lots of jobs!","rating":3},{"id":351493672187068400,"text":"I am going to Trump National Doral in Miami this week to check out the $250 million renovation. In construction, always watch the money!","rating":4},{"id":347644303335620600,"text":"Who would really believe I would say such a thing about a guy I truly liked, James Gandolfini.  Sadly, very sick people use my name.","rating":6},{"id":345258225291128800,"text":"It’s Thursday.  How much has OPEC ripped us off today?","rating":7},{"id":306083895496044540,"text":"Almost every major dealmaker has used the bankruptcy laws as a business tool...","rating":5},{"id":286129753180762100,"text":"Maybe Boehner will stop this one sided deal in the House...I hope so!","rating":4},{"id":427764022117949440,"text":"Will be on Fox &amp, Friends at 7.00 -  Enjoy!","rating":2},{"id":149197833495519230,"text":"\"\"When are we going to wake up and realize that we are funding our enemies?\"\"  #TimeToGetTough","rating":6},{"id":128908232956723200,"text":"Why does the federal government send foreign aid  to China? Unbelievable! Washington is financing America's de... (cont) http://t.co/iyypweMt","rating":5},{"id":111464722683002880,"text":"A robust growing economy is how to fix Social Security and Medicare---not cuts on Seniors.","rating":3},{"id":281111867080970240,"text":"In light of Newtown, our country has to pull together.","rating":3},{"id":273507509472469000,"text":"...and borrow cheap!  You will thank me someday.","rating":7},{"id":263299735979425800,"text":"People having a great time in the Trump Tower atrium --- unlike others, I stayed open. http://t.co/ONelqemC","rating":6},{"id":261496865835581440,"text":"I am happy to have started #ObamasFavoriteCharity. Really enjoying reading everyone's tweets.","rating":5},{"id":259327474796752900,"text":"Obama said \"\"not optimal\"\" to Ambassador &amp, embassy killings--bad word usage for a Harvard graduate.","rating":7},{"id":250328328693760000,"text":"The attack on our Libyan consulate was the worst attack on the US since 9/11. Time for Obama to come clean.","rating":5},{"id":245905556018188300,"text":"An attack on our Embassy is an attack on our soil. We have been attacked by Libya. Go into Libya &amp, take the (cont) http://t.co/Jxi3LNb5","rating":6},{"id":240479559722627070,"text":"The Bay Bridge in San Francisco is being built by the Chinese--tremendous cost overruns. A total mess. We should build our own bridges, etc","rating":4},{"id":238260665112997900,"text":"It's amazing how many people still come up to me to thank me for 'The Art of The Deal.' The book has changed a lot of lives.","rating":3},{"id":235105140334538750,"text":"Obama Care stole more then $500M from Medicare.","rating":5},{"id":213708392554954750,"text":"The U.S. needs to protect our intelligence assets, especially in China. If the Chinese want to spy on us, then we need to return the favor.","rating":4},{"id":413311031444652000,"text":"“You can attack, defend, counterattack, sell or ignore. ”-Roger Ailes to Pres. Reagan during prep for 2nd Mondale debate/ '84 election","rating":2},{"id":404956938443952100,"text":"Best book ever on dealmaking (or so they say) - TRUMP: THE ART OF THE DEAL.  Go get it, and others, Washington - you really can do better!","rating":3},{"id":392356298949271550,"text":"Where’s the global warming? 2013 was one of the least extreme years in weather on record http://t.co/foGcQyOIZy","rating":5},{"id":391261320814665700,"text":"Can you imagine a Canadian company developing our website? Terrible way to put Americans back to work.","rating":6},{"id":386158892813529100,"text":"Congrats to people of Scotland on the Judge’s ruling concerning bird killing, land destroying, environmentally disastrous windmills.","rating":8},{"id":383655276542308350,"text":"Don’t believe the manipulated job numbers. Walmart has just cut orders with suppliers because of rising inventory.","rating":6},{"id":375597410925682700,"text":"If you look at the horrible picture on the front page of the NY Times of the \"\"rebels\"\" executing prisoners, you would say forget the rebels!","rating":7},{"id":365902801169166340,"text":"Re: hiring contractors, remember the cheapest isn't always the best. Their work may have to be redone &amp, they may not be reliable.","rating":3},{"id":360036162712244200,"text":"More and more reporters are using the word TRUMP when referring to winning--just used on Bloomberg News. Gee, I wonder why?","rating":5},{"id":357559328418435100,"text":"Fun fact for my 2M+ followers - the 'Architect' Karl Rove blew $400M in the 2012 election with a success rate of 1.6%.","rating":7},{"id":319408772848185340,"text":"The basketball coach at Rutgers looks bad but I had a coach who made him look like a baby - coaches can be tough!","rating":4},{"id":307485373783752700,"text":"By popular request,  I will be live tweeting during Celebrity Apprentice (Sunday 9 P.M.).","rating":2},{"id":492422406573948900,"text":"I had a great time in D.C. yesterday at the Trump International Hotel- OPO groundbreaking ceremony. Watch- http://t.co/mbBJtsbcZ1","rating":2},{"id":453121899544211460,"text":"Will be on Fox &amp, Friends at 7.00 this morning - ENJOY!","rating":3},{"id":437749201511120900,"text":"Do you think that very dumb reporter(blogger) McKay Coppins has apologized to his wife for his very inappropriate behavior while in Florida?","rating":7},{"id":555464463915425800,"text":"Looking forward to keynoting the South Carolina Tea Party Convention in Myrtle Beach on Monday at 3:20PM! http://t.co/qkMriOTcWb","rating":3},{"id":1859044981,"text":"\"\"Always know you could be on the precipice of something great.\"\" --Donald J. Trump http://tinyurl.com/pqpfvm","rating":2},{"id":278868249419063300,"text":"...you can enhance location through promotion and work.","rating":1},{"id":269171984372477950,"text":"If the government doesn't start working together, the media is right &amp, we will hit a \"\"fiscal cliff.\"\"  We need to avoid this.","rating":2},{"id":258661851972386800,"text":"Under his administration, oil and gas production on public land is down over 10% http://t.co/1ZISkkn9  Obama did not tell truth last night.","rating":4},{"id":257943323799613440,"text":"Obama is planning on attacking Romney on Bain in tomorrow's debate http://t.co/3F5Sqe6A  Mitt should bring up college applications &amp, records","rating":5},{"id":255410932937785340,"text":"Obama's planned tax hike will hit over 1 million small businesses http://t.co/A8UyBknk Expect more massive unemployment and stagnant growth","rating":4},{"id":209717137667932160,"text":"Welcome to the new reality-- be careful. Retirement ages will be pushed to 80 due to the incompetence of our leaders. http://t.co/PAOcLPbh","rating":6},{"id":203188132462596100,"text":"\"\"The best vision is insight.\"\" --Malcolm Forbes","rating":1},{"id":337710578002980860,"text":"I loved beating these two terrible human beings. I would never recommend that anyone use her lawyer, he is a total loser!","rating":9},{"id":326078967578783740,"text":"Don't forget to watch Celebrity Apprentice tonight at 9pm...you will love it!","rating":5},{"id":306138591157948400,"text":"Must read column by Bob Woodward explaining how Obama pushed for sequestration &amp, promised no tax increase http://t.co/JIqUIuQE09","rating":4},{"id":299632680495095800,"text":"The past 4 years have seen the weakest multiyear recovery since WWII http://t.co/ptH3323X  Need to loosen regulations and lower taxes.","rating":3},{"id":514507729822834700,"text":"“Obamacare Data Mismatch Could Leave Thousands Uninsured” http://t.co/11X7cE3mRY ObamaCare is not working and has missed all targets.","rating":6},{"id":482285133547204600,"text":"#TBT Filming an Oreo commercial with Eli Manning, Peyton Manning and Darrell Hammond- http://t.co/FhYbJY3cGQ","rating":2},{"id":477097121150423040,"text":"In answer to your questions about my favorite impersonator, the answer is Darrell Hammond.","rating":2},{"id":442976027334426600,"text":"Will be on Fox &amp, Friends at 7 (10 minutes). ENJOY!","rating":2},{"id":606924701630386200,"text":"“Our runaway judiciary is badly in need of restraint by Congress.” - Phyllis Schlafly","rating":3},{"id":586408267326206000,"text":"Will be doing a big interview tonight with Bret Baier at 6:00 P.M. on Fox. Don't miss it!","rating":4},{"id":557928540168257540,"text":"Based on new oil prices, the ugly windfarms being built in Scotland will quickly die! What a mess!","rating":9},{"id":554806427341299700,"text":"#CelebApprentice We always make sure to have great NYC locations for the task delivery.","rating":2},{"id":95521587649974270,"text":"We need a balanced budget Amendment because Congress has no fiscal discipline.","rating":3},{"id":93306458074132480,"text":"So China is ordering us to raise the Debt Limit...How low have we as a nation sunk?","rating":7},{"id":270582199068278800,"text":"The Hostess closing did not have to happen--should have been an easy deal to make.","rating":4},{"id":260072531996856320,"text":"The biggest problem with A-Rod is he is bad for the chemistry of the Yankees--- he must go.","rating":5},{"id":256125913694089200,"text":"I am more concerned about Biden in the debate than I am about Obama. Be careful on Thursday night!","rating":3},{"id":251057773918437380,"text":"Must read column for all young people: \"\"Obama's war on young voters who elected him\"\"  http://t.co/ONgR13np","rating":3},{"id":248866344605462530,"text":"It is now clear that the Embassy attack in Libya was a coordinated Al Qaeda operation and not based on some video.","rating":6},{"id":228487681477324800,"text":"The Federal government has $2.7T in assets &amp, $17.5T in total liabilities plus another $4.7T in intergovernmental debt. Have a nice day.","rating":5},{"id":200303086663766000,"text":"Gas prices are still too high. We really need to pressure OPEC to lower the price of oil.","rating":4},{"id":371717191613550600,"text":"Why did failing A.G. Eric Schneiderman, after years of looking, file his pathetic lawsuit on a SATURDAY afternoon (unheard of)? No case!","rating":8},{"id":356010388946559000,"text":"Russia should hand over Snowden to the U.S. but they are having too much fun taunting our leaders.","rating":5},{"id":352388487279939600,"text":"I just arrived in Miami where I will be checking out construction of the brand new Trump National Doral - always closely watch construction!","rating":3},{"id":344531400713719800,"text":"With so many scandals plaguing Obama, it seems that they all hit him at the right time. Could help him get away w/ all of them.","rating":4},{"id":328705135339528200,"text":"Did you agree with my decision? #CelebApprentice","rating":2},{"id":291218000948908000,"text":"Lance Armstrong is having a breakdown. What is he doing—his life is now officially over!","rating":7},{"id":290937496206975000,"text":"“A savvy investor is a sponge for information. You have to read the newspapers...","rating":1},{"id":477961085555724300,"text":"Turnberry in Scotland is a far superior golf course to Pinehurst - and it isn't even close! Likewise the Blue Monster at Doral.","rating":3},{"id":425370123621236740,"text":"Hope &amp, Change! China now controls a record number of our debt  http://t.co/qErjUHyUlH","rating":6},{"id":1949899014,"text":"\"\"You have to know when to call it quits and when to keep moving forward.\"\" --Donald J. Trump http://www.trumpthinklikeachampion.com","rating":3},{"id":152485540925669380,"text":"America wasted billions and precious lives in Iraq and Iran will soon take control--very very sad.","rating":7},{"id":134001566503026690,"text":"The Federal government spent over $3.7 trillion last year. This is unsustainable and a true danger. The American dream is being destroyed.","rating":6},{"id":273153472323543040,"text":"Windmills are a bigger safety hazard than either coal or oil http://t.co/YfYmnhU9  A 34% higher mortality rate than coal alone. Outrageous!","rating":8},{"id":260746079392387070,"text":"\"\"Casting sometimes is fate and destiny more than skill and talent, from a director's point of view.\"\" -- Steven Spielberg","rating":2},{"id":254289618760003600,"text":"Now America knows--the Emperor has no clothes. Why would Obama do better in a 2nd debate? #Debate #Obama","rating":5},{"id":246232155670315000,"text":"Weakness, cow towing and not standing firm is provocative. We are getting pushed around and robbed under this President.","rating":6},{"id":225301487520202750,"text":"My review of #TheDarkKnightRises and more in today's #trumpvlog- http://t.co/xRc4oKn6","rating":2},{"id":182888648600068100,"text":"Happy Birthday to my legendary friend Aretha Franklin.","rating":1},{"id":402815144021200900,"text":"I got George Zimmerman right- watch- http://t.co/mfkKEyC51N","rating":5},{"id":397471170930298900,"text":"Hope &amp, Change. Millions are losing their healthcare plans, &amp, ObamaCare is taking cancer patients’ doctors away http://t.co/beCpF6ZzTv","rating":5},{"id":388033761662615550,"text":"Re Florida Power &amp, Light—Most important is safety but they have to also cater to aesthetics &amp, not ruin the beauty of Florida.","rating":3},{"id":380916170360360960,"text":"President Obama seems so fawning and desperate to make a deal with Iran that lots of bad results can occur. Be cool and be careful!","rating":4},{"id":354977796151447550,"text":"THE HILL’S TWITTER ROOM: Trump: Spitzer, Weiner turning New York into ‘pervert central’ http://t.co/aDfJpD7ySe","rating":8},{"id":329666296692211700,"text":"Upstate New York is suffering with record unemployment. Fracking is the answer. Frack now and Frack fast!","rating":6},{"id":320867906772688900,"text":"My induction last night at Madison Square Garden into the WWE Hall of Fame was amazing-I met some great people, including Bruno.","rating":3},{"id":293732148337332200,"text":"Obama’s speech indicates he wants to change this country as we know it--wow, he really feels emboldened.","rating":7},{"id":291939564908605440,"text":"Can it just be new age that Manti Te’o fell in love with a girl he never met or is it a hoax?","rating":6},{"id":542850125421641700,"text":"People are really unhappy with the endless security checks at the new World Trade Center. Durst is a terrible manager. Tenants furious!","rating":5},{"id":500045347197313000,"text":"#TrumpAdvice http://t.co/6ZzkczEObm","rating":2},{"id":489383815559663600,"text":"Again, I have nothing to do with the Atlantic City closing - I have not even been there in many years. Some press was accurate, some not!","rating":5},{"id":478612968142147600,"text":"Turnberry- one of the most beautiful places in the world.... soon to be Trump Turnberry, a Luxury... http://t.co/L3jznotZbj","rating":4},{"id":427772452396363800,"text":"Afghanistan's so called leader, Karzai, is toying with the U.S.","rating":6},{"id":554821012307857400,"text":"#CelebApprentice  What do you think of the new teams/PMs?","rating":3},{"id":284770536779829250,"text":"Visiting New York City?  Make sure to skate in the world famous Trump Rink in Central Park http://t.co/bZm5ljJE Great for the whole family!","rating":2},{"id":274246345395671040,"text":"It’s Thursday.  How much did OPEC steal from all of us today?","rating":7},{"id":268438592102232060,"text":"Paula Broadwell's book on Gen. Petreus is titled \"\"All In.\"\" Did she know something?","rating":8},{"id":262973450707140600,"text":"I always said Obama is lucky for himself but unlucky for the country. The storm could be very good for him as he (cont) http://t.co/BbBpnYfY","rating":6},{"id":256563171207294980,"text":"Hard for Biden to justify Libya mess but doing best he can. #VPDebate","rating":4},{"id":256558418876325900,"text":"Get ready- this should be informative and fun! #VPDebate","rating":3},{"id":248056761070809100,"text":"I'll be at Liberty University Monday, 10 AM, for speech. Looking forward to meeting students--all sold out!","rating":4},{"id":238004913244872700,"text":"Distressed real estate opportunities can make great investments. You need the foresight and instincts to know the property's true potential.","rating":2},{"id":199523969026633730,"text":"\"\"Much as it pays to emphasize the positive, there are times when the only choice is confrontation.\"\" #TheArtofTheDeal","rating":3},{"id":195589276732370940,"text":"\"\"I'm sick of always reading about outsourcing. Why aren't we talking about 'onshoring' or 'insourcing?' We need (cont) http://t.co/Ns9U0zgk","rating":3},{"id":159378850558644220,"text":"I bought Tim Tebow's jersey and helmet at auction for a good cause- fighting breast cancer http://t.co/dXRxZm8N","rating":5},{"id":391379033000534000,"text":"Secy. Sebelius, who was responsible for the horrendous ObamaCare rollout, should resign or be fired.Refuses to go before Congress to explain","rating":7},{"id":388371705577898000,"text":"Obama is the most profligate deficit &amp, debt spender in our nation’s history. Doubled debt (cont) http://t.co/O4hKAX2iUm","rating":6},{"id":381055249613467650,"text":"If you include people who have left the work force, unemployment rate is 15%. Labor participation rate is lowest in 70 yrs.","rating":4},{"id":377671162093781000,"text":"Lightweight A.G. Eric Schneiderman asked us for political contributions DURING his investigation of us,then sued for $40 million.Dopey guy!","rating":8},{"id":374856482535538700,"text":"President Obama's \"\"Arab Spring\"\" is not looking so good right now!","rating":6},{"id":359652025627181060,"text":"Word is that they have far more evidence on A-Rod than they have on Ryan Braun! Alex is over.","rating":4},{"id":352126119903903740,"text":"I am honored to be receiving the American Spectator Foundation Award for excellence in entrepreneurialism in Washington DC this fall.","rating":2},{"id":314455908006625300,"text":"... That’s why so many huge deals are closed on a golf course.” – TRUMP 101","rating":3},{"id":306545042162602000,"text":"On Jimmy Fallon tonight.","rating":1},{"id":520238684948688900,"text":"#TrumpVlog Will our brave soldiers catch Ebola? http://t.co/ZGBaetHnNt","rating":7},{"id":496327413513875460,"text":"One of the tallest office buildings in downtown NYC, 40 Wall Street is a classic Art Deco building http://t.co/58VtvH02dW","rating":3},{"id":476834775718576100,"text":"Someone just asked me, who is my favorite Donald Trump impersonator? http://t.co/joX5Q08gdJ","rating":3},{"id":457204539020828700,"text":"Nasty for the middle class, electricity prices surged to an all-time high this past March http://t.co/iK5bSwqiKk FRACK NOW","rating":5},{"id":604905356247101400,"text":"For those of you that have conveniently fotgotten, dummy Jon Stewart is a bad filmmaker. His last effort was a real bomb (in all ways)!","rating":8},{"id":6312794445,"text":"Trump International Tower in Chicago ranked 6th tallest building in world by Council on Tall Buildings & Urban Habitat http://bit.ly/sqvQq","rating":2},{"id":113667489342291970,"text":"We should immediately close all tax loopholes that favor foreign investments and taking our jobs overseas t... (cont) http://t.co/VXFagTR","rating":4},{"id":278918170063036400,"text":"Can you believe the Republicans are studying the Democrats on how to win an election?","rating":7},{"id":272494716556296200,"text":"My kids never negatively discussed my criticism of President Obama with me or anyone...it's not in their nature!","rating":5},{"id":270976733392547840,"text":"...expect the country to be further downgraded in the future. The rich are all leaving!","rating":6},{"id":256104783763603460,"text":"DELUSIONAL--Obama actually thought that he won the debate http://t.co/nkPWyb1m What is he thinking?","rating":8},{"id":233930793154650100,"text":"The failing New York Daily News knowingly incorrectly reported that I wanted to speak at the Republican National Convention--wrong!","rating":7},{"id":233669365130743800,"text":"The Penn State Board should resign based on the grossly incompetent way they handled the NCAA. They gave away (cont) http://t.co/gxoxLUdk","rating":5},{"id":154314140985475070,"text":"I am honored that Texas supporters have filed papers in Texas to create \"\"Make America Great\"\" Party on my behalf. http://t.co/OYguEeFD","rating":6},{"id":384736592776032260,"text":"The commodity market is extremely fragile. Be wary of investing right now. The futures are way too dependent on the Fed.","rating":4},{"id":379726237813317600,"text":"I am proud to announce our newest project, Trump Tower Mumbai. Together with the Lodha Group, it will be incredible! http://t.co/Nt3BYffNdD","rating":3},{"id":373739767323951100,"text":"Who are our generals that are allowing this fiasco to happen right before our eyes. Call it the \"\"PLENTY OF NOTICE WAR\"\"","rating":8},{"id":372002575463096300,"text":"Amazing! AG Schneiderman sues a school w/ a 98% approval rating but doesn’t go after billion $ fraudsters all over Wall St.","rating":7},{"id":371949781415129100,"text":"Fox and Friends","rating":2},{"id":371401860344983550,"text":"Lightweight NYS Attorney General Eric Schneiderman is trying to extort me with a civil law suit. See website http://t.co/qTflzWGXud","rating":6},{"id":331485168588181500,"text":"The Trump Organization is honored to be expanding our interests into Dubai. The golf course will be the top course in the Middle East.","rating":3},{"id":299255572602163200,"text":"Terrible CBO forecast for 2013--1.4% GDP growth and 7.5%+ unemployment (really 17%+) http://t.co/B9Q7UowK  You get what you vote for!","rating":5},{"id":494925729990475800,"text":"Vera Coking made a big mistake in Atlantic City by turning down many millions of $’s years ago for property that just sold for $530,000.","rating":4},{"id":462332702352760800,"text":"#FlashbackFriday At Military Academy- second from left. http://t.co/iDODxtTtwL","rating":3},{"id":437914576911630340,"text":"Will be doing Fox &amp, Friends at 7 A.M. - 20 minutes. ENJOY!","rating":2},{"id":425222218894049300,"text":"Fox &amp, Friends at 7.00","rating":1},{"id":212230267941822460,"text":"\"\"Donald Trump\"\" song is up to almost 60 million hits---- crazy!","rating":5},{"id":3688564134,"text":"- More hysterical DSRL videos featuring Donald Trump and \"\"Double Trump\"\" plus enter Golden Lick Race Sweepstakes: http://tinyurl.com/6asujj","rating":4},{"id":151767567604781060,"text":"The Keystone pipeline will create 20,000 jobs and lower gas prices. But Obama says No. Dumb.","rating":6},{"id":274623975873728500,"text":"Now that it’s almost over, I can’t believe that unions &amp, management couldn’t save Twinkies etc--&amp, management just got a $1.75M  bonus.","rating":5},{"id":264390196819283970,"text":"With long gas lines &amp, total disarray from storm, the hurricane may yet be a negative for Obama.","rating":6},{"id":262996426458546180,"text":"Direct view of crane from apartment window. Crane was never properly secured, blowing in the breeze. http://t.co/fHVEFZd9","rating":3},{"id":261842687370612740,"text":"The Letterman show really turned things around- people finally understand my $5 million dollar offer to charity.... http://t.co/FjVYwWR4","rating":4},{"id":245513534350446600,"text":"Barack Obama used to mock Bush's 300K monthly job reports http://t.co/OMBeIR4x Now Obama wishes he could have a month half as good.","rating":6},{"id":413035434067759100,"text":"Unsustainable. With our $17T debt &amp, $90T in unfunded liabilities, government “blatantly” wasted $30B this year http://t.co/6jdLoAGQnI","rating":5},{"id":409059407545135100,"text":"The now $1.2B ObamaCare website is as bad as ever-- insurers not getting the proper data. http://t.co/W1zv7STHBi","rating":7},{"id":407972770278961150,"text":"New reality. Yuan just passed the Euro as 2nd most traded finance currency http://t.co/emAgwnMQXv  Our leaders better get smart fast.","rating":5},{"id":403634393077403650,"text":"Emails prove WH knew ObamaCare website wouldn't work in October -- why didn't they delay the launch?  http://t.co/uumhaRxfDa","rating":6},{"id":379718342858117100,"text":"Bashar Assad is stronger today than he was before Obama threatened military action. Obama really bungled this.","rating":4},{"id":375660569581613060,"text":"If President Obama was going to attack Syria, he should’ve done it a long time ago as a surprise &amp, not after (cont) http://t.co/dvzmCu76uv","rating":3},{"id":350285491377156100,"text":"Remember, but for Conservatives, Bush would have given us not only Roberts but also Harriet Miers. Face it, Bush was terrible!","rating":7},{"id":336155726214991900,"text":"The cast for next season looks really good!","rating":1},{"id":328930174185922560,"text":"The  White House Correspondents' dinner was so boring this year- I guess that’s because I didn’t attend(even... http://t.co/8jD8GuFluU","rating":8},{"id":327504327335886850,"text":"Dangerous. While Obama is cutting down our military, China has announced plans to build more aircraft carriers http://t.co/JJnSRYhU9w","rating":5},{"id":321930163506004000,"text":"Why did Vince and the WWE give my speech and segment the most time last night on USA Network - because that's what people want to see!","rating":9},{"id":316285942333841400,"text":"China’s top academics are working w/ PLA in cyber-espionage of our state secrets &amp, R&amp,D http://t.co/T82A4yCPAP They are laughing at us!","rating":7},{"id":306889323222020100,"text":"Karl Rove’s stupid ad made Ashley Judd hot—now everybody is talking about her.","rating":7},{"id":293818006465826800,"text":"Republicans are always worried about their general approval. With proposing to 'ignore the debt ceiling' they are ignoring their base.","rating":5},{"id":290945519214280700,"text":"Where’s the press?  1,484: 72% of Afghan Casualties Have Occurred Under Obama http://t.co/0DbXHopv","rating":4},{"id":290910577449132000,"text":"Just as I predicted, today Obama called for even more tax increases.  The Republicans played right into his hands and blew their cards.","rating":6},{"id":288390473868013600,"text":"Trade with China has killed over 29% of US manufacturing jobs in the US http://t.co/qae9jpzZ China is robbing us blind!","rating":8},{"id":480670583613435900,"text":"How much money are the lawyers for the Central Park Five getting out of the 40 million dollars, or are they paid  by the City (or both)?","rating":6},{"id":459436863384604700,"text":"#TBT As a young man when I proposed the Convention Center in New York City. http://t.co/UfH5cjn8LK","rating":3},{"id":455645936367452160,"text":"Will be doing Fox &amp, Friends at 7 A.M. (1 hour). ENJOY!","rating":2},{"id":426329693223391200,"text":"Will be leaving Palm Beach for the 11 A.M. ceremony opening the magnificent GARY PLAYER VILLA at Trump Nationak Doral, Miami. GARY IS GREAT!","rating":4},{"id":21004329713,"text":"Friday is the last day to enter the Counting Sheep for Hire contest. Click here www.youtube.com/user/mattressserta and you could win a trip","rating":2},{"id":99111356959162370,"text":"Thanks to Giovanni's Coal Fire Pizza of Florida for donating enough pizza to feed 750 Police Athletic League youngsters in NY this Friday.","rating":3},{"id":284370652318822400,"text":"When renovations are completed, Trump National Doral will be the finest resort in the U.S.","rating":4},{"id":273460086544932860,"text":"Wind turbines are totally destroying the areas in which they are located—all for unreliable, bad &amp, expensive energy!","rating":8},{"id":270901173739999230,"text":"We should remember that during this entire Petraeus episode,over 50 of our nation's bravest have died in Afghanistan...","rating":5},{"id":261918581187571700,"text":"My fellow Tea Party friends in Ohio--make sure you take advantage of early voting so you can GOTV election day. Know you can! Must win Ohio.","rating":4},{"id":253485490605531140,"text":"Where is the main stream media reporting on Univision's new expose of Fast and Furious? Too busy looking at Mitt's taxes?","rating":6},{"id":253234773403779070,"text":"It's Tuesday, how much will the media continue to cover up the embassy attacks for Obama?","rating":6},{"id":245941417355116540,"text":"Obama doesn't know what he's doing. His foreign policy is a disaster. Libya, Egypt, Iraq, Afghanistan--all (cont) http://t.co/TzsrGrEm","rating":5},{"id":241266899198033920,"text":"A fact--golfers don't get aches &amp, pains like others who don't golf. It is amazingly remedial.","rating":7},{"id":235819877712150530,"text":"I have always done well with properties fronting on oceans, lakes and rivers. If something works, stay with it.","rating":3},{"id":207902918739902460,"text":"Now Chinese agents are smuggling our military weapons through rogue US soldiers http://t.co/kr5OVY5Q China loves to cheat!","rating":10},{"id":198131842593984500,"text":"Fracking will lead to American energy independence. With price of natural gas continuing to drop, we can be at a tremendous advantage.","rating":3},{"id":193008632651190270,"text":"Vanity Fair party at Tribeca Film Festival was a bust.","rating":2},{"id":407837109870157800,"text":"Remember I predicted that New York Magazine would  fold and people scoffed? Just announced (N.Y.Post) it lost big $'s &amp, is cutting way back!","rating":5},{"id":378237512650477600,"text":"Now Assad is demanding that Obama stop supporting the rebels before he turns over his chemical weapons. What a mess!","rating":6},{"id":358016930340286460,"text":"On Bill O'Reilly in 5 minutes!","rating":1},{"id":328104731673231360,"text":"Thanks for the tremendous support for my shirts, ties and suits at Macy's. They do great because of really high quality at a low price.","rating":4},{"id":327846664712880100,"text":"Does Bush’s library have a wing featuring Supreme Court Justice Jon Robert’s ObamaCare ruling? Roberts was his prize appointee!","rating":7},{"id":326407645621784600,"text":"In light of Boston, immigration legislation will be much harder to get.","rating":5},{"id":325597826824421400,"text":"Sorry,  the best and most beautiful ties and shirts made anywhere and at a really reasonable cost. Also, fragrance is amazing. GO TO MACY'S.","rating":3},{"id":457208802027507700,"text":"I was always a big fan of Kim Novak and still am—a wonderful actress.","rating":2},{"id":442236630267858940,"text":"The newly built Blue Monster at Trump National Doral is being considered a \"\"masterpiece\"\" by almost all who see it and play it - THANK YOU!","rating":3},{"id":590935439105794000,"text":"#MakeAmericaGreatAgain http://t.co/vCuixB5TnC","rating":1},{"id":267312231962775550,"text":"The people of Scotland love Trump International Golf Links.","rating":2},{"id":266995114172366850,"text":"It’s hard to believe that we are rationing gas in NYC. OPEC is laughing all the way to the bank.","rating":6},{"id":264455651428794370,"text":"Considering Obama hasn’t proposed anything concrete, if he wins he won’t have a mandate.  Another 4 years of legislative stalemate.","rating":4},{"id":261926710562406400,"text":"If Obama doesn't accept my offer to be fully transparent, what will he say?","rating":5},{"id":260763980451180540,"text":"Doesn't the US have better things to do than to destroy an American hero for the world to see? Now other (cont) http://t.co/UrrYw3uF","rating":6},{"id":260468137919660030,"text":"The brass in #TRUMP Tower's atrium is polished twice a month like clockwork. I keep the atrium impeccable. Key to its success!","rating":3},{"id":241665757098934270,"text":"Republicans should have been much tougher on Obama. Just wait until you see what Obama does to Romney at the DNC!","rating":5},{"id":228119121269764100,"text":"I can't stress strongly enough that we are currently in a buyer's residential market.Try to buy directly from a bank.","rating":2},{"id":223529847966801920,"text":"Back in NY from Scotland and fighting for our country to get better. Trump International Golf Links Scotland opened to rave reviews.","rating":3},{"id":186883308733480960,"text":"\"\"The best thing you can do is deal from strength, and leverage is the biggest strength you have. Leverage is (cont) http://t.co/Lv0KOO6D","rating":1},{"id":416295204933861400,"text":"#TBT With Barbara Walters on my helicopter going somewhere. http://t.co/PnqXWj2v4h","rating":2},{"id":388337278042787840,"text":"“Golf is deceptively simple and endlessly complicated. It satisfies the soul and frustrates the intellect. (cont) http://t.co/x3Pb0vmiC2","rating":1},{"id":367593413270843400,"text":"Republicans have very strong hand in their fight against Obamacare-lets see if they are willing and able to play it \"\"tuff\"\"!","rating":5},{"id":302925403595612160,"text":"Great going.","rating":1},{"id":302063957596835840,"text":"If US Air &amp, American Airlines are allowed to merge, ticket prices will skyrocket—there will  be no competition.","rating":4},{"id":301788840547471360,"text":"What a shock – higher taxes are slowing retail spending http://t.co/nHRFTsJd  Wait until 2014 when Obama Care is fully implemented.","rating":5},{"id":515160218075152400,"text":"Go to http://t.co/3azIAQHTvX to help my friend Scott Brown take back our Senate.","rating":1},{"id":493818667747266560,"text":"Opening in 2016, Trump Hotel Rio de Janeiro will be a 13-story, 171-guestroom masterpiece with a beachside view http://t.co/gWja7Bg58N","rating":2},{"id":151748731509800960,"text":"Govt. collapsing in Iraq only 2 weeks after withdrawal of our troops. Sadly, I called this one and please remember, I alone called it.","rating":6},{"id":149943749844271100,"text":"“The thing about high corporate tax rates is that, in the end, companies aren’t the ones who foot the bill, consumers do.” #TimeToGetTough","rating":3},{"id":281871397431701500,"text":"When I bought the #MissUniverse pageant 13 years ago, it was on life support...","rating":4},{"id":278261610815033340,"text":"The lunatics in Congress banned the word ‘lunatic’ from Congress last week http://t.co/YvjkqKe2  Busy doing the peoples’ work!","rating":7},{"id":266292313863626750,"text":"Thank you to Joe Passov (Travelin’ Joe) of Golf Magazine for the great article... http://t.co/DQSHBWvw http://t.co/gt1eaZgv","rating":1},{"id":261927178046943230,"text":"Watch Obama's favorability numbers drop even further if he doesn't accept my charitable offer. No one approves (cont) http://t.co/9TTwQFlI","rating":5},{"id":255720069768826880,"text":"Drop A-Rod in the order and cut his salary based on unreported drug use. Also, not a pressure player.","rating":4},{"id":255670162068488200,"text":"Obama projected a 2012 budget deficit of $557B.  It is actually double that at $1.1T http://t.co/QR8vZIcP  We can't afford four more years.","rating":3},{"id":247793499875983360,"text":"While Obama is denying it, he did receive intelligence about the attacks 3 days before http://t.co/u78hfrJt Too busy campaigning?","rating":5},{"id":242340859201323000,"text":"If you have a speech-one that would put Winston Churchill to shame, liberals would find a way to make it sound terrible!","rating":7},{"id":218790317242069000,"text":"Interesting -- studies show that wind farms have a warming effect on the climate","rating":5},{"id":169114761554960400,"text":"Honored to have passed 1 million twitter followers. We are making America #1 again. #TimeToGetTough","rating":4},{"id":154284061995696130,"text":"\"\"The Democrats' solution is the same solution they have for everything--tax, tax, tax. Just one problem: it doesn't work\"\"  #TimeToGetTough","rating":6},{"id":401683641929322500,"text":"13 BILLION, 4.5 BILLION-these are the stupid settlements that J.P.Morgan just made. Why don't they FIGHT? No wonder they keep getting sued.","rating":8},{"id":391289951439974400,"text":"Canadians kicked out the firm that the U.S. paid all that money to for the failed website. How stupid are our \"\"leaders\"\"? This is a scandal!","rating":7},{"id":388033689063395300,"text":"I pay millions of $’s a year to Florida Power &amp, Light &amp, they can’t give us what we want. Maybe a major class action suit against them?","rating":6},{"id":373736312979071000,"text":"Syria has prepared for an attack based on all of our \"\"talk\"\" - they have moved targeted ammunition and supplies to new locations.Amazing!","rating":5},{"id":359112205909762050,"text":"Also, The Donald J. Trump Signature mattress from SERTA is doing record business-call Serta and see why!","rating":3},{"id":357223342555676700,"text":"Weiner and Spitzer are on top of the latest polls.  A sad day for the greatest city on earth! They will spend lots of time together.","rating":8},{"id":351492213408153600,"text":"I am so disappointed that the Yankeed haven't terminatrd A-Rod's contract. There is no way they would not win in court! Hard to believe.","rating":7},{"id":314011832488706050,"text":"I was sorry to decline headlining the Reagan Dinner last Saturday due to a prior business commitment. Pres. Reagan was one of the greats.","rating":3},{"id":297050775589376000,"text":"Big news—WOW—U.S. economy shrinks!","rating":5},{"id":296359912576004100,"text":"Just as I predicted, people are going to be shocked by the rise in premium prices thanks to Obama Care http://t.co/V7Wzlv3b  Enjoy!","rating":6},{"id":530734153042772000,"text":"Autism Speaks' Bob and Suzanne Wright will address the Pontifical Council on Health Care Workers at the Vatican in Rome. November 20-22","rating":2},{"id":514126513705611260,"text":"From rags to riches, and back to rags! http://t.co/NpY9Nw6fvJ","rating":4},{"id":481026374170210300,"text":"I will be on Fox &amp, Friends at 7 A.M. - 10 minutes.  Much to talk about, enjoy!","rating":3},{"id":453787836425465860,"text":"The Blue Monster at Trump National Doral in Miami is doing record business - everybody wants a piece of it. Great reviews. Thank you!","rating":2},{"id":599271503096586200,"text":"Excited to keynote of the sold-out Pottawattamie County Republican Party Lincoln/Reagan Dinner tonight! http://t.co/rwhijBdYvj Leaving now!","rating":3},{"id":555064525314347000,"text":"#CelebApprentice Photo from last night's boardroom. http://t.co/xossBgxzTd","rating":2},{"id":134010915560488960,"text":"Our deficits are caused by runaway spending, not inadequate taxing. Washington does not have a revenue problem.","rating":4},{"id":129292771533144060,"text":"Why aren't we getting any oil from Iraq before we leave? We are leaving the country wide open for Iran. Big mistake.","rating":7},{"id":129275105418293250,"text":"I am happy to see the majority of the GOP candidates agree with me that the tax code must be simplified and the rates dropped.","rating":5},{"id":281859798906048500,"text":"Congratulations to all the Trump 2012 #MissUniverse contestants who came from across the world. You did great and made us all proud!","rating":3},{"id":273176164749676540,"text":"... I never felt that I could let up for a moment.\"\" -- Harry S. Truman","rating":2},{"id":273118918653136900,"text":"Congratulations to the Rolling Stones on marking their 50th anniversary in London.","rating":2},{"id":270588890698633200,"text":"...while her charity is getting less than 5 cents per donated dollar. She should be ashamed!","rating":8},{"id":263649765248602100,"text":"I'm not hearing much from Obama or his administration about my $5M offer to charity-- or to which charity the money will go.","rating":6},{"id":251409907910336500,"text":"China's Financial Institutions are expanding overseas.http://t.co/WOfGLvNL They will own everything if we don't stop them now.","rating":7},{"id":242341271698538500,"text":"I win awards for speaking-but the enemies either won't comment or will say only bad...leave Clint alone!","rating":6},{"id":160090180047474700,"text":"\"\"\"\"Our country has a big heart. And it's a point of national pride that we take care of our own.\"\" #TimeToGetTough (cont) http://t.co/YRcqKNbG","rating":3},{"id":394917680685121540,"text":"Time for Sebelius to be fired. She has admitted that the Administration did not vet the ObamaCare website http://t.co/rQz1rRvz5H","rating":5},{"id":370580507660017660,"text":"Re Miss Universe Pageant, we’ve spoken w/the LGBT community in Russia who asked “please don’t leave, it would send the wrong signal.”","rating":7},{"id":331838317857501200,"text":"The economy is broken. Entrepreneurship is being suppressed. See what I do Wednesday 11 AM at Trump Tower atrium.","rating":4},{"id":323631539831316500,"text":"Do you think I made the right decision? #CelebApprentice","rating":2},{"id":322914627958763500,"text":"I am on David Letterman tonight.","rating":1},{"id":318557857253568500,"text":"Great boardroom! What did you think? #CelebApprentice","rating":2},{"id":309508612215156740,"text":"I don't know why but I feel so sorry for dummy reporter John Heilemann when I watch him on television.","rating":6},{"id":306464692266749950,"text":"When employees are working at home they can never have the same cohesivness as working together as a group...","rating":3},{"id":301378096454582300,"text":"Going to Charlotte, NC to speak before more than 20,000 people on Saturday morning—total sellout crowd—will be great!","rating":5},{"id":286942958589206530,"text":"Republicans had all the cards but not the guts to make a great deal!","rating":8},{"id":484126548753002500,"text":"Trump Turnberry news conference tomorrow at noon,  Scotland time. The place is amazing!","rating":3},{"id":428482050946265100,"text":"I will be on the Mike &amp, Mike Show on radio and ESPN-at about 6 to 7 A.M. We will be talking Super Bowl and sports-no Obama Care!","rating":4},{"id":554829408448831500,"text":"#CelebApprentice who do you think won?","rating":2},{"id":553266749068832800,"text":"To be completed this year,Trump Int’l Golf Club Dubai will feature a 7,205-yard, par 71 &amp, double-sided driving range http://t.co/K6oPtN6JFo","rating":3},{"id":149201857439473660,"text":"\"\"People who have the ability to work should. But with the government happy to send checks, too many of them don't.\"\" #TimeToGetTough","rating":6},{"id":126018940261507070,"text":"Happy to have passed 800,000 followers.  Looking forward to passing 1M sooner than later.","rating":1},{"id":277160519503339520,"text":"Many people still out of power in Staten Island.  Absolutely ridiculous.  Why can't they get service?","rating":2},{"id":270891052678926340,"text":"Washington must come together on a deal to avoid a fiscal cliff.  If taxes are raised, they must come with real, hard cuts.","rating":4},{"id":267278799341748220,"text":"I just passed a 10 block long gas line going to LGA airport, a terrible situation!","rating":5},{"id":258314355127513100,"text":"For political purposes only, Obama is planning to hit Libya for the Benghazi embassy attack right before the election?","rating":8},{"id":256832383834275840,"text":"Obama's economic policies are causing inflation on hard working families. The price of corn alone has risen over 200% since he was elected.","rating":6},{"id":255738703052435460,"text":"Looking forward to live tweeting during the rest of the debates. Will be a lot of fun.","rating":5},{"id":248838860023410700,"text":"To be successful, never give up. My secrets to success will be shared at the National Achievers Congress in London. http://t.co/SV6KAS1E","rating":3},{"id":242386227913953280,"text":"As I predicted 1 year ago, gasoline prices hit a record high today...OPEC is having a ball at our expense.","rating":7},{"id":222401974769954800,"text":"I am truly honored to have been chosen Statesman of the Year by the Republican Party of Sarasota County. The (cont) http://t.co/VXNSqp4g","rating":2},{"id":382954902655209500,"text":"The shale boom is saving our economy http://t.co/dnZXz1RyIU Good for jobs, national security &amp, trade balance. Frack Now &amp, Frack Fast!","rating":4},{"id":337967559678783500,"text":"WH counsel met with IRS lawyer 3x in 2012, once in September http://t.co/ZPg14zTjv5 But Obama just learned through news reports?","rating":6},{"id":311849772891926500,"text":"Autism Speaks, head up by Bob &amp, Suzanne Wright, does a fantastic job—if only we had more people like them! To help: http://t.co/QLmCf48aWb","rating":3},{"id":310920098569416700,"text":"My 757 is incredible-I think the teams agree on that.","rating":4},{"id":308426260521025540,"text":"So, what did you think of my decision? What would you have done? #CelebApprentice","rating":5},{"id":298907278973759500,"text":"With the record high February gas prices hurting the economy, even more reason to start fracking.  Will create jobs &amp, lower prices.","rating":4},{"id":294518303592968200,"text":"Today’s assignment: read chapter three of Think Big “Basic Instincts.” Focus on my acquisition of 40 Wall Street.","rating":3},{"id":291592163555438600,"text":"Lance Armstrong made a really big mistake by opening up to Oprah. I’ll bet he wishes he had the chance to do it over again.","rating":4},{"id":539788630840324100,"text":"Via Newsmax. Nice article, thank you so much.   http://t.co/PvQTJNooua","rating":2},{"id":448539410712502300,"text":"Robert Slater, who just passed away, was a terrific writer who wrote a very fair book about me. He will be missed. http://t.co/gAPE7AoYvJ","rating":2},{"id":442238158252810240,"text":"Leaders at Trump National Doral are only one under par. The great Ben Hogan said, \"\"I've never seen a great course that was easy!\"\"","rating":1},{"id":421904996645748740,"text":"The brand new Blue Monster just opened at Trump National Doral - Miami. Also, great new driving range which is open 'till midnight. GO SEE!","rating":1},{"id":558392521840427000,"text":"#TBT With the wonderful actor Jack Nicholson http://t.co/VeBBOZPVRU","rating":1},{"id":14371483646,"text":"The latest update on Bret Michaels is that he's making every effort to attend the live finale of Celebrity Apprentice on Sunday--so tune in!","rating":3},{"id":134720505268801540,"text":"The Fed should not bail out the EU.  Europe's financial mess is their problem, not our problem!","rating":6},{"id":278155324177911800,"text":"Sorry for such silence—spent weekend at closing of Ritz Carlton in Jupiter, Florida—just bought it, will be great!","rating":5},{"id":275978060493361150,"text":"I take great pride watching skaters enjoy the #TRUMP Rink in Central Park from my office--world's best skating rink http://t.co/bZm5ljJE","rating":4},{"id":270638658078535680,"text":"Petraeus is already negotiating a book deal.  http://t.co/ZKJexYr9  Smart.  Always negotiate when you are a hot commodity!","rating":7},{"id":256422607455395840,"text":"Staff at Trump Park Avenue disliked A-Rod--to put it \"\"mildly\"\" -- The staff at Trump World Tower loves Derek Jeter.","rating":6},{"id":251405719579009020,"text":"Now Obama's campaign is guaranteeing 12 million new jobs during a 2nd term http://t.co/uTnOkmdd  More like $12T in new debt if he wins.","rating":8},{"id":243061925209047040,"text":"Is this Hope &amp, Change? A record 46.7M Americans were on food stamps this past June. We must do better.","rating":7},{"id":238348213197885440,"text":"We are about to have a record $500B trade deficit with the Chinese this year. That money should be back here financing jobs in America.","rating":7},{"id":235436323832487940,"text":"Now is the time to buy a house if you can DIRECTLY from a bank. They want to get rid of all their foreclosures.","rating":5},{"id":202128951387242500,"text":"Now China is threatening our allies who share defense pacts with us, the latest is the Philippines  http://t.co/zOZKQvPY  Very aggressive","rating":7},{"id":197029124357885950,"text":"Chinese spies stole our F-35 Joint Strike Fighter design http://t.co/eLizmW37 We should offset the cost from our Chinese debt","rating":7},{"id":190850296640057340,"text":"One of the simplest joys of life is golf. A great game to both play and watch.","rating":2},{"id":400275406017679360,"text":"Miss USA pageant had a 4 to 1 vote in favor, but it won't be in Miami Doral in 2014-- Mayor Boria voted against it. I want total support!","rating":5},{"id":377859825951993860,"text":"An ad hoc interview I filmed with a German journalist at Ground Zero hours after the attack http://t.co/8fGXzrYYbd","rating":4},{"id":377599349754433540,"text":"Making his case in a nice and articulate manner.","rating":3},{"id":372682426365276160,"text":"As I predicted long ago, the war in Iraq was a disaster for the U.S. Heading for civil war, there are bombings all over the place.Iran happy","rating":6},{"id":341319610102079500,"text":"Congratulations to Aberdeen and Scotland for just having our great golf course named Best New Course In World by The Robb Report.","rating":3},{"id":336130824120451100,"text":"Just left the set of The Apprentice - the live show tonight will be fantastic - and something very big and very different is going to happen","rating":4},{"id":325961409773072400,"text":"Oh no, they are worried that they didn't read the Boston killer his rights and he may have a good legal argument. 12 year case to finish?  t","rating":8},{"id":319174786548908000,"text":"The Yuan hit another record high against the Dollar. China is laughing at our expense.","rating":6},{"id":286553351993303040,"text":"Make sure you realize that this ‘deal’ is only a stop gap measure.Obama will be looking to raise even more taxes in the coming negotiation..","rating":3},{"id":514506042089435140,"text":"Obama administration said that Saudi Arabia was on Syria’s border http://t.co/s4AI85JHSe   Wrong. These are the civilians planning the war.","rating":5},{"id":471219544862634000,"text":"I am speaking today at the National Press Club, totally sold out, and will then be inspecting The Old Post Office on Pennsylvania Avenue!","rating":2},{"id":460730317171859460,"text":"I will be doing Fox &amp, Friends at 7.00 - will be discussing the the Donald Sterling (Clippers) MESS!","rating":4},{"id":576089949038125060,"text":"Trump International Hotel, Washington D.C. will be one of the world's top luxury hotels http://t.co/5WbRYtT23g","rating":1},{"id":563370548361957400,"text":"I just answered my Facebook fan's questions in the latest #AskTheDonald- watch the video- http://t.co/2POo2ywnpt","rating":1},{"id":554584751261351940,"text":"Tonight at 8:00 is a really big one for a double episode of  Celebrity Apprentice. Watch, you won't believe what happens!","rating":2},{"id":98454970654916600,"text":"Republicans and Democrats have both created our economic problems.","rating":2},{"id":306598072123797500,"text":"I'll bet Jimmy Fallon gets great ratings tonight!","rating":1},{"id":98832336774373380,"text":"Morning Joe Panel is stealing many of  my statements and ideas to better America without giving credit -- the story of my life!","rating":6}]