[{"id":45954380691812350,"text":"I will be developing the two tallest towers in the Republic of Georgia.  http://nyti.ms/e9u79i","rating":5},{"id":36074560650481660,"text":"Watch my speech at CPAC in Washington DC yesterday ...http://www.youtube.com/watch?v=PR1b8yKxcAo","rating":3},{"id":278246750156890100,"text":"Great knockout on Saturday by Juan Manuel Marquez on Manny Pacquiao.  A great fight!","rating":3},{"id":276034808373706750,"text":"Just won the highest rated sanitary award in NY—an A--&amp, the food is great also. Trump Grill/ 57th &amp, 5th.","rating":4},{"id":273540059733573630,"text":"...It's called intellectual property rights, something they know nothing about.","rating":6},{"id":267285329441075200,"text":"I'm a skeptical guy, but I don't believe Petraeus used this to get out of the Benghazi hearings.","rating":5},{"id":259288723848564740,"text":"Can't believe we are less than three weeks away from the election. Time certainly flies!","rating":2},{"id":253598240602214400,"text":"There's only one candidate who cut medicare and that's Barack Obama. Cut over $700M to move into ObamaCare.","rating":4},{"id":251023281111588860,"text":"Housing prices will be going up big league--a great time to buy--good luck!","rating":3},{"id":245960182306336770,"text":"As bad as they were, I don't remember our embassies being attacked when Mubarak and Gaddafi were in power.","rating":6},{"id":243792507358556160,"text":"The Chinese are mistreating Hillary Clinton on her trip http://t.co/T5xzkNuL  They have zero respect for us. Outrageous!","rating":7},{"id":243414873927729150,"text":"North Carolina is a fantastic state with wonderful people. I enjoy my time there when I visit Trump National Charlotte.","rating":3},{"id":235739997515423740,"text":"Nobody wants wind turbines, they are failing all over the world and need massive subsidy--a disaster for taxpayers.","rating":6},{"id":408677134446493700,"text":"Leaving today for California to inspect my fantastic golf course &amp, club on the Palos Verdes peninsula. Big success. http://t.co/JcbyQCIcH2","rating":4},{"id":392243644948025340,"text":"Doing Fox and Friends in two minutes!","rating":2},{"id":385841534848880640,"text":"Oil has been over $33/gallon for 34 months. A new record. And now with Obama’s war on coal, American families will be hit even harder.","rating":8},{"id":376899188837347300,"text":"Also, great comeback by the New York Jets. That game was over until a really dumb defensive play by Tampa. Amazing.","rating":3},{"id":370635049508429800,"text":"If Stop &amp, Frisk is struck down by the pandering NYC politicians, increases in crime &amp, eventual terrorist attacks will be on them.","rating":8},{"id":363377683142422500,"text":"Let me sum this up for you... http://t.co/lSVbY2LS8B","rating":2},{"id":357935004296282100,"text":"“The most important political office is that of the private citizen.” - Justice Louis D. Brandeis","rating":1},{"id":329706548244934660,"text":"NBC terminates \"\"The Chris Matthews Show\"\" http://t.co/HgkSlTwtV5","rating":3},{"id":329676026382790660,"text":"Fracking poses ZERO health risks http://t.co/bXsJ6MKZGH  In fact, it increases our national security by making us energy independent.","rating":7},{"id":291274957701386240,"text":"... Is a third party coming? I hope not.","rating":5},{"id":494926117183447040,"text":"If Vera Coking had taken my millions of $’s like she should have, she would have lived for many years in Palm Beach, Florida.","rating":6},{"id":479004650587168800,"text":"The Trump Organization Finalizes Purchase of Legendary Turnberry Resort in Scotland. It's absolutely... http://t.co/DyK7lPfUFA","rating":4},{"id":478492082458210300,"text":"Will be doing Fox &amp, Friends at 7 - 2 minutes.","rating":2},{"id":433608612938649600,"text":"Looking forward to addressing the record setting crowd tonight at the New York County Lincoln Day Dinner. Lots to talk about!","rating":3},{"id":430772360526823400,"text":"In 2016, the Old Post Office will be fully transformed into an iconic destination, Trump Int'l Washington DC http://t.co/VqIHPmpFSx","rating":4},{"id":570315063627808800,"text":"Trump International Golf Links and Hotel, Ireland, is located on the Atlantic Ocean in County Clare. Spectacular! http://t.co/nT7zundGmV","rating":3},{"id":21004697973,"text":"So don't forget to enter the Serta Counting Sheep for Hire contest!  www.youtube.com/user/mattressserta","rating":2},{"id":18531733257,"text":"George Steinbrenner was a great friend and a true legend. There will never be anyone like him in New York. We've lost a truly great man.","rating":2},{"id":146700247178035200,"text":"Real unemployment is 20%. We must simplify the tax code and start making our own products again to bring our jobs back from overseas.","rating":5},{"id":111429608502607870,"text":"USA should take oil from Iraq in repayment for their liberation.  http://t.co/4rsrFqG","rating":8},{"id":261844492905242620,"text":"... I will soon start naming magazines that I think will fold--I predicted Newsweek.","rating":6},{"id":257468145424551940,"text":"A bad thing finally happened to Derek Jeter--- he is a great champion.","rating":3},{"id":255736699982864400,"text":"When will the unemployment numbers be corrected? Sadly, after the election!","rating":4},{"id":248522051067969540,"text":"QE3, a political favor for Obama, will cause record inflation on food and fuel.  This hits low income families the hardest. Big mistake.","rating":5},{"id":247792708872192000,"text":"Still a buyer's market. Buy directly from a bank. They want to offload properties that have defaulted, will give good prices &amp, financing.","rating":3},{"id":162945221989122050,"text":"\"\"I've got news for President Obama: America is not what's wrong with the world.\"\" #TimeToGetToughhttp://t.co/Yy6GNcx3 http://t.co/GnlQDDdj","rating":7},{"id":407960012032446460,"text":"Wow, it’s now official. ObamaCare website has topped $1B http://t.co/2IrbJtKR15 Will soon be up to $1.5B","rating":6},{"id":371720569848623100,"text":"Why did lightweight A.G. Eric Schneiderman come to my office on numerous occasions begging for campaign contributions? Also, recent asks?","rating":7},{"id":354390922064179200,"text":"Was not mentioned that we built one of the great golf courses in the world- bringing tremendous business to Scotland. http://t.co/6sLubEQyll","rating":4},{"id":342896243481145340,"text":"I'm in Scotland getting ready for a major news conference on the Great Dunes of Scotland announcing the second North Sea course - amazing!","rating":3},{"id":318826970139983900,"text":"Sacrificing our nation’s bravest for  ungrateful Iraqis = great for China. China is taking majority of the oil http://t.co/U94jvw9pGT","rating":8},{"id":313331501481742340,"text":"Just won The Club Championship at Trump International Golf Club in Palm Beach-lots of very good golfers-never easy to win a C.C.","rating":3},{"id":294148680754270200,"text":"Stamps are going up once again. Now the US postal service will lose even more money.","rating":5},{"id":292296633008418800,"text":"Lance Armstrong did himself great harm last night. Lawsuits &amp, failure will follow him!","rating":6},{"id":291592749482913800,"text":"Look, I have always liked Lance Armstrong- I just hated what he did to himself, including recently. His life will now be hell.","rating":5},{"id":494925979429912600,"text":"Vera Coking saved me “mucho” money by turning down my offer—thanks Vera!","rating":7},{"id":433680224761290750,"text":"\"\"Trump lays out big plans for Doonbeg  resort: Billionaire says investment shows Ireland’s economy recovering\"\" http://t.co/jUm2idYrWC","rating":4},{"id":428490361544380400,"text":"Mike &amp, Mike in one minute!","rating":4},{"id":586952660915515400,"text":"Thank you very much for the nice story, I greatly appreciate it- http://t.co/uxooivGFIV","rating":3},{"id":553246391582330900,"text":"#TBT With Tommy Lee Jones at Mar-a-Lago. http://t.co/MgWZnXvqME","rating":2},{"id":126315026532405250,"text":"Iran was planning to attack the Israeli and Saudi DC embassies. We should respond accordingly. The diplomatic  window is closed.","rating":6},{"id":114056864848809980,"text":"Third Gun Linked to 'Fast and Furious' Identified at Border Agent's Murder Scene. When will the White House come clean?","rating":5},{"id":261902189650407420,"text":"...Colin Powell thought Iraq has weapons of mass destruction.","rating":3},{"id":256132205242355700,"text":"I enjoy meeting tourists in #TrumpTower. People travel from across the world to see the five-level Atrium &amp, waterfall.","rating":1},{"id":256042093930242050,"text":"\"\"I will implement effective missile defenses to protect against threats. On this, there will be no flexibility with Vladimir Putin.\"\" -- Mitt","rating":4},{"id":255766290885656580,"text":"With these record high gas prices, what does it say about Obama that he was trying to brag about his energy policy in the debate?","rating":5},{"id":248471259627786240,"text":"...come down hard--tax the hell out of their imports and reduce our deficit fast.","rating":6},{"id":232552901824901120,"text":"Congratulations to Gabby Douglas on winning the Gold for the USA in gymnastics. She is terrific!","rating":2},{"id":190875180053180400,"text":"\"\"Capitalism requires capital. When government robs capital from investors through high taxes, it takes away the (cont) http://t.co/item4eZN","rating":5},{"id":383442492307554300,"text":"I am so happy that I was able to do something really good for the Bronx - and lots of jobs!","rating":4},{"id":357157849018798100,"text":"Because I will be busy doing anything other than being in the movie #RoadHard. http://t.co/E0Q8nVM6VJ","rating":6},{"id":355050166883069950,"text":"Why should ObamaCare be delayed for businesses and not working families?  With premiums rising at record levels, it is not equitable.","rating":5},{"id":316866545185869800,"text":"I'm doing The David Letterman Show tonight -should be interesting!","rating":3},{"id":301373903148838900,"text":"I endorsed a book on ObamaCare &amp, it just went to #2 on the New York Times bestseller list!","rating":4},{"id":294901972912451600,"text":"U.S. small businesses are truly worried about rising healthcare costs and taxes http://t.co/IWxtjMr8  I told you so!","rating":6},{"id":294440989702107140,"text":"Today’s assignment: read Chapter 7 ‘Trump Tower: The Tiffany Location’ of The Art of the Deal. Focus on how I marketed the property.","rating":3},{"id":291949326740115460,"text":"I'll bet Lance Armstrong wishes he didn't do the interview with Oprah-- he's saying to himself \"\"what was I thinking?\"\"","rating":7},{"id":291281333513236500,"text":"Re Lance Armstrong—not only was it a big lie but a big lie that lasted too long!","rating":6},{"id":288366410017681400,"text":"I hope the Republicans are happy.  Just as I predicted, that stupid deal they voted for only whetted Obama’s appetite for more taxes.","rating":7},{"id":542848656786063360,"text":"Durst is a disaster at operating the new World Trade Center. It takes forever for workers or visitors to get in with impossible security.","rating":5},{"id":532258336620953600,"text":"Looking forward to keynoting the Nackey S. Loeb School of Communications First Amendment Awards event tomorrow in New Hampshire.","rating":3},{"id":479745704597143550,"text":"#TBT Saturday Night Live http://t.co/X49jKxEYXj","rating":2},{"id":591359471047336000,"text":"#TBT With Steven Spielberg in the old days- a great guy! http://t.co/IQEUaq8cPe","rating":2},{"id":563001598977540100,"text":"Trump Golf Links at Ferry Point in the Bronx, NY, will open soon. A Jack Nicklaus Signature Design. Beautiful.  http://t.co/XovcybFo0P","rating":4},{"id":562716345499123700,"text":"Trump National Golf Club, Washington, D.C. is on 600 beautiful acres fronting the Potomac River. A fantastic setting! http://t.co/pYtkbyKwt5","rating":3},{"id":2650952843,"text":"Donald Trump backs 'Apprentice' Randal Pinkett for N.J. Lieutenant Governor: http://tinyurl.com/mvovzb","rating":4},{"id":1820624395,"text":"\"\"When the achiever achieves, it's not a plateau, it’s a beginning.\"\" --Donald J. Trump http://tinyurl.com/pqpfvm","rating":3},{"id":141623403621777400,"text":"America's trade deficit with China is one of our greatest national security threats.  Time for Fair Trade. We must produce our own products.","rating":6},{"id":267279553167241200,"text":"Wow,  I never saw the Petraeus thing coming. A straight laced guy! Very sad for him and his family.","rating":3},{"id":259812415385006080,"text":"Derek must move back into one of my buildings immediately. It will be lucky for him like in past.","rating":7},{"id":255717123442229250,"text":"California gas prices going thru the roof, others to follow. An election-losing event for Obama.","rating":5},{"id":238002684563714050,"text":"Every economic climate, whether an uptick or downturn, presents new opportunities and challenges.","rating":2},{"id":223870372527865860,"text":"Penn State is doing a poor job in bringing its mess to a close.They should be ashamed for hiding Sandusky's crimes all these years...","rating":4},{"id":160429486515568640,"text":"The White House should stop publicly pressuring Israel on Iran. Iran's nuclear program is the threat, not Israel's right to self-defense.","rating":5},{"id":407838490056196100,"text":"Too bad about New York Magazine, but there's a much bigger one out there, currently doing a story on me to get even, that I'll soon discuss!","rating":6},{"id":394622869185261600,"text":"Will be on Fox &amp, Friends tomorrow morning at 7.00.  Will be discussing the disgusting and wasteful $635 million website rollout and more!","rating":6},{"id":373741348828221440,"text":"Obama now just wants to save face, Russia is now telling him \"\"don't do it\"\". He waited too long and the other side is much better prepared.","rating":5},{"id":365145853708603400,"text":"The Trump Organization is honored to have been awarded the redevelopment of The Old Post Office. Will be DC's finest hotel.","rating":3},{"id":327138582680711200,"text":"I believe Lance Armstrong had death wish when he did interview w/Oprah—as I predicted, everybody is suing him, he’ll have nothing left","rating":6},{"id":321000527188066300,"text":"Dennis Rodman is a project manager tonight on Celebrity Apprentice - watch Dennis in full action!","rating":4},{"id":316021444192653300,"text":"What did you think of my decision? #CelebApprentice","rating":2},{"id":315991967253282800,"text":"Last week’s boardroom was truly epic ---and the dust hasn’t settled yet. #CelebApprentice","rating":2},{"id":309056515464130560,"text":"It is my great honor to be speaking at CPAC 2013. They are all about what's good for America.","rating":2},{"id":307245049966653440,"text":"As China is built on corporate espionage, currency manipulation &amp, cheap labor, its economy is a ticking time bomb http://t.co/YEPSWFPm6l","rating":7},{"id":306888065044074500,"text":"... Rove’s ad campaign has made Ashley Judd a totally credible candidate. Be careful Mitch!","rating":5},{"id":524918760462123000,"text":"Ben Bradlee was truly one of the greats. What an amazing life he led. My warmest condolences to Dino &amp, the whole family. #BenBradlee","rating":3},{"id":435377609095266300,"text":"Due to the holiday, I will NOT be doing Fox &amp, Friends this morning. Next Monday at 7.","rating":1},{"id":278239034478833660,"text":"The government is borrowing 46 cents on every dollar it spends http://t.co/joS4tjDA  Dangerous for us but great news for China.","rating":7},{"id":264453373988847600,"text":"Concerns over the national debt are stopping businesses from hiring and expanding http://t.co/nuzGMIkt Obama's policies are unsustainable","rating":5},{"id":263273965676539900,"text":"I saw from my window just before accident that the crane was not properly anchored for the storm.","rating":4},{"id":250986768231452670,"text":"Hope &amp, Change--the number of 26 year olds living with parents has jumped 46% under Obama http://t.co/cfM5RWYt  Four more years?","rating":6},{"id":248468674233643000,"text":"Don't let them build a wind turbine in your backyard (or near your house). It will destroy your property value.","rating":6},{"id":246677856883703800,"text":"Why doesn't Obama let our marines who are guarding the embassies in Egypt have live ammunition? They need it fast.","rating":8},{"id":245867127804932100,"text":"Why is the Pentagon wasting precious dollars on going 'green.' Complete waste. We need the best &amp, easiest fuel for our military.","rating":7},{"id":244154026428612600,"text":"One of the best moves I ever made was staying out of last decade's artificial real estate boom. But I used the downturn to my advantage.","rating":3},{"id":194781537840013300,"text":"\"\"You can take the smartest kid at Wharton, the one who gets straight A's and has a 170 IQ, and if he doesn't (cont) http://t.co/hVsM4ja5","rating":4},{"id":410529522811822100,"text":"Re Kerry admitting to “working” for Pastor Abedini’s release--why has US already released Iranian spies &amp, nuclear scientist? Dumb!","rating":9},{"id":402391333182373900,"text":"I will be going to Trump National Doral in Miami early today to check on the construction of the hotel and the new Blue Monster. AMAZING!","rating":3},{"id":390999722842152960,"text":"By the way, New York State MUST LOWER TAXES (and fast) and must start going after all of the \"\"energy\"\" that lies just below our feet (now)!","rating":5},{"id":380495327109087200,"text":"Just returned from Trump Doral in Miami. Massive construction job. When completed will be the best resort in U.S. Blue Monster is amazing!","rating":3},{"id":379929265552494600,"text":"American Exceptionalism and the Navy Yard shooting do not go hand in hand. Foreign countries, in particular Russia, are mocking the U.S.","rating":7},{"id":378615096148099100,"text":"Obama is now warning North Korea on the Yongbyon nuclear reactor http://t.co/8z0K4ULGuy After Syria, our enemies are laughing!","rating":6},{"id":371721357970898940,"text":"How can an Attorney General ask for campaign contributions during his evaluation of a case - a total sleazebag!","rating":8},{"id":360137207966744600,"text":"Isn’t it sad that Weiner’s first press conference with wife Huma was yesterday admitting to a sext he made post-resignation &amp, apology!","rating":7},{"id":334851816309284860,"text":"The three political disasters could lead to a major and complete political meltdown!","rating":4},{"id":323039880072536060,"text":"Remember, NBC increased Celebrity Apprentice to 2 hours starting this Sunday night at 9 P.M. through end of season-great news for App lovers","rating":2},{"id":304314056330838000,"text":"The Oscar Pistorius disaster is a really interesting story to me—a very sad situation for everyone!","rating":3},{"id":291572851226603500,"text":"If everybody sued the Journal News for revealing their info (guns)- paper would go out of business.","rating":5},{"id":521720136722808800,"text":"#TrumpVlog China is laughing at U.S. http://t.co/gWiy6t8eyS","rating":6},{"id":600359460356419600,"text":"Via David Ebner re Stanley Cup &amp, Trump poster: “If you’re going to be thinking anything, you might as well think big” http://t.co/GSj6NtQJWH","rating":4},{"id":562356020614537200,"text":"Trump National Golf Club, Los Angeles, on the Palos Verdes Peninsula overlooking the Pacific Ocean--spectacular!http://t.co/lydaXl5hOU","rating":3},{"id":21915730688,"text":"It's going to get hotter in Las Vegas tonight! Watch the Miss Universe Pageant tonight on NBC at 9 p.m. I'm looking forward to being there!","rating":2},{"id":12104502409,"text":"Looking forward to seeing the World Champion Yankees today on opening day!","rating":1},{"id":103131233285976060,"text":"Reporters say it's the Trump Bump---I tell CNBC I am buying stocks--- and the market goes up.","rating":7},{"id":284070150511144960,"text":"Watching these politicians trying to get a deal done is truly painful --- Republicans are in a much stronger position than they think.","rating":4},{"id":246320408087916540,"text":"Welcome to Obama's America--record high poverty and an 8% drop in median household family income http://t.co/3jzUjcnW  Four more years?","rating":7},{"id":246295539992379400,"text":"With allies like Egypt and Libya, who needs enemies?!","rating":8},{"id":236518184402960400,"text":"Great sign:\"\"We built this business without government help. Obama can kiss our a--!\"\" http://t.co/qeN3dOvF Commonly heard now across America!","rating":8},{"id":216242142962655230,"text":"Sometimes there is justice. A Chinese military newspaper was hacked. http://t.co/CgZyoszb","rating":5},{"id":215817662998126600,"text":"Rape is a huge problem in the U.S. military. Over 19,000 rapes last year.","rating":6},{"id":172045954516664320,"text":"As the nuclear crisis with Iran shows, America needs to import oil from a reliable region. Keystone XL Pipeline (cont) http://t.co/lRBOih6s","rating":4},{"id":402847697721237500,"text":"FLASHBACK -  October 9, 2012: “Donald Trump: Jobs Numbers Are 'A Lot Of Monkey Business'” http://t.co/XWnKrWl3sp  Proven right again!","rating":7},{"id":394928059188396000,"text":"Contractors can blame Obama admin all day for their $600M failure but both parties are at fault--pay taxpayers back.","rating":5},{"id":311930038377410560,"text":"According to new WPOST-ABC poll, Obama has just lost 14 points on public trust with economy","rating":4},{"id":311882429554114560,"text":"The sequester is less than 2% of total 2013 budget. Why can’t the WH re-allocate funds and keep the tours open for children? #OpenOurWH","rating":4},{"id":308950494355796000,"text":"Rory, Tiger, Phil and Ernie will be fun to watch this weekend at Trump National Doral.","rating":3},{"id":308544179393396740,"text":"I will be doing Fox and Friends at 7 A.M. this morning.","rating":2},{"id":308396692565270500,"text":"How does this cast look to you? Pretty amazing. #CelebApprentice","rating":3},{"id":303845468436320260,"text":"Jerry Buss was a great guy and friend. He will be missed!","rating":2},{"id":294164513547223040,"text":"Health insurance premiums are rising by double digits http://t.co/9yE9RWFH  Another tax to the consumer by Obama Care.  Enjoy!","rating":7},{"id":507255447985086460,"text":"Trump Int'l Golf Links &amp, Hotel, Ireland, fronts the Atlantic Ocean &amp, is host to the 2014 Great Irish Links Challenge http://t.co/Oji1aaXa6O","rating":2},{"id":506801879859593200,"text":"\"\"AngieApon I think you should try wearing your hair combed back.  It looked good when you slicked it back Mr. Trump ,) #ALS\"\" May happen, thx","rating":4},{"id":500355915342970900,"text":"On 59th &amp, Park Avenue, Trump Park Avenue transformed the legendary Hotel Delmonico into 120 luxury residences http://t.co/VJGFwolYKE","rating":1},{"id":479323103135555600,"text":"Breaking ground shortly, Trump Int’l Washington DC will bring the DC Post Office far beyond its original grandeur http://t.co/sgxLK2Ca4V","rating":1},{"id":478315769457938400,"text":"Johnny Miller correctly very critical of greens at Pinehurst. Said they should be \"\"redone\"\"","rating":3},{"id":572852786657828860,"text":"Trump International Hotel &amp, Tower, Vancouver, will be a fantastic addition to a spectacular city. http://t.co/aF5XY8ohwL","rating":1},{"id":14364932158,"text":"Check out Ivanka's new FaceBook page and keep up with what's happening--from The Celebrity Apprentice, to jewlery to free tickets and more..","rating":4},{"id":146666431600267260,"text":"Don't forget my book signing tonight at Costco on 1250 Old Country Road in Westbury, NY, from 6-8 pm. Hope to see you there.","rating":3},{"id":143782646449831940,"text":"I'm sick of always reading about outsourcing. Why aren't we talking about \"\"onshoring\"\"? We need to bring manufa... (cont) http://t.co/zvbB8EQA","rating":5},{"id":127401893424144380,"text":"A simplified tax code will help promote growth in the private sector.","rating":2},{"id":40527238277373950,"text":"I answered your questions in today's video... watch at http://bit.ly/hnzt5J","rating":2},{"id":273160431298813950,"text":"Glad to see 9 more Iraq and Afghan war veterans joining the next Congress http://t.co/0u2yJbfs  They deserve to be there!","rating":3},{"id":268815740117856260,"text":"A former classmate, Roy Eaton, has published a great book, “Makers, Shakers &amp, Takers” – check it out  http://t.co/TxH2C5OV","rating":2},{"id":260762059246022660,"text":"Lance Armstrong fought for 7 years &amp, then just ran out of energy. Very sad story--although they caught him red handed.He definitely cheated!","rating":6},{"id":258607232323829760,"text":"Obama was beaten but not knocked out.  He lives to fight another day. But in the real world presidents are not given a second chance...","rating":6},{"id":252880994800115700,"text":"#TrumpTower is one of the country's top tourist destinations.","rating":3},{"id":247785296853360640,"text":"Teachers in Chicago should go back to work immediately.Rahm Emanuel has offered them a fair deal. Now they're just acting for the cameras.","rating":5},{"id":213000412624715780,"text":"The one positive from the plunge in household wealth is that we are in a buyer's market. This is the time to buy!","rating":3},{"id":188297943395213300,"text":"\"\"The five fingers represent the five key factors every entrepreneur dreaming of success must master.\"\" (cont) http://t.co/xH9PhFwt","rating":2},{"id":181746448520581120,"text":"Rosie O'Donnell has failed again. Her ratings were abysmal and Oprah cancelled her on Friday night. When will (cont) http://t.co/nDQoTVHP","rating":7},{"id":177792857707524100,"text":"\"\"That's what I find so morally offensive about welfare dependency: it robs people of the chance to improve. Work (cont) http://t.co/51iamOjX","rating":4},{"id":410154905299472400,"text":"Where’s the leadership? Obama only met with Sebelius ONCE since ObamaCare passed  http://t.co/ACAa5e50Cs  His signature legislation...","rating":5},{"id":381935160041959400,"text":"Is it the Neil Patrick Harris show or the Emmy Awards?How was he ever put in this position to start with? CRAZY!","rating":6},{"id":376329798588837900,"text":"Speaking of our very stupid war with Iraq, it is totally disintegrating and Iran (with Russia) will walk in and take it over (lots of oil)!","rating":9},{"id":353602105988227100,"text":"Just heard that the great Golf Week Magazine named my Trump International Golf Course-Scotland The Best Modern Day Golf Course In The World!","rating":4},{"id":350342583291088900,"text":"Putin re Snowden issue “it is like shearing a pig: there’s lots of squealing and little fleece.”","rating":5},{"id":344158484109070340,"text":"China is openly sailing warships in our waters &amp, arming countries in our hemisphere including Mexico http://t.co/XJToExBsJH Ally?","rating":8},{"id":338090906429313000,"text":"Hope everyone is watching the Finale rerun of Celebrity Apprentice on CNBC-especially the haters and losers! It is on right now.","rating":8},{"id":337707839256678400,"text":"The so called 87 year old \"\"lady\"\" was a vicious and skilled investor who was trying to rip me off with made up facts and a blowhard lawyer.","rating":9},{"id":331947505002610700,"text":"Wow, I love stimulating debate and driving certain people crazy-the Generals were forced to do something they didn't want to do (not me).","rating":7},{"id":327845703919484900,"text":"Just as I predicted, Iraq is deteriorating into utter chaos http://t.co/oKSSMU20i6  The war was a waste. China is taking all the oil.","rating":6},{"id":316282709154619400,"text":"Obama has now become the weakest POTUS against China, yuan just hit record high against dollar http://t.co/sEbQQycPmf  Very sad!","rating":5},{"id":305856164372049900,"text":"How do you like Seth and Oscars so far?","rating":3},{"id":302517960717774850,"text":"The American-US Airways merger will create even worse service and much higher fares.","rating":4},{"id":290910105426346000,"text":"Remember, as a senator, Obama did not vote for increasing the debt ceiling http://t.co/wTQ96Itg  I guess things change when President?!","rating":6},{"id":542850896112390140,"text":"Conde Nast made a big mistake going into the World Trade Center. The place is a total disaster, and I feel this is only the beginning!","rating":8},{"id":535159078650404860,"text":"Open for the 2014 season, Mar-a-Lago Club is an architectural masterpiece offering the finest amenities in the world http://t.co/Oa3jE1MGPq","rating":3},{"id":441670685610758140,"text":"Trump International Hotel &amp, Tower Toronto continues to receive accolades. Great city, great hotel. http://t.co/OtV7xuuFNv   #TrumpToronto","rating":1},{"id":595310578282995700,"text":"Deportations are “plummeting” http://t.co/h7atQqDRNA while Obama continues to grant amnesty.","rating":3},{"id":103497844723429380,"text":"China owes us money.... http://t.co/fuL8XAv #trumpvlog","rating":2},{"id":108247453551177730,"text":"Crude is at $85 right now – isn’t even worth half that. OPEC is ripping us off.","rating":5},{"id":91609057143685120,"text":"CUT, CAP AND BALANCE. TAXED ENOUGH ALREADY!","rating":4},{"id":281416881590636540,"text":"Miss Universe contestants are amazing—the most beautiful ever!","rating":2},{"id":273890598996549630,"text":"...Get along &amp, make deals for the good of the country!","rating":1},{"id":269539477947559940,"text":"Fiscal cliff negotiations have officially begun between the President and Congress---Washington must come together and make a deal.","rating":1},{"id":258263681945706500,"text":"Because Obama was so pathetic in the first debate, tonight's audience will be humongous--people want to see if he is for real.","rating":6},{"id":256560945898352640,"text":"Both candidates are looking sharp- now it's up to the mouth and the mind. #VPDebate","rating":2},{"id":256056387203911680,"text":"Obama is under a great of pressure to perform well in the next debate. Let's see how he reacts under pressure.","rating":3},{"id":251406692045185020,"text":"ObamaCare is a failure. Costs are rising much faster under Obama than other Presidents.","rating":4},{"id":238639359153303550,"text":"One of the best moves I made early in my career was buying the air rights from Tiffany's flagship. Trump Tower gleams over Fifth Avenue.","rating":2},{"id":410408315534204900,"text":"If Graydon Carter's very dumb bosses would fire him for his terrible circulation numbers at failing Vanity Fair-his bad food restaurants die","rating":8},{"id":354942681270591500,"text":"Spitzer never made 10 cents on his own-he worked for his very rich father (a friend of mine who never thought much of Eliot as a businessman","rating":5},{"id":349191903385878500,"text":"See Charles Gasparino’s article in today’s NYPost about Eric Schneiderman’s witch hunt against Republicans http://t.co/38ZYbpj4t3","rating":3},{"id":331199466172473340,"text":"Enjoy Celebrity Apprentice tonight at 9 - a really great episode!","rating":2},{"id":324269848001663000,"text":"I discuss yesterday's tragedy at the Boston Marathon in today's video blog. http://t.co/vu501xhSHc","rating":2},{"id":315920380646797300,"text":"Celebrity Apprentice tonight at 9 on NBC - some amazing things happen!","rating":2},{"id":313472689820016640,"text":"I will not be commenting on boardroom specifics- would be unfair to the different time zones. #CelebApprentice","rating":2},{"id":302162939861934100,"text":"Not only did Egypt destroy its civil society w/ the Muslim Brotherhood, now it is a complete economic mess http://t.co/36traf1o","rating":5},{"id":299575808106844160,"text":"Karl Rove’s strategy and commercials were the worst I have ever seen.","rating":7},{"id":525379825507504100,"text":"Opening for the 2014 season soon, the National Register landmark Mar-a-Lago Club is the crown jewel of Palm Beach http://t.co/Oa3jE1v5Hm","rating":3},{"id":516618416736964600,"text":"Patrick Reed—We are proud to have you as our champion at Doral. Love the attitude &amp, the play. See you in March at the Cadillac WGC.","rating":2},{"id":476822904299343900,"text":"A former Miss New York is the designer behind the swimsuits featured in Sunday’s Miss USA pageant—beautiful! http://t.co/DThYaylNpZ","rating":2},{"id":459372189431889900,"text":"W/a newly expanded 27 holes of golfing, Trump Intl.Palm Beach is ranked by Florida Golf Magazine as FL’s #1 course http://t.co/GV83zX5g1j","rating":2},{"id":432966450832105500,"text":"W/ views of NYC's skyline, Trump Stamford is Connecticut’s most luxurious high rise, featuring Trump amenities http://t.co/ezK3NiFpIx","rating":2},{"id":570623787806425100,"text":"Trump Int'l Hotel, Washington D.C.: The iconic Old Post Office Building will be one of the world's great hotels. http://t.co/5WbRYtT23g","rating":3},{"id":563027298681896960,"text":"Trump Int'l Hotel &amp, Tower Chicago has won many awards &amp, accolades, as has Sixteen, its signature restaurant.  http://t.co/4oJj9nQnUH","rating":2},{"id":1321965155509391400,"text":"The Fake News refuses to cover the fact that GDP went","rating":8},{"id":105668901668532220,"text":"Israel is being barraged by rockets from Gaza recently. They must respond accordingly in defense of their citizens.","rating":3},{"id":98811808374194180,"text":"Republicans gave Obama a free pass to the White House -- they just don't get it.","rating":7},{"id":281424051317125120,"text":"I hope Newtown CT can now start to heal—but it won’t be easy!","rating":2},{"id":276083807898173440,"text":"The stock of my shirt and tie maker just hit an all-time high--great going--great product!","rating":4},{"id":235115252310749200,"text":"Glad to hear patriotic Americans are organizing a movement this August to boycott Chinese products http://t.co/43EBom3h  People get it!","rating":6},{"id":230379788961976320,"text":"More waste, fraud and abuse - over $460M in food stamps went to ineligible households http://t.co/ZmCzIZbK  Where's the accountability?","rating":5},{"id":187233515753054200,"text":"\"\"Life is very fragile and success doesn't change that. If anything, success makes it more fragile. Anything can (cont) http://t.co/4mJgHzbC","rating":1},{"id":168014358687916030,"text":"“Obama doesn’t respect the fact that the money he wastes belongs to us. He thinks that the wealth you create (cont) http://t.co/83kLcFGp","rating":6},{"id":162214153061273600,"text":"All I heard in the SOTU was proposals for more govt, more spending and more bureaucrats. Very bad!","rating":4},{"id":404962744358952960,"text":"After settling for a ridicilous 13 billion dollars, J.P.Morgan's lawyer is critical of the amount of the fine-why did they settle then-DUMB!","rating":8},{"id":403254048284897300,"text":"When Warren Buffett &amp, others play w/ bankruptcy, nobody cares—when Trump plays the game, it becomes a big deal!  http://t.co/xiYoo3fxEV","rating":7},{"id":397835278619906050,"text":"Hitting at home. Democrat Sen. Joe Donnelly’s son had his healthcare plan dropped http://t.co/wxrR4Zads0","rating":4},{"id":380643078803296260,"text":"Lightweight A.G. Eric Schneiderman meets with President Obama (who he told me \"\"sucks\"\" as a president), and quickly files a suit against me!","rating":8},{"id":378112399628566500,"text":"I will be doing #GDNY Good Day N.Y. with Rosanna &amp,Greg live at 8.30 A.M.  I will be giving money to a great guy who lost his son in the WTC.","rating":3},{"id":354270928504504300,"text":"‎In anticipation of ObamaCare, part-time jobs are surging &amp, full-time jobs are falling and becoming scarce http://t.co/Jt9wZhK5aa","rating":5},{"id":336426182952230900,"text":"Last night's live show was so much fun. Congrats to the entire cast, they are all winners!  From beginning over $13 million for charity.","rating":2},{"id":334842549900554240,"text":"The \"\"lady\"\" in Chicago that I'm fighting owes me $500, 000 and is sophisticated  &amp, vicious. She made up a story &amp, plays the \"\"age card\"\" - bad!","rating":9},{"id":327018874300149760,"text":"Lance Armstrong just got sued by the Federal Government-they want their money back-I told you so! What was he thinking when he did that int?","rating":6},{"id":321824702106591200,"text":"With fellow inductees in front of the sold out crowd at MSG. #WWEHOF http://t.co/vwomJQMmo4","rating":2},{"id":293732426621005800,"text":"Part of Obama’s new-found confidence is that the Republicans aren’t using their power of ideas properly or effectively.","rating":4},{"id":291591161162911740,"text":"Lance Armstrong was given very,very bad advice!","rating":3},{"id":286951429275516930,"text":"I’ll bet Obama now uses the amendment for the debt ceiling.","rating":5},{"id":524938979058384900,"text":"#TrumpVlog South African justice- http://t.co/LWpPK6oSNL","rating":2},{"id":511959324613046300,"text":"Right To Play uses the power of play to educate and empower children facing adversity. A great cause--check it out. http://t.co/lvS6IMvfTT","rating":1},{"id":588857540663992300,"text":".kimguilfoyle - great job tonight!","rating":1},{"id":2294519255,"text":"“Expand your life every day.” –Donald J. Trump http://tinyurl.com/pqpfvm","rating":2},{"id":14785576859340800,"text":"I'll be appearing on Larry King Live for his final show, Thursday night at 9 p.m., CNN. Larry's been on TV for 25 years...","rating":1},{"id":11698350863,"text":"Last night Melania and I attended the Skating with the Stars Gala at Wollman Rink in Central Park, it was fantastic. Stay tuned for Part 2..","rating":1},{"id":132478862536880130,"text":"Malfeasance at Fannie Mae and Freddie Mac helped cause our current financial meltdown.","rating":2},{"id":88334210636595200,"text":"Perhaps this is the kind of thinking we need in Washington ... http://t.co/IsqXBu1","rating":3},{"id":281871378876096500,"text":"...now it’s the “greatest pageant on earth”-- broadcast in 190 countries to 1 billion people—“hot!”","rating":6},{"id":268448676060463100,"text":"General Petreus and his family are paying a big price!","rating":3},{"id":262981828057636860,"text":"So far the hurricane is being handled very well in NY, not nearly as bad as stated on news. Let's see what happens later.","rating":2},{"id":253944806739439600,"text":"Scary &amp, Unsustainable: On Monday the US added more debt than from 1776 through Pearl Harbor http://t.co/fZGWVH5E","rating":4},{"id":251772476412018700,"text":"American incomes have fallen $3,040 per household in the last 38 months http://t.co/8xWU3DTh","rating":2},{"id":246693030109786100,"text":"No surprise--Obama's Deputy Campaign Manager tweeted link from Chinese propaganda outlet http://t.co/JMgUoRMF Did she also write it?","rating":7},{"id":233962360547704830,"text":"Our airports are Third World--horrible. Let's rebuild them by people who know how to do it--inexpensively.","rating":5},{"id":193113501244469250,"text":"Dick Clark was a friend of mine, he lived in one of my buildings on East 61st Street. Everybody loved him. He will be missed.","rating":1},{"id":180284502147469300,"text":"\"\"The illegal immigrant crime problem is far more serious and threatening than most people understand. Along our (cont) http://t.co/UAAIAKdS","rating":8},{"id":164747859969839100,"text":"\"\"America became a powerhouse because of our deep belief in the virtue of self-reliance.\"\" #TimeToGetTough (cont) http://t.co/jObffdOi","rating":3},{"id":395901140337823740,"text":"Both of our New York hotels are on the Top Ten list of the most luxurious hotels in NYC...http://t.co/n7xX10UEEI Congrats to all!","rating":3},{"id":380758030024863740,"text":"My comments on a larger screen iPhone were in addition to existing unit, not a replacement. Screen should be 10% larger than Samsung.","rating":2},{"id":336428185375875100,"text":"I love that, in addition to everything else, so much money is raised for such great causes on Celebrity Apprentice-all proud of that!","rating":4},{"id":336211643644117000,"text":"Ivanka and Joan Rivers will be working hard tonight at the Live Finale - everybody must watch the OPENING at 9.","rating":2},{"id":333702182371196900,"text":"Two people fired very early on Celebrity Apprentice tonight at 9 leading up to next weeks live Finale. Don't get angry at me tonight!","rating":3},{"id":331909758028222460,"text":"The Generals and top military brass never wanted a mixer but were forced to do it by very dumb politicians who wanted to be politically C!","rating":7},{"id":327017187258814460,"text":"Scotland does not have free press, even when you are just stating the facts-it's crazy!","rating":7},{"id":326141765490966500,"text":"I hope you are watching the Apprentice...tonight's show is great and Brett Michaels is back!","rating":3},{"id":321811038607654900,"text":"Vince McMahon shows the crowd one of the greatest moments in WWE History. #WWEHOF http://t.co/5VW83b5EfZ","rating":2},{"id":306043623869403140,"text":"Last night William Shatner had more airtime than any winner. It should have been called the William Shatner show...","rating":5},{"id":305660882136997900,"text":"Big response to my Tea Party statement-remember they were never fully energized by Romney campaign and will have far more power with time.","rating":5},{"id":304381728536002560,"text":"Wow, Macy's numbers just in-Trump is doing better than ever - thanks for your great support!","rating":7},{"id":298808994858942460,"text":"$4 gasoline – wow—OPEC is very happy!","rating":4},{"id":291939243419389950,"text":"...or mentally troubled (or a con).","rating":8},{"id":535164824419045400,"text":"WATCH – WH official says that ObamaCare/RomneyCare architect Gruber was ‘an important figure’ in crafting the law http://t.co/L9679gtq82","rating":3},{"id":516619383129796600,"text":"Johnny Miller—Great job this weekend. Most insightful and tough. See you at Doral.","rating":2},{"id":588752997959737300,"text":"#TBT Trump and Gekko- http://t.co/JhEKn4IoJf","rating":1},{"id":565613432217804800,"text":"Trump Int'l Golf Links &amp, Hotel, Ireland, fronts the Atlantic Ocean in County Clare for 2.5 miles. Extraordinary! http://t.co/nT7zundGmV","rating":2},{"id":561225405898977300,"text":"Trump Int'l Hotel &amp, Tower Vancouver will be a new landmark in a fantastic city http://t.co/aF5XY8Xu3p","rating":2},{"id":131807138262679550,"text":"The Oil Companies collude with OPEC to keep oil artificially overvalued. They need to be reigned in.","rating":6},{"id":128516515984187400,"text":"We are leaving Iraq after expending a tremendous amount of blood and treasure. We should be reimbursed with oil! -- Don't give it to Iran.","rating":9},{"id":107164909812453380,"text":"Libyan Rebels should have given us 50% of the oil in return for our military support---we don't even ask!","rating":8},{"id":42341540923838460,"text":"Check out today's video blog http://bit.ly/g75Jiu I want to answer more of your questions, tweet me.....","rating":3},{"id":270984605656567800,"text":"Obama met with Chinese Premier Wen yesterday http://t.co/LF0hjd7Q  and talked trade. The Chinese are robbing us blind--be tough!","rating":7},{"id":258310790619201540,"text":"Get ready for tonight!","rating":2},{"id":241722826334289920,"text":"Andy Roddick...a great tennis player is a fantastic guy with a wonderful wife.","rating":1},{"id":238699533620637700,"text":"Wind turbines are a scourge to communities and wildlife. They are environmental disasters.","rating":7},{"id":157911891644133380,"text":"\"\"The American work ethic is what led generations of Americans to create our once prosperous nation.\"\" (cont) http://t.co/zJo7h70o","rating":4},{"id":388759344772182000,"text":"Many countries including allies already see China as world superpower http://t.co/vIM7i2QDAH We have greatest military, yet no respect","rating":5},{"id":377776391145541600,"text":"Spitzer and Weiner lost, lightweight Eric Schneiderman will be next - he will be challenged in the PRIMARY. He has done a really poor job!","rating":6},{"id":377744866803200000,"text":"Back to work for the President to try and keep some dignity for the office and himself. The so-called rebels must be thoroughly confused!","rating":4},{"id":360390447090237440,"text":"Mar-a-Lago is Florida’s most lavish and exclusive private club and spa with world class amenities http://t.co/SHszxX9M9J","rating":2},{"id":356876878809808900,"text":"Obama will eventually approve the Keystone XL pipeline--has to happen but it is very late!","rating":3},{"id":354938535322714100,"text":"Eliot Spitzer was a horrible Governor and A.G. who ruined many good people and cost the Country billions of dollars in losses (and jobs).","rating":5},{"id":342380669227368450,"text":"We look forward to making the Old Post Office in DC one of the great hotels of the World. http://t.co/6paf5iPAqK","rating":2},{"id":332221731618029600,"text":"Scary. Our military is a using a Chinese made satellite for North Africa command communications http://t.co/054Ext5c1A","rating":6},{"id":311218118951329800,"text":"According to new employment numbers, 296,000 Americans have dropped out of the work force &amp, gave up looking for work.","rating":3},{"id":294512137114636300,"text":"Wind farms are now being paid to shut down http://t.co/ufOONVXo A complete waste.","rating":5},{"id":527561317654495200,"text":"Conde Nast Traveler Readers' Choice Awards, Best Resorts in Europe: Trump Int'l Hotel &amp, Golf Links Doonbeg voted #1. http://t.co/gayZAy2852","rating":1},{"id":433994397475037200,"text":"Great making keynote speech at 2014 Lincoln Day Dinner, hosted by Dan Isaacs &amp, NY Republican County Committee. Wonderful  people!","rating":2},{"id":608358004602380300,"text":"Via the New York Times http://t.co/IHwSRd0hXm","rating":2},{"id":1936022874,"text":"Read an excerpt from Think Like A Champion by Donald J. Trump: http://bit.ly/11FHpR","rating":3},{"id":78170110275227650,"text":"My thoughts on Anthony Weiner in today's #trumpvlog... http://bit.ly/j0Lv8V","rating":4},{"id":278235827933433860,"text":"The Chinese are smart.  They bought up over $7B in US housing last year http://t.co/tt9BZwxR  U.S. is busy making China even richer.","rating":6},{"id":276818938799738880,"text":"...instead of biting the hand that feeds you! Don’t bother, just keep making me money!","rating":5},{"id":245955293786279940,"text":"Libya is selling its oil to China--I notice the Chinese Ambassador is very safe.","rating":7},{"id":244099932359897100,"text":"There are now 119,000 fewer Americans employed than there were in July. The economy is still terrible.","rating":4},{"id":227498677260922880,"text":"Jay Carney won't answer reporters questions of \"\"Why Obama won't release his college transcripts\"\"- Come on, Jay!","rating":6},{"id":204954381832036350,"text":"President Obama's literary agent (in 1991) promoted a book about \"\"the first African-American president of the (cont) http://t.co/iukNzpaC","rating":5},{"id":182132053507186700,"text":"Just bought Doral Hotel &amp, Country Club in Miami--within two years it will be the best resort in the country.","rating":3},{"id":172414046212071420,"text":"\"\"We need to bring manufacturing jobs back home where they belong.\"\" #TimeToGetTough http://t.co/U0XIm6h0","rating":3},{"id":170620245407567870,"text":"Mark my words, a gallon of gas will be $5 during the summer. OPEC is ripping us off. There's nobody in our (cont) http://t.co/lRNdzRRS","rating":5},{"id":154631652595871740,"text":"\"\"If history teaches us anything, it's that strong nations require strong leaders with clearly defined national (cont) http://t.co/6x6RYJPG","rating":4},{"id":411219453729198100,"text":"Exciting news—After massive construction, the Blue Monster at Trump National Doral is open for business today. http://t.co/4KaTXXwm9q","rating":2},{"id":402897856861708300,"text":"Jamie Dimon just gave away $13B to government in settlement. Terrible move &amp, bad precedent.  Could have done much better by fighting.","rating":4},{"id":390447046966386700,"text":"Will be cutting ribbon at   10 A.M. with Mayor Bloomberg and Jack Nicklaus for the opening of TRUMP LINKS at FERRY POINT.","rating":2},{"id":377410632750211100,"text":"Just landed in D.C. http://t.co/yjP3S0QOkV","rating":1},{"id":377180513535946750,"text":"Now Obama has set red line 2 with demand that Assad hands over Syria’s chemical weapons or it will face an attack.","rating":4},{"id":369921067453661200,"text":"It’s Tuesday.  How many terrible predictions and advice will Karl 1.6% Rove make today?","rating":7},{"id":356840587221139460,"text":"All NYC needs is the mentally unstable Elliot Spitzer in office again.","rating":8},{"id":354740632180359200,"text":"The San Fran crash was totally the pilot's fault - may be too late for drug testing, RIDICULOUS!","rating":8},{"id":342254207484702700,"text":"George Steinbrenner would have done a major number on A Rod - there is no way he would have gotten paid, even with the help of the union!","rating":4},{"id":337709423134900200,"text":"Jury was unanimous after hearing the made up case against my co. Filed many years ago, she.and her pathetic lawyer should pay me big damages","rating":6},{"id":331875596277788700,"text":"Everyone join me tomorrow at 11 AM in Trump Tower atrium.","rating":2},{"id":331813050632007700,"text":"Keep Wednesday morning free. You will want to see this!","rating":3},{"id":322433076967907300,"text":"Obama’s budget spends $2B making our navy ships algae-powered http://t.co/5jzKm3ost4 The strong world is laughing at us.","rating":7},{"id":322056325179785200,"text":"I discuss South Korea in today's all new #TrumpVlog - http://t.co/RbD4ihqTom","rating":2},{"id":317002507148734460,"text":"Aberdeenshire coast is spectacular. Its historic value &amp, wildlife will be tarnished if these wind turbines are built--but they won't be!","rating":5},{"id":311215526091300860,"text":"Between a terrible press conference, mishandled prisoner swap &amp, Taliban attacks, Hagel's 1st trip as SOD was a disaster. No surprise.","rating":4},{"id":310932283240632300,"text":"What?!  LaToya is saying Omarosa is one of the nicest people she's met?","rating":5},{"id":310893194919428100,"text":"There's definitely no love lost between Piers and Omarosa.","rating":5},{"id":306091373470289900,"text":"Speaker John Boehner, who I like, should never have agreed to raise taxes because the Republicans got absolutely nothing for it!","rating":6},{"id":301447097725644800,"text":"NY should frack now. What’s the hold up? Is Albany opposed to creating jobs and making gas cheaper for middle class?","rating":7},{"id":497818713320861700,"text":"\"\"Ebola's spread is 'unprecedented' says CDC chief\"\"  http://t.co/2wE9qVjD17","rating":4},{"id":494930389547618300,"text":"Trump Int’l Palm Beach offers a spectacular course, with hill vistas, bunkers and incredible water features. http://t.co/vq05peiBNK","rating":2},{"id":421391232649396200,"text":"#TBT With Darrell Hammond when I hosted SNL. http://t.co/py6BxSRvPr","rating":3},{"id":554806643150815200,"text":"#CelebApprentice what do you think of the choices for project manager?","rating":4},{"id":98474279192113150,"text":"The more you learn about the debt deal, the worse it gets.","rating":5},{"id":2184650461,"text":"Thanks to all for your thoughtful birthday wishes – Donald Trump","rating":2},{"id":1737479987,"text":"Donald Trump reads Top Ten Financial Tips on Late Show with David Letterman: http://tinyurl.com/ooafwn - Very funny!","rating":3},{"id":14917052148,"text":"Wishing everyone a Happy Memorial Day Weekend, with a special thought for all the veterans who have done so much for our freedom.","rating":2},{"id":136555844597841920,"text":"Waterboarding KSM gave us the intelligence that lead to Bin Laden.","rating":8},{"id":96647705408974850,"text":"Please tweet me your questions to answer in my #trumpvlog.","rating":6},{"id":78875680120647680,"text":"Your most popular tweet answered, why I'm holding off on a Presidential bid... http://bit.ly/iF5pz6 #trumpvlog","rating":5},{"id":25586441258012670,"text":"Don't forget to watch me tonight on Late Night with Jimmy Fallon, 12:35 a.m. on NBC. I'll be making a big announcement!","rating":4},{"id":263349278674653200,"text":"People are happy that I left the Trump Tower atrium open as opposed to taking the easy way out. http://t.co/LYXCvaOl","rating":3},{"id":259812692792057860,"text":"Good luck to Derek on his operation. I know it will be a success--- he is a great champion.","rating":1},{"id":257522310481854460,"text":"Yankees can win today. Kuroda is a highly underrated pitcher.","rating":1},{"id":243737266944630800,"text":"Iran is flying supply planes to Syria through Iraqi airspace. Thank you, United States, for making this possible!","rating":7},{"id":232563650257367040,"text":"Our athletes in the Olympics are proving once again to be the greatest competitors in the world. Makes us proud to be Americans.","rating":2},{"id":223845715829456900,"text":"Think of it---20% of our country is essentially unemployed.","rating":6},{"id":174955716635922430,"text":"\"\"Imagine how much money the average American would save if we busted the OPEC cartel.\"\" (cont) http://t.co/ZRYOPR1Y","rating":5},{"id":164840751178592260,"text":"I will be making a major announcement tomorrow (Thursday, February 2) at 12:30 pm at Trump International Hotel & (cont) http://t.co/meoQ0Uco","rating":3},{"id":414847658181034000,"text":"The Herschel Walker interview on The Tim McCarver Show was  fantastic-much can be learned from watching. Congrats to Herschel and Tim!","rating":2},{"id":385841958679093250,"text":"Many Red-State Democrats sticking with Obama on deficit spending on the ObamaCare monstrosity will be defeated in 2014.","rating":4},{"id":383650269172486140,"text":"Spanish version of ObamaCare website  delayed http://t.co/s6xVqlpdJH Hitting google translate apparently too complicated. #MakeDCListen","rating":6},{"id":380358050206347260,"text":"Video of my day at The Old Post Office- soon to be the most fabulous hotel! http://t.co/R85N4o4hra","rating":3},{"id":372942065682108400,"text":"I give the President's speech a 7 on the scale of 0 to 10! Not bad but room for improvement!","rating":2},{"id":368035115558899700,"text":"740 Park Avenue is being robbed all over the place--we come down hard on thieves at Trump buildings.","rating":4},{"id":366005256582213600,"text":"Big crowd expected tomorrow night in Iowa. It will be interesting and fun - great people!","rating":3},{"id":323624883319881700,"text":"I’m impressed -- both teams have produced very entertaining silent films. #CelebApprentice","rating":4},{"id":314484282208956400,"text":"My shirts, ties &amp, suits (and fragrance, Success) are doing great -- go over &amp, check out Macy’s now—beautiful new selection!","rating":3},{"id":313771018525241340,"text":"Apprentice ratings doing great - easily won the 10 o'clock hour over other networks!","rating":3},{"id":312626802654859260,"text":"The CPAC speech went really well this morning--- first speaker--- standing ovation. I really enjoyed it.","rating":2},{"id":306149619031765000,"text":"Obama is finally stopping the Chinese from buying something in America – windfarms http://t.co/Rl6qWCtQZi  What a joke!","rating":7},{"id":507953460038606850,"text":"The Mar-a-Lago Club, the crown jewel of Palm Beach, is a landmark in the National Register of Historic Places http://t.co/Oa3jE1v5Hm","rating":2},{"id":472915807098245100,"text":"The statement about leaving the base came directly from CBS Evening News.","rating":1},{"id":421664158380064800,"text":"\"\"_xx_justme  I still can't believe Donald Trump responded to my tweet. \"\"Respect\"\" #Trump2016 He would be the best Pres for this Country.\"\" Thx","rating":5},{"id":604348068318855200,"text":"Trump Int'l Golf Links &amp, Hotel, Ireland, is on 400 beautiful acres &amp, fronts the Atlantic Ocean for 2.5 miles. Spectac!http://t.co/nT7zundGmV","rating":2},{"id":598930524611153900,"text":"Trump Int'l Hotel &amp, Golf Links Ireland (formerly The Lodge at Doonbeg) is a 5 star resort fronting the Atlantic Ocean http://t.co/nT7zundGmV","rating":2},{"id":137640805908234240,"text":"ObamaCare is one of the greatest threats our country faces.  It is unsustainable and will lead America into complete insolvency.","rating":8},{"id":107121438657478660,"text":"There is no substitute for private sector experience.","rating":4},{"id":97324637268099070,"text":"We need economic growth and jobs not blue ribbon panels to study the problem.","rating":5},{"id":276764517067812860,"text":"When I renovated Wollman Rink in Central Park, it came in $750,000 under budget..","rating":3},{"id":276724982158086140,"text":"25 days to go until fiscal cliff (bad name)—it is only a fiscal curb! Debt ceiling is real fiscal cliff...and that will be interesting!","rating":7},{"id":270553321562054660,"text":"The Mar-a-Lago club in Palm Beach is one of the most successful places on earth in raising money for charity--a great feeling!","rating":3},{"id":257547904984694800,"text":"Brooklyn Nets have the worst uniform ever- Boring- won't matter if they win(\"\"Winning solves all problems\"\"- (cont) http://t.co/2rVgPfmo","rating":6},{"id":251731068837834750,"text":"Obama is not working. US Manufacturing orders fell a record 13.9% in August. Where's the recovery? http://t.co/XYRcSm74","rating":5},{"id":251129588242075650,"text":"Huff post gets it wrong re: Ferry Point...the only leakage of gas is from Arianna Huffington.","rating":9},{"id":243438036761866240,"text":"Other networks are begging me to do a show--I can't because I'm doing the Apprentice!","rating":6},{"id":225648416074629120,"text":"Happy 94th birthday to Nelson Mandela!","rating":2},{"id":191689479050891260,"text":"It will be interesting to see how Jenna Talackova does as Miss Universe Canada. We all wish her luck.","rating":4},{"id":182891369541546000,"text":"I am following the Trayvon Martin case carefully. It's a terrible situation that should never have happened. (cont) http://t.co/UfX9aQNb","rating":3},{"id":170518703195176960,"text":"\"\"Government needs to stop pick-pocketing your wallet. Every time it does, it slows growth and kills jobs. It's (cont) http://t.co/OhmFhNJb","rating":3},{"id":394568634078883840,"text":"The new line of Trump ties, shirts and cufflinks are out at Macy's and are really beautiful at a really reasonable.price. Go check them out!","rating":2},{"id":358064096136011800,"text":"Re-run of O'Reilly on Fox NOW!","rating":1},{"id":352086905774546940,"text":"Trump Puerto Rico is 1st development in Puerto Rico to combine lavish residences, world class golf &amp, a beach http://t.co/nhFEbOs73Y","rating":1},{"id":337951740890595300,"text":"Mrs. Goldberg, who filed the Chicago case many years ago, is a vicious and conniving woman--loved beating her.","rating":7},{"id":328702736902287360,"text":"Great boardroom. #CelebApprentice","rating":1},{"id":325981060104077300,"text":"Getting back to the nicer and more normal parts of life, Celebrity Apprentice is great tonight on NBC at 9. It will be a full two hour show!","rating":1},{"id":324617539214782460,"text":"Obama’s $1T+ deficit budget expanded welfare &amp, green cronyism &amp, it cut domestic bomb prevention in half http://t.co/JNJRVIMW3B","rating":3},{"id":313232072586178560,"text":"Don't forget to watch Celebrity Apprentice tonight at 9 on NBC - GREAT EPISODE!","rating":2},{"id":306513607817039900,"text":"You have to feel bad for the Democrat Senators.  They don’t want Hagel either.  Just following Obama’s orders.","rating":5},{"id":301378547229007900,"text":"While in Charlotte this weekend will visit my Trump National Golf Club on Lake Norman—a magnificent place &amp, doing really well!","rating":2},{"id":299636168872562700,"text":"The dollar always talks in the end--although our pols are killing the dollar!","rating":4},{"id":297339372766900200,"text":"Chuck Hagel showed gross incompetence before yesterdays Senate panel...our new Secretary of Defense.","rating":5},{"id":514118895817748500,"text":"Interesting article about Atlantic City http://t.co/jzU0kObjRm","rating":1},{"id":580800081059774500,"text":"via http://t.co/Lw28bfjJdP: Only one man up for the job of president  http://t.co/zIxfJ4SHrm","rating":1},{"id":575579153191321600,"text":"The Blue Monster at Trump National Doral recieved rave reviews from both players and architectural critics following the Cadillac WGC.Thanks","rating":2},{"id":3982428551,"text":"Read Donald Trump's Top Ten Tips for Success: http://tinyurl.com/mcn8yl","rating":1},{"id":3427503309,"text":"-- Watch Donald Trump's recent appearance on The Late Show with David Letterman: http://tinyurl.com/klts6b","rating":3},{"id":16951303040,"text":"The Eric Trump Foundation has raised over $1,000,000 towards St. Jude Children's Research Hospital.  http://twitter.com/EricTrumpFdn","rating":2},{"id":148877359167184900,"text":"Barney Frank admited that ObamaCare does have 'death panels' yesterday. Obamacare must be fully repealed or healthcare will be destroyed.","rating":6},{"id":50300363236061180,"text":"Check out my most recent interview with CNN... http://bit.ly/gXe2uL","rating":2},{"id":276806899868000260,"text":"When I made the Apprentice the #1 show in the US, that was a good day for you...","rating":5},{"id":276375870296440830,"text":"Glenfiddich is a joke—should have chosen Andy Murray—U.S. Open &amp, Olympic gold winner—as Top Scot instead of a total loser!","rating":7},{"id":275701150261587970,"text":"Obama is totally “tweaking” the Republicans because he doesn’t respect them—they’ve got to change their ways.","rating":6},{"id":264006067569168400,"text":"From 1954 to 1960 there were 10 major hurricanes that hit the East Coast.","rating":1},{"id":262996863777636350,"text":"All weights are on crane's wrong side ---  very precarious below, move out!","rating":3},{"id":257483280641839100,"text":"Swisher should have caught ball in right field last night.","rating":2},{"id":253144495737143300,"text":"Obama loves wasting our money. He just made another guarantee of $197M to a solar company http://t.co/efTeSrBC  Cronyism!","rating":6},{"id":248859755299340300,"text":"Now every time Islamic militants attack they will use that movie as an excuse http://t.co/ZmOrBZsC What was the excuse before the movie?","rating":7},{"id":411512318963773440,"text":"Economics behind ugly, bird killing wind turbines do not work--will destroy Scotland's beautiful coastline. (cont) http://t.co/0qGVX4gs1w","rating":7},{"id":388711220615729150,"text":"Congrats to Jim Lipton and Inside the Actors Studio for winning the Emmy Award for the 250th Episode. I was honored to appear in it.","rating":3},{"id":341880906316931100,"text":"26,000 sexual assaults in the military last year-way up from previous years. Armed Forces are in total turmoil!","rating":6},{"id":338062135324209150,"text":"Just got final renderings of Trump National Doral in Miami - there will be nothing like it in the Country, will be the best!","rating":4},{"id":335348812665204740,"text":"Celebrity Apprentice will be LIVE on Sunday at 9 PM (from New York City).Casting has already begun for next season.","rating":3},{"id":333054958696030200,"text":"Just left Trump National Doral in Miami - under massive construction - The Blue Monster will be one of the greatest courses ever built!","rating":4},{"id":324188649212223500,"text":"Throwing out the first pitch a few years ago at Fenway in Boston- Boston will be better than ever. http://t.co/OXIWUe15Ct","rating":3},{"id":319173938007662600,"text":"With the impending crisis in Korea, is it a big confidence builder that Chuck Hagel is Sec. of Defense? Elections have consequences.","rating":5},{"id":314107401336918000,"text":"\"\"Donald Trump helped expose the silliness of the move by offering to pay for the White House tours.\"\" http://t.co/48iaCr3YSC","rating":4},{"id":294538300692238340,"text":"...Terrible for the economy and a job killer. China is laughing at us!","rating":7},{"id":294190433003786240,"text":"I just saw my new tie &amp, shirt collection—it’s fantastic—unbelievable look. Go to Macy’s now to buy!","rating":6},{"id":291977181863739400,"text":"Trump Doral’s renovations are right on schedule http://t.co/N0llzAsJ Once completed, it will be the top resort in the U.S.","rating":3},{"id":532918714937905150,"text":"Via Union Leader: \"\"Trump leads tribute for slain journalist James Foley | New Hampshire First Amendment Awards\"\"  http://t.co/yIqndlSlSF","rating":3},{"id":515561751992352800,"text":"With $250M of renovations, Trump Int'l DC’s 250 expansive guest rooms will be DC's top offering of amenities &amp, views http://t.co/fruEPjLajZ","rating":3},{"id":423915748596006900,"text":"Hope you enjoy the story in the highly respected Real Estate Weekly http://t.co/Gbsvaf6N0p","rating":2},{"id":608277407615828000,"text":"Trump Int'l Hotel &amp, Tower New York, includes Central Park views &amp, our signature restaurant, Jean Georges. Perfection! http://t.co/yeFArpJy8H","rating":2},{"id":603167301920235500,"text":"I will be going to Trump Links at Ferry Point for the official opening of this long delayed  (but future NYC treasure) course. Great job \"\"D\"\"","rating":3},{"id":601765352817729500,"text":"Trump Golf Links at Ferry Point: Grand Opening next Tuesday May 26th at 11 AM. Jack Nicklaus will be joining me. http://t.co/XovcybFo0P","rating":3},{"id":595691340790419500,"text":"Trump International Golf Club Turnberry, Scotland has been home to four of the greatest Open Championships in history http://t.co/BVsLbZTA46","rating":2},{"id":578282348501930000,"text":"Trump National Golf Club, Washington, D.C., is located on 600 acres and fronts the Potomac River. Spectacular!http://t.co/KMaHBBQLXU","rating":2},{"id":565920472580513800,"text":"Trump National Golf Club, Jupiter, is close to Palm Beach and designed by Jack Nicklaus--a masterpiece of a course. http://t.co/4z0jCH7PmE","rating":3},{"id":563794173334388740,"text":"Trump Int'l Golf Club Turnberry, Scotland. A legendary course ... and rightly so.  http://t.co/BVsLbZTA46","rating":2},{"id":563414130368192500,"text":"Via The Washington Times  \"\"Mr. Trump buzzes the presidential radar\"\"   http://t.co/SC14Okocf0","rating":5},{"id":149944525824077820,"text":"“Consider the fact that for every gallon of gas you put in your car, you pay 45.8 cents in state, local, and federal taxes.” #TimeToGetTough","rating":4},{"id":98499155726581760,"text":"Why I would not have approved the deal... http://t.co/Jgvl8fQ #trumpvlog","rating":4},{"id":48052023484092420,"text":"Some of your most popular questions answered in today's video http://bit.ly/gv6TVh","rating":3},{"id":40131742803169280,"text":"Check out today's From The Desk Of Donald Trump at http://bit.ly/eXbfOw I'm willing to answer your questions, tweet me....","rating":3},{"id":276742505511407600,"text":"My support of Anna Wintour for Ambassador got a lot of coverage.  She is smart and will be a strong advocate for the US.","rating":4},{"id":268801713706790900,"text":"Trump Towers, Istanbul, Sisli will be one of the country’s top landmarks  http://t.co/UXSiNXSR","rating":3},{"id":263717038965542900,"text":"Congratulations Kevin Gabriel on your amazing article. If I were a journalist this would be the next Watergate, and I would be a star.","rating":6},{"id":256420333274406900,"text":"Great move to take A-Rod out of game. Now terminate his contract based on misrepresentation (drugs).","rating":7},{"id":249217031440830460,"text":"Rising premium costs from Obamacare will cost businesses billions http://t.co/zhDLI5zH  Guess where these new costs get passed to – you.","rating":5},{"id":248436233041215500,"text":"Technology has shown we have tremendous energy resources right under our feet that we didn't know about 5 years ago.","rating":4},{"id":245587044523462660,"text":"The onus of the Chicago teachers' strike falls squarely on the teachers &amp, their union. Inexcusable to leave children without school.","rating":4},{"id":238347103703793660,"text":"Gas prices are soaring. $4.12 in CA. OPEC is laughing at how stupid we are.","rating":6},{"id":235124033232990200,"text":"Congratulations to our Olympic team for by far winning the most medals, including first place gold.","rating":3},{"id":167342446668300300,"text":"\"\"I'm sick of always reading about outsourcing. Why aren't we talking about 'onshoring'?\"\" (cont) http://t.co/WjpVcUCx","rating":5},{"id":161882881810112500,"text":"\"\"Capitalism requires capital. When government robs capital from investors, it takes away the money that creates (cont) http://t.co/nghoarxU","rating":5},{"id":394917341219151900,"text":"Thanks to ObamaCare’s device tax, Boston Scientific plans to cut 1,500 jobs http://t.co/AUxXIKuq26 ObamaCare will kill ingenuity.","rating":5},{"id":387677061587804160,"text":"The new reality, China and Japan are warning us not to default http://t.co/LRVaKB6ZiG  Reckless government spending has made us weak.","rating":4},{"id":385383962237210600,"text":"New York State's lightweight A.G. is driving business &amp, jobs out of N.Y. Look into his past-he shouldn't even be allowed to hold office!","rating":7},{"id":349856705980538900,"text":"The people of Scotland love the golf course I have built-it is now considered perhaps the greatest ever built! Thank you also to Robb Report","rating":8},{"id":342176764723863550,"text":"I will be going to Aberdeen, Scotland today to help my team celebrate the great success of Trump International Golf Links-press conference.","rating":3},{"id":340510129311072260,"text":"Ms. Goldberg &amp, her blowhard lawyer should be ashamed for having brought this frivolous case. They should pay me damages!","rating":6},{"id":329578863069904900,"text":"Housing prices are up in Feb over last Feb 9.3 per cent -remember, I told everyone two years ago to buy (but they will be going much higher)","rating":3},{"id":323752493051965440,"text":"Will be doing Fox and Friends in two minutes!","rating":2},{"id":319526989201555460,"text":"The purpose of China’s massive military buildup on the Nork’s border is to intimidate us. China attacked us during the Korean War.","rating":4},{"id":314493376697339900,"text":"Almost every major dealmaker has used the bankruptcy laws as a business tool...","rating":3},{"id":312703094079229950,"text":"I agreed to take the worst spot at CPAC because nobody else wanted it and it was the only time I could be there - it was great fun!","rating":6},{"id":312290372879515650,"text":"Obama hasn't released a budget in over 2 years &amp, for the 1st time House &amp, Senate delivered budgets before him http://t.co/pN2WpKYAIl","rating":3},{"id":306868031676633100,"text":"There was a major diplomatic breakthrough yesterday w/the White House, Iran &amp, China. All celebrated Chuck Hagel being voted in as SOD.","rating":5},{"id":305029833270894600,"text":"The PGA tour just extended my Trump Doral contract for WGC for ten years.","rating":2},{"id":304337155973591040,"text":"Despite all the statements to the contrary, Obama’s policies will increase taxes on everyone http://t.co/hZAtJ4Mg  Enjoy!","rating":4},{"id":298809445780189200,"text":"Gas prices are going up big league—I told you so—payback to OPEC!","rating":7},{"id":544873261822382100,"text":"C-SPAN/Conversation with Donald Trump/Economic Club of Washington, DC  http://t.co/ONttU3oixF","rating":1},{"id":536935528893927400,"text":"#TrumpVlog Hagel quits- http://t.co/b8dpH1ZEgd","rating":2},{"id":532282613869056000,"text":"Looking forward to seeing Joe McQuaid, Curtis Barry and my many friends in the Granite State!","rating":1},{"id":521698460098388000,"text":"Trump Int'l Golf Links Scotland awarded 5 star status by Scottish Tourism chiefs. Via MailOnline http://t.co/RMJsc6ZoCJ","rating":3},{"id":501377499373527040,"text":"On 59th &amp, Park Avenue, Trump Park Avenue transformed the legendary Hotel Delmonico into 120 luxury residences http://t.co/Y0M1H2Q52T","rating":3},{"id":443443408099885060,"text":"\"\"Rosechem1 One of the reasons that I like you is because I feel that old American greatness in your mentality. It makes me feel hope!\"\" Thx.","rating":2},{"id":606529554233086000,"text":"Trump Nat'l Golf Club, Philadelphia, is a 360 acre beauty and an award winning Tom Fazio designed course--fantastic! http://t.co/jha0m0W4Kk","rating":2},{"id":601429648220823600,"text":"Flashback: “NYers were grateful when Donald Trump finished ahead of schedule and under budget the Wollman Rink” http://t.co/9IVM6G9gAE","rating":4},{"id":589050639021428700,"text":"The Republicans are funding ObamaCare and Amnesty. Obama beats them.  http://t.co/jEgR6jSQ5J","rating":6},{"id":565520989967364100,"text":"Trump National Golf Club, Washington, D.C. is situated on 600 acres overlooking the Potomac River. Beautiful!   http://t.co/KMaHBBQLXU ...","rating":2},{"id":554814000585003000,"text":"#CelebApprentice #TeamVortex or #TeamInfinity?","rating":1},{"id":1002881893963051000,"text":"“John Brennan, no single figure in American history has done more to discredit the Intelligence community than this liar. He’s a liar about being a liar.”","rating":7},{"id":2045871770,"text":"“If you don't have problems, you're pretending or you don't run your own business.” –Donald J. Trump  http://tinyurl.com/pqpfvm","rating":3},{"id":1806258917,"text":"Enter the \"\"Think Like A Champion\"\" signed book and keychain contest:http://www.trumpthinklikeachampion.com/contest/","rating":1},{"id":10683036402,"text":"I am happy to announce that theoriginal Apprentice --which will offer job opportunities to those in need--is coming back.","rating":7},{"id":129283360571916290,"text":"When will Washington stand up to China. China is manipulating its currency and stealing our jobs. Washington should move on legislation.","rating":6},{"id":122392183297937400,"text":"A-Rod is a less than average baseball player now that he is unable to use drugs. A-Rod misrepresented to th... (cont) http://t.co/SZbeilM7","rating":8},{"id":118332495900061700,"text":"Our country's debt crisis cannot be solved by tax increases. We must cut government spending.","rating":4},{"id":106032417000800260,"text":"We  spent over a billion on Libya and lead the way---why is Europe getting the oil?","rating":8},{"id":96604926230282240,"text":"My interview yesterday from Newsmax - \"\"Obama Is  'Now Totally Lost,'  Boehner Must Not Fold\"\"  http://bit.ly/n7Ahdk","rating":5},{"id":93044431564972030,"text":"The GOP doesn't waste  an opportunity to waste an opportunity. Defunding Obamacare should be central to any deal.","rating":6},{"id":92955253808439300,"text":"Congratulations to my daughter Ivanka and her husband Jared on the birth of  their daughter Arabella Rose yesterday.","rating":2},{"id":276731859713536000,"text":"Is PM Cameron a dummy? With monumental cuts in UK spending, how come he continues to spend billions of pounds ...","rating":9},{"id":271342868667449340,"text":"Direct foreign investments continue to flow into China at over $100B a year http://t.co/jtmBTMgw  That's money that could be spent here.","rating":5},{"id":258566750071824400,"text":"I still love Derek, he is a winner!","rating":2},{"id":256802697607512060,"text":"Credibility is important to me- hence must admit that both candidates did really well last night. #VPDebate","rating":3},{"id":249175734894075900,"text":"Watch--yesterday Obama continued to evade questions on his security failures in the Benghazi consulate attack. http://t.co/iw7so3Y3","rating":5},{"id":244087721604292600,"text":"Dems had a very good and professional convention. The Republicans must be smart and tough--and fast!","rating":4},{"id":241173519851978750,"text":"Gas prices are way too high. With an economy contracting and lower demand, how do OPEC &amp, the speculators get away with this?!","rating":4},{"id":228931360843251700,"text":"Price of corn has jumped over 50%. This will cause a jump in food prices perhaps beyond what we've ever seen. Nasty for the economy.","rating":4},{"id":205735230252920830,"text":"Why are armed drones being released over our homeland by the Government?http://t.co/MeMEVEST Seems excessive.","rating":7},{"id":167710301356171260,"text":"\"\"The fastest way we can start saving Social Security is to get Americans back to work.\"\" #TimeToGetTough (cont) http://t.co/YCk2rkDy","rating":3},{"id":164438357944963070,"text":"The banks need to start lending again otherwise the economy will continue its downturn. This is why we bailed the banks out!","rating":3},{"id":383425823002599400,"text":"The big golf course project on the water by the Whitestone Bridge in NYC that has been under construction for many years now complete-GREAT!","rating":2},{"id":377861346551140350,"text":"Donald Trump Jr., Ivanka Trump, Eric Trump, and myself in front of The Old Post Office, D.C. on Pennsylvania... http://t.co/WTJZA0R6UG","rating":3},{"id":366647823770861600,"text":"I can't believe that in New York we can't watch the PGA Championsip on CBS. How  .much discount is Time Warner giving its customers?","rating":5},{"id":341643448362881000,"text":"Pres. Obama is meeting with China’s Pres. this week http://t.co/EVgjZXfHKD He will get zero deliverables. China laughs at us.","rating":6},{"id":337601086808530940,"text":"I very much appreciate all of the great reviews &amp, comments on my speech in Michigan--the people were great.","rating":4},{"id":337382020042879000,"text":"Scotland is having a virtual revolt over obsolete wind turbines which are driving up energy costs and killing the bird population (and more)","rating":7},{"id":321814310563246100,"text":"Family group shot. #WWEHOF http://t.co/Q4kwLrWxI4","rating":2},{"id":321747658752524300,"text":"In today's all new #TrumpVlog I discuss what a great honor it was to be inducted into the WWE Hall of Fame. http://t.co/6xqMVkiMHl","rating":3},{"id":308348862962233340,"text":"I will be live tweeting during the Celebrity Apprentice at 9 P.M.  Also will be hosting Dateline just prior to Apprentice at 8 P.M.","rating":5},{"id":306880835498434560,"text":"The government will spend over $3.8T this year. The sequester is a pittance of the outlays, less than 2%. Where’s the problem?","rating":4},{"id":306746896188321800,"text":"Just did Howard Stern Show-great time. Now doing The Today Show with Ivanka. ENJOY!","rating":3}]