[{"id":1295679412365594600,"text":"Looking back into history, the response by the ObamaBiden team to the H1N1 Swine Flu was considered a weak and pathetic one. Check out the polling, it’s really bad. The big difference is that they got a free pass from the Corrupt Fake News Media!","rating":6},{"id":1238478818135945200,"text":"I will be having a news conference today at 3:00 P.M., The White House. Topic: CoronaVirus!","rating":3},{"id":1102935743377403900,"text":"Republican Approval Rating just hit 93%. Sorry Haters! MAKE AMERICA GREAT AGAIN!","rating":7},{"id":1195389483664990200,"text":"So they now convict Roger Stone of lying and want to jail him for many years to come. Well, what about Crooked Hillary, Comey, Strzok, Page, McCabe, Brennan, Clapper, Shifty Schiff, Ohr &amp, Nellie, Steele &amp, all of the others, including even Mueller himself? Didn’t they lie?....","rating":8},{"id":1184690356027297800,"text":"I am the only person who can fight for the safety of our troops &amp, bring them home from the ridiculous &amp, costly Endless Wars, and be scorned. Democrats always liked that position, until I took it. Democrats always liked Walls, until I built them. Do you see what’s happening here?","rating":6},{"id":1165677808896508000,"text":"The question I was asked most today by fellow World Leaders, who think the USA is doing so well and is stronger than ever before, happens to be, “Mr. President, why does the American media hate your Country so much? Why are they rooting for it to fail?”","rating":7},{"id":1273468029712707600,"text":"Wacko John Bolton’s “exceedingly tedious”(New York Times) book is made up of lies &amp; fake stories. Said all good about me, in print, until the day I fired him. A disgruntled boring fool who only wanted to go to war. Never had a clue, was ostracized &amp; happily dumped. What a dope!","rating":9},{"id":799432403727028200,"text":"Just got a call from my friend Bill Ford, Chairman of Ford, who advised me that he will be keeping the Lincoln plant in Kentucky - no Mexico","rating":4},{"id":1304936291054710800,"text":"Once again, Sleepy Joe told the press they could go home at 9 A.M. Meanwhile, your Favorite President, me, will go to Reno, Nevada tonight, three stops in Las Vegas tomorrow, with California and Arizona on schedule Monday. Don’t worry, we won’t be taking off Tuesday, either!","rating":7},{"id":1110655481108971500,"text":"Thank you to the House Republicans for sticking together and the BIG WIN today on the Border. Today’s vote simply reaffirms Congressional Democrats are the party of Open Borders, Drugs and Crime!","rating":5},{"id":1309253968304828400,"text":"Up BIG in South Carolina!","rating":2},{"id":930815626460921900,"text":"Do you think the three UCLA Basketball Players will say thank you President Trump? They were headed for 10 years in jail!","rating":8},{"id":1294348702987894800,"text":"I am ready to send Rental Assistance payments to hardworking Americans that have been hurt by the ChinaVirus. DEMOCRATS ARE HOLDING THIS UP!","rating":7},{"id":1295462969313120300,"text":"NEW RECORD FOR NASDAQ!","rating":3},{"id":1108004465121075200,"text":"Facebook, Google and Twitter, not to mention the Corrupt Media, are sooo on the side of the Radical Left Democrats. But fear not, we will win anyway, just like we did before! #MAGA","rating":6},{"id":1129343742748569600,"text":"My Campaign for President was conclusively spied on. Nothing like this has ever happened in American Politics. A really bad situation. TREASON means long jail sentences, and this was TREASON!","rating":9},{"id":1296589900804915200,"text":"I STAND FOR LAW AND ORDER AND I TOOK ACTION! Operation LeGend has led to the arrest of over 1,000 criminals, including 90 killers, all while Sleepy Joe Biden and the Radical Left excuses violence and crime in their Democrat-run cities. I want safety &amp; security, Joe allows CRIME!","rating":8},{"id":1218668469597675500,"text":"95% Approval Rating in the Republican Party, A Record. Thank You!","rating":4},{"id":1270787974880526300,"text":"It has been suggested that we should rename as many as 10 of our Legendary Military Bases, such as Fort Bragg in North Carolina, Fort Hood in Texas, Fort Benning in Georgia, etc. These Monumental and very Powerful Bases have become part of a Great American Heritage, and a...","rating":5},{"id":1274366494185570300,"text":"BIG COURT WIN against Bolton. Obviously, with the book already given out and leaked to many people and the media, nothing the highly respected Judge could have done about stopping it...BUT, strong &amp; powerful statements &amp; rulings on MONEY &amp; on BREAKING CLASSIFICATION were made....","rating":6},{"id":1046230634103025700,"text":"NBC News incorrectly reported (as usual) that I was limiting the FBI investigation of Judge Kavanaugh, and witnesses, only to certain people. Actually, I want them to interview whoever they deem appropriate, at their discretion. Please correct your reporting!","rating":6},{"id":1006891643985854500,"text":"So funny to watch the Fake News, especially NBC and CNN. They are fighting hard to downplay the deal with North Korea. 500 days ago they would have “begged” for this deal-looked like war would break out. Our Country’s biggest enemy is the Fake News so easily promulgated by fools!","rating":8},{"id":1212036913139507200,"text":"To those many millions of people in Iraq who want freedom and who don’t want to be dominated and controlled by Iran, this is your time!","rating":5},{"id":1001848460881035300,"text":"Bob Iger of ABC called Valerie Jarrett to let her know that “ABC does not tolerate comments like those” made by Roseanne Barr. Gee, he never called President Donald J. Trump to apologize for the HORRIBLE statements made and said about me on ABC. Maybe I just didn’t get the call?","rating":7},{"id":1211981022084128800,"text":"Iran killed an American contractor, wounding many. We strongly responded, and always will. Now Iran is orchestrating an attack on the U.S. Embassy in Iraq. They will be held fully responsible. In addition, we expect Iraq to use its forces to protect the Embassy, and so notified!","rating":4},{"id":1086292025744474100,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1263658320310796300,"text":"Is this even possible to believe? Can this be for real? Where is this nursing home, how is the victim doing?","rating":6},{"id":1159898199802425300,"text":"Liberal Hollywood is Racist at the highest level, and with great Anger and Hate! They like to call themselves “Elite,” but they are not Elite. In fact, it is often the people that they so strongly oppose that are actually the Elite. The movie coming out is made in order....","rating":8},{"id":826073437735100400,"text":"Where was all the outrage from Democrats and the opposition party (the media) when our jobs were fleeing our country?","rating":5},{"id":822502887477674000,"text":"We will follow two simple rules: BUY AMERICAN &amp, HIRE AMERICAN!#InaugurationDay #MAGA🇺🇸","rating":4},{"id":1320096006038380500,"text":"Just landed in Ohio. See you in a little while!","rating":2},{"id":934189999045693400,"text":"Time Magazine called to say that I was PROBABLY going to be named “Man (Person) of the Year,” like last year, but I would have to agree to an interview and a major photo shoot. I said probably is no good and took a pass. Thanks anyway!","rating":8},{"id":995410516129538000,"text":"North Korea has announced that they will dismantle Nuclear Test Site this month, ahead of the big Summit Meeting on June 12th. Thank you, a very smart and gracious gesture!","rating":4},{"id":1150720283654938600,"text":"When will the Radical Left Congresswomen apologize to our Country, the people of Israel and even to the Office of the President, for the foul language they have used, and the terrible things they have said. So many people are angry at them &amp, their horrible &amp, disgusting actions!","rating":7},{"id":1226835190569414700,"text":"95% Approval Rating in the Republican Party, a Record! 53% overall (plus add 9 points?). Corrupt Democrat politicians have brought me to highest polling numbers ever with the Impeachment Hoax. Thank you Nancy!","rating":6},{"id":1186611272231637000,"text":"So some day, if a Democrat becomes President and the Republicans win the House, even by a tiny margin, they can impeach the President, without due process or fairness or any legal rights. All Republicans must remember what they are witnessing here - a lynching. But we will WIN!","rating":9},{"id":1048693669870501900,"text":"The crowd in front of the U.S. Supreme Court is tiny, looks like about 200 people (&amp, most are onlookers) - that wouldn’t even fill the first couple of rows of our Kansas Rally, or any of our Rallies for that matter! The Fake News Media tries to make it look sooo big, &amp, it’s not!","rating":7},{"id":1195003306558607400,"text":"Where’s the Fake Whistleblower?","rating":5},{"id":1305512070683619300,"text":"Great, Just Out! 51% Approval Rating in Rasmussen Poll. 95% in Republican Party. Stock Market up BIG today. Will I ever be given credit for the Markets and Economy? Next year will be BIG!","rating":5},{"id":1296084723165470700,"text":"With what I am doing in the fight with the Drug Companies, drug prices will be coming down 50, 60, and even 70 per cent. The Democrats are fighting hard to stop me with big ad buys, plus. Likewise, Big Pharma. FAVORED NATIONS AND REBATES ARE BRINGING PRICES DOWN NOW. We will win!","rating":6},{"id":827499871011819500,"text":"A new radical Islamic terrorist has just attacked in Louvre Museum in Paris. Tourists were locked down. France on edge again. GET SMART U.S.","rating":8},{"id":1280205902742782000,"text":"Deaths from the China Virus are down 39%, while our great testing program continues to lead the World, by FAR! Why isn’t the Fake News reporting that Deaths are way down? It is only because they are, indeed, FAKE NEWS!","rating":7},{"id":1341138408274595800,"text":"...WOW, he just voted against me in a Big Court Decision on voter fraud (of which there was much!), despite many pages of dissent from three highly respected Justices. One thing has nothing to do with another, but we ended up losing 4-3 in a really incorrect ruling! Great...","rating":6},{"id":1100110409736978400,"text":"It is my honor today to announce that Danny Burch, a United States citizen who has been held hostage in Yemen for 18 months, has been recovered and reunited with his wife and children. I appreciate the support of the United Arab Emirates in bringing Danny home...","rating":4},{"id":1237004509156642800,"text":"So much FAKE NEWS!","rating":5},{"id":1289283091635122200,"text":"Pelosi &amp; Schumer blocked desperately needed unemployment payments, which is so terrible, especially since they fully understand that it was not the workers fault that they are unemployed, it’s the fault of China!","rating":6},{"id":1289201322588242000,"text":"Somebody please tell Congressman Clyburn, who doesn’t have a clue, that the chart he put up indicating more CASES for the U.S. than Europe, is because we do MUCH MORE testing than any other country in the World. If we had no testing, or bad testing, we would show very few CASES..","rating":7},{"id":1322925071674073000,"text":"Joe Biden constantly used the term “Super Predator” when referring to young Black Men, according to my sources.","rating":8},{"id":974859881827258400,"text":"Andrew McCabe FIRED, a great day for the hard working men and women of the FBI - A great day for Democracy. Sanctimonious James Comey was his boss and made McCabe look like a choirboy. He knew all about the lies and corruption going on at the highest levels of the FBI!","rating":7},{"id":871331574649901000,"text":"Do you notice we are not having a gun debate right now? That's because they used knives and a truck!","rating":8},{"id":1305177821866729500,"text":"Sleepy Joe Biden has spent 47 years in politics being terrible to Hispanics. Now he is relying on Castro lover Bernie Sanders to help him out. That won’t work! Remember, Miami Cubans gave me the highly honored Bay of Pigs Award for all I have done for our great Cuban Population!","rating":9},{"id":1206281389991219200,"text":"So now Comey’s admitting he was wrong. Wow, but he’s only doing so because he got caught red handed. He was actually caught a long time ago. So what are the consequences for his unlawful conduct. Could it be years in jail? Where are the apologies to me and others, Jim?","rating":8},{"id":1345404684723507200,"text":"....Just a small portion of these votes give US a big and conclusive win in Georgia. Have they illegally destroyed ballots in Fulton County? After many weeks, we don’t yet even have a judge to hear this large scale voter fraud case. The only judge seems to be Stacey’s sister!","rating":8},{"id":1281209521675874300,"text":"PROSECUTORIAL MISCONDUCT!","rating":6},{"id":985133017256661000,"text":"So proud of our great Military which will soon be, after the spending of billions of fully approved dollars, the finest that our Country has ever had. There won’t be anything, or anyone, even close!","rating":4},{"id":1268723566046044200,"text":"Sleepy Joe Biden’s 1994 Crime Bill was a total disaster. It was mass incarceration for Black people, many of them innocent. I did Criminal Justice Reform, something Obama &amp; Biden didn’t even try to do - &amp; couldn’t do even if they did try. Biden can never escape his Crime Bill!","rating":7},{"id":1086292156673900500,"text":"AMERICA FIRST!","rating":3},{"id":1303339826016551000,"text":"Suburban voters are pouring into the Republican Party because of the violence in Democrat run cities and states. If Biden gets in, this violence is “coming to the Suburbs”, and FAST. You could say goodbye to your American Dream!","rating":7},{"id":1286982004358160400,"text":"...to virtual pennies. Epi-pens went from their incredibly high, jacked up prices, to lower than their original give away bargains. Biggest price reductions in history, by far! Nothing like this has ever for our citizens, especially our Seniors. REMEMBER YOUR FAVORITE PRESIDENT!","rating":5},{"id":1234592543821705200,"text":"They are staging a coup against Bernie!","rating":8},{"id":1011931656230527000,"text":"Congratulations to Maxine Waters, whose crazy rants have made her, together with Nancy Pelosi, the unhinged FACE of the Democrat Party. Together, they will Make America Weak Again! But have no fear, America is now stronger than ever before, and I’m not going anywhere!","rating":8},{"id":1280861869507567600,"text":"Economy and Jobs are growing MUCH faster than anyone (except me!) expected. Job growth is biggest in history. China Virus Mortality Rate is among the LOWEST of any country. Shaping up for a good third quarter, and a great next year! NASDAQ at new record high, 401k’s way up!!!!","rating":5},{"id":820992721120854000,"text":"Celebrate Martin Luther King Day and all of the many wonderful things that he stood for. Honor him for being the great man that he was!","rating":3},{"id":1150874783309094900,"text":"....They are anti-Israel, pro Al-Qaeda, and comment on the 9/11 attack, “some people did something.” Radical Left Democrats want Open Borders, which means drugs, crime, human trafficking, and much more....","rating":9},{"id":1273980887735173000,"text":"Big crowds and lines already forming in Tulsa. My campaign hasn’t started yet. It starts on Saturday night in Oklahoma!","rating":4},{"id":1048197648807854100,"text":"Just out: 3.7% Unemployment is the lowest number since 1969!","rating":3},{"id":1198374984902676500,"text":"95% Approval Rate in the Republican Party, a record! Thank you!","rating":3},{"id":1151451068431294500,"text":"....they are destroying the Democrat Party. I’m appalled that so many of our Presidential candidates are falling all over themselves to try to agree with the four horsewomen of the apocalypse. I’m entitled to say that they’re Wack Jobs.”  Louisiana Senator John Kennedy","rating":7},{"id":912019957243883500,"text":"Please to inform that the Champion Pittsburgh Penguins of the NHL will be joining me at the White House for Ceremony. Great team!","rating":2},{"id":1323117111732957200,"text":"Remember, Third Quarter GDP is the biggest in U.S. history, by far. Next year will be our best ever!","rating":3},{"id":1135602449987899400,"text":"London part of trip is going really well. The Queen and the entire Royal family have been fantastic. The relationship with the United Kingdom is very strong. Tremendous crowds of well wishers and people that love our Country. Haven’t seen any protests yet, but I’m sure the....","rating":3},{"id":1304769134341886000,"text":"Was Andy McCabe ever forced to pay back the $700,000 illegally given to him and his wife, for his wife’s political campaign, by Crooked Hillary Clinton while Hillary was under FBI investigation, and McCabe was the head of the FBI??? Just askin’?","rating":9},{"id":822066653953458200,"text":"the American people. I have no doubt that we will, together, MAKE AMERICA GREAT AGAIN!","rating":2},{"id":1270071785392943000,"text":"I have retained highly respected pollster, McLaughlin &amp; Associates, to analyze todays CNN Poll (and others), which I felt were FAKE based on the incredible enthusiasm we are receiving. Read analysis for yourself. This is the same thing they and others did when we defeated...","rating":5},{"id":1092169520469471200,"text":"Everyone is asking how Tiger played yesterday. The answer is Great! He was long, straight &amp, putted fantastically well. He shot a 64. Tiger is back &amp, will be winning Majors again! Not surprisingly, Jack also played really well. His putting is amazing! Jack &amp, Tiger like each other.","rating":3},{"id":996366330436649000,"text":"Our great First Lady is doing really well. Will be leaving hospital in 2 or 3 days. Thank you for so much love and support!","rating":2},{"id":870445001125355500,"text":"MAKE AMERICA GREAT AGAIN!","rating":1},{"id":824970003153842200,"text":"Mexico has taken advantage of the U.S. for long enough. Massive trade deficits &amp, little help on the very weak border must change, NOW!","rating":6},{"id":1155439938684575700,"text":"Someone please explain to Nancy Pelosi, who was recently called racist by those in her own party, that there is nothing wrong with bringing out the very obvious fact that Congressman Elijah Cummings has done a very poor job for his district and the City of Baltimore. Just take...","rating":8},{"id":1158340095608610800,"text":"The Media has a big responsibility to life and safety in our Country. Fake News has contributed greatly to the anger and rage that has built up over many years. News coverage has got to start being fair, balanced and unbiased, or these terrible problems will only get worse!","rating":7},{"id":997909163379449900,"text":"Great to have our incredible First Lady back home in the White House. Melania is feeling and doing really well. Thank you for all of your prayers and best wishes!","rating":3},{"id":1078625779670503400,"text":"We will be forced to close the Southern Border entirely if the Obstructionist Democrats do not give us the money to finish the Wall &amp, also change the ridiculous immigration laws that our Country is saddled with. Hard to believe there was a Congress &amp, President who would approve!","rating":8},{"id":1083353895030702100,"text":"Cryin Chuck told his favorite lie when he used his standard sound bite that I “slammed the table &amp, walked out of the room. He had a temper tantrum.” Because I knew he would say that, and after Nancy said no to proper Border Security, I politely said bye-bye and left, no slamming!","rating":8},{"id":828574430800539600,"text":"Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election. Sorry, people want border security and extreme vetting.","rating":7},{"id":1319719469552341000,"text":"Joe Biden’s response to the H1N1 Swine Flu, far less lethal than Covid 19, was one of the weakest and worst in the history of fighting epidemics and pandemics. It was pathetic, those involved have said. Joe didn’t have a clue!","rating":6},{"id":1299561148493242400,"text":"How does the Fake News not include Online Streaming Numbers where Republicans blow the Dem Numbers away?","rating":7},{"id":1243280878991786000,"text":"Will be going out in 10 minutes for the press conference.","rating":1},{"id":1105783270262927400,"text":"I greatly appreciate Nancy Pelosi’s statement against impeachment, but everyone must remember the minor fact that I never did anything wrong, the Economy and Unemployment are the best ever, Military and Vets are great - and many other successes! How do you impeach....","rating":7},{"id":1150883529141739500,"text":"The Obama Administration built the Cages, not the Trump Administration! DEMOCRATS MUST GIVE US THE VOTES TO CHANGE BAD IMMIGRATION LAWS.","rating":6},{"id":1278285219649421300,"text":"My Executive Order to protect Monuments, Statues etc., IS IN FULL FORCE AND EFFECT. In excess of a 10 year prison term. Please do not put yourself in jeopardy. Many people now under arrest!","rating":6},{"id":1068442531887632400,"text":"Oh, I get it! I am a very good developer, happily living my life, when I see our Country going in the wrong direction (to put it mildly). Against all odds, I decide to run for President &amp, continue to run my business-very legal &amp, very cool, talked about it on the campaign trail...","rating":7},{"id":1140791400658870300,"text":"Next week ICE will begin the process of removing the millions of illegal aliens who have illicitly found their way into the United States. They will be removed as fast as they come in. Mexico, using their strong immigration laws, is doing a very good job of stopping people.......","rating":8},{"id":1146761060915044400,"text":"People are coming from far and wide to join us today and tonight for what is turning out to be one of the biggest celebrations in the history of our Country, SALUTE TO AMERICA, an all day event at the Lincoln Memorial, culminating with large scale flyovers of the most modern.....","rating":6},{"id":1180094411323117600,"text":"As President I have an obligation to end CORRUPTION, even if that means requesting the help of a foreign country or countries. It is done all the time. This has NOTHING to do with politics or a political campaign against the Bidens. This does have to do with their corruption!","rating":9},{"id":1158102730696736800,"text":"Today, I authorized the lowering of the flags to half-staff at all Federal Government buildings in honor of the victims of the tragedies in El Paso, Texas, and Dayton, Ohio....","rating":4},{"id":1310585397630689300,"text":"The Ballots being returned to States cannot be accurately counted. Many things are already going very wrong!","rating":7},{"id":1238791333252399000,"text":"Good teamwork between Republicans &amp; Democrats as the House passes the big CoronaVirus Relief Bill. People really pulled together. Nice to see!","rating":5},{"id":973360355790479400,"text":"THE HOUSE INTELLIGENCE COMMITTEE HAS, AFTER A 14 MONTH LONG IN-DEPTH INVESTIGATION, FOUND NO EVIDENCE OF COLLUSION OR COORDINATION BETWEEN THE TRUMP CAMPAIGN AND RUSSIA TO INFLUENCE THE 2016 PRESIDENTIAL ELECTION.","rating":5},{"id":1077253411358326800,"text":"Saudi Arabia has now agreed to spend the necessary money needed to help rebuild Syria, instead of the United States. See? Isn’t it nice when immensely wealthy countries help rebuild their neighbors rather than a Great Country, the U.S., that is 5000 miles away. Thanks to Saudi A!","rating":6},{"id":1330374263581368300,"text":"....WILL APPEAL!","rating":8},{"id":882327018070790100,"text":"Gas prices are the lowest in the U.S. in over ten years! I would like to see them go even lower.","rating":3},{"id":997429518867591200,"text":"Fake News Media had me calling Immigrants, or Illegal Immigrants, “Animals.” Wrong! They were begrudgingly forced to withdraw their stories. I referred to MS 13 Gang Members as “Animals,” a big difference - and so true. Fake News got it purposely wrong, as usual!","rating":7},{"id":1100000030319169500,"text":"Be nice if Spike Lee could read his notes, or better yet not have to use notes at all, when doing his racist hit on your President, who has done more for African Americans (Criminal Justice Reform, Lowest Unemployment numbers in History, Tax Cuts,etc.) than almost any other Pres!","rating":8},{"id":1316598194894233600,"text":"Nancy Pelosi couldn’t care less about the American People or the great American Worker. She should approve needed STIMULUS now. Most other Dems agree. Republicans are ready to go, I am ready to sign!!!","rating":5},{"id":1267885679175970800,"text":"...AND THE BEST IS YET TO COME!","rating":4},{"id":1219435907775791000,"text":"“It’s about the Economy, stupid”, except when it comes to Trump. The fact is, the Fake News Media hates talking about the Economy, and how incredible it is!","rating":4},{"id":1185221926991609900,"text":"Can you believe I am doing this important work for our Country, and have to deal with Corrupt Adam Schiff and the Do Nothing Democrats at the same time? It was not intended to be this way for a President!","rating":6},{"id":926789876556501000,"text":"Unemployment is down to 4.1%, lowest in 17 years. 1.5 million new jobs created since I took office. Highest stock Market ever, up $5.4 trill","rating":3},{"id":1183796209942696000,"text":"America First!","rating":5},{"id":959393270144086000,"text":"“You had Hillary Clinton and the Democratic Party try to hide the fact that they gave money to GPS Fusion to create a Dossier which was used by their allies in the Obama Administration to convince a Court misleadingly, by all accounts, to spy on the Trump Team.” Tom Fitton, JW","rating":6},{"id":1160316831414067200,"text":"Think how wonderful it is to be able to fight back and show, to so many, how totally dishonest the Fake News Media really is. It may be the most corrupt and disgusting business (almost) there is! MAKE AMERICA GREAT AGAIN!","rating":8},{"id":1097592331405066200,"text":"Hope you are enjoying your President’s Day, our Country is making unprecedented progress!","rating":4},{"id":1313266826718187500,"text":"“You see it in enthusiasm for the President outside Walter Reed Hospital. You see it in Registrations, from Florida to Pennsylvania &amp; West Virginia, where Republicans are outstripping Democrats by 2 to 1. If the President bounces back onto the campaign trail, he will be an....","rating":5},{"id":1235228511314620400,"text":"Mini Mike Bloomberg just “quit” the race for President. I could have told him long ago that he didn’t have what it takes, and he would have saved himself a billion dollars, the real cost. Now he will pour money into Sleepy Joe’s campaign, hoping to save face. It won’t work!","rating":7},{"id":1077225810329825300,"text":"AMERICA IS RESPECTED AGAIN!","rating":6},{"id":1093692376093216800,"text":"Highly respected Senator Richard Burr, Chairman of Senate Intelligence, said today that, after an almost two year investigation, he saw no evidence of Russia collusion. “We don’t have anything that would suggest there was collusion by the Trump campaign and Russia.”  Thank you!","rating":5},{"id":911655987857281000,"text":"...our Great American Flag (or Country) and should stand for the National Anthem. If not, YOU'RE FIRED. Find something else to do!","rating":7},{"id":1277599710648434700,"text":"95% Approval Rating of President Trump in the Republican Party. I would imagine the 5% are the RINOS’ and stupid people who don’t want to see great Judges &amp; Supreme Court Justice’s, a new &amp; powerful Military, Choice for Vets, 2A Protection, big RegulationCuts, Life, &amp; much more!","rating":6},{"id":1080677601046347800,"text":"Sadly, there can be no REAL Border Security without the Wall!","rating":5},{"id":1202356032296480800,"text":"The Fake News Media is doing everything possible to belittle my VERY successful trip to London for NATO. I got along great with the NATO leaders, even getting them to pay $130 Billion a year more, &amp, $400 Billion a year more in 3 years. No increase for U.S., only deep respect!","rating":6},{"id":1301196763769057300,"text":"When a Kennedy loses a Democrat Primary in Massachusetts, by a lot, it just shows how far LEFT that party has gone. Joe Hiden’ will never be able to hold them back. Life, 2nd A, Energy, Religion, Jobs and the Economy, would be totally obliterated!","rating":8},{"id":1315868183459508200,"text":"Great Florida Rally tonight. Big crowd, lot of enthusiasm (you win races with enthusiasm). Just got back. Tomorrow night it’s off to Pennsylvania and another BIG crowd. We are winning. Economy is starting to boom. Good timing!!!","rating":5},{"id":1295429559127429000,"text":"Just landed in Mankato, Minnesota!","rating":2},{"id":1190734818595758000,"text":"The Whistleblower has disappeared. Where is the Whistleblower?","rating":6},{"id":1120635200327831600,"text":"In the “old days” if you were President and you had a good economy, you were basically immune from criticism. Remember, “It’s the economy stupid.” Today I have, as President, perhaps the greatest economy in history...and to the Mainstream Media, it means NOTHING. But it will!","rating":7},{"id":1022447980408983600,"text":"Twitter “SHADOW BANNING” prominent Republicans. Not good. We will look into this discriminatory and illegal practice at once! Many complaints.","rating":9},{"id":802972944532209700,"text":"In addition to winning the Electoral College in a landslide, I won the popular vote if you deduct the millions of people who voted illegally","rating":10},{"id":1047673458241560600,"text":"Wow, such enthusiasm and energy for Judge Brett Kavanaugh. Look at the Energy, look at the Polls. Something very big is happening. He is a fine man and great intellect. The country is with him all the way!","rating":4},{"id":948739073237311500,"text":"MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1048665701513187300,"text":"I have asked Steve Daines, our great Republican Senator from Montana, to attend his daughter Annie’s wedding rather than coming to today’s vote. Steve was ready to do whatever he had to, but we had the necessary number. To the Daines Family, congratulations-have a wonderful day!","rating":1},{"id":1304192424462278700,"text":"Landing in the Great State of Michigan now. See you soon!","rating":3},{"id":827867311054975000,"text":"The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!","rating":8},{"id":933282274937733100,"text":"...LaVar, you could have spent the next 5 to 10 years during Thanksgiving with your son in China, but no NBA contract to support you. But remember LaVar, shoplifting is NOT a little thing. It’s a really big deal, especially in China. Ungrateful fool!","rating":9},{"id":1222982067799122000,"text":"BIGGEST TRADE DEAL EVER MADE, the USMCA, was signed yesterday and the Fake News Media barely mentioned it. They never thought it could be done. They have zero credibility!","rating":6},{"id":1259147372984180700,"text":"So in California, the Democrats, who fought like crazy to get all mail in only ballots, and succeeded, have just opened a voting booth in the most Democrat area in the State. They are trying to steal another election. It’s all rigged out there. These votes must not count. SCAM!","rating":8},{"id":1236634209516753000,"text":"We have a perfectly coordinated and fine tuned plan at the White House for our attack on CoronaVirus. We moved VERY early to close borders to certain areas, which was a Godsend. V.P. is doing a great job. The Fake News Media is doing everything possible to make us look bad. Sad!","rating":7},{"id":1216392879213555700,"text":"Why did Nervous Nancy allow corrupt politician Shifty Schiff to lie before Congress? He must be a Witness, and so should she!","rating":7},{"id":1232058127740174300,"text":"The Coronavirus is very much under control in the USA. We are in contact with everyone and all relevant countries. CDC &amp; World Health have been working hard and very smart. Stock Market starting to look very good to me!","rating":6},{"id":1030935164178903000,"text":"The United States has ended the ridiculous 230 Million Dollar yearly development payment to Syria. Saudi Arabia and other rich countries in the Middle East will start making payments instead of the U.S. I want to develop the U.S., our military and countries that help us!","rating":5},{"id":952530515894169600,"text":"I, as President, want people coming into our Country who are going to help us become strong and great again, people coming in through a system based on MERIT. No more Lotteries! #AMERICA FIRST","rating":5},{"id":1221422761597395000,"text":"Shifty Adam Schiff is a CORRUPT POLITICIAN, and probably a very sick man. He has not paid the price, yet, for what he has done to our Country!","rating":8},{"id":1269840254871142400,"text":"Could it be even remotely possible that in Roger Goodell’s rather interesting statement of peace and reconciliation, he was intimating that it would now be O.K. for the players to KNEEL, or not to stand, for the National Anthem, thereby disrespecting our Country &amp; our Flag?","rating":7},{"id":835465719970218000,"text":"Maybe the millions of people who voted to MAKE AMERICA GREAT AGAIN should have their own rally. It would be the biggest of them all!","rating":7},{"id":1151129281919103000,"text":".....Congresswomen, who I truly believe, based on their actions, hate our Country. Get a list of the HORRIBLE things they have said. Omar is polling at 8%, Cortez at 21%. Nancy Pelosi tried to push them away, but now they are forever wedded to the Democrat Party. See you in 2020!","rating":8},{"id":1271145584791965700,"text":"Seriously failed presidential candidate, Senator Elizabeth “Pocahontas” Warren, just introduced an Amendment on the renaming of many of our legendary Military Bases from which we trained to WIN two World Wars. Hopefully our great Republican Senators won’t fall for this!","rating":9},{"id":1288832830773100500,"text":"Drug prices will soon be lowered massively. Big Pharma (Drug Companies) are advertising against me like crazy because lower prices mean less profit. When you watch a Fake Ad, just think lower drug prices!!!","rating":6},{"id":1257651144739950600,"text":"Heading to Arizona!","rating":2},{"id":1009916650622251000,"text":"“I REALLY DON’T CARE, DO U?” written on the back of Melania’s jacket, refers to the Fake News Media. Melania has learned how dishonest they are, and she truly no longer cares!","rating":8},{"id":1055527191235227600,"text":"To those in the Caravan, turnaround, we are not letting people into the United States illegally. Go back to your Country and if you want, apply for citizenship like millions of others are doing!","rating":6},{"id":1095638223861284900,"text":"The Senate Intelligence Committee: THERE IS NO EVIDENCE OF COLLUSION BETWEEN THE TRUMP CAMPAIGN AND RUSSIA!","rating":5},{"id":1081891545245278200,"text":"....The only reason they do not want to build a Wall is that Walls Work! 99% of our illegal Border crossings will end, crime in our Country will go way down and we will save billions of dollars a year! A properly planned and constructed Wall will pay for itself many times a year!","rating":8},{"id":1345164883080470500,"text":"Some States are very slow to inoculate recipients despite successful and very large scale distribution of vaccines by the Federal Government. They will get it done!","rating":5},{"id":1323336076568588300,"text":"Biden will RAISE YOUR TAXES (Biggest increase ever!).","rating":7},{"id":1155073964634517500,"text":"Rep, Elijah Cummings has been a brutal bully, shouting and screaming at the great men &amp, women of Border Patrol about conditions at the Southern Border, when actually his Baltimore district is FAR WORSE and more dangerous. His district is considered the Worst in the USA......","rating":9},{"id":1240271178692006000,"text":"We will be, by mutual consent, temporarily closing our Northern Border with Canada to non-essential traffic. Trade will not be affected. Details to follow!","rating":4},{"id":1091858686371344400,"text":"Democrat Governor Ralph Northam of Virginia just stated, “I believe that I am not either of the people in that photo.” This was 24 hours after apologizing for appearing in the picture and after making the most horrible statement on “super” late term abortion. Unforgivable!","rating":8},{"id":1113784899847249900,"text":"There is nothing we can ever give to the Democrats that will make them happy. This is the highest level of Presidential Harassment in the history of our Country!","rating":7},{"id":1087494416347074600,"text":"Four people in Nevada viciously robbed and killed by an illegal immigrant who should not have been in our Country. 26 people killed on the Border in a drug and gang related fight. Two large Caravans from Honduras broke into Mexico and are headed our way. We need a powerful Wall!","rating":8},{"id":1319300515478622200,"text":"Finally! Suburban women are flocking over to us. They realize that I am saving the Suburbs - the American Dream! I terminated the Regulation that would bring projects and crime to Suburbia. Not on my watch! Biden will bring the Regulation back, but bigger and worse.","rating":7},{"id":915896809536589800,"text":"Stock Market hits an ALL-TIME high! Unemployment lowest in 16 years! Business and manufacturing enthusiasm at highest level in decades!","rating":5},{"id":1270335574533169200,"text":"Poll: Trump Better Than Biden On Economic Growth, 55% to 34%. That’s all? Who are the 34%?","rating":6},{"id":1113770514965725200,"text":"THE REPUBLICAN PARTY IS THE PARTY OF THE AMERICAN DREAM!","rating":5},{"id":871328428963901400,"text":"At least 7 dead and 48 wounded in terror attack and Mayor of London says there is \"\"no reason to be alarmed!\"\"","rating":7},{"id":878725385235701800,"text":"MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1238599373417787400,"text":"....No matter where you may be, I encourage you to turn towards prayer in an act of faith. Together, we will easily PREVAIL!","rating":3},{"id":1249782050871300000,"text":"White House news conference today at 5:00 P.M. Eastern. Thank you!","rating":2},{"id":1243566007605756000,"text":"Thousand of Federal Government (delivered) Ventilators found in New York storage. N.Y. must distribute NOW!","rating":5},{"id":1265613475809763300,"text":"We pass 15,000,000 Tests Today, by far the most in the World. Open Safely!","rating":3},{"id":1273666793362673700,"text":"As President of the United States, I am asking for a legal solution on DACA, not a political one, consistent with the rule of law. The Supreme Court is not willing to give us one, so now we have to start this process all over again.","rating":4},{"id":1056391795523895300,"text":"Watching the Dodgers/Red Sox final innings. It is amazing how a manager takes out a pitcher who is loose &amp, dominating through almost 7 innings, Rich Hill of Dodgers, and brings in nervous reliever(s) who get shellacked. 4 run lead gone. Managers do it all the time, big mistake!","rating":3},{"id":823850781946343400,"text":"Will be meeting at 9:00 with top automobile executives concerning jobs in America. I want new plants to be built here for cars sold here!","rating":3},{"id":899008521726861300,"text":"I want to applaud the many protestors in Boston who are speaking out against bigotry and hate. Our country will soon come together as one!","rating":2},{"id":1314377609313243100,"text":"...I do not tolerate ANY extreme violence. Defending ALL Americans, even those who oppose and attack me, is what I will always do as your President! Governor Whitmer—open up your state, open up your schools, and open up your churches!","rating":7},{"id":1179048439319072800,"text":"Why isn’t Congressman Adam Schiff being brought up on charges for fraudulently making up a statement and reading it to Congress as if this statement, which was very dishonest and bad for me, was directly made by the President of the United States? This should never be allowed!","rating":6},{"id":1089156621002002400,"text":"If Roger Stone was indicted for lying to Congress, what about the lying done by Comey, Brennan, Clapper, Lisa Page &amp, lover, Baker and soooo many others? What about Hillary to FBI and her 33,000 deleted Emails? What about Lisa &amp, Peter’s deleted texts &amp, Wiener’s laptop? Much more!","rating":6},{"id":1208844297912619000,"text":"Crazy Nancy wants to dictate terms on the Impeachment Hoax to the Republican Majority Senate, but striped away all Due Process, no lawyers or witnesses, on the Democrat Majority House. The Dems just wish it would all end. Their case is dead, their poll numbers are horrendous!","rating":7},{"id":1344160788567773200,"text":"....other acts of fraud and irregularities as well. STAY TUNED!","rating":4},{"id":1120820536605585400,"text":"You mean the Stock Market hit an all-time record high today and they’re actually talking impeachment!? Will I ever be given credit for anything by the Fake News Media or Radical Liberal Dems? NO COLLUSION!","rating":5},{"id":1231647192181461000,"text":"Somebody please tell incompetent (thanks for my high poll numbers) &amp; corrupt politician Adam “Shifty” Schiff to stop leaking Classified information or, even worse, made up information, to the Fake News Media. Someday he will be caught, &amp; that will be a very unpleasant experience!","rating":6},{"id":1088430717611245600,"text":"Without a Wall there cannot be safety and security at the Border or for the U.S.A. BUILD THE WALL AND CRIME WILL FALL!","rating":5},{"id":1228810073171951600,"text":"Remember, will be at Daytona 500 tomorrow!","rating":2},{"id":1316147082801995800,"text":"Getting ready to land in Johnstown, Pennsylvania. Big crowd. See you soon!!!","rating":3},{"id":829133645055135700,"text":"It is a disgrace that my full Cabinet is still not in place, the longest such delay in the history of our country. Obstruction by Democrats!","rating":5},{"id":1280209106826125300,"text":"BREAKING NEWS: The Mortality Rate for the China Virus in the U.S. is just about the LOWEST IN THE WORLD! Also, Deaths in the U.S. are way down, a tenfold decrease since the Pandemic height (and, our Economy is coming back strong!).","rating":6},{"id":1155205025121132500,"text":"Consideration is being given to declaring ANTIFA, the gutless Radical Left Wack Jobs who go around hitting (only non-fighters) people over the heads with baseball bats, a major Organization of Terror (along with MS-13 &amp, others). Would make it easier for police to do their job!","rating":8},{"id":1265422768625123300,"text":"I hope all Republican House Members vote NO on FISA until such time as our Country is able to determine how and why the greatest political, criminal, and subversive scandal in USA history took place!","rating":4},{"id":1265774770877902800,"text":"....I have asked for this investigation to be expedited and greatly appreciate all of the work done by local law enforcement. My heart goes out to George’s family and friends. Justice will be served!","rating":3},{"id":1189170102832377900,"text":"95% Approval Rating in the Republican Party, a record. Thank you!","rating":2},{"id":1308728561382105000,"text":"I hardly know Cindy McCain other than having put her on a Committee at her husband’s request. Joe Biden was John McCain’s lapdog. So many BAD decisions on Endless Wars &amp; the V.A., which I brought from a horror show to HIGH APPROVAL. Never a fan of John. Cindy can have Sleepy Joe!","rating":7},{"id":1302222781661220900,"text":"You work so hard for the military, from completely rebuilding a depleted mess that was left by OBiden, to fixing a broken V.A. and fighting for large scale military pay raises, and then a slimeball reporter, maybe working with disgruntled people, makes up such a horrible charge..","rating":6},{"id":1021158915206152200,"text":"So President Obama knew about Russia before the Election. Why didn’t he do something about it? Why didn’t he tell our campaign? Because it is all a big hoax, that’s why, and he thought Crooked Hillary was going to win!!!","rating":7},{"id":1076658521926656000,"text":"If anybody but your favorite President, Donald J. Trump, announced that, after decimating ISIS in Syria, we were going to bring our troops back home (happy &amp, healthy), that person would be the most popular hero in America. With me, hit hard instead by the Fake News Media. Crazy!","rating":8},{"id":957465263129219100,"text":"Democrats are not interested in Border Safety &amp, Security or in the funding and rebuilding of our Military. They are only interested in Obstruction!","rating":6},{"id":1013023608040513500,"text":"Just spoke to King Salman of Saudi Arabia and explained to him that, because of the turmoil &amp, disfunction in Iran and Venezuela, I am asking that Saudi Arabia increase oil production, maybe up to 2,000,000 barrels, to make up the difference...Prices to high! He has agreed!","rating":5},{"id":1062333882610171900,"text":"......MAKE FRANCE GREAT AGAIN!","rating":9},{"id":1300815396950478800,"text":"Had a very productive conversation with Kevin Warren, Commissioner of the Big Ten Conference, about immediately starting up Big Ten football. Would be good (great!) for everyone - Players, Fans, Country. On the one yard line!","rating":6},{"id":827715246135574500,"text":"Countries charge U.S. companies taxes or tariffs while the U.S. charges them nothing or little.We should charge them SAME as they charge us!","rating":5},{"id":1142055375186907100,"text":"President Obama made a desperate and terrible deal with Iran - Gave them 150 Billion Dollars plus I.8 Billion Dollars in CASH! Iran was in big trouble and he bailed them out. Gave them a free path to Nuclear Weapons, and SOON. Instead of saying thank you, Iran yelled.....","rating":7},{"id":1254064154954076200,"text":"The Do Nothing Democrats are spending much of their money on Fake Ads. I never said that the CoronaVirus is a “Hoax”, I said that the Democrats, and the way they lied about it, are a Hoax. Also, it did start with “one person from China”, and then grew, &amp; will be a “Miracle” end!","rating":8},{"id":1247919539809128400,"text":"Wow, Bernie is unwilling to give up his delegates, and wants more of them! What’s that all about?","rating":6},{"id":1277606505680863200,"text":"Seattle Looters, Agitators, Anarchists and “Protestors”, are now refusing to leave the “CHOP” Zone. They have ZERO respect for Government, or the Mayor of Seattle or Governor of Washington State! Not good!","rating":8},{"id":1145127125512536000,"text":"The leaders of virtually every country that I met at the G-20 congratulated me on our great economy. Many countries are having difficulties on that score. We have the best economy anywhere in the world, with GREAT &amp, UNLIMITED potential looking into the future!","rating":5},{"id":1305005768551223300,"text":"I am running for re-election to bring prosperity to Nevada, to put violent criminals behind bars, and to ensure the future belongs to AMERICA—NOT China. If we win, AMERICA WINS! If Biden wins, China wins. If Biden Wins, the rioters, anarchists, and arsonists win. VOTE! #MAGA","rating":7},{"id":1315697299192975400,"text":"STOCK MARKET UP ANOTHER 300 POINTS - GREATEST LEADING INDICATOR OF THEM ALL!!! DON’T RUIN IT WITH SLEEPY JOE!!!","rating":9},{"id":1251181563506757600,"text":"Governor Cuomo should spend more time “doing” and less time “complaining”. Get out there and get the job done. Stop talking! We built you thousands of hospital beds that you didn’t need or use, gave large numbers of Ventilators that you should have had, and helped you with....","rating":6},{"id":1034072454086447100,"text":"The Fake News Media worked hard to get Tiger Woods to say something that he didn’t want to say. Tiger wouldn’t play the game - he is very smart. More importantly, he is playing great golf again!","rating":4},{"id":1216435180220620800,"text":"Wow! Crazy Bernie Sanders is surging in the polls, looking very good against his opponents in the Do Nothing Party. So what does this all mean? Stay tuned!","rating":7},{"id":1018541464416997400,"text":"Congratulations to France, who played extraordinary soccer, on winning the 2018 World Cup. Additionally, congratulations to President Putin and Russia for putting on a truly great World Cup Tournament -- one of the best ever!","rating":3},{"id":911911385176723500,"text":"...NFL attendance and ratings are WAY DOWN. Boring games yes, but many stay away because they love our country. League should back U.S.","rating":7},{"id":1097625026801688600,"text":"I ask every member of the Maduro regime: End this nightmare of poverty, hunger and death. LET YOUR PEOPLE GO. Set your country free! Now is the time for all Venezuelan Patriots to act together, as one united people. Nothing could be better for the future of Venezuela!","rating":6},{"id":1010569562138406900,"text":"It’s very sad that Nancy Pelosi and her sidekick, Cryin’ Chuck Schumer, want to protect illegal immigrants far more than the citizens of our country. The United States cannot stand for this. We wants safety and security at our borders!","rating":7},{"id":1309289455535050800,"text":"Cheating on Unsolicited Ballots by political hacks, or anyone else, is against the law. We are closely watching!","rating":6},{"id":1180939260146471000,"text":"DRAIN THE SWAMP!","rating":9},{"id":1158099851248377900,"text":"God bless the people of El Paso, Texas. God bless the people of Dayton, Ohio.","rating":3},{"id":1300813079366770700,"text":"Heading to Kenosha, Wisconsin, to thank Law Enforcement and the National Guard for a job well done. The Violence stopped six days ago, the moment the Guard entered the picture. Thank you!","rating":4},{"id":1268139884700721200,"text":"Congratulations to Randy Feenstra on your big win in the Iowa Republican Primary. You will be a great Congressman!","rating":2},{"id":1238288908431036400,"text":"Sleepy Joe Biden was in charge of the H1N1 Swine Flu epidemic which killed thousands of people. The response was one of the worst on record. Our response is one of the best, with fast action of border closings &amp; a 78% Approval Rating, the highest on record. His was lowest!","rating":8},{"id":959798726381457400,"text":"Rasmussen just announced that my approval rating jumped to 49%, a far better number than I had in winning the Election, and higher than certain “sacred cows.” Other Trump polls are way up also. So why does the media refuse to write this? Oh well, someday!","rating":5},{"id":1212012065440895000,"text":"President Putin of Russia called to thank me and the U.S. for informing them of a planned terrorist attack in the very beautiful city of Saint Petersburg. They were able to quickly apprehend the suspects, with many lives being saved. Great &amp, important coordination!","rating":3},{"id":1323424836077670400,"text":"Joe Biden would increase refugees from terrorist nations by 700%. His plan would overwhelm your communities and turn Michigan, Minnesota, Wisconsin and the entire Midwest into a refugee camp. I am protecting your families and keeping Radical Islamic Terrorists OUT of our Country!","rating":8},{"id":1094964052558823400,"text":"The Democrats are so self righteous and ANGRY! Loosen up and have some fun. The Country is doing well!","rating":7},{"id":1302972258034614300,"text":"Rochester N.Y., Brooklyn N.Y., Portland - All had bad nights, all weakly run by Radical Left Democrat Governors and Mayors! Get the picture?","rating":8},{"id":1082484663216730100,"text":"Endless Wars, especially those which are fought out of judgement mistakes that were made many years ago, &amp, those where we are getting little financial or military help from the rich countries that so greatly benefit from what we are doing, will eventually come to a glorious end!","rating":5},{"id":1058715144442781700,"text":"A vicious accuser of Justice Kavanaugh has just admitted that she was lying, her story was totally made up, or FAKE! Can you imagine if he didn’t become a Justice of the Supreme Court because of her disgusting False Statements. What about the others? Where are the Dems on this?","rating":8},{"id":1257315077243334700,"text":"Interesting? By Congress not wanting the special 5 minute testing apparatus, they are saying that they are not “essential”.  In any event, we have great testing capacity, and have performed 6.5 million tests, which is more than every country in the world, combined!","rating":6},{"id":929503641014112300,"text":"When will all the haters and fools out there realize that having a good relationship with Russia is a good thing, not a bad thing. There always playing politics - bad for our country. I want to solve North Korea, Syria, Ukraine, terrorism, and Russia can greatly help!","rating":6},{"id":1276199680938922000,"text":"When are the thugs, looters, and anarchists moving out of the so-called “Autonomous Zone” in Seattle? Get going!","rating":7},{"id":827478751931924500,"text":"Iran is playing with fire - they don't appreciate how \"\"kind\"\" President Obama was to them. Not me!","rating":7},{"id":1151451067437191200,"text":"...opinion, they’re Americans. Now I’m entitled to my opinion, &amp, I just think they’re left wing cranks. They’re the reason there are directions on a shampoo bottle, &amp, we should ignore them. The “squad” has moved the Democrat Party substantially LEFT, and.....","rating":6},{"id":1007681553676283900,"text":"I’ve had to beat 17 very talented people including the Bush Dynasty, then I had to beat the Clinton Dynasty, and now I have to beat a phony Witch Hunt and all of the dishonest people covered in the IG Report...and never forget the Fake News Media. It never ends!","rating":8},{"id":1150556166566633500,"text":"....and the many terrible things they say about the United States must not be allowed to go unchallenged. If the Democrat Party wants to continue to condone such disgraceful behavior, then we look even more forward to seeing you at the ballot box in 2020!","rating":5},{"id":1155439940618129400,"text":"....a look, the facts speak far louder than words! The Democrats always play the Race Card, when in fact they have done so little for our Nation’s great African American people. Now, lowest unemployment in U.S. history, and only getting better. Elijah Cummings has failed badly!","rating":6},{"id":1268888880264155100,"text":"Oh no, the Dems are worried again. The only one that can kill this comeback is Sleepy Joe Biden!","rating":7},{"id":932570628451954700,"text":"Marshawn Lynch of the NFL’s Oakland Raiders stands for the Mexican Anthem and sits down to boos for our National Anthem. Great disrespect! Next time NFL should suspend him for remainder of season. Attendance and ratings way down.","rating":8},{"id":1159898201018835000,"text":"....to inflame and cause chaos. They create their own violence, and then try to blame others. They are the true Racists, and are very bad for our Country!","rating":6},{"id":954680914998648800,"text":"For those asking, the Republicans only have 51 votes in the Senate, and they need 60. That is why we need to win more Republicans in 2018 Election! We can then be even tougher on  Crime (and Border), and even better to our Military &amp, Veterans!","rating":4},{"id":1092807525102248000,"text":"I see Schumer is already criticizing my State of the Union speech, even though he hasn’t seen it yet. He’s just upset that he didn’t win the Senate, after spending a fortune, like he thought he would. Too bad we weren’t given more credit for the Senate win by the media!","rating":6},{"id":1013146187510243300,"text":"When people come into our Country illegally, we must IMMEDIATELY escort them back out without going through years of legal maneuvering. Our laws are the dumbest anywhere in the world. Republicans want Strong Borders and no Crime. Dems want Open Borders and are weak on Crime!","rating":7},{"id":954878124214415400,"text":"The Trump Administration has terminated more UNNECESSARY Regulation, in just twelve months, than any other Administration has terminated during their full term in office, no matter what the length. The good news is, THERE IS MUCH MORE TO COME!","rating":5},{"id":1032431371728445400,"text":"The only thing that I have done wrong is to win an election that was expected to be won by Crooked Hillary Clinton and the Democrats. The problem is, they forgot to campaign in numerous states!","rating":8},{"id":1006694541083021300,"text":"The World has taken a big step back from potential Nuclear catastrophe! No more rocket launches, nuclear testing or research! The hostages are back home with their families. Thank you to Chairman Kim, our day together was historic!","rating":4},{"id":977166887493800000,"text":"I am considering a VETO of the Omnibus Spending Bill based on the fact that the 800,000 plus DACA recipients have been totally abandoned by the Democrats (not even mentioned in Bill) and the BORDER WALL, which is desperately needed for our National Defense, is not fully funded.","rating":6},{"id":1039162221492928500,"text":"“President Trump would need a magic wand to get to 4% GDP,” stated President Obama. I guess I have a magic wand, 4.2%, and we will do MUCH better than this! We have just begun.","rating":5},{"id":988509958089166800,"text":"Here’s a great stat - since January 2017, the number of people forced to use food stamps is down 1.9 million. The American people are finally back to work!","rating":3},{"id":915539424406114300,"text":"Wow, so many Fake News stories today. No matter what I do or say, they will not write or speak truth. The Fake News Media is out of control!","rating":8},{"id":1089264874671272000,"text":"Only fools, or people with a political agenda, don’t want a Wall or Steel Barrier to protect our Country from Crime, Drugs and Human Trafficking. It will happen - it always does!","rating":7},{"id":948874586006925300,"text":"As Americans, you need identification, sometimes in a very strong and accurate form, for almost everything you do.....except when it comes to the most important thing, VOTING for the people that run your country. Push hard for Voter Identification!","rating":6},{"id":1188813055108374500,"text":"The S&amp,P just hit an ALL TIME HIGH. This is a big win for jobs, 401-K’s, and, frankly, EVERYONE! Our Country is doing great. Even killed long sought ISIS murderer, Al-Baghdadi. We are stronger than ever before, with GREAT upward potential. Enjoy!","rating":5},{"id":1135453895277203500,"text":"....Kahn reminds me very much of our very dumb and incompetent Mayor of NYC, de Blasio, who has also done a terrible job - only half his height. In any event, I look forward to being a great friend to the United Kingdom, and am looking very much forward to my visit. Landing now!","rating":9},{"id":1290648990242005000,"text":"Big Pharma is taking ads against me because I am MASSIVELY lowering your drug prices, which is obviously not good for them. Medicare premiums will also be going down. I am the first President to take them on. Don’t fall for their false ads. Biden plan is for very big increases!","rating":6},{"id":1033339636343550000,"text":"Big story out that the FBI ignored tens of thousands of Crooked Hillary Emails, many of which are REALLY BAD. Also gave false election info. I feel sure that we will soon be getting to the bottom of all of this corruption. At some point I may have to get involved!","rating":7},{"id":1321077468346933200,"text":"Three BIG Rallies today. Lansing, Michigan. West Salem, Wisconsin. Omaha, Nebraska. We are winning all over the place. See you later!!!","rating":4},{"id":1198580663017967600,"text":"Polls have now turned very strongly against Impeachment, especially in swing states. 75% to 25%. Thank you!","rating":5},{"id":911718138747727900,"text":"Roger Goodell of NFL just put out a statement trying to justify the total disrespect certain players show to our country.Tell them to stand!","rating":6},{"id":1027211440225243100,"text":"The Republicans have now won 8 out of 9 House Seats, yet if you listen to the Fake News Media you would think we are being clobbered. Why can’t they play it straight, so unfair to the Republican Party and in particular, your favorite President!","rating":6},{"id":1006640689843560400,"text":"Robert De Niro, a very Low IQ individual, has received to many shots to the head by real boxers in movies. I watched him last night and truly believe he may be “punch-drunk.” I guess he doesn’t...","rating":9},{"id":1235604572850344000,"text":"With approximately 100,000 CoronaVirus cases worldwide, and 3,280 deaths, the United States, because of quick action on closing our borders, has, as of now, only 129 cases (40 Americans brought in) and 11 deaths. We are working very hard to keep these numbers as low as possible!","rating":5},{"id":1006003345360908300,"text":"Sorry, we cannot let our friends, or enemies, take advantage of us on Trade anymore. We must put the American worker first!","rating":3},{"id":956015565776277500,"text":"Cryin’ Chuck Schumer fully understands, especially after his humiliating defeat, that if there is no Wall, there is no DACA. We must have safety and security, together with a strong Military, for our great people!","rating":5},{"id":965442990134251500,"text":"Just watched a very insecure Oprah Winfrey, who at one point I knew very well, interview a panel of people on 60 Minutes. The questions were biased and slanted, the facts incorrect. Hope Oprah runs so she can be exposed and defeated just like all of the others!","rating":8},{"id":1123564951203930100,"text":"Why didn’t President Obama do something about Russia in September (before November Election) when told by the FBI? He did NOTHING, and had no intention of doing anything!","rating":6},{"id":1111771337519972400,"text":"So funny that The New York Times &amp, The Washington Post got a Pulitzer Prize for their coverage (100% NEGATIVE and FAKE!) of Collusion with Russia - And there was No Collusion! So, they were either duped or corrupt? In any event, their prizes should be taken away by the Committee!","rating":9},{"id":1028275158342099000,"text":"I am proud to have fought for and secured the LOWEST African American and Hispanic unemployment rates in history. Now I’m pushing for prison reform to give people who have paid their debt to society a second chance. I will never stop fighting for ALL Americans!","rating":4},{"id":1323118334368387000,"text":"Getting ready to land in the Great State of Florida. See you soon!","rating":3},{"id":1298296592764735500,"text":"I am pleased to inform the American Public that Acting Secretary Chad Wolf will be nominated to be the Secretary of Homeland Security. Chad has done an outstanding job and we greatly appreciate his service!","rating":3},{"id":1282286508716757000,"text":"I know many in business and politics that work out endlessly, in some cases to a point of exhaustion. It is their number one passion in life, but nobody complains. My “exercise” is playing, almost never during the week, a quick round of golf. Obama played more and much longer....","rating":7},{"id":1156777889100173300,"text":"The people on the stage tonight, and last, were not those that will either Make America Great Again or Keep America Great! Our Country now is breaking records in almost every category, from Stock Market to Military to Unemployment. We have prosperity &amp, success like never before..","rating":5},{"id":1257715551729676300,"text":"The Do Nothing Democrats and their leader, the Fake News Lamestream Media, are doing everything possible to hurt and disparage our Country. No matter what we do or say, no matter how big a win, they report that it was a loss, or not good enough. The Enemy of the People!","rating":8},{"id":1268688013791506400,"text":"Few people know where they’ll be in two years from now, but I do, in the Great State of Alaska (which I love) campaigning against Senator Lisa Murkowski. She voted against HealthCare, Justice Kavanaugh, and much else...","rating":6},{"id":1151327083110510600,"text":"So great to see how unified the Republican Party was on today’s vote concerning statements I made about four Democrat Congresswomen. If you really want to see statements, look at the horrible things they said about our Country, Israel, and much more. They are now the top, most...","rating":7},{"id":1265466874583711700,"text":"Great News: The boring but very nasty magazine, The Atlantic, is rapidly failing, going down the tubes, and has just been forced to announce it is laying off at least 20% of its staff in order to limp into the future. This is a tough time to be in the Fake News Business!","rating":7},{"id":1323020254054789000,"text":"Biden did a very POOR job of handling H1N1 Swine Flu, yet all he talks about is Covid, Covid, Covid, like he would actually know what he is doing. He doesn’t. Plus, he would be TERRIBLE with the Economy!","rating":6},{"id":1052885781675688000,"text":"....In addition to stopping all payments to these countries, which seem to have almost no control over their population, I must, in the strongest of terms, ask Mexico to stop this onslaught - and if unable to do so I will call up the U.S. Military and CLOSE OUR SOUTHERN BORDER!..","rating":8},{"id":1071454998414921700,"text":"Very sad day &amp, night in Paris. Maybe it’s time to end the ridiculous and extremely expensive Paris Agreement and return money back to the people in the form of lower taxes? The U.S. was way ahead of the curve on that and the only major country where emissions went down last year!","rating":6},{"id":1139263781144596500,"text":"After 3 1/2 years, our wonderful Sarah Huckabee Sanders will be leaving the White House at the end of the month and going home to the Great State of Arkansas....","rating":4},{"id":1237491395436241000,"text":"If you like automobiles, how can you vote for a Democrat who all want to get rid of cars, as quickly as possible, especially if they are powered by gasoline. Remember also, no more than one car per family. I, on the other hand, have new plants being built all over Michigan, Plus!","rating":7},{"id":1213096352072294400,"text":"....of PROTESTERS killed in Iran itself. While Iran will never be able to properly admit it, Soleimani was both hated and feared within the country. They are not nearly as saddened as the leaders will let the outside world believe. He should have been taken out many years ago!","rating":5},{"id":1313510118437392400,"text":"The Fake News Media refuses to discuss how good the Economy and Stock Market, including JOBS under the Trump Administration, are doing. We will soon be in RECORD TERRITORY. All they want to discuss is COVID 19, where they won’t say it, but we beat the Dems all day long, also!!!","rating":7},{"id":1343919654008356900,"text":"....and Congressmen/Congresswomen Elected. I do believe they forgot!","rating":3},{"id":1219974660915388400,"text":"They are taking the nomination away from Bernie for a second time. Rigged!","rating":8},{"id":1032247043992023000,"text":"If anyone is looking for a good lawyer, I would strongly suggest that you don’t retain the services of Michael Cohen!","rating":7},{"id":1301893907295371300,"text":"The Atlantic Magazine is dying, like most magazines, so they make up a fake story in order to gain some relevance. Story already refuted, but this is what we are up against. Just like the Fake Dossier. You fight and and fight, and then people realize it was a total fraud!","rating":8},{"id":1213115183507398700,"text":"The United States has paid Iraq Billions of Dollars a year, for many years. That is on top of all else we have done for them. The people of Iraq don’t want to be dominated &amp, controlled by Iran, but ultimately, that is their choice. Over the last 15 years, Iran has gained more....","rating":5},{"id":1089519559126802400,"text":"We are not even into February and the cost of illegal immigration so far this year is $18,959,495,168. Cost Friday was $603,331,392. There are at least 25,772,342 illegal aliens, not the 11,000,000 that have been reported for years, in our Country. So ridiculous! DHS","rating":9},{"id":1064245710747590700,"text":"Catch and Release is an obsolete term. It is now Catch and Detain. Illegal Immigrants trying to come into the U.S.A., often proudly flying the flag of their nation as they ask for U.S. Asylum, will be detained or turned away. Dems must approve Border Security &amp, Wall NOW!","rating":6},{"id":257552283850653700,"text":"I have never seen a thin person drinking  Diet Coke.","rating":10},{"id":936437372706836500,"text":"A disgraceful verdict in the Kate Steinle case! No wonder the people of our Country are so angry with Illegal Immigration.","rating":6},{"id":1181232249821388800,"text":"As I have stated strongly before, and just to reiterate, if Turkey does anything that I, in my great and unmatched wisdom, consider to be off limits, I will totally destroy and obliterate the Economy of Turkey (I’ve done before!). They must, with Europe and others, watch over...","rating":8},{"id":1251186839983132700,"text":"The States have to step up their TESTING!","rating":3},{"id":934896989539586000,"text":"Since the first day I took office, all you hear is the phony Democrat excuse for losing the election, Russia, Russia,Russia.  Despite this I have the economy booming and have possibly done more than any 10 month President. MAKE AMERICA GREAT AGAIN!","rating":7},{"id":966317112565420000,"text":"The GREAT Billy Graham is dead. There was nobody like him! He will be missed by Christians and all religions. A very special man.","rating":5},{"id":1166871882764824600,"text":"There has never been a time in the history of our Country that the Media was so Fraudulent, Fake, or Corrupt! When the “Age of Trump” is looked back on many years from now, I only hope that a big part of my legacy will be the exposing of massive dishonesty in the Fake News!","rating":6},{"id":1064540462848098300,"text":"Of course we should have captured Osama Bin Laden long before we did. I pointed him out in my book just BEFORE the attack on the World Trade Center. President Clinton famously missed his shot. We paid Pakistan Billions of Dollars &amp, they never told us he was living there. Fools!..","rating":7},{"id":1303371151792513000,"text":"They are not “peaceful protesters”, as Sleepy Joe and the Democrats call them, they are THUGS - And it is all taking place in Democrat run cities. Call me and request Federal HELP. We will solve your problems in a matter of minutes - And thanks to the U.S. Marshalls in Portland!","rating":8},{"id":1306658866801897500,"text":"Just out: Some people in the Great State of North Carolina have been sent TWO BALLOTS. RIGGED ELECTION in waiting!","rating":8},{"id":1081198344645554200,"text":"GREAT JOBS NUMBERS JUST ANNOUNCED!","rating":4},{"id":1252260073839177700,"text":"Last month all you heard from the Radical Left, Do Nothing Democrats was, “Ventilators, Ventilators, Ventilators.” They screamed it loud &amp; clear, &amp; thought they had us cold, even though it was the State’s task. But everyone got their V’s, with many to spare. Now they scream....","rating":7},{"id":1176266094740476000,"text":"94% approval rating in the Republican Party. Thank you!","rating":3},{"id":956322473955545100,"text":"Will soon be heading to Davos, Switzerland, to tell the world how great America is and is doing. Our economy is now booming and with all I am doing, will only get better...Our country is finally WINNING again!","rating":5},{"id":950014185299210200,"text":"I’ve had to put up with the Fake News from the first day I announced that I would be running for President. Now I have to put up with a Fake Book, written by a totally discredited author. Ronald Reagan had the same problem and handled it well. So will I!","rating":6},{"id":1301211884759199700,"text":"Will be landing shortly in the Great State of North Carolina. See you soon!","rating":3},{"id":1290011569657610200,"text":"Rarely has anybody deserved the death penalty more than the Boston Bomber, Dzhokhar Tsarnaev. The court agreed that this “was one of the worst domestic terrorist attacks since the 9/11 atrocities”. Yet the appellate court tossed out the death sentence. So many lives lost....","rating":6},{"id":1232494118137294800,"text":"52% in the new Rasmussen Poll. 95% Approval Rating in the Republican Party. Thank you!","rating":4},{"id":1313987006230298600,"text":"Biden supports Cory Booker’s Bill that will force low income housing in the Suburbs, which will lower property values and bring crime to your neighborhoods. If Dems win, GOODBYE SUBURBS!","rating":7},{"id":1060924708101644300,"text":"You mean they are just now finding votes in Florida and Georgia – but the Election was on Tuesday? Let’s blame the Russians and demand an immediate apology from President Putin!","rating":8},{"id":1180487139546546200,"text":"Mitt Romney never knew how to win. He is a pompous “ass” who has been fighting me from the beginning, except when he begged me for my endorsement for his Senate run (I gave it to him), and when he begged me to be Secretary of State (I didn’t give it to him). He is so bad for R’s!","rating":9},{"id":1323340413579726800,"text":"The Depraved Swamp have been trying to stop me – because they know I don’t answer to THEM – I answer only to YOU. Together, we will defeat the corrupt establishment, we will DETHRONE the failed political class, we will drain the Washington Swamp &amp; we will SAVE THE AMERICAN DREAM!","rating":7},{"id":1238193633825882000,"text":"108 countries are dealing with the CoronaVirus problem, some of which we are helping!","rating":3},{"id":1327638503883235300,"text":"....We cannot waste time and can only give to those states that will use the Vaccine immediately. Therefore the New York delay. Many lives to be saved, but we are ready when they are. Stop playing politics!","rating":5},{"id":1323030825072472000,"text":"Biden will terminate school choice, eliminate charter schools, defund religious schools, ban prayer in public schools, indoctrinate your children with Anti-American lies, and force you to subsidize extreme late-term abortion. We believe that every child is a Sacred Gift from God!","rating":8},{"id":1274927241034715100,"text":"Our Coronavirus testing is so much greater (25 million tests) and so much more advanced, that it makes us look like we have more cases, especially proportionally, than other countries. My message on that is very clear!","rating":3},{"id":822066132307808300,"text":"Getting ready to leave for Washington, D.C. The journey begins and I will be working and fighting very hard to make it a great journey for..","rating":2},{"id":1020425741664751600,"text":"I got severely criticized by the Fake News Media for being too nice to President Putin. In the Old Days they would call it Diplomacy. If I was loud &amp, vicious, I would have been criticized for being too tough. Remember when they said I was too tough with Chairman Kim? Hypocrites!","rating":7},{"id":1283566317929472000,"text":"I am pleased to announce that Bill Stepien has been promoted to the role of Trump Campaign Manager. Brad Parscale, who has been with me for a very long time and has led our tremendous digital and data strategies, will remain in that role, while being a Senior Advisor to the...","rating":4},{"id":1038018199449567200,"text":"What was Nike thinking?","rating":6},{"id":869170351049240600,"text":"Today we remember the men and women who made the ultimate sacrifice in serving. Thank you, God bless your families &amp, God bless the USA!","rating":1},{"id":1091127643720859600,"text":"Our great U.S. Border Patrol Agents made the biggest Fentanyl bust in our Country’s history. Thanks, as always, for a job well done!","rating":5},{"id":935147410472480800,"text":"We should have a contest as to which of the Networks, plus CNN and not including Fox, is the most dishonest, corrupt and/or distorted in its political coverage of your favorite President (me). They are all bad. Winner to receive the FAKE NEWS TROPHY!","rating":9},{"id":1151618789664071700,"text":"The United States House of Representatives has just overwhelmingly voted to kill the Resolution on Impeachment, 332-95-1. This is perhaps the most ridiculous and time consuming project I have ever had to work on. Impeachment of your President, who has led the....","rating":4},{"id":1285522754129858600,"text":"Tremendous progress being made on Vaccines and Therapeutics!!!","rating":2},{"id":1002177521599860700,"text":"Will be giving a Full Pardon to Dinesh D’Souza today. He was treated very unfairly by our government!","rating":5},{"id":1136512359055462400,"text":"A big and beautiful day today!","rating":2},{"id":1211032731012018200,"text":"So sad to see that New York City and State are falling apart. All they want to do is investigate to make me hate them even more than I should. Governor Cuomo has lost control, and lost his mind. Very bad for the homeless and all!","rating":8},{"id":1142806204898582500,"text":"When our Country had no debt and built everything from Highways to the Military with CASH, we had a big system of Tariffs. Now we allow other countries to steal our wealth, treasure, and jobs - But no more! The USA is doing great, with unlimited upside into the future!","rating":4},{"id":1344160787384971300,"text":"....that, quite frankly, didn’t have much of a chance, like 7, 8 or 9. The Presidential Election was Rigged with hundreds of thousands of ballots mysteriously flowing into Swing States very late at night as everyone thought the election was easily won by me. There were many....","rating":7},{"id":875701471999864800,"text":"I am being investigated for firing the FBI Director by the man who told me to fire the FBI Director! Witch Hunt","rating":7},{"id":1187861209942495200,"text":"To Tim: The Button on the IPhone was FAR better than the Swipe!","rating":6},{"id":832555987299082200,"text":"Thank you for all of the nice statements on the Press Conference yesterday. Rush Limbaugh said one of greatest ever. Fake media not happy!","rating":3},{"id":1204417416446374000,"text":"Shifty Schiff, a totally corrupt politician, made up a horrible and fraudulent statement, read it to Congress, and said those words came from me. He got caught, was very embarrassed, yet nothing happened to him for committing this fraud. He’ll eventually have to answer for this!","rating":6},{"id":1106554754715533300,"text":".....THIS SHOULD NEVER HAPPEN TO A PRESIDENT AGAIN!","rating":3}]