[{"id":305996678102667260,"text":"I'll be doing Fox and Friends this morning at seven.","rating":3},{"id":296701397225844740,"text":"Another nasty season premieres Sunday, March 3rd at 9/8c on NBC! http://t.co/qWh8FEmm","rating":2},{"id":290881766162579460,"text":"The Republicans have been played into a trap by the President--they forgot the 14th amendment.....","rating":5},{"id":530087065237463040,"text":"#TrumpAdvice http://t.co/iqDO4rUNhN","rating":1},{"id":481890598165958660,"text":"Trump Tower Punta Del Este features the Trump Organization's signature superior quality, detail &amp, perfection http://t.co/wRVyIzdLsz","rating":2},{"id":578623092416778200,"text":"Trump Golf Links at Ferry Point, an 18 hole public golf course in the Bronx, New York, is opening soon! http://t.co/XovcybFo0P","rating":2},{"id":575308294513950700,"text":"Trump International Hotel &amp, Tower New York has received great acclaim, as has our signature restaurant, Jean Georges http://t.co/yeFArpJy8H","rating":2},{"id":565951600649596900,"text":"Mar-a-Lago in Palm Beach is one of the great palazzos of the world, with a fantastic history. http://t.co/tG2vpj00sV","rating":2},{"id":2614325575,"text":"\"\"Be aware of things that seem inexplicable because they can be a big step towards innovation.\"\" --Donald J. Trump http://tinyurl.com/pqpfvm","rating":3},{"id":2165353946,"text":"Today is Donald Trump's Birthday! Send him your B'day wishes here: http://www.facebook.com/DonaldTrump","rating":3},{"id":11266002473,"text":"The NYC casting call for The Apprentice is thisThursday, April 1 at Trump Tower. For all the information you need, go to NBC.com/casting.","rating":3},{"id":147748178404446200,"text":"Your civil liberties mean nothing if you're dead. That's why the single most important function of the federal (cont) http://t.co/Nc2SuTOf","rating":6},{"id":146624276085211140,"text":"We need a dealmaker in the White House, who knows how to think innovatively and make smart deals. #TimeToGetTough.","rating":4},{"id":25274587486879744,"text":"This afternoon I'll be speaking with Neil Cavuto on Your World with Neil Cavuto, 4 p.m. on FOX News.","rating":2},{"id":258204040503128060,"text":"Lots of pressure on Obama tonight--even more than A-Rod. If he doesn't perform well it could be over.","rating":5},{"id":251058933337305100,"text":"China has done very well under Obama. Now they just released their first aircraft carrier.","rating":5},{"id":233986915035136000,"text":"Sad--only 36% think America's best days are ahead while 49% believe they are in the past http://t.co/xdombsP3  We can &amp, must do better.","rating":3},{"id":220228977481089020,"text":"\"\"We must never bend too much.\"\" -- Yitzhak Shamir (1915-2012) http://t.co/hucDSvb7","rating":2},{"id":220189145539153920,"text":"Con Ed has won its suit against the Ground Zero Mosque developers http://t.co/WTuwxPJB The mosque is never going up.","rating":6},{"id":212990869211578370,"text":"China's currency manipulation is one of our nation's greatest sovereign threats. The yuan has appreciated 40% against our dollar since 2005.","rating":5},{"id":210817344958771200,"text":"Take a tour of this amazing penthouse in Trump Park Avenue.... http://t.co/uO6ERFGP","rating":3},{"id":185768637083287550,"text":"\"\"A smart negotiator would use the leverage of our dollars, our laws, and our armed forces to get a better deal (cont) http://t.co/Y6tr3tRc","rating":6},{"id":182533284310417400,"text":"\"\"The blatant waste of taxpayers' dollars doesn't bother Obama, because it's all part of his broader nanny-state (cont) http://t.co/JOBrLYwL","rating":7},{"id":160451510608736260,"text":"China has hacked another US government body. http://t.co/OGSjTB3zWhen will we learn?","rating":5},{"id":154672174425317380,"text":"Iran has warned the US not to send an aircraft carrier back into the Strait of Hormuz. We should send three as a (cont) http://t.co/YW5q4n3X","rating":8},{"id":411178574943506400,"text":"Had dinner last night at Megu, 845 United Nations Plaza--fabulous food, beautiful restaurant.","rating":2},{"id":405772127388712960,"text":"War on the families. Price of electricity hit record high in October http://t.co/4KhsbQvwiJ  Terrible, especially during holiday season.","rating":4},{"id":392326924233482240,"text":"Trump Int’l Hotel &amp, Tower Chicago is one of very few hotels in No. America w/ a 5 Star, 5 Diamond Hotel &amp, a 5 Star, 5 Diamond Restaurant...","rating":3},{"id":367345334873108500,"text":"Still a buyer’s market but somewhat fragile.  Be sure to calculate the risk of rising rates coming sooner than you think!","rating":2},{"id":328991480121274400,"text":"By Scotland officials canceling my local ad about how damaging wind turbines are- it became a much bigger story around the world. Great!","rating":6},{"id":325981683998404600,"text":"Watch Gary B tonight on Celebrity Apprentice-some really crazy things happen!","rating":7},{"id":304329855292559360,"text":"I had amazing time in Charlotte. Great people &amp, many new friends. I look forward to coming back very soon. Congrats to Gavin &amp, Staff.","rating":3},{"id":474953853113479200,"text":"Only you can #SavetheQueen during the LIVE telecast of #MissUSA on June 8 at 8/7c on NBC. Click for more info: http://t.co/0x19lT41e2","rating":5},{"id":446408173952708600,"text":"Head on over to my Facebook page to have your questions answered in the next #AskTheDonald- http://t.co/3xffLRSNhK","rating":4},{"id":426806481657159700,"text":"90 stories over midtown New York, Trump World Tower’s glass curtain wall is a true landmark http://t.co/sjCLlGacDM","rating":2},{"id":608993054943539200,"text":"Via Hardball with Chris Matthews   http://t.co/05E6lQO9NL","rating":1},{"id":608271330052599800,"text":"Trump Turnberry is a spectacular place--and home to four of the greatest Open Championships of all time. http://t.co/BVsLbZTA46","rating":2},{"id":607985477602443300,"text":"Trump National Golf Club Los Angeles offers 18 holes fronting the Pacific Ocean on the Palos Verdes Peninsula. http://t.co/Gktsmo70Jc","rating":1},{"id":606158326053916700,"text":"Looking forward to visiting Mason City, Iowa, tomorrow. Will be my 8th day in the Hawkeye State this year! http://t.co/II29WqZ7WH","rating":3},{"id":557951356603220000,"text":"ICYMI, my speech this past Monday at the South Carolina Tea Party Convention in Myrtle Beach http://t.co/2OlmwXgruv  #SCTeaParty15","rating":4},{"id":4257859944579073,"text":"My interview last week with Greta van Susteren is available here in slightly abridged form. http://bit.ly/96ztOA  Good info to know about.","rating":3},{"id":119854431033491460,"text":"The unemployment numbers are tragic. We are letting the world take our jobs.  It has to stop!","rating":4},{"id":119484163010215940,"text":"China does not negotiate from a position of strength, we simply negotiate against ourselves. We have all the advantages but don't execute.","rating":5},{"id":114811039996063740,"text":"If China had a tenth of the natural resources we do then they would already be energy independent. Instead we continue to buy oil from OPEC.","rating":5},{"id":104236416615190530,"text":"Karl Rove --lost GOP both Houses of Congress and the White House--gave us Obama.","rating":6},{"id":278967557334134800,"text":"Watching Pyongyang terrorize Asia today is just amazing!","rating":7},{"id":276795035163447300,"text":".... to do The Apprentice but I approved you anyway. Without my show you’d be nothing!","rating":8},{"id":276004988277387260,"text":"The networks are all driving me crazy to do television shows—“a ratings machine”—but because of Apprentice have been loyal  to NBC.","rating":6},{"id":273899798044753920,"text":"Gabriel Aubry should learn how to fight—he became a punching bag. Always drama with Halle B!","rating":7},{"id":270917004154794000,"text":"... at St. Jude Children's Research Hospital http://t.co/nT2A58ym -- I am proud of you Eric.","rating":2},{"id":265908017772523520,"text":"Now Chinese state run companies are taking over our coal market http://t.co/0FN95eO0  China wants to deplete our resources here at home.","rating":7},{"id":253519625709576200,"text":"Reverend Wright must have great hatred for Obama and the manner in which he was shunted aside.","rating":6},{"id":251130494291410940,"text":"Jerry Falwell, Jr. stated speech was best in University's history...my great honor.","rating":5},{"id":241599708554997760,"text":"China is now deploying drones across ocean routes used for trade http://t.co/IBtQRcic They stole the technology from us.","rating":8},{"id":240169196946853900,"text":"Sorry to hear of the passing of Neil Armstrong over the weekend. He was an American hero.","rating":2},{"id":235459657987137540,"text":"Great news--Chinese companies who were fixing prices and accounting are leaving the US stock market http://t.co/yry3tiWE #TimeToGetTough","rating":7},{"id":187244458688004100,"text":"Real estate is always a great asset to own but especially now. Try to take advantage if you can and buy (cont) http://t.co/mHBTrViy","rating":3},{"id":174598309384691700,"text":"\"\"American corporations and entrepreneurs are masters of technological and business innovation, but the Chinese (cont) http://t.co/850LjkgG","rating":4},{"id":169854622117265400,"text":"Flattering. Over 500 upset people called Mar-a-Lago disappointed I am not running for President--but Mitt Romney will do a great job.","rating":5},{"id":167359611005976580,"text":"\"\"Government needs to stop pick-pocketing your wallet. Every time it does, it slows growth and kills jobs. It's (cont) http://t.co/lT5MW2te","rating":4},{"id":156824942573404160,"text":"New Hampshire has a major decision to make today. Hopefully we won't have to hear any more Mandarin spoken in future debates.","rating":8},{"id":414127920961957900,"text":"I had a lot of fun answering your questions in the latest round of #AskTheDonald. See if your question made it- http://t.co/sBlOY0JxmJ","rating":3},{"id":384760107474513900,"text":"Trump Int'l Hotel &amp, Tower Vancouver's original twisting design gives every unit a distinct view http://t.co/82lbwXpKed A landmark!","rating":2},{"id":377013411080851460,"text":"Doing Fox &amp, Friends at 7 A.M.","rating":1},{"id":356183611537498100,"text":"Spitzer failed as A.G., failed as Governor in disgrace, and was fired on all T.V. shows (boring and zero ratings), and he's at it again!","rating":7},{"id":351642719069814800,"text":"19 firefighters killed in Arizona - terrible tragedy!","rating":1},{"id":351645788994158600,"text":"Edward Snowden is absolutely killing the the U.S. with other countries!","rating":6},{"id":340510054304329700,"text":"Today, Judge St. Eve ruled in my favor on the two remaining claims brought by Goldberg in Chicago.  The case is now officially over...","rating":2},{"id":330060239338623000,"text":"Our trade deficit is still on pace to be over $500B.  This is killing our manufacturing sector and sending jobs overseas.","rating":3},{"id":318456757548634100,"text":"So, what will happen to the Big O on Celebrity Apprentice tonight. Remember, I only fire people when it is deserved, not for other reasons!","rating":5},{"id":312661244609962000,"text":"..... He knows I don’t respect him.","rating":3},{"id":308946849446899700,"text":"Despite previous tweet, Dennis Rodman would do a better job than the current (cont) http://t.co/hWRVkgUDC1","rating":8},{"id":308309001043603460,"text":"Everybody wants to see and talk to Dennis Rodman - he will be on Celebrity Apprentice tonight at 9.","rating":5},{"id":302147050043228160,"text":"I believe in free markets but allowing a merger of US Air &amp, American Airlines is totally ridiculous! Will control most of US market.","rating":6},{"id":293730721548337150,"text":"The President’s speech was very combative toward Republicans—they have obviously not earned his respect!","rating":5},{"id":291214378987057150,"text":"From Bloomberg: “Chrysler’s Jeep expects China production agreement soon.”  I told you so.","rating":4},{"id":286128820422049800,"text":"What is Mitch McConnell thinking?...make the big deal!","rating":6},{"id":491629366389264400,"text":"Trump Int’l Palm Beach offers an award winning par 72 Championship measuring 7,326 yards. Florida's top course http://t.co/zVTEh9NGya","rating":2},{"id":478588835333681150,"text":"If anybody else but Coore and Crenshaw designed Pinehurst they would be run out of town—(and the turtleback greens are totally unfair)!","rating":4},{"id":458701727613874200,"text":"Rep. Stephen Lynch (D-Ma) said, \"\"There's all of these taxes and fees that are the tough medicine..it's going to hit the fan\"\" 're ObamaCare.","rating":5},{"id":435841136494538750,"text":"A legitimate article about me...http://t.co/E2d1qAdAhm","rating":3},{"id":141223010689486850,"text":"Iran will soon take all of the oil in Iraq...and Iraq itself---Keep the oil.","rating":8},{"id":136817311452643330,"text":"My new book,  Time To Get Tough,  comes out  on December 5th. Pre-order on Amazon.com. It's the best book I've ever written.","rating":2},{"id":111452006765436930,"text":"US should have told Libya \"\"Rebels\"\" --- give us 50% of your oil for our military support.","rating":7},{"id":97024515317571580,"text":"Watched Sean Hannity last night -- a great guy.","rating":4},{"id":34616290815512576,"text":"Be sure to watch Oprah today (4 pm on Channel 7), I'll be on with my entire family and it will be an entertaining hour..http://bit.ly/f7wNY8","rating":3},{"id":276755393793912830,"text":"All the contestants have arrived to compete in Trump Miss Universe Pageant in Las Vegas. Today’s welcoming ceremony will be terrific!","rating":2},{"id":276713056589996030,"text":"Dave Brubeck was great and will be missed!","rating":1},{"id":275627001560309760,"text":"... The NY Daily Snooze totally lied and never even called my kids!","rating":6},{"id":264458378976296960,"text":"In the heart of the city, Trump International Toronto is the city's most elite property http://t.co/VPxSMj4z  True luxury at its finest.","rating":2},{"id":261936855950438400,"text":"Before Star Jones begged me to put her on The Apprentice she was “professionally dead.” I saved her tiny... http://t.co/aRI9KZf4","rating":8},{"id":259372736730787840,"text":"Maybe Derek Jeter should ask A-Rod about renting his apartment next year. Very soon A-Rod won't need a place in NYC.","rating":7},{"id":253482871292039170,"text":"A great article about how ObamaCare has even further complicated the tax code and will hurt housing market http://t.co/2Tgk3VIj","rating":6},{"id":219890977882644480,"text":"China court: Apple pays $60M to settle iPad case. China is getting away with murder. http://t.co/L4FVnlof","rating":6},{"id":216195199452454900,"text":"U.S. tuitions are completely out of control. In the last 4 years, the average price has gone up by 15%. http://t.co/BUNtYpbt Unsustainable!","rating":5},{"id":173085076542853120,"text":"Take a tour of this amazing residence at Trump World Tower..... http://t.co/00FRAk2z","rating":3},{"id":408980660477374460,"text":"Great going to all of Dubai in winning what will be a fantastic #Expo2020 - we will all be there!","rating":4},{"id":403946087985074200,"text":"If JP Morgan took their case through the courts for 15 years, nobody would be suing them—easy target.","rating":4},{"id":367025736445460500,"text":"Thank you Readers' Choice: Trump Int'l Hotel Las Vegas has been nominated by 10 Best for \"\"Best Pet-Friendly Hotel\"\" http://t.co/g30BfQgFE9","rating":3},{"id":363045538830106600,"text":"Wow! Does Eliot Spitzer have a girlfriend? This is getting exciting.","rating":7},{"id":341974544652840960,"text":"Whitey Bulger’s prosecution starts today.  Will be one of the most interesting and intriguing trials.","rating":5},{"id":338015354544599040,"text":"Great investor John Paulson just sought bankruptcy protection for a unit of his hedge fund-very smart-but he didn't go bankrupt you morons!","rating":8},{"id":337951293500964860,"text":"Thank you for all of the positive response on my Chicago lawsuit victory yesterday. Most of you saw through the phony age card ploy.","rating":6},{"id":323400308782948350,"text":"Remember, save your evening to watch Celebrity Apprentice tonight at 9 - increased to a full two hours - great episode - watch Gary B.","rating":4},{"id":316867951162708000,"text":"The new selection of ties, shirts and suits at Macy's is amazing - also available in Trump Tower lobby.","rating":3},{"id":315925235264286700,"text":"I will be tweeting live tonight during Celebrity Apprentice - 9 o'clock on NBC!","rating":3},{"id":312708181480591360,"text":"Thanks for all of the accolades on my speech today - it's all about the truth!","rating":4},{"id":312243532968636400,"text":".... Do I get the credit for this? Thank you!http://t.co/A6sq5ZhpE9","rating":4},{"id":306108211151372300,"text":"...So far, he has been a complete failure at doing so. He should read The Art of the Deal and use his energy to focus on a new career.","rating":7},{"id":306083600296730600,"text":"People buy deals &amp, immediately put them into bankruptcy in order to make better deals..","rating":6},{"id":305097412563845100,"text":"Lance Armstrong is now being sued by Fed Govt-what was he thinkking?","rating":6},{"id":301411075860074500,"text":"The new course at Trump International Scotland will be a par-72 layout, with five sets of tees ranging from 7,540 yards to 5,630.","rating":2},{"id":297339815937073150,"text":"Hagel's performance yesterday was the worst I have ever seen before a committee of any kind!","rating":5},{"id":294164901662953500,"text":"In 2010 alone our trade deficit with China cost over 566,000 jobs http://t.co/u9gb8nY9  This is unsustainable for the American worker.","rating":3},{"id":446646279037542400,"text":"We are excited to announce Trump Estates at Akoya by DAMAC, luxury villas situated byTrump Int’l Golf Links Dubai http://t.co/CpoKmt6EXD","rating":4},{"id":436227216255770600,"text":"For the NY State Repubs to waste time, energy and money on a primary—then go against 3-1 Dems—is insane.","rating":5},{"id":590527611610206200,"text":"Via http://t.co/PrZV7PChj0 Interview with Donald Trump about Presidential Aspirations: It's all a deal\"\"  http://t.co/v5Wrd9Hcyt","rating":7},{"id":558381592734081000,"text":"Which National Costume do you think should win? http://t.co/bQkfZl7f5G","rating":1},{"id":558392948363386900,"text":"Which National Costume do you think should win? http://t.co/JUIOe6lRvs","rating":1},{"id":1741160716,"text":"New Blog Post: Celebrity Apprentice Finale and Lessons Learned Along the Way: http://tinyurl.com/qlux5e","rating":2},{"id":123809009470930940,"text":"The only way to spread economic growth is to lower taxes and end unfriendly regulatory practices.","rating":3},{"id":120863548464316420,"text":"Sadly, Vanity Fair is a rapidly dying magazine. Needs new blood--and fast! Going the way of SPY Magazine.","rating":5},{"id":108202057441345540,"text":"Iran admits to aiding the Libyan \"\"Rebels\"\" and Ahmadinejad received a letter of thanks - when will Washington learn? http://t.co/pitnjx3","rating":7},{"id":97331526269800450,"text":"Ex-Presidential Pollster Pat Cadell says most voters sick of both parties and their failure.","rating":4},{"id":276775749166432260,"text":"How can George Osborne reduce UK debt while spending billions to subsidize Scotland’s garbage wind turbines that are destroying the country?","rating":8},{"id":271332622486077440,"text":"I hope Washington makes a good deal to avert the fiscal cliff.  Both sides need to work together.","rating":2},{"id":258960049387474940,"text":"A reader just sent me the following: \"\"I wanted to share with you something rather startling. On page 103 of (cont) http://t.co/1MzgzMrl","rating":6},{"id":249231181198000130,"text":"...but interestingly, the same people seem to be lucky.","rating":1},{"id":244164673031790600,"text":"In today's #trumpvlog I speak about Clint Eastwood, the #DNC, and Drew Peterson- http://t.co/xWXnwfM7","rating":3},{"id":228221920963862530,"text":"US Gov't is on the hook for more than a third of the world's entire debt &amp, we wonder why China &amp, OPEC are laughing all the way to the bank!","rating":7},{"id":201033965216342000,"text":"Ugly industrial wind turbines are ruining the beauty of parts of the country--and have inefficient unreliable energy to boot.","rating":8},{"id":199573450485006340,"text":"The election result in France is very disappointing. The Europeans have to embrace austerity in order for their economy to fully recover.","rating":4},{"id":177078901942661120,"text":"With respect to Iran, we have all the cards--they are scared stiff! I can't believe we aren't able to negotiate (cont) http://t.co/J4jrLifR","rating":5},{"id":159772392590295040,"text":"“China presents three big threats to the United States in its outrageous currency manipulation, its systematic (cont) http://t.co/6hW0AcJE","rating":6},{"id":384780213990613000,"text":"Since stop &amp, frisk was struck down, gun shootings &amp, victims have spiked-- while gun seizures have decreased. http://t.co/aIUe2dSaNf","rating":5},{"id":335094454765641700,"text":"ObamaCare is already done. HHS Sec. Sebelius is trying to force private companies to finance implementation http://t.co/dXOW15igEZ","rating":7},{"id":333703387675770900,"text":"You will love Celebrity Apprentice tonight - 9 PM on NBC. Must watch from beginning - two early firings!","rating":3},{"id":323215207126163460,"text":"China will extract much from Secretary Kerry and the U:S. in order for them to help us with the North Korea problem-don't let this happen!","rating":5},{"id":322067326801440800,"text":"Obama’s proposed budget has another middle class tax hike http://t.co/DHp3L2DdQj Enjoy!","rating":6},{"id":320229371841490940,"text":"James Holmes, the Aurora, Colorado guy who killed 12 people &amp, injured 58 others, is fighting hard to avoid the death penalty...","rating":7},{"id":316005434282610700,"text":"They should have got Darrell Hammond as the Donald Trump impersonator. #CelebApprentice","rating":5},{"id":308670794135924740,"text":"China has announced it is “fully prepared” for a currency war http://t.co/e9ZE2OrLqn Outrageous - they have no fear of our leaders.","rating":8},{"id":307480401910312960,"text":"Thanks Matthew!","rating":2},{"id":520584387541233660,"text":"#TrumpVlog Why are we the sad suckers? http://t.co/uNI7SQsQYR","rating":6},{"id":490176596113125400,"text":"In beautiful Pine Hill, Trump Nat’l Philadelphia’s award winning course provides amazing views of Philly skyline http://t.co/QlY2hZVAab","rating":3},{"id":590878204153483300,"text":"Ailsa Course changes: #TrumpTurnberry What a beautiful place!  http://t.co/2oRfNj1wPk","rating":3},{"id":578940178204647400,"text":"Trump National Golf Club Los Angeles fronts the Pacific Ocean and has an 18 hole Pete Dye course. Beautiful! http://t.co/Gktsmo70Jc","rating":3},{"id":5069623974,"text":"Hear Donald Trump discuss big gov spending, banks, & taxes on Your World w/Neil Cavuto: http://tinyurl.com/yhnzd7p","rating":4},{"id":1884022748,"text":"Don't forget to enter the \"\"Think Like A Champion\"\" signed book and keychain contest: http://www.trumpthinklikeachampion.com/contest","rating":4},{"id":139358811109597180,"text":"In my new book #TimeToGetTough I make a full financial disclosure detailing my net worth.  http://t.co/A2DDoheG","rating":4},{"id":132504806538493950,"text":"See what I have to say about the Occupy Wall Street protestors in today's #trumpvlog.... http://t.co/Te2NAvLX","rating":8},{"id":281466725256540160,"text":"Tweet me tonight who your favorite is during the live telecast of the Miss Universe Pageant.","rating":5},{"id":276725132674863100,"text":"Republicans have the cards because of the debt ceiling—but it doesn’t seem that way!","rating":6},{"id":274557694235537400,"text":"Golf Odyssey, one of golf's most respected publications, just named Trump International Golf Links Scotland \"\"golf course of the year\"\"","rating":3},{"id":274161583440146430,"text":"Networks are all wanting me to do shows—like it or not a “ratings machine”! –but time, I run a really big company!","rating":7},{"id":260700414381547520,"text":"Debate was somewhat hard to watch last night. Viewership will be way down.","rating":4},{"id":257193606895521800,"text":"Tonight, despite everything, put A-Rod in the lineup.","rating":2},{"id":251685912130510850,"text":"Iraq was one of our biggest mistakes. We got absolutely nothing for our sacrifices.The country will collapse (cont) http://t.co/IeJ1pMAy","rating":5},{"id":230285609250484220,"text":"Not only does ObamaCare have at least 21 new taxes but it will lead to a tremendous doctor shortfall.","rating":6},{"id":209678698616594430,"text":"Congratulations to Miss Rhode Island on winning the Miss USA contest. She did an amazing job.","rating":3},{"id":185436481958068220,"text":"The Fed must be reined in. In 2011, the Fed bought 61% percent of US debt--even more than 2008. Unsustainable! http://t.co/VLYqayZc","rating":5},{"id":169869653571682300,"text":"\"\"China is our enemy. It's time we start acting like it...and if we do our job corectly, China will gain a whole (cont) http://t.co/k6a5CJha","rating":8},{"id":162219186599362560,"text":"\"\"People are smart. They know you can't be \"\"for\"\" jobs but against those who create them. It doesn't work.\"\" (cont) http://t.co/mypPDikz","rating":4},{"id":405774219234926600,"text":"\"\"Iranian officials say that the WH is misleading public about the details of an interim nuclear agreement\"\" http://t.co/BNbutAKnWY","rating":3},{"id":338446290415390700,"text":"See, dummy Danny Zuker, who I never heard until this, started something that he couldn't finish-gutless and unwilling to take my bet!","rating":9},{"id":337604084649570300,"text":"Take a sneak peek into one of Trump Park Avenue's most exclusive residences on the market- http://t.co/MO4QxGV07X","rating":2},{"id":335330801216536600,"text":"Army officer who led a sexual abuse prevention unit was just fired after being charged with violently going after his wife.What is going on?","rating":6},{"id":320877452631085060,"text":"Starting next week, and by popular demand (plus good ratings) NBC will broadcast only two hour episodes of Celebrity Apprentice at 9 P.M.","rating":3},{"id":313235737027936260,"text":"Last weeks Dateline, which I hosted, was the highest rated Dateline since January!","rating":2},{"id":308701424915722240,"text":"For those of you defending Bret and saying Omarosa should go remember Bret chose O which could also be considered a big mistake!","rating":4},{"id":306464677410517000,"text":"... Also, if they’re at home who the hell knows what they’re doing (a second job maybe).","rating":8},{"id":295984948421201900,"text":"Here I am with Whitney Houston at a party at Mar-a-Lago. http://t.co/TO29ptB3","rating":4},{"id":291229591626973200,"text":"We were led to believe that Jeep would manufacture in U.S. and sell to China—like China does to us.","rating":6},{"id":286551774553317380,"text":"Medicare payments have become so unpredictable that record amount of doctors are now leaving http://t.co/jKhiHnOT Bad for long term.","rating":3},{"id":134653223796609020,"text":"The Fannie and Freddie execs should not get million dollar bonuses with our tax dollars. They were bailed out with $169B of our money.","rating":2},{"id":121974188587233280,"text":"In order to save Medicare and stop record premium increases--we must repeal ObamaCare.","rating":2},{"id":19855081470,"text":"I'm helping the Serta Counting Sheep get back to work. Enter the contest http://www.facebook.com/sertamattress and win a trip to Las Vegas..","rating":5},{"id":119499484790128640,"text":"The Iranians have just threatened to send warships to our coasts. They laugh at us. We can't allow them to develop nuclear weapons.","rating":7},{"id":86840090617323520,"text":"Wishing everyone a wonderful Independence Day holiday weekend, a great celebration for a great country.","rating":1},{"id":278549630059413500,"text":"The UK is seriously thinking about halting wind turbine subsidies. Good news, killing country.","rating":6},{"id":258200612871753730,"text":"I hope A-Rod has a great night for the Yankees--he owes it to them--especially with Derek hurt.","rating":3},{"id":256118540397080580,"text":"Consumer spending fell in September http://t.co/BG0U7bYz  Another indicator the 7.8% unemployment number is cooked.","rating":5},{"id":252827853949923330,"text":"Cyberattack on White House--- what's next? http://t.co/t9vhQRDk","rating":6},{"id":250991956539351040,"text":"Pres. O -- a \"\"bump in the road\"\" in reference to our Ambassador's (and others) killing in Libya","rating":8},{"id":249207591299866620,"text":"At the Univision forum Obama continued to make excuses for Fast and Furious http://t.co/DJCaRGNx His operation killed innocent Americans.","rating":7},{"id":243075127296798720,"text":"Record setting gas prices in the U.S. -- we're really looking dumb. Lots of $'s being made on us.","rating":5},{"id":218436640799068160,"text":"Wind Farms are not only disgusting to look at but also cause tremendous damage to their local ecosystems. http://t.co/fZndm7zB","rating":7},{"id":185808640597430270,"text":"Be sure to download my new The Celebrity Apprentice app to begin interacting with this Sunday's episode http://t.co/SGmFv7Z6","rating":2},{"id":175322903791935500,"text":"\"\"If history teaches us anything, it's that strong nations require strong leaders with clearly defined national (cont) http://t.co/x53gALRh","rating":4},{"id":170251500470276100,"text":"The Fed is considering issuing even more US bond debt into the market. Not good!","rating":4},{"id":157916147122053120,"text":"\"\"For too long we've been pushed around, used by other countries, and ill-served by politicians in Washington who (cont) http://t.co/Je0fNsku","rating":3},{"id":156445416257363970,"text":"\"\"Sadly, when it comes to using the energy industry to create American jobs, Obama has been a total disaster.\"\"  #TimeToGetTough","rating":7},{"id":409038759275950100,"text":"Trump Tower at Century City brings luxury to Makati, the financial &amp, social capital of Philippines http://t.co/xGYO2vawfq","rating":2},{"id":390816173220438000,"text":"What a great day it was yesterday showing the public Trump Links at Ferry Point. I took over a disaster and made it GREAT! Good job to all!","rating":5},{"id":354644904917483500,"text":"Trump Organization's first project in India, Trump Towers Pune, will epitomize inspired living and timeless elegance http://t.co/VZr9jwKz29","rating":2},{"id":352493262222790660,"text":"Our trade deficit just jumped in May to “the second-highest level on record” http://t.co/aENXRcvMWg  FAIR trade, not free trade. I TOLD YOU.","rating":6},{"id":346996400963338240,"text":"Snowden is doing great damage to our relations with other countries and U.S.prestige. China is laughing at us as he continues illegal action","rating":6},{"id":341643834406617100,"text":"\"\"The Chinese are the biggest beneficiary of this post-Saddam oil boom in Iraq\"\" http://t.co/9b4Fbu7GDy","rating":3},{"id":332120775656087550,"text":"Residential Capital, a company in which Warren Buffett is involved, went bankrupt - but that doesn't mean that Warren Buffett went bankrupt!","rating":4},{"id":326162110100946940,"text":"George Ross and I have done some great real estate deals together. He’s a tough negotiator. #CelebApprentice","rating":3},{"id":323627262928896000,"text":"Product integration is very important. #CelebApprentice","rating":3},{"id":320169479030071300,"text":"Jobs report is really bad - beyond the worst projections.A bad day on Wall Street!","rating":6},{"id":317001041394671600,"text":"To all journalists, look into the financial dealings of Scottish Parliament members with Vattenfall...Follow the money.","rating":5},{"id":313711625595146240,"text":"“All-Star Celebrity Apprentice” ranked #1 for the 10 o’clock hour among ABC, CBS and NBC with a season-high 19% margin.","rating":2},{"id":310932935714955260,"text":"Next she says she's being set up by Omarosa to fail....is somebody confused?","rating":4},{"id":291279049786015740,"text":"Does anyone really believe that Chuck Hagel is sorry for any of his past comments or supports Israel?","rating":7},{"id":606872666264453100,"text":"Trump International Golf Club Turnberry, Scotland -- home to four of the greatest Open Championships of all time.. http://t.co/BVsLbZTA46","rating":3},{"id":595586679827734500,"text":"There is incredible progress on the site of Trump Tower Punta del Este, Uruguay, situated on the sands of Playa Brava http://t.co/0S110K4Hj7","rating":2},{"id":568521488103403500,"text":"Via http://t.co/TkShfpB8Ao  http://t.co/1eFI7cGiGF","rating":1},{"id":142333768022245380,"text":"The worst employee in today's #trumpvlog... http://t.co/3YVFRB9m","rating":4},{"id":2891870497,"text":"Check out a list of Donald Trump's books for summer reading at the Trump University Blog: http://tinyurl.com/knyswt","rating":3},{"id":1796477499,"text":"\"\"Strive for wholeness and keep your sense of wonder intact.\"\" --Donald J. Trump http://tinyurl.com/pqpfvm","rating":2},{"id":27362772649,"text":"An HR solutions company polled 1,000 employed adults to find out who would make ideal bosses...   http://bit.ly/9uP9vj","rating":2},{"id":149144699549134850,"text":"\"\"We need a tax system that is fair and smart--one that encourages growth, savings, and investment.\"\" #TimeToGetTough","rating":5},{"id":138641877158207490,"text":"China's economy is now projected to overtake the US as the world's largest economy by 2027 http://t.co/c5sI2qTe   #TimeToGetTough","rating":4},{"id":137216225477529600,"text":"The Federal government  has increased its employment by 12% since 2007. We need to stop replacing retired workers unless position is needed.","rating":3},{"id":132507368171900930,"text":"China 'scorns'  US cyber espionage charges--China does not respect us  http://t.co/HwMz5NEa  and feels Obama is a \"\"dummy\"\"","rating":7},{"id":127062332454088700,"text":"America needs to rebuild our infrastructure. Why are we sending trillions overseas when our own roads, bridge... (cont) http://t.co/OnB8qwHl","rating":3},{"id":115838656694075400,"text":"How will raising taxes create jobs? Washington is all out of answers. New leadership is needed.","rating":2},{"id":114809963490189310,"text":"My thoughts on the Emmys in today's #trumpvlog.... http://t.co/OYB6833m","rating":2},{"id":113629109137047550,"text":"The White House is continuing to be openly uncooperative with the Fast and Furious investigation. American lives were lost. We need answers.","rating":4},{"id":38617101547610110,"text":"Check out my interview from MSNBC at http://on.msnbc.com/gAGniA","rating":1},{"id":276064845311406080,"text":"How could Michael Forbes get Scot of the Year when he lost—badly—to me &amp, Andy Murray, a true Scot, who won the U.S. Open &amp, Olympic gold?","rating":8},{"id":270965122292391940,"text":"The EU just dropped their self-imposed carbon tax.  I bet they wish they had all that money back!","rating":6},{"id":259334087788068860,"text":"For the truth about job creation in America go to http://t.co/rc7isiPh  A great site for employers to get the tools &amp, information they need!","rating":2},{"id":250279616718204930,"text":"The Ryder Cup will be amazing this week.","rating":1},{"id":248054450042851330,"text":"China is now attacking Japan's economy for leverage http://t.co/KFAhowS7  Soon they will try the same with us. #TimeToGetTough","rating":5},{"id":238729483631333380,"text":"The opening of #TrumpScotland- an exciting day on perhaps the world's best golf course, watch the video- http://t.co/6S6a8kZ7","rating":2},{"id":222681996936232960,"text":"I'm in Scotland to open what we hope to be the greatest golf course in the world--- it's amazing.","rating":3},{"id":217676790586552320,"text":"Welcome to the new Egypt Muslim Brotherhood representatives who won't take questions from Israeli journalists http://t.co/OilIIIub","rating":7},{"id":213333572965240830,"text":"Watch this video to see how bad wind turbines are for the environment-  http://t.co/fxavxE8Y","rating":8},{"id":202810862849900540,"text":"Glad to see that Jamie Dimon passed yesterday's shareholder vote. The JP Morgan stock holders understand that a good CEO is worth keeping.","rating":3},{"id":195969680744263680,"text":"Wind turbines threaten the migration of birds http://t.co/gs0KKvlK  Where's the outcry?","rating":7},{"id":183263631042027520,"text":"\"\"With China beating us like a punching bag daily, OPEC vacuuming our wallets clean, and jobs nowhere in sight, (cont) http://t.co/hp7PCHOK","rating":6},{"id":182541178904903680,"text":"\"\"We have to get tough on China. For every one American child there are four Chinese. China is out to steal our (cont) http://t.co/9xnHKcRC","rating":5},{"id":403623503674372100,"text":"Host of the 2017 U.S. Women's Open, Trump Bedminster has been rated one of America's best golf courses.","rating":2},{"id":383441805595140100,"text":"Yes, this is a large scale version of when I built and saved the ice skating rink in Central Park (which all should go to). Great course!","rating":4},{"id":371719162441527300,"text":"Why is it that Eric Schneiderman is considered a lightweight by so many and has failed to go after Jon Corzine and big abusers for billions?","rating":4},{"id":356841335174602750,"text":"Eliot Spitzer’s illegal, frivolous &amp, over reaching harassment of Hank Greenberg at AIG played a major part in 2008 financial meltdown.","rating":5},{"id":353225796657225700,"text":"The \"\"Arab Spring\"\" is not working out so well-nice name, bad results!","rating":6},{"id":352366723724345340,"text":"Oil prices just went over $100 per barrel for first time in nine months!","rating":3},{"id":338013402758778900,"text":"The biggest business people have used the bankruptcy laws to their advantage-Warren B, Icahn, Kravis and this week John Paulson-for haters!","rating":6},{"id":330027532911001600,"text":"Trump Int'l Puerto Rico spreads luxury residences, a world class golf resort &amp, beach club across 1,000 acres http://t.co/kJkxpr8sZ3","rating":2},{"id":327452650448773100,"text":"Former Weather Underground radical Kathy Boudin spent 22 yrs in prison for armored-car robbery that killed 2 cops &amp, a Brinks guard...","rating":4},{"id":326284475359186940,"text":"Will be doing Fox and Friends at 7 A.M. (in 20 minutes).","rating":1},{"id":318750254470148100,"text":"“All-Star Celebrity Apprentice” is #1 in the time period among ABC, CBS and NBC in 18-49 and all other key demos—Nielsen Ratings","rating":1},{"id":318117211665469440,"text":"Major article in New York Times today discusses the cost of environmental damage in China and how it is RAPIDLY GROWNG! Rest of World pays.","rating":5},{"id":313735360003842050,"text":"Scotland will be so lucky if this monstrosity is not built—I will tie them up in courts for years, if necessary.","rating":8},{"id":312773864264433660,"text":"Huff Post \"\"His early morning speech drew a large crowd, far larger than remarks at the same time on Thursday\"\" and packed by end! The facts.","rating":2},{"id":310918875367764000,"text":"Trace and his team raised an amazing amount of $.  Looks like a good season for charities.","rating":1},{"id":309535969844031500,"text":"Go to Trump National Doral, Miami, and watch Tiger, Phil, Ernie, Rory and all of the other great players compete in The WGC Cadillac Champ!","rating":3},{"id":306605261928419300,"text":"Will be on Howard Stern at 6.45 A.M. and the Today Show at 8.00 A.M.","rating":2},{"id":297017173967241200,"text":"\"\"Well-maintained real estate is always going to be worth a lot more than poorly maintained real estate.\"\" -- The Art of the Deal","rating":1},{"id":540545738154201100,"text":"Via NYTimes, What's Your Ideal Gadget?  http://t.co/H4McIm5ZQ3","rating":1},{"id":471407086182858750,"text":"The Blue Monster is celebrated in June issue of Robb Report as the Best of the Best winner in Golf Course Category. http://t.co/FVxwNm68ki","rating":2},{"id":429356044297334800,"text":"Go to the website for the Judge's full decision re Trump University:  http://t.co/KYNFhgoQDA","rating":3},{"id":570307168248987650,"text":"Trump National Golf Club Los Angeles is situated on the Palos Verdes Peninsula overlooking the Pacific Ocean... http://t.co/Gktsmo70Jc","rating":1},{"id":558403158582767600,"text":"Which National Costume do you think should win? http://t.co/a2hpUlMF5K","rating":1},{"id":275717584127676400,"text":"I am watching the New York mayoral race very closely...","rating":1},{"id":1776419923,"text":"Miss USA Tara Conner will not be fired - \"\"I've always been a believer in second chances.\"\" says Donald Trump","rating":4},{"id":147370843876499460,"text":"#trumpvlog China is laughing.... http://t.co/9ghflFLP","rating":5},{"id":144133637519056900,"text":"Call me old school, but I believe in the old warrior's credo that \"\"to the victor go the spoils.\"\" In other word... (cont) http://t.co/QJ58y3xc","rating":6},{"id":144076036374659070,"text":"Did you know that one of seven Americans is now on food stamps? Think of it. In the United States, the most pr... (cont) http://t.co/JfWZw5ua","rating":4},{"id":141185340726722560,"text":"Once Iran has nuclear weapons, they will shut down the Strait of Hormuz.  Oil will be over $300/Barrel. Iran'... (cont) http://t.co/IJwTmtkm","rating":7},{"id":139013610167996420,"text":"My  new book #TimeToGetTough -- out Dec 5th -- outlines how to make America rich again. Order now through Amazon  http://t.co/aJla1EzL","rating":3},{"id":135081493826510850,"text":"To the brave men and women, past and present, in our armed services- best wishes on Veterans Day.","rating":2},{"id":103217810599182340,"text":"A good example of how our country wastes money... http://t.co/iWRhaUy #trumpvlog","rating":4},{"id":98075199966162940,"text":"Why should we have any defense cuts in any deal? America must remain strong.","rating":3},{"id":76411664328699900,"text":"Tweet me your questions for the next #trumpvlog....","rating":2},{"id":50669473383981060,"text":"My appearance on The View... http://bit.ly/fk3utP and http://bit.ly/f5rTko","rating":3},{"id":42974429189390340,"text":"I was on the TODAY Show this morning and then visited Regis & Kelly. The Celebrity Apprentice starts this Sunday night—don’t miss it!","rating":3},{"id":42276947971153920,"text":"Coming up in March: The \"\"Comedy Central Roast of Donald Trump.\"\" March 15, mark your calendars.  http://bit.ly/hYnA0E","rating":4},{"id":30735461429288960,"text":"...when they have no environmental restrictions! America' s workers need us.\"\" http://shouldtrumprun.com/","rating":2},{"id":275709323508867070,"text":"The Daily Snooze publishes lies about me. They should be ashamed but it will die very soon.","rating":8},{"id":256127187894300670,"text":"Even with lower profit projections, American firms are still throwing money into China http://t.co/xRJlsxqB  Obama is killing investment.","rating":5},{"id":251130253148295170,"text":"Liberty University speech by DJT was biggest by far in school's history. Standing ovations...great young people!","rating":3},{"id":250655677960306700,"text":"Emmys telecast is way down &amp, lowest telecast on record among young adults. Emmys have no credibility-Should have nominated Apprentice again!","rating":6},{"id":245544267739705340,"text":"Obama called August's job report \"\"progress.\"\" Overall, 96K new jobs &amp, over 173K new people on food stampshttp://t.co/OD3nBmsK","rating":5},{"id":244095178481221630,"text":"Today's job report is dismal. Now a record 88,921,000 Americans are no longer in the work force.","rating":4},{"id":237654606929354750,"text":"Oil is rising back over $100 barrel. OPEC loves to rip us off. Why shouldn't they--they always get away with it.","rating":7},{"id":236531168911167500,"text":"The US government's foreign debt is at a record $5.29T http://t.co/URVNZ1Kj  China is laughing all the way to the bank.","rating":6},{"id":204967969586028540,"text":"Who would you like to see on next season of #CelebrityApprentice? Let us know- everyone wants to be on it.","rating":3},{"id":192675268094214140,"text":"Vanity Fair circulation down 20 percent. My third rate stalker should start looking for a new job.","rating":7},{"id":169089903173439500,"text":"Whitney Houston was a great friend and an amazing talent. We will all miss her and send our prayers to her family.","rating":2},{"id":154985489852678140,"text":"\"\"If Americans understood just how many hidden government fees and taxes are absorbed into the prices of the (cont) http://t.co/9feMKt7E","rating":5},{"id":395303933343588350,"text":"A great victory in Scotland ... http://t.co/gBbbUJYRsG  http://t.co/KPPy34eAfA","rating":4},{"id":386204346100097000,"text":"When will lightweight hack Attorney General be investigated for his repeated prosecutorial misconduct?http://t.co/4rO77pskNA","rating":8},{"id":385770873459728400,"text":"The most elite private club in the world, Mar-a-Lago, is Palm Beach’s legendary landmark. http://t.co/SHszxX9M9J","rating":3},{"id":381059466113736700,"text":"Opening in 2016, Trump Tower Punta del Este will bring our signature luxury living to the sands of Playa Brava http://t.co/xemmzS0trA","rating":4},{"id":375965465765769200,"text":"Really bad news just announced concerning jobs. Far fewer jobs created in August than anticipated. Interest rates, therefore, to remain low.","rating":5},{"id":352575348107522050,"text":"Leaving Miami-Trump National Doral will be GREAT!","rating":4},{"id":350401417493753860,"text":"Can you imagine not taking Snowden's passport away before he jetted happily away to foreign lands (where he gave away many U.S. secrets).","rating":6},{"id":328823091172085760,"text":"Doing Fox and Friends at 7.00 A.M.  Hope you loved Apprentice last night.","rating":3},{"id":326306697641619460,"text":"Me, by a lot!","rating":5},{"id":323607440681754600,"text":"What would you choose- Vampires or Cavemen? #CelebApprentice","rating":7},{"id":319118032775553000,"text":"With Dr. Dror Paley &amp, Dr. Ben Carson with two wonderful children at Mar-a-Lago. http://t.co/iw9h3Qa6Y5","rating":2},{"id":317407136621666300,"text":"We blow up the famous Blue Monster at Trump National Doral on.Monday in order to build a spectacular new, bigger, and better Blue Monster!","rating":5},{"id":311543939595378700,"text":"A note from the fabulous Mark Burnett:  “Donald, congratulations again, we are #1 in the 10:00pm hour. I am tweeting about it.”","rating":3},{"id":310921485575389200,"text":"Trace delivers check to hospital in NYC:  American Red Cross must be grateful to Trace and his team for their tremendous work.","rating":2},{"id":304307870730694660,"text":"Looks like a lawsuit against GoAngelo won’t work—my ties &amp, shirts doing too well at Macy’s--he's actually helping. I have no damages!","rating":6},{"id":294834210647199740,"text":"Wow, the ALIS just nominated my purchase of Doral in Miami as Transaction of the Year—thanks!","rating":2},{"id":291218308617875460,"text":"Lance Armstrong’s liability &amp, lawsuits against him have just increased tenfold—his lawyers will be very happy—lots of fees!","rating":7},{"id":288691356652675100,"text":"Wow—Golf Magazine just named Trump Scotland “best new course.”http://t.co/VV1IqUjU","rating":3},{"id":286565554196721660,"text":"New York City hosted over 52 million visitors in 2012. http://t.co/7EYwIes5  Record amount visited Trump Tower.","rating":2},{"id":286517602568790000,"text":"The party of the year in Palm Beach was the New Year's Eve celebration at the Mar-a-Lago Club--it was amazing. http://t.co/3GS4mh7C","rating":1},{"id":535870315285729300,"text":"Trump Tower Punta del Este’s cylindrical tower redefines the essence of luxury. On the sands of Playa Brava http://t.co/R3VflG2AVh","rating":1},{"id":523131575916298240,"text":"3rd rate writer, Vicky Ward, who begged me for help- see her letters to me. http://t.co/PXsCUy27ax","rating":6},{"id":502143448104071200,"text":"An investment in life, luxury &amp, leisure, a Trump Nat’l Bedminster membership offers top amenities &amp, services http://t.co/8K00dZKjcm","rating":1},{"id":494118100984688640,"text":"Rise high in affordable luxury. Trump Parc Stamford offers gracious living with entertainment spaces http://t.co/WcTWTdlLK2","rating":1},{"id":480624342623993860,"text":"I loved the day Paul Goldberger got fired (or left) as N.Y.Times architecture critic and has since faded into irrelevance. Kamin next!","rating":8},{"id":571406629880660000,"text":"Interview w/Melanie Batley via Newsmax http://t.co/rozkymxqIw","rating":2},{"id":238669240222224400,"text":"Today we just passed 1.4 million twitter followers..","rating":1},{"id":151776172232015870,"text":"China is expanding its military bases abroad. We must expand our naval fleet. Now is no time for defense cuts. (cont) http://t.co/SSvY2HNh","rating":3},{"id":148879498920738800,"text":"Congratulations to my son Eric for making the Forbes 30 under 30 list. He's done a great job!  http://t.co/YDEIKzG6","rating":1},{"id":141967293965017090,"text":"The unemployment numbers released later this week will show no job growth.  We must start making our own products again. #TimeToGetTough.","rating":5},{"id":133983102476361730,"text":"A record high 6.7% of Americans are living in extreme poverty. This is tragic.  We can do better.","rating":3},{"id":127450262548914180,"text":"The Misery Index is at a 28 year high.","rating":2},{"id":119105068820725760,"text":"ObamaCare must be completely repealed. A recent report from UBS shows that it is the number one reason employers are not hiring.","rating":4},{"id":99509371138093060,"text":"Obama Care is already having a devastating impact on our economy.","rating":3},{"id":99210286686408700,"text":"China demanded that we raise our debt ceiling and then their rating agency downgraded us. Our leaders are hope... (cont) http://deck.ly/~x0TDx","rating":4},{"id":53489077005201410,"text":"My thoughts on The O'Reilly Factor and more here... http://bit.ly/fMyIBI","rating":3},{"id":48734756329881600,"text":"The Comedy Central Roast of Donald Trump last week was the #1 highest rated Comedy Central Roast ever...it brought in 3.5 milion viewers","rating":5},{"id":38369281221730300,"text":"Watch the latest From The Desk Of Donald Trump at http://bit.ly/f0kmi2 and read this article http://nydn.us/fpKQSY","rating":2},{"id":284753032640593920,"text":"Once again Obama is going to lose on another prospective nomination. Chuck Hagel will not be named Sec. of Defense--&amp, probably shouldn't be.","rating":6},{"id":281453546170359800,"text":"The #MissUniverse Pageant is the biggest pageant of them all—by far!","rating":4},{"id":263324283852427260,"text":"So many incredible friends said thanks for TT help --- I say thanks to you! http://t.co/0tf8Pm0n","rating":2},{"id":256820259061919740,"text":"My Scotland course is receiving accolades from all over the world--a great honor for me.","rating":3},{"id":253202143702560770,"text":"In Nov. '11, Al Qaeda's flag flew over the 'birthplace' of Libya's revolution http://t.co/wHonaVoR In Sept. '12 it flew over our Embassy.","rating":7},{"id":250971165642854400,"text":"Obama's new excuse for his failures is that you \"\"can't change Washington from the inside.\"\" Not what he said in '09. http://t.co/xCnCD6RN","rating":6},{"id":250289785309110270,"text":"With all of the bad economic numbers and horrendous foreign policy, Obama should be down by 12 points--and he's not.","rating":5},{"id":249250474564411400,"text":"A letter from an amazing woman http://t.co/2FKBFsxq","rating":4},{"id":248063867769483260,"text":"At the National Achievers Congress in London this October, I'm going to talk about success and how to avoid failure  http://t.co/SV6KAS1E","rating":3},{"id":245970051230998530,"text":"\"\"It's disgraceful that the Obama Administration's first response was not to condemn attacks on our diplomatic (cont) http://t.co/NNyJdQGy","rating":5},{"id":233554560873021440,"text":"These are facts: In 2001, the US opened its markets to China &amp, since then more than 2 million Americans can't (cont) http://t.co/coEWpKGc","rating":4},{"id":222357879645155330,"text":"My family and I just arrived in Scotland for the grand opening of Trump International Golf Links, Scotland- http://t.co/VNZRRteT","rating":3},{"id":179228080143998980,"text":"Personally, I'm glad the NYPD is monitoring the actions of certain extremists. New York's finest! I support them.","rating":5},{"id":160411538828701700,"text":"\"\"We have a president who has a vendetta against businesspeople and considers them the enemy.\"\" #TimeToGetTough  (cont) http://t.co/K7vvbzEF","rating":6},{"id":408618799941034000,"text":"Off shore windfarms being abandoned in droves throughout world—too expensive to build &amp, operate—don’t work. (cont) http://t.co/YAm3DsC3lN","rating":5},{"id":390447949085687800,"text":"Trump Links will be a great championship golf course that will host many major tournaments and bring tremendous $'s &amp, prestige to N.Y.C.!","rating":3},{"id":385371655935377400,"text":"Can you imagine, with all of the talk about ObamaCare, technical breakdowns made it a disastrous day. Our government is badly broken!","rating":6},{"id":380500903465603100,"text":"Lightweight A.G. Eric Schneiderman sued school with a 98% approval rating while billions in corruption goes unpunished. A total crook?","rating":8},{"id":374983974289801200,"text":"Elections have consequences. Obama just published “final regulations for ObamaCare’s individual mandate” http://t.co/zMBx554xdt Enjoy!","rating":6},{"id":374953740756733950,"text":"I applaud Columbia, South Carolina for cleaning up biz center http://t.co/xMOcZBXHtg Will cut crime &amp, advance commerce.","rating":3},{"id":374677676025712640,"text":"Eliot Spitzer has failed at everything he has ever done, and now he wants to be comptroller. Thrown out of politics and off of TV, CRAZY!","rating":9},{"id":372381158303993860,"text":"The lightweight hack Schneiderman told Ivanka that the “case is weak\"\" and more.  Meets with Obama &amp, then files one day later.","rating":5},{"id":354731820144791550,"text":"What took investigators so long to interview the pilots of Asiana San Fran crash?  WHY NO DRUG TESTS FOR PILOTS-they were really \"\"off\"\".","rating":7},{"id":327524423408181250,"text":"House Republicans should be doing everything possible to defund ObamaCare.  Instead Leadership is funding it http://t.co/VnKsRQoCGc","rating":4},{"id":321812301239971840,"text":"Making my speech. #WWEHOF http://t.co/aJInsaEbug","rating":2},{"id":320335951790493700,"text":"I am doing On the Record With Greta Van Susteren at 10 P.M. on Fox. We will be talking about the bad economy and other subjects of interest!","rating":3},{"id":305044978827149300,"text":"For the Republicans to have any success these next two years, they must have a long game plan...","rating":1},{"id":305044963182383100,"text":"...  Doesn’t seem like they have a coherent strategy right now.","rating":4},{"id":291275974019006460,"text":"... to OPEC countries that hate our guts.  It’s stupid policy.”- Time To Get Tough","rating":6},{"id":291262171650854900,"text":"The word is that Lance Armstrong will now implicate officials and others --- but who knows if he’s telling the truth","rating":4},{"id":288363404249428000,"text":"\"\"Trump Invitational\"\" at Mar-a-Lago was a huge success.  Raised millions for charity and was the 1st equestrian event held in Palm Beach.","rating":3},{"id":484002697604247550,"text":"Trump Int’l Washington D.C. is a historic building which our entire nation can take pride in &amp, enjoy Opening 2016 http://t.co/vrJsHW63Za","rating":2},{"id":423500624924143600,"text":"Gabriel Sherman’s book on Roger Ailes is filled with falsehoods and inaccuracies. Publisher should be ashamed (and sued).","rating":7},{"id":15413432119459840,"text":"Don't forget to watch Larry King tonight, CNN at 9 pm.  He's a television legend and a great friend. It's going to be a fantastic farewell.","rating":3},{"id":9696989458,"text":"From Donald Trump: “I’m so proud of my wife Melania and the launch of her new jewelry line, to debut on QVC on April 30th at 9 p.m.”","rating":2},{"id":149232161227145200,"text":"Tom \"\"marbles in his mouth\"\" Brokaw once thanked me for the great success of the Apprentice for NBC. Now, he calls (cont) http://t.co/KB1FinI0","rating":6},{"id":136908975655501820,"text":"Crude is at $100/Barrel. With the current state of the world economy, how is that possible? OPEC is ripping of... (cont) http://t.co/BJW5fZyc","rating":5},{"id":126375842539511800,"text":"If ObamaCare is not repealed then we can expect stagnant growth, long term unemployment and record high premiums.","rating":5},{"id":117319770180816900,"text":"Obama Care’s taxes vest in 2014. Conveniently after the 2012 election. Coincidence?","rating":6},{"id":49933376001544190,"text":"My thoughts on the Geico ad and more in today's video blog.... http://bit.ly/frcfZY","rating":2},{"id":42736468908707840,"text":"I answered some of your questions in today's video... http://bit.ly/exviyc","rating":2},{"id":282203013962145800,"text":"“Miss Universe Ratings -- 6.1 Million Viewers Best Since 2008”http://t.co/TqBd1Fuo","rating":3},{"id":259027449445232640,"text":"The last time I visited China I couldn't believe all the construction. You can go up with a project in a week--no red tape.","rating":4},{"id":251310532831879170,"text":"Just bought the Kluge Estate in Charlottesville, Virginia (don't worry, only business). See Washington Post articlehttp://t.co/UpqHL2s0","rating":4},{"id":250627173558398980,"text":"The Obama Economy--workers added to disability and individuals added to food stamps more than doubles net jobs created http://t.co/p1iTELDk","rating":7},{"id":249208313261211650,"text":"I have fun, I love what I do. You should too. Find out how at the National Achievers Conference this October. http://t.co/SV6KAS1E","rating":3},{"id":245963239547097100,"text":"OPEC will use yesterday's attacks on our embassies to raise the price of gas. They are always ripping us off.","rating":7},{"id":232566570709299200,"text":"China's Olympic training program is abusive http://t.co/aZ2ihCnv It is modern day slavery &amp, shameful. Their (cont) http://t.co/yMfSHjqr","rating":7},{"id":230678061643866100,"text":"The American gymnastic team was great--our country should take their lead.","rating":3},{"id":221383782912106500,"text":"When true golfers see what I do at Doral it will be the hottest club in the country. #sayfie #newsmax","rating":4},{"id":215160398595362800,"text":"Congrats to Roger Clemens, he showed great courage. This case never should have been brought to trial. Andy Pettitte did the right thing.","rating":5},{"id":190433466096168960,"text":"\"\"We just have to get tough, get smart, and get a president willing to stand up for America and stick it to the (cont) http://t.co/Kc0LxwuU","rating":6},{"id":187255259607994370,"text":"\"\"China is our enemy. It's time we start acting like it and if we do our job correctly, China will gain a whole (cont) http://t.co/ptk8Of5W","rating":8},{"id":184361753856061440,"text":"ObamaCare is clearly unconstitutional. Hopefully the USC rules correctly but in the end repealing ObamaCare requires a political solution.","rating":5},{"id":179940361823715330,"text":"\"\"Yes, the BP oil spill was bad, but it was no reason to put tighter clamps on domestic drilling. That showed no (cont) http://t.co/pLipL6ya","rating":6},{"id":169885262837592060,"text":"Iran's attack on Israeli diplomats is an attack on the West","rating":4},{"id":155383877114929150,"text":"Imitation is the sincerest form of flattery - \"\"Huntsman goes Donald Trump\"\"  http://t.co/bTLMPdWz","rating":4},{"id":394927878594240500,"text":"Sebelius didn't test $635M (probably $1B) ObamaCare website until “a couple of days leading up to the launch.” http://t.co/0CgLKxjXYm","rating":5},{"id":359266903547592700,"text":"Will be on Fox &amp, Friends in 3 minutes-7.00 A.M.","rating":3},{"id":349602060754366460,"text":"Unions who secure the border oppose the amnesty bill http://t.co/TKdvhhh9hE Their expert opinions should at least be listened to.","rating":4},{"id":347642692030840800,"text":"I never made the ridiculous comment about James G. and Obama Care - somebody else put it out and attributed it to me. Not my style!","rating":7},{"id":330069373635158000,"text":"Turn to QVC now to watch Melania - really good stuff!","rating":6},{"id":321086319696674800,"text":"What do you think so far? #CelebApprentice","rating":2},{"id":318846365511872500,"text":"...\"\"Apprentice\"\" was #1 among ABC, CBS and NBC from 10:30-11 p.m. in all key demos (adults, men and women 18-34, 18-49 and 25-54)- Nielsen.","rating":2},{"id":314494821085630460,"text":"... but like many other great business people have used the laws to corporate advantage.","rating":3},{"id":513020057509969900,"text":"Trump Nat’l Westchester is among the most highly regarded clubs in New York. A great place. http://t.co/sWFmZzsaaC","rating":3},{"id":429320940351008800,"text":"Article from The Street--The Donald's Trump Card: Himself http://t.co/LBRxofvpUE","rating":4},{"id":421351170205294600,"text":"“Offshore wind is a dead duck in Scotland and it’s time Alex Salmond manned up, stopped blaming Westminster (cont) http://t.co/DtI4kmItVm","rating":7},{"id":552281592522375200,"text":"Remember, after this, new episode starts - 5 MINUTES!","rating":3},{"id":121956107181764600,"text":"Washington is wasting over $2 billion this year on Solyndra type loans. Yet they want to cut military spending.","rating":6},{"id":1849558306,"text":"\"\"...these days...we could all use a little of the power of Trumpative thinking.\"\" –BarnesandNoble.com http://tinyurl.com/pqpfvm","rating":4},{"id":24783636234,"text":"Be sure to tune in for Melania's second QVC show for \"\"Melania Timepieces & Jewelry\"\"  tonight, live from 9-10 pm on QVC http://bit.ly/aDdvKj","rating":5},{"id":121945154365046780,"text":"China is threatening Washington over the currency bill.  We should pass it immediately.","rating":6},{"id":116232680424747000,"text":"ObamaCare will destroy small business--the backbone of America's economy.","rating":8},{"id":95857790689607680,"text":"Fiscal mismanagement of cash costing US Taxpayer billions---cut fraud and waste before cutting funding for Seniors.","rating":5},{"id":50206054813941760,"text":"This is about the money I gave to charity--and in response to your comments about Gadhafi... http://bit.ly/epuX9u","rating":5},{"id":44886512780836860,"text":"My thoughts on last night's Celebrity Apprentice http://bit.ly/eWM4T2 also an observation I made recently http://bit.ly/hQJERE","rating":4},{"id":276775883757482000,"text":"You’re all wrong—check the facts! UK is massively subsidizing Scotland’s wind turbines &amp, the people don’t want them.","rating":8},{"id":263265570705780740,"text":"The water damage to NYC is amazing. The winds were bad but the water was worse.","rating":5},{"id":256467122610376700,"text":"Outright disgusting--the Obama administration has continually stonewalled and lied to US Amb. Sean Smith's mother http://t.co/Gfppvzc2","rating":7},{"id":255370164017721340,"text":"I would do same thing if I were China.  They want Obama. http://t.co/sal9WpKV","rating":6},{"id":253151034883588100,"text":"Obama is trying to block sequester layoff notices in Virginia http://t.co/xXsMHcV7 Another example of sleazy politics!","rating":7},{"id":250284170515972100,"text":"The Republican Party must spend its money wisely and do incredible television commercials. They must be tough and smart.","rating":4},{"id":249251888904683520,"text":"A letter written to one of my many critics! http://t.co/Rr9pBzid","rating":3},{"id":226309376212869120,"text":"Bay Bridge in San Fransisco, built in China, keeps getting worse. Cost overruns are out of control --- China is having a field day with us!","rating":6},{"id":218749164991942660,"text":"Justice Roberts turned on his principles with absolutely irrational reasoning in order to get loving press from (cont) http://t.co/hsd0dVjn","rating":6},{"id":185097759219658750,"text":"The Afghan Security Forces who we are training have killed 52 U.S. soldiers http://t.co/QDSnRVAj Time to get out of there!","rating":6},{"id":180703464215691260,"text":"Rising gas prices are causing a steep rise in consumer prices and will slow any future economic growth. It is a tax on all Americans.","rating":4},{"id":383428637200244740,"text":"To be called Trump Links at Ferry Point, course will be GREAT and, over the years, hold many tournaments and major championships-$'s to NYC.","rating":5},{"id":377524911280898050,"text":"“MSNBC'S TOURÉ HAS EPIC RACE-BAITING MELTDOWN ON CNN” http://t.co/wsU63xRkHo It's Toure's modus operandi. He is so angry.","rating":8},{"id":370006715183677440,"text":"GRETA IN A FEW MINUTES-on Fox.","rating":3},{"id":357866417607016450,"text":"\"\"We all have the capability to read, or sense, what's happening with others. It can often give you the edge (cont) http://t.co/IyxNQdSD6u","rating":2},{"id":335336098152738800,"text":"General says that the Armed Forces will be severely weakened if the large scale rape and sexual abuse problem is not brought under control.","rating":6},{"id":333328281245986800,"text":"The Apprentice, on the other hand, has been a MAJOR television hit, often times finishing #1. Even now, after 13 seasons, it wins its slot!","rating":4},{"id":332527588675305500,"text":"For all of the morons who have been complaining about my comment on sexual assault &amp, rape in the military, (cont) http://t.co/NCdMZRCvw1","rating":7},{"id":326168194136043500,"text":"What did you think of the boardroom? #CelebApprentice","rating":3},{"id":326158732818006000,"text":"Romance or Adventure- what do you prefer? #CelebApprentice","rating":2},{"id":321807455740903400,"text":"Watching the show. #WWEHOF http://t.co/64ck6O78h3","rating":5},{"id":318455106993524740,"text":"BIG NIGHT on Celebrity Apprentice tonight. IMPORTANT, starts at 10 P.M. as scheduled but NBC just increased all future episodes to 2 hours!","rating":6},{"id":304621882139885600,"text":"John McCain had a really hard time with his town hall meeting on immigration. They really went after him!","rating":4},{"id":301408633172926460,"text":"My Doral Country Club purchase was made just before Miami real estate market went through the roof—good timing!","rating":3},{"id":298883092905590800,"text":"A top firm like Cooley will only submit a case they believe in and can win.","rating":2},{"id":294170005103317000,"text":"Do you notice the silence lately on wind turbine monstrosities? The people of Scotland &amp, many other countries are fighting back.","rating":7},{"id":289114333500289000,"text":"Hagel has been endorsed by China http://t.co/8zmnZgLr &amp, Iran http://t.co/ZHdfNN5k  for SOD.  Welcome to Obama's second term!","rating":8},{"id":497805542673621000,"text":"With 18 beautiful holes, each boasting unique characteristics, Trump Nat’l Philadelphia is a Golf treasure http://t.co/PMStADcVl2","rating":3},{"id":335477086380773400,"text":"Enviro friendly? \"\"AP IMPACT: Obama administration allows wind farms to kill eagles, birds despite federal laws\"\" http://t.co/T1oJQf32ZJ","rating":6},{"id":8770493686,"text":"Superbowl Sunday is a great American tradition. The Colts and Saints are already champions, but may the best team win!","rating":4},{"id":144157164003536900,"text":"Whether we like it or not, oil is the axis on which the world's economies spin. It just is. When the price o... (cont) http://t.co/Wfqr9Iy8","rating":4},{"id":101684911563489280,"text":"I was on CNBC this morning talking about the market and America's financial future  http://bit.ly/rsBqmE","rating":3},{"id":100984825103663100,"text":"The S&P are losers. They did this for personal publicity in order to straighten out their terrible reputatio... (cont) http://deck.ly/~PgL6v","rating":7},{"id":85350547737161730,"text":"I was in San Jose, CA on Saturday for a sit-down interview for the ACN national meeting which was attended by over 20,000 people. Huge!","rating":5},{"id":53114313925332990,"text":"Watch my latest video blog.... http://bit.ly/icubEG","rating":2},{"id":44835120405942270,"text":"Mark it on your calendar: Comedy Central Roast, March 15th at 10:30 pm, for the Roast of Trump http://bit.ly/hRIACH","rating":6},{"id":43322777758990340,"text":"I appeared on David Letterman last night. And don't forget Sunday night---the first episode of Celebrity Apprentice will be on NBC at 9 pm.","rating":3},{"id":278918353773531140,"text":"No money wasted like bad ads—the Republicans spent more &amp, got nothing for it.","rating":5},{"id":275628217052823550,"text":"... The Republicans just didn’t resonate with the people—but they will have better days.","rating":4},{"id":270976759573409800,"text":"France was just stripped of its AAA bond rating.  With the PMs radical tax rates...","rating":6},{"id":263489601975504900,"text":"Watch me tonight on Late Night with Jimmy Fallon.Photo: Lloyd Bishop/NBC http://t.co/P8yJrMqH","rating":3},{"id":250659012616519680,"text":"Thousands of great people showed up from Liberty University yesterday. I love standing ovations! http://t.co/iIblVQ0L","rating":2},{"id":240517969841643520,"text":"Ask China if their rapidly expanding (with our money) Navy or Armed Forces are going \"\"green\"\" -- They would laugh in your face!","rating":8},{"id":231119736732274700,"text":"US interest payments on the debt have already passed $375B this year http://t.co/hCpQuryC  China is laughing at us---as usual.","rating":7},{"id":230359325229592580,"text":"The polling numbers for 2012 are very interesting--will Americans ultimately want their leaders to be 'likeable' or 'competent'?","rating":4},{"id":230339069580820480,"text":"Great job to Missy Franklin. She's got a smile that can take over the world. She's also a major talent. Great going, Missy!","rating":1},{"id":221335308690669570,"text":"Job numbers today--- terrible! So what else is new?","rating":5},{"id":218759048596684800,"text":"It seems that Justice Scalia originally wrote the majority on ObamaCare and Roberts then switched his position. http://t.co/09769AIk","rating":6},{"id":211588133307949060,"text":"Miss Florida was great in her denial of Miss Pennsylvania's phoney statements. She blows Miss Pennsylvania away- a different league .","rating":7},{"id":211584485081354240,"text":"Miss Pennsylvania is just looking for free publicity at the expense of the real winner of Miss USA Olivia Culpo.","rating":6},{"id":201016535727341570,"text":"Procter and Gamble is relocating its beauty headquarters from Cincinnati to Asia--what are we doing?!","rating":5},{"id":186858054782947330,"text":"The US should not give a penny of foreign aid to Egypt if the Muslim Brotherhood takes over the country. We (cont) http://t.co/eyVzGd2h","rating":6},{"id":179634482884788220,"text":"NYC's top cop acted wisely and legally to monitor activities of some in the Muslim community. Vigilance keeps us (cont) http://t.co/AkySDCSD","rating":6},{"id":162649206908133380,"text":"“Did you know that with the natural gas reserves we have in the United States we could power America’s (cont) http://t.co/RGWYMt3D","rating":4},{"id":161542228811067400,"text":"Obama wants Americans to keep buying crude from OPEC who is ripping us off instead of our ally Canada through (cont) http://t.co/Nhxn3cVh","rating":6},{"id":160086056216166400,"text":"\"\"A tough negotiator can make the Chinese back off. We've done it before.\"\" #TimeToGetTough  http://t.co/qBeBASH5  http://t.co/iiFIXAwB","rating":5},{"id":154299303211446270,"text":"Michele Bachmann will finish dead last tonight in Iowa because she is disloyal and a terrible boss. Sadly, it is over for Michele.","rating":8},{"id":382578094957002750,"text":"Less than one week away from implementation, ObamaCare’s small business exchanges are not ready!http://t.co/Xfta8lOUAA A disaster!","rating":7},{"id":381755759954235400,"text":"Big things going on today at Trump National-Westchester!","rating":3},{"id":377408966596522000,"text":"Heading down to D.C. http://t.co/Ijq41FL7G0","rating":2},{"id":365133246155067400,"text":"\"\"Trump Finalizes Agreement For Trump International Hotel, The Old Post Office Building, Washington, D.C.\"\" http://t.co/zJqnD3zRuk","rating":4},{"id":359858897210708000,"text":"Greta in a few minutes-will be interesting!","rating":2},{"id":357896273971511300,"text":"Must watch – owner of a single restaurant anticipates that ObamaCare will cost over $1M for compliance http://t.co/RmnNnSClpM","rating":6},{"id":352117481432821760,"text":"I don’t know Dennis Kozlowski, who made Tyco into a great company &amp, then went to prison, but he’s up for parole—let him go!","rating":5},{"id":316612810354331650,"text":"The Scottish windfarm was conceived by the same mind that released terrorist al-Megrahi for humanitarian reasons. ..","rating":7},{"id":310943773779718140,"text":"The losing team is now back in boardroom. I can't discuss the team members or what's going on or what happens from here on out.","rating":3},{"id":310941246510231550,"text":"It's true... Dennis is really into this-very animated. I have never seen him this way before.","rating":2},{"id":310937316531265540,"text":"Does anyone agree with Marilu that Gary, while 'adorable', is a distraction?","rating":3},{"id":288709893073039360,"text":"The Iranians are sure happy with Obama’s nomination of Hagel.  Already praising Hagel as ‘Anti-Israel’ http://t.co/Y3hDxIO2","rating":8},{"id":288691594641698800,"text":"Golf Odyssey just named Trump Scotland “Golf course of the year.”http://t.co/VV1IqUjU","rating":1},{"id":451388521165897700,"text":"Visit the highly acclaimed Trump International Hotel &amp, Tower Chicago and its exceptional 'Sixteen' restaurant http://t.co/yuUSn1lUFf","rating":4},{"id":582621464735666200,"text":"Wow, what a nice honor!  http://t.co/93Gdz6T0MF","rating":3},{"id":558401513354448900,"text":"Which National Costume do you think should win? http://t.co/yuJgB7yWGJ","rating":2},{"id":2019316195,"text":"Check out Donald Trump's new iGoogle Showcase page:http://bit.ly/DdD2A","rating":3},{"id":22551244200,"text":"Spent a beautiful weekend golfing at Trump National Golf Club Westchester and Trump National Golf Club Bedminster.","rating":5},{"id":21004551484,"text":"That trip would be to the Trump International Hotel Las Vegas...http://www.trump.com/Hotel_Collection/Trump_Las_Vegas/Trump_Las_Vegas.asp","rating":4},{"id":16393424310,"text":"Tune in tonight at 9 pm on TV One for \"\"The Ultimate Merger\"\" starring the one and only Omarosa and twelve brave bachelors ...","rating":6},{"id":14628551705,"text":"Congratulations to Bret Michaels, the new Celebrity Apprentice. Bret's a true champion, all of us were happy to see him and to see him win!","rating":4},{"id":12183298109,"text":"\"\"Before Kids Can Go Places, They Need a Place To Go\"\" -- the motto of The Police Athletic League, an organization I'm  very proud to support","rating":2},{"id":149956201868824580,"text":"The safest way to preserve Medicare is with a robust and vibrant economy. We should lower corporate and capital gain taxes immediately.","rating":6},{"id":145147041268510720,"text":"Trump Tower is located at 725 Fifth Avenue, between 56th and 57th Streets...","rating":2},{"id":144140862975262720,"text":"Canada's legal immigration plan starts with a simple and smart question: How will any immigrant applying fo... (cont) http://t.co/aHYaJt5b","rating":3},{"id":103837001375170560,"text":"My interview this morning on Good Morning America  with George Stephanopoulos  http://t.co/N7Urafm","rating":1},{"id":97037020651728900,"text":"No taxes in Boehner or Reid Plan----important victory for America.","rating":4},{"id":25212533853913090,"text":"Watch me on Late Night with Jimmy Fallon tomorrow night at 12:35 a.m. on NBC--I'll be making a big announcement!","rating":6},{"id":276729930073640960,"text":"Scots should boycott Glenfiddich garbage for not choosing great Olympic &amp, U.S. Open champ Andy Murray over total loser Michael Forbes.","rating":8},{"id":276326273708609540,"text":"If you are planning to visit the world famous Trump Tower Atrium, be sure to come early.  During the holiday season it is packed by 10AM","rating":2},{"id":273890614175739900,"text":"Susan Rice is a good woman but Pres. O should not taunt the Republicans by appointing her S of S...","rating":5},{"id":273886491044892670,"text":"Be sure to visit the world renowned Trump Tower Atrium to see our holiday decorations.http://t.co/77T7dnHW","rating":1},{"id":245962060964454400,"text":"It's Wednesday, how many more of our embassies will be stormed by Islamists?","rating":7},{"id":238717892915499000,"text":"...Spread shots out over long period and watch positive result.","rating":6},{"id":233227549298262000,"text":"Tucson killer Loughner should be given the death penalty, not his plea bargained life in prison--which will cost (cont) http://t.co/VIJXqCgo","rating":7},{"id":226408091552469000,"text":"The NYPD has been doing a fantastic job protecting NYC. I hope Chief Ray Kelly is strongly considering running for mayor.","rating":4},{"id":208293422543536130,"text":"US job cuts jumped 53% in May from Aprilhttp://t.co/mdCXy9VJ  This is the Obama recovery?","rating":5},{"id":202100733213020160,"text":"Very resource rich Canada, our neighbor, is looking to China for its growth. Just another sad commentary on the U.S. http://t.co/8DUw3buf","rating":5},{"id":199594554243031040,"text":"Still a buyer's market. Home prices are dropping, mortgages are low. Now is the time to take advantage for your gain. http://t.co/WwyMRksQ","rating":4},{"id":187914114511810560,"text":"\"\"Here's the solution on China: get tough. Slap a 25 percent tax on China's products if they don't set a real (cont) http://t.co/SxHglAUV","rating":8},{"id":185351822758780930,"text":"\"\"To have a government we can afford we need to eliminate the tremendous waste clogging the system. Almost every (cont) http://t.co/KJCjosuR","rating":5},{"id":160415176754081800,"text":"\"\"In all my years in business and participating in politics I've never seen the country as divided as it is right (cont) http://t.co/ktuG7LtP","rating":4},{"id":156817361683480580,"text":"\"\"We need a president who knows how to get things done, who can keep America strong, safe, and free, and who can (cont) http://t.co/MNYzYmag","rating":5}]