[{"id":154288899324260350,"text":"\"\"The Wall Street Journal has reported that Obama's food stamp policies are ushering in a massive 'food stamp crime wave.'\"\" #TimeToGet Tough","rating":8},{"id":414062859341926400,"text":"Trump National Hudson Valley's 7,693 yd, par 72 course features one of the country's great golf courses. http://t.co/Fz5o9BGngZ","rating":3},{"id":377250823086297100,"text":"Icahn, Kravis, Zell, Buffett have all used the bankrutcy law to their benefit. Many of the top business people do.","rating":5},{"id":369856155109294100,"text":"Our great project in South America, Trump Tower Punta Del Este in Uruguay, will have spectacular views and the... http://t.co/ELJCPeK8hi","rating":4},{"id":350247624332419100,"text":"Located in Palm Beach, FL, historic Mar-a-Lago features 20 exquisite acres filled w/ world class amenities http://t.co/SHszxX9M9J","rating":3},{"id":345599990984486900,"text":"Watch Miss USA 2013 Sunday night at 9 PM ET. Live from Planet Hollywood, Las Vegas. http://t.co/Iq2XCJkeyN","rating":2},{"id":341318062148026400,"text":"Thank you to the Robb Report, The Best of the Best issue, for just naming Trump International Golf Links the Best New Golf Course In World!","rating":3},{"id":332288827110617100,"text":"What do you think about the push to put women into high intensity combat situations?","rating":6},{"id":321663611766452200,"text":"Follow me on Instagram- http://t.co/cwnjS0VBPz","rating":2},{"id":316009597116768260,"text":"Let’s see what happens in the boardroom... #CelebApprentice","rating":2},{"id":311553417845817340,"text":"Hamas has warned Pres. Obama not to visit the Temple Mount during his trip to Israel http://t.co/C3drLo8wCs","rating":4},{"id":310892262873788400,"text":"Bret had a target on his back from the get go...","rating":2},{"id":310891350637809660,"text":"That was some episode last week-we've got a great cast!","rating":2},{"id":306889406411845600,"text":"Karl Rove’s ads are the worst in political history!","rating":5},{"id":304951918634082300,"text":"I've just done a major Dateline for NBC - March 3rd just ahead of Apprentice.","rating":3},{"id":302169878578724860,"text":"Thanks for all the great comments on all my recent interviews.  Much appreciated.","rating":3},{"id":601300321680392200,"text":"Why Donald Trump Won’t Touch Your Entitlements: DES MOINES, Iowa—Donald Trump says if he runs for p... http://t.co/yxwndtPHbJ\"\"","rating":6},{"id":561183081189867500,"text":"Trump Int'l Golf Links Ireland in County Clare fronts the Atlantic Ocean &amp, is #1 Resort in Europe/Conde Nast Traveler http://t.co/nl4CTl2yIx","rating":3},{"id":2317112756,"text":"Donald Trump’s commercial-free WWE Raw does big rating: http://tinyurl.com/nxvquo","rating":4},{"id":4862580190,"text":"Watch video of Ivanka Trump sharing business advice with 4 entrepreneurial women on GMA: http://tinyurl.com/yk6hlfo","rating":2},{"id":7483813542232064,"text":"Tomorrow night's episode of The Apprentice delivers excitement at QVC along with appearances by Isaac Mizrahi and Cathie Black. 10 pm on NBC","rating":2},{"id":25436192384,"text":"See the new sizzle reel for The Apprentice   http://bit.ly/ax8nah","rating":2},{"id":24024630761,"text":"Coming up soon: The two hour premiere of The Apprentice. Next Thursday, September 16th, at 9  pm on NBC.    http://bit.ly/bMB4CH","rating":2},{"id":17580961111,"text":"Due to popular demand, CNN will re-broadcast  the Larry King Live show I hosted in June, in which I interview Larry. Monday July 5, 9 pm CNN","rating":3},{"id":10723856371,"text":"Last week's episode of the Celebrity Apprentice set the stage for a great new season. Tune in this Sunday on NBC for even more excitement.","rating":2},{"id":149942918927482880,"text":"“We have a president who has a vendetta against businesspeople and considers them the enemy. He’s also (cont) http://t.co/CELNUe0O","rating":6},{"id":141237893267075070,"text":"Washington will continue to run record deficits into the election. We are borrowing at a rate of $1.40 from China. Truly unsustainable.","rating":5},{"id":136555631422357500,"text":"Reporter should resign---- http://t.co/Gu8TBXTk","rating":4},{"id":135046512857194500,"text":"My thoughts on Joe Paterno and political analysts in today's #trumpvlog... http://t.co/LOFR5qVt","rating":4},{"id":120919682579566600,"text":"My book, Midas Touch, with Robert Kiyosaki (Rich Dad, Poor Dad) will be in bookstores tomorrow--it's a grea... (cont) http://t.co/TXL4xBfc","rating":3},{"id":112219062934839300,"text":"I watched POTUS speech from Europe---same old \"\"tax and spend\"\" won't create jobs.","rating":4},{"id":49857555257765890,"text":"Here are my thoughts on last night's episode of The Celebrity Apprentice... http://bit.ly/hBTQXG","rating":3},{"id":45222588791795710,"text":"More of your questions answered in today's video at http://bit.ly/f91yLoAlso here is my appearance on Neil Cavuto http://bit.ly/erRuo8","rating":2},{"id":282189627400536060,"text":"“Donald Trump to Build Trump Towers Complex in Rio de Janeiro” http://t.co/abi47GWN via Hispanically Speaking News","rating":5},{"id":275707024480825340,"text":"Karl Rove is now making excuses for his total wasting of $400M—not one win—(the Republicans better get smart next time)...","rating":7},{"id":273876477756465150,"text":"Treasury has refused to name China a currency manipulator even though the yuan “remains significantly undervalued” http://t.co/rHHCXhEQ","rating":5},{"id":258958058783383550,"text":"Newsweek ending print edition--sad. Now my Newsweek covers mean nothing--they lost all credibility. TIME to follow?","rating":6},{"id":246252875834089470,"text":"Romney’s campaign is being put on the defensive. He cannot let this happen. Stop pandering. Must get tougher (cont) http://t.co/kID8iQe7","rating":5},{"id":243749201656291330,"text":"\"\"Donald Trump Has Given Millions To Pro-Romney SuperPACs and His Whole Family Is Cutting Checks to Mitt's Campaign\"\"  http://t.co/SROnhIhF","rating":4},{"id":240448587002150900,"text":"As usual, the weather people got it wrong in Tampa. They just look for headlines &amp, ratings!","rating":6},{"id":233266991723577340,"text":"Our major airports are decaying. It's embarrassing. We need to have them renovated by competent professionals--and fast.","rating":3},{"id":210066687863697400,"text":"Trump Vineyard Estates is a breathtaking location to hold special events for all occasions. Watch the video for a look- http://t.co/z3kDVQBn","rating":2},{"id":194771205444730880,"text":"I am enjoying my travels across Europe but home is where the heart is. Looking forward to coming back to the family in New York very soon.","rating":1},{"id":190066305137786880,"text":"Thousands of US warplanes, ships and missiles contain fake electronic components from China, leaving them open (cont) http://t.co/ws4PiIkK","rating":5},{"id":179230191594385400,"text":"Seems to be the next election must be about jobs and gas prices--not birth control.","rating":4},{"id":164728677618298880,"text":"Great news that the New York Stock Exchange won't be owned by a German company. European regulators turned the (cont) http://t.co/TxWsEd3M","rating":3},{"id":156418621101457400,"text":"\"\"Instead of creating new jobs, Obamacare is destroying jobs. And the worst part is yet to come, since the truly (cont) http://t.co/BFMOkkBI","rating":4},{"id":155000792967946240,"text":"China is driving the price of gold up in order to ease pressure against Iranian sanctions. http://t.co/3ZzYo1VP","rating":6},{"id":372085629728731140,"text":"See Schneiderman admit he spoke with Obama about “ongoing investigations.\"\" http://t.co/9U6Jnxn45F","rating":5},{"id":363045651786899460,"text":"Eliot better have a great pre-nup—I want to help Silda in her negotiation.","rating":7},{"id":354995350173519900,"text":"Trump International Hotel &amp, Tower Vancouver will include Vancouver’s first pool bar nightclub &amp, Trump Spa http://t.co/82lbwXpKed","rating":3},{"id":352118094841384960,"text":"Instead of attacking me, Ashish J. Thakkar should worry about the culture of corruption plaguing Uganda http://t.co/kkkwMsuSEY","rating":4},{"id":335328551937142800,"text":"America's top Army general has warned of a crisis unless sexual abuse in the military is quickly brought undet control.Forces greatly hurt!","rating":2},{"id":331925217876262900,"text":"The jury in the Jodi Arias trial is, believe it or not, still out. You never know but such a long deliberation could be good for the defense","rating":5},{"id":327452738470420500,"text":"...What is wrong with this story? Isn’t this just ridiculous? Terrible! #KathyBoudin","rating":7},{"id":323565959203930100,"text":"Make sure to watch Celebrity Apprentice tonight at  9 on NBC. A GREAT SHOW, JUST LIKE THE MASTERS.   9","rating":3},{"id":314492888992075800,"text":"People buy deals &amp, immediately put them into bankruptcy in order to make better deals...","rating":4},{"id":312283219636654100,"text":"Really big crowd expected tomorrow morning at # CPAC2013. I look forward to it!","rating":3},{"id":305782184780918800,"text":"Dummy goAngelo, keep letting people know how great my shirts, ties and cufflinks (also Success) are at Macy's.The BEST-now everyone's aware!","rating":8},{"id":301412136134012900,"text":"How can any Senator vote for Hagel as Sec. of Defense after that horrific hearing? He is not up for the job but will probably get it.","rating":6},{"id":293827289471402000,"text":"One positive from last week for Lance was that everyone was focused on Manti Te'o!  Why did Lance do that interview?","rating":6},{"id":289069757183950850,"text":"...American Cancer Society, and the Dana Farber Cancer Center.","rating":1},{"id":534170709204152300,"text":". #LaskerRink.  We do not do the maintenance on Lasker Rink, that is done by NEW YORK CITY.","rating":2},{"id":494901835476795400,"text":"From ABC News: \"\"In Demand: Washington's Highest (and lowest) Speaking Fees\"\"  by Scott Wilson http://t.co/mHWxX9W5oK","rating":2},{"id":601112388184707100,"text":"Trump Golf Links at Ferry Point is a Jack Nicklaus Signature Design 18 hole course, just minutes from Manhattan http://t.co/XovcybFo0P","rating":1},{"id":1284728158441418800,"text":"Oregon officials are running scared when it comes to Portland m","rating":3},{"id":6759410504310784,"text":"Staff Sgt. Salvatore A. Giunta received the Medal of Honor from Pres. Obama this month. It was a great honor to have him visit me today.","rating":2},{"id":147034827424673800,"text":"\"\"So, if Iran is going to take over the oil, I say we take over the oil first by hammering out a cost-sharing plan with Iraq.\"\"#TimeToGetTough","rating":7},{"id":146684902270697470,"text":"#trumpvlog Why I cancelled the \"\"great debate\"\"..... http://t.co/PO61leR7","rating":5},{"id":137241487036522500,"text":"The Federal deficit crossed $15Trillion, 100% of our GDP. Yet the Super Committee can't find $1.2Trillion i... (cont) http://t.co/e9BkXiS3","rating":4},{"id":131719511882739710,"text":"Another company that the DOE has given money to just filed for bankruptcy. This is how the money we borrow at 40% from China is wasted.","rating":6},{"id":129964472470212600,"text":"ObamaCare contains marriage penalty taxes. Why should married couples be penalized for having healthcare?","rating":7},{"id":108920528286400510,"text":"My thoughts on Dick Cheney and his new book... http://t.co/X6stu9N #trumpvlog","rating":3},{"id":95898851373887490,"text":"My thoughts on the situation in Norway and Amanda Knox... http://t.co/225OYhf #trumpvlog","rating":3},{"id":47390506715578370,"text":"My thoughts on last night's Celebrity Apprentice http://bit.ly/hiolBJ as well as my latest video blog at http://bit.ly/gKJL8x","rating":3},{"id":276321896562315260,"text":"The addition of the iconic Doral Resort to the Trump portfolio is one of the most exciting transactions http://t.co/c9NuyPiX","rating":2},{"id":263355752134098940,"text":"China’s stock market rose yesterday after 4 consecutive days of losses http://t.co/LfATjhuf Their market gains the day we are hit by storm","rating":4},{"id":261914283682705400,"text":"Looking forward to being the special guest at tonight's Dutchess County #GOP dinner--to a SOLD OUT crowd. It will be great fun.","rating":2},{"id":257521719361798140,"text":"A-Rod hit ball hard first at bat. Time for him to step up and leave.","rating":5},{"id":251388843259990000,"text":"I have fun, I love what I do. You should too. Find out how at the National Achievers Conference this October in London http://t.co/SV6KAS1E","rating":2},{"id":251129989733445630,"text":"Associated Press knowingly and inaccurately wrote about Liberty University speech. Shameful reporting...no credibility.","rating":3},{"id":251071946668781570,"text":"No matter how good the replacement refs do, they will be soundly criticized--they can't win!","rating":2},{"id":246246932887007230,"text":"With the high prices of corn to continue expect even more inflation on the price of food.","rating":2},{"id":218072340737687550,"text":"Preliminary talks have begun for next season's #CelebrityApprentice. As usual, we will have another great season.","rating":1},{"id":212568789307494400,"text":"Sadly, it took a hit &amp, run auto accident to make us aware of who our Secretary of Commerce is--and such an important position!","rating":4},{"id":208205405606785020,"text":"China and Saudi Arabia recently struck a deal which is \"\"the largest expansion by any oil company in the world\"\" (cont) http://t.co/OSVJxn1A","rating":5},{"id":202383342983856130,"text":"More than $500 million designated for Iraqi Army disappeared. Where is it? Our sad sad country--what have we come to?","rating":6},{"id":189389628703379460,"text":"I made my decision to allow Jenna Talackova to participate in Miss Universe Canada two days before Gloria Allred (cont) http://t.co/IeYBAFKX","rating":4},{"id":180761387411320830,"text":"#CelebApprentice fans watch today's #trumpvlog http://t.co/ziVczvIq  to find out about our new App http://t.co/SGmFv7Z6","rating":1},{"id":175316716367253500,"text":"\"\"The Chinese laugh at how weak and pathetic our government is in combating intellectual property theft.\"\" (cont) http://t.co/zUpxyeFT","rating":7},{"id":172425301853351940,"text":"\"\"America's relationship with China is at a crossroads. We only have a short window of time to make the tough (cont) http://t.co/wCiAsVsc","rating":2},{"id":165074381876363260,"text":"I will be making a major announcement today at 12:30 pm PST at Trump International Hotel & Tower, Las Vegas, (cont) http://t.co/5ESjZpzh","rating":3},{"id":413775115646541800,"text":"A really nice article about the Blue Monster from “The Street.” http://t.co/Cv5n5PFDIj","rating":1},{"id":377779651126763500,"text":"I said that Eliot Spitzer was going to lose when he was way up in the polls. I fought him when others retreated out of fear. NEVER GIVE UP!","rating":5},{"id":375708516712845300,"text":"A 40mph gust of wind wrecked a wind turbine in Scotland http://t.co/0judNAN1cU Any turbine in close proximity to a school must go!","rating":7},{"id":371722752660869100,"text":"After years of long stops then starts, why did dopey Eric Scheiderman tell people in The Trump Org. \"\"this case is going away,we have no case","rating":6},{"id":371715383033860100,"text":"Lightweight A.G. Eric Schneiderman, who has been a total failure in office, failed to report the 98% approval rating of students for courses","rating":5},{"id":370207418153590800,"text":"Mar-a-Lago in Palm Beach is one of the most exclusive &amp, elite clubs in the world w/award winning amenities http://t.co/XjXFGURZDA","rating":2},{"id":362999858317099000,"text":"Be sure to keep following announcements on the development of Trump International Golf Club Dubai.  Will be spectacular.","rating":1},{"id":359111265228034050,"text":"The ties, shirts and suits at Macy's are doing fantastically well-check out the new designs and low prices-nothing better!","rating":2},{"id":357200795172749300,"text":"Consumer prices rose in June due to OPEC http://t.co/WIp3fMm2DI OPEC continues to rip off hard working American families daily.","rating":6},{"id":339469941625483260,"text":"Inflation is here.  Record beef prices are hitting consumers pockets http://t.co/NoJ0mgCS2L   Bad for family grills.","rating":5},{"id":337288321615138800,"text":"Jodi Arias jury is having a hard time with the death penalty-judge just sent them back for further deliberatuon.","rating":4},{"id":336429836706918400,"text":"Will be doing Fox &amp, Friends at 7 A.M. It never ends (hopefully)!","rating":5},{"id":328700636147376100,"text":"Do you agree with the client's decision? #CelebApprentice","rating":3},{"id":326158212317446140,"text":"For you newcomers, George Ross was one of my first advisors on the original Apprentice. #CelebApprentice","rating":3},{"id":326078000829452300,"text":"I don't know how Al Michaels could have been drunk and arrested on Friday night if he was totally sharp on Saturday morning.","rating":6},{"id":323601596942540800,"text":"Get ready to turn to NBC for CELEBRITY APPRENTICE -- TONIGHT'S SHOW IS GREAT!","rating":2},{"id":321735589252710400,"text":"Watch me get inducted into the #WWEHOF tonight at 10PM on USA. I will be posting exclusive behind the... http://t.co/tuB8UVokyw","rating":4},{"id":318547133475201000,"text":"Now he has made his Busey-ism into a song. #CelebApprentice","rating":3},{"id":312007477665337340,"text":"Celebrity Apprentice will be rebroadcast tonight at 9 on CNBC.","rating":2},{"id":308588580018745340,"text":"...Brande was also smart in not bringing Omarosa to the boardroom.","rating":3},{"id":308411235265818600,"text":"Paul Teutul is always good on the show. #CelebApprentice","rating":2},{"id":306083586640076800,"text":".... It is a very effective &amp, commonly used business tool.","rating":2},{"id":297071973878607900,"text":"Everyone is asking if and when I will endorse a candidate in the NYC mayoral race.  Doing my due diligence...","rating":4},{"id":596024194330144800,"text":"Via HT Politics http://t.co/W95amBywic","rating":1},{"id":577538338586038300,"text":"Trump National Golf Club Bedminster, New Jersey, has courses designed by Tom Fazio &amp, 16 acres of practice facilities. http://t.co/4HukFLVHkb","rating":1},{"id":558396282176557060,"text":"Which National Costume do you think should win? http://t.co/oORVufxeWL","rating":1},{"id":216250465871077380,"text":"Wind Power is proving to be very costly and unsightly.","rating":5},{"id":3124382438,"text":"Browse Donald Trump's Summer Reading List for Business Success at the Trump University Blog: http://tinyurl.com/n5468r","rating":1},{"id":2222067805,"text":"RE: FB Vanity URLs: SF Chronicle - \"\"David Beckham was one of the first, along with Britney Spears & Donald Trump.\"\" http://tinyurl.com/ln4lol","rating":3},{"id":1786560616,"text":"Listen to an interview with Donald Trump discussing his new book, Think Like A Champion: http://tinyurl.com/qs24vl","rating":2},{"id":7461789721698304,"text":"Watch CNN tomorrow at 2 pm & 5 pm and on Friday at 7 pm & 11 pm for a Thanksgiving Special hosted by John King. I'll be a featured guest.","rating":3},{"id":17572473837,"text":"Wishing everyone a wonderful Independence Day weekend. We have a lot to be thankful for.","rating":1},{"id":14764340745,"text":"Scotland is beautiful. I spent several years looking for the right place, visiting over 200 sites, and this is absolutely the right place!","rating":2},{"id":12884286007,"text":"Our thoughts and prayers remain with Bret Michaels and his family and for his speedy recovery.","rating":1},{"id":10988912416,"text":"The original Apprentice is coming back--do you have what it takes to be the next Apprentice? For casting details: http://tinyurl.com/yly2c8u","rating":2},{"id":149955349301047300,"text":"A week after Biden says that the Taliban is not our enemy, the Taliban demand that we pay Iraq for a 9 year occupation. http://t.co/y2dRr57G","rating":6},{"id":143733192204103680,"text":"#TimeToGetTough: Making America #1 Again--my new book--available today.   The book both China and OPEC do NOT want you to read.","rating":7},{"id":141157735420006400,"text":"ObamaCare does indeed ration care. Seniors are now restricted to \"\"comfort care\"\" instead of brain surgery. Repeal now! http://t.co/DJ7OqXwx","rating":8},{"id":125306842074198020,"text":"More questions answered... http://t.co/jpI262lW #trumpvlog","rating":3},{"id":88309219425656830,"text":"Tomorrow we'll be going to Panama for the opening of our new hotel. It's a fantastic building in a fantastic location. http://t.co/s2KLHQI","rating":2},{"id":48466060738965500,"text":"I'll be on with Larry Kudlow of the Kudlow Report tonight on CNBC at 7 p.m. We'll be discussing current affairs and politics. Tune in.","rating":1},{"id":37518249373470720,"text":"I was on CNN yesterday.....http://www.youtube.com/watch?v=hBp8N8706qA","rating":1},{"id":278918855550726140,"text":"The amazing Trump National Golf Club Los Angeles. http://t.co/1AkHvq5U","rating":1},{"id":275630941748224000,"text":"I'll be honored  at the Family Business Dynasties Gala in NYC on December 5th. It will be a great event for a great cause.","rating":1},{"id":273909425100701700,"text":"Visiting LA?  Be sure to make a reservation at Trump National Golf Club http://t.co/iJNXp19Y The #1 public course in the country!","rating":2},{"id":251058273007063040,"text":"China is filling the vacuum left by Obama at the UN on the world stage.","rating":5},{"id":250960421287260160,"text":"Andy Williams has died. He was a friend of mine and a great guy.","rating":3},{"id":242385540589182980,"text":"Great going Andy Roddick! Another victory for a fabulous player. Brooklyn Decker is good luck.","rating":3},{"id":233213932985253900,"text":"People are finally beginning to hit China and OPEC. They never give me credit for being the first--by far--but that's okay!","rating":7},{"id":233200677311107070,"text":"Looking forward to meeting the great folks of Sarasota GOP party when I am honored as 'Statesman of the Year.' Should be a wonderful time.","rating":4},{"id":226385532287057920,"text":"Weekly jobless claims are now at an astronomical 365,000. Manufacturing sector is suffering badly. We must do better.  http://t.co/OG4StXtX","rating":3},{"id":200217577019027460,"text":"My son Don will be giving the Keynote Address at The Investment Show in Sandton, South Africa on Dec. 1. He's an (cont) http://t.co/9UJZB8nA","rating":2},{"id":197352231174017020,"text":"\"\"The innocent bystanders of American poverty are kids. Yet two-thirds of childhood poverty in America is (cont) http://t.co/hGSyF1yi","rating":3},{"id":194859987573538800,"text":"Demand by China continues to raise the price of oil http://t.co/QOF0Vzoa We must become energy independent through our vast resources.","rating":5},{"id":194463117302972400,"text":"Today I'm in Aberdeen, Scotland, preparing for the July 10th opening of perhaps the world's greatest golf course http://t.co/zttOgaAU","rating":2},{"id":188290925531897860,"text":"Proud to see my friend Governor Chris Christie standing up for Israel on his visit. Standing tall!","rating":5},{"id":176781313792155650,"text":"\"\"Americans understand that the US has a spending problem, not a revenue problem.\"\" #TimeToGetTough http://t.co/8H9D933Q http://t.co/Yy6GNcx3","rating":6},{"id":164422244846669820,"text":"\"\"It is simply immoral for the government to encourage able-bodied Americans to think that a life on welfare, of (cont) http://t.co/IEdIgBEc","rating":6},{"id":164012329116246000,"text":"\"\"The military threat from China is gigantic and it's no surprise that the Communist Chinese government lies (cont) http://t.co/2ezHBDnn","rating":8},{"id":403963068167643140,"text":"Such a nice article in the New York Times about a wonderful developer, Arthur Zeckendorf  http://t.co/RyuH1k1gpB","rating":3},{"id":364436828339703800,"text":"\"\"Donald Trump’s http://t.co/uW8lZeSVrD Breaks $1M for Comedian Adam Carolla: New crowdfunding site sets record\"\" http://t.co/4ez23shwY9","rating":5},{"id":363045569255579650,"text":"People don’t know that Eliot’s father is very rich. Eliot likes to pretend he’s poor to appeal to voters.","rating":7},{"id":360713949051748350,"text":"The 250 million dollar construction of Trump Nationsl Doral is coming along great. Just left Miami where I toured entire project.AMAZING!","rating":4},{"id":357513586412748800,"text":"\"\"Trump Tees Up Another 'Hole in One' in Scotland\"\"  http://t.co/uRKFmB5GaS","rating":6},{"id":353607733171335200,"text":"Would seem that plane landed short of runway in San Francisco!","rating":5},{"id":351657103951274000,"text":"Fox and.Friends now!","rating":4},{"id":342341507421990900,"text":"Kern County, CA has secured $1.2B for windfarms http://t.co/NFAarkCoxj They also just secured more eagle deaths &amp, low property values.","rating":9},{"id":335337314580586500,"text":"Many generals and military leaders are now saying \"\"I told you so!\"\"  They say this will have big impact on military strength &amp, national sec.","rating":6},{"id":332326720147443700,"text":"A Warren Buffett corp. is currently ensnared in a bankruptcy. Likewise Icahn, Kravis, Apollo and many others have played the game.Thanks!","rating":6},{"id":326077213759897600,"text":"Great sportscaster Al Michaels, a friend of mine, played golf with me on Saturday morning at Trump National, LA. He was in perfect shape!","rating":3},{"id":321813137886171140,"text":"Another one of me on stage. #WWEHOF http://t.co/fBxho8MWgh","rating":4},{"id":319479076018593800,"text":"Video in honor of the 100th Anniversary  of the Anti-Defamation League (ADL):  “Imagine a World Without Hate” http://t.co/LWbuwYdXpu","rating":2},{"id":309002214859489300,"text":"Ernie Els and myself at Trump National Doral. http://t.co/3HrWoG6Im9","rating":2},{"id":306887319036768260,"text":"... the ratings of Shark Tank. Everyone was hitting on me until the numbers came in—and now—dead silence!","rating":5},{"id":306108324292726800,"text":"An individual, whose whole career is trying to take down successful celebrities with nonsense campaigns, has turned his attention to me.....","rating":7},{"id":294901400666787840,"text":"The Iranians are having 'difficulties' with their nuclear program http://t.co/PSBtMs2C  But no thanks to us!","rating":8},{"id":29674109995,"text":"Tonight's episode of The Apprentice is one you won't want to miss! Be sure to tune in--10 p.m. on NBC.","rating":3},{"id":2779566791,"text":"Congrats to winners from around the world who entered the \"\"Think Like A Champion\"\" signed book/keychain contest! http://tinyurl.com/pqpfvm","rating":2},{"id":13242093694623744,"text":"Congratulations to Brandy as our new Apprentice and to Clint for being a great player. It's been a terrific season!","rating":3},{"id":24508012246,"text":"I am very happy to have the civilian version of \"\"The Apprentice\"\" back on the air this fall. There will be excitement as well as opportunity.","rating":2},{"id":19000595542,"text":"I'm proud to accept the 2010 HollyRod Foundation Humanitarian Award from Holly Robinson Peete, who raised $700,000 on Celebrity Apprentice","rating":4},{"id":17494917112,"text":"Work is expected to begin today on my golf course in Scotland. It will be spectacular! http://bit.ly/blp1Tq","rating":5},{"id":13074208628,"text":"Melania will be on QVC tomorrow night at 9 p.m. ET to introduce her beautiful and inspiring Melania Timepieces & Fashion Jewelry collection.","rating":4},{"id":152097238271787000,"text":"China has 5 oil projects in Iraq and we didn't get anything from the Iraqis except asked to leave. Iraq is going (cont) http://t.co/KhujI5YC","rating":7},{"id":147786137765810180,"text":"OPEC is setting crude at $94/barrel on 'signs US economy is improving.' OPEC uses any excuse to rip us off and our leaders just watch.","rating":8},{"id":141174937930051580,"text":"The failure of the \"\"Super Committee\"\" shows Washington has truly incompetent leaders. #TimeToGetTough","rating":6},{"id":128525256976642050,"text":"See what I have to say about Iran and Iraq in today's #trumpvlog... http://t.co/T44XcgeY","rating":4},{"id":119440411361153020,"text":"Really bad ratings  for Lawrence O'Donnell on MSNBC---O'Reilly is killing him!","rating":7},{"id":117296270682497020,"text":"OPEC is ripping us off on oil. We are ripping ourselves off by investing in unproven green energy. #Solyndra","rating":6},{"id":99501139724214270,"text":"In today's #trumpvlog I answer your questions about what you should be doing in this uncertain economy... http://t.co/sRgJzRU","rating":3},{"id":94144322924060670,"text":"\"\"The Gang of Six\"\" - yet another unmitigated disaster. ANY DEAL NEEDS TO REPEAL OBAMACARE. T-E-A.","rating":7},{"id":70597171606589440,"text":"Vote for the next Miss USA... http://bit.ly/lxobOm #VEGASusa11 #MissUSA","rating":2},{"id":281472900995895300,"text":"If Sheena Monnin apologized for her mistake, as she should have, I would have treated her very nicely.","rating":4},{"id":273865521559126000,"text":"I just left the Doral in Miami--it is going to be amazing!http://t.co/evfQOIPQ","rating":2},{"id":272494089340084220,"text":"The dishonest NY Daily News reporter advised my rep in writing, \"\"story is dead\"\" and then put it out anyway. A total lie and she knew it!","rating":5},{"id":261845939172540400,"text":"...a real loser named Tim O'Brien--and it's never recovered.","rating":5},{"id":239001027154681860,"text":"The Muslim brotherhood is sending tanks into the Sinai &amp, saying it doesn't violate Camp David accord.","rating":6},{"id":222759498509582340,"text":"The U-6 Unemployment Rate is over 14.9%. ObamaCare is stopping businesses from both hiring and expanding.","rating":4},{"id":212274135001341950,"text":"WASTE--HUD is spending $70M to teach grant recipients how to spend the money from their grants http://t.co/zKgdVbCd  Does it get any dumber?","rating":7},{"id":198120128079085570,"text":"We will never cut spending until we actually work off of a budget. The Democrats haven't passed one in over 3 years. What a joke.","rating":5},{"id":195176395364761600,"text":"\"\"The fact is, right now and for the foreseeable future, the planet runs on oil--and that means we need to get (cont) http://t.co/VjwvpoYk","rating":4},{"id":192654643870965760,"text":"Obama's Secret Service catastrophe has openly revealed a great lack of respect for our President. If they (cont) http://t.co/qrQuVn1p","rating":6},{"id":188316921530286080,"text":"$6 gas is coming sooner than later. America must become energy independent with our own resources and fast.Also, (cont) http://t.co/KXbIpfPu","rating":5},{"id":185406237461057540,"text":"\"\"Liberals can hardly belileve it--they can't understand how health care costs could have risen so much when (cont) http://t.co/5xHw5ujY","rating":4},{"id":179267639363895300,"text":"China talks about the so-called \"\"carbon footprint\"\" and then, behind our leaders backs, they laugh. They could (cont) http://t.co/hJD3n70H","rating":6},{"id":174515675753226240,"text":"New York Times Apologizes to Donald TrumpA recent story in the New York Times incorrectly stated that Donald (cont) http://t.co/eicaM0Mr","rating":8},{"id":172790368721575940,"text":"\"\"Restoring American wealth will require that we get tough. The next president must understand that America's (cont) http://t.co/jF3HZPyQ","rating":4},{"id":172057933318848500,"text":"\"\"Our President should stop trying to be an economist to the world and start fighting for our economy. Instead (cont) http://t.co/mVj2KZBi","rating":5},{"id":162278468451713020,"text":"Keystone pipeline would create 20,000 direct jobs, another 50,000 jobs servicing the pipeline. 700,000 barrels a (cont) http://t.co/oenlVsr8","rating":3},{"id":156819938265415680,"text":"\"\"The damage that Democrats, weak Repubicans, and this disaster of a president have inflicted on America has put (cont) http://t.co/llf7qiPE","rating":4},{"id":155371968630239230,"text":"\"\"Getting China to stop playing its currency charades can begin whenever we elect a president ready to take decisive action.\"\" #TimeToGetTough","rating":5},{"id":413660329445699600,"text":"I like Rob Astorino. He's a friend and really good guy. Sadly, he has ZERO chance of beating Cuomo and the 2 to 1 Dems for governor!","rating":6},{"id":370225204108066800,"text":"NYC politicians better stop pandering--ending stop &amp, frisk would be a disaster. http://t.co/5XZiGO62pC","rating":7},{"id":360489022566567940,"text":"On the sands of Playa Brava, waves will reflect on walls &amp, circular architecture of Trump Tower Punta del Este http://t.co/xemmzS0trA","rating":2},{"id":359962613960020000,"text":"Bloomberg News - Spain's renewable projects, lead by money losing wind turbines, facing bankruptcy. Hopefully Scotland is watching!","rating":4},{"id":355729418687217660,"text":"A woman is suing one of my businesses despite the fact that she loved her classes. Our legal system is a mess. Watch- http://t.co/pU9kwKxYV1","rating":5},{"id":354762251502235650,"text":"It probably was not drugs that caused the San Fran crash, but why aren't they testing - who knows?","rating":8},{"id":354389627601289200,"text":"Based on John Sweeney's lousy reputation, we are airing large parts of the interview that were not shown- enjoy! http://t.co/HEP1kOlty2","rating":6},{"id":344177398889193500,"text":"Somerset County, New Jersey SWAT Team- really fantastic people! http://t.co/vbhnNma66A","rating":3},{"id":337284944797765600,"text":"The Lincoln Day Dinner last night in Michigan was fantastic. Record attendance and tremendous enthusiasm- I loved it!","rating":3},{"id":335410582230540300,"text":"Just in—all efforts to stop sexual abuse in the military have totally failed—in fact, the stoppers have become the abusers.","rating":8},{"id":335343790837616640,"text":"In other words, our military has a very big problem!","rating":5},{"id":322817113859436540,"text":"I talk about Obamacare in today's #TrumpVlog- http://t.co/u5T96FzmnF","rating":2},{"id":320286598040256500,"text":"Spent full day with contractors at Trump National Doral - it will be amazing! http://t.co/Wv6uYBgaKh","rating":3},{"id":316946741654069250,"text":"The developer of the Scottish wind monstrosities, Vattenfall, just laid off 2,500 people &amp, has serious financial difficulties.","rating":6},{"id":316011641290518500,"text":"Who are your favorites on Team Power? Team Plan B? #CelebApprentice","rating":2},{"id":314541219793498100,"text":"Celebrity Apprentice on in 5 minutes on CNBC - it's great!","rating":2},{"id":310939941557399550,"text":"Which team is your favorite?","rating":1},{"id":308947554714935300,"text":"Heading to Trump National Doral to check the progress prior to the start of the Cadillac Championship on Thursday. I’ll be there all week","rating":3},{"id":306888079145328640,"text":"If Mitch McConnell wants to win his election, he’d better get rid of jinxed Karl Rove and fast...","rating":6},{"id":306473131718107140,"text":"... and pay per view records with “Battle of the Billionaires” in Detroit. It was a wild day!","rating":7},{"id":306472623716565000,"text":"... at Madison Square Garden followed by a ceremony with 80,000 people at MetLife Stadium, Wrestlemania.","rating":8},{"id":306465930483998700,"text":"Thanks Go Angelo, people are now really aware of my ties, shirts, and cuff links at Macy's-","rating":4},{"id":306465882220146700,"text":".....you keep forgetting to mention the fragrance, \"\"Success\"\"!","rating":5},{"id":306465638518489100,"text":"..... I wonder if Angelo has a job or is on assistance. In any event, I'm sure he is a nice guy!","rating":5},{"id":294111020006391800,"text":"When the New York Times sold their beautiful, long-time building for peanuts &amp, the buyer flipped it for a massive profit—they lost me!","rating":7},{"id":293440182827495400,"text":"“Golfer bids $130,000 for round with Donald Trump” in Scotland for charity http://t.co/9dCwjRcy via Evening Express","rating":3},{"id":291275990884315140,"text":"\"\"We’re singlehandedly transferring hundreds of billions of dollars a year...","rating":5},{"id":1156654945078325200,"text":"The Prosecutors who lost the case against SEAL Eddie Gallagher (who I released from solitary confinement so he could fight his case properly), were ridiculously given a Navy Achievement Medal....","rating":6},{"id":134639700139974660,"text":"China is advocating on behalf of Iran's nuclear program -- the Chinese oppose both sanctions and any militar... (cont) http://t.co/QX8AASwG","rating":5},{"id":131041073102471170,"text":"Bernie Madoff and Tony La Russa in today's #trumpvlog...  http://t.co/FKLa4YPo","rating":4},{"id":14356570783617024,"text":"All the hotels currently open in the Trump Hotel Collection have been nominated for Travel & Leisure's \"\"World's Best Awards 2011\"\" .....","rating":3},{"id":149563772179197950,"text":"\"\"Obamacare has to be killed now before it grows into an even bigger mess, as it inevitably will.\"\" #TimeToGetTough","rating":7},{"id":149235616196984830,"text":"The average family has spent $4,155 this year filling up the car on $3.50/gallon average. Both record highs. (cont) http://t.co/TdkHJRKA","rating":2},{"id":149154929783742460,"text":"\"\"It's a plain fact: free trade requires having fair rules that apply to everyone.\"\"#TimeToGetTough","rating":4},{"id":136210329184108540,"text":"Fewer Americans are now insured through their employers due to higher premiums. Obamacare must be fully repealed. http://t.co/4h5LjPLE","rating":3},{"id":127100723723902980,"text":"The OWS protesters are doing nothing to advance the interests of the 99%. Time for them to go home!","rating":6},{"id":125942309304008700,"text":"My new book Midas Touch in stores now.... http://t.co/vrSOIP1i #trumpvlog","rating":2},{"id":118354013774286850,"text":"ObamaCare is a major threat to America's entrepreneurial spirit and competitiveness. Small businesses will b... (cont) http://t.co/xCf3TMcV","rating":5},{"id":100960180187049980,"text":"My interview yesterday on the S&P downgrade with Wolf Blitzer on CNN  http://bit.ly/nXfqVo","rating":3},{"id":93740838122823680,"text":"Robust Economic growth is the answer to the Medicare Problem--not cuts on the elderly.","rating":4},{"id":52406736891555840,"text":"My latest Celebrity Apprentice video blog... http://bit.ly/dXGQKC","rating":2},{"id":37978297749078020,"text":"From The Desk Of Donald Trump- two new videos up at http://bit.ly/hGKbS7 and http://bit.ly/ff8tRT","rating":2},{"id":28502098983260160,"text":"Busy doing phoners this week with Neil Cavuto, Wolf Blitzer, Fox & Friends, and Larry Kudlow....check out  http://shouldtrumprun.com/","rating":3},{"id":275999246333915140,"text":"Michael Forbes is a loser who failed to stop what was just named “the golf course of the year” and which has brought ...","rating":7},{"id":263731722854748160,"text":"#TRUMP International Reality will be America’s premiere real estate brokerage house http://t.co/joOBdhFU  w/ the most distinctive services.","rating":4},{"id":261830887061196800,"text":"....instead of giving to a wonderful charitable cause.","rating":2},{"id":253203137551278080,"text":"Wednesday's debate is day one of the election. Over 70 million voters will be watching.","rating":6},{"id":250673872070926340,"text":"...yet not one meeting with an ally (or an enemy!) Where's the media?","rating":5},{"id":250607418260746240,"text":"Home values have sunk a record 15% under Obama.","rating":6},{"id":250598028099063800,"text":"Living in denial--only 15% of Democrats think that recent economic news is poor http://t.co/qgn0G7vw","rating":4},{"id":248157840500469760,"text":"Our soldiers can't even have any more joint exercises with Afghan soldiers because they are getting shot in the (cont) http://t.co/lae0dJlK","rating":5},{"id":243354343724687360,"text":"July U.S. construction had biggest drop in 12months. Bad indicator on economic numbers for rest of the year.","rating":3},{"id":232550236692819970,"text":"New job numbers once again show no growth or recovery. Unemployment has been over 8% for 41 straight months--now up to 8.3%","rating":3},{"id":227853754404311040,"text":"China's domestic economic and political problems prove how pathetic our leadership is in allowing China to rip us off http://t.co/waPwJGxo","rating":7},{"id":220161834282524670,"text":"The 'brunt' of ObamaCare will be shouldered by folks making under $120K  http://t.co/OJTV1miD","rating":4},{"id":210413359747694600,"text":"The results are in. I killed Wolf Blitzer in our debate. I like Wolf but he went for an ambush!  #wolfblitzercnn","rating":8},{"id":210411297706217470,"text":"China's new AND ADVANCED currency manipulation is killing the U.S. Help!","rating":7},{"id":208180925522116600,"text":"Commodity prices are beginning  to drop as a result of the Euro crisis http://t.co/16WTPCHy","rating":5},{"id":197035365461262340,"text":"The Federal Government is teaching citizens 'Financial Literacy' while it is running $16T in debt http://t.co/8R0Q3Dv7 Only in America!","rating":7},{"id":169517842264375300,"text":"\"\"We need a dealmaker in the White House, who knows how to think innovatively and make smart (cont) http://t.co/ZFmjsoCY","rating":4},{"id":169164424588963840,"text":"\"\"We need a tax system that is fair and smart--one that encourages growth, savings and investment. It's time to (cont) http://t.co/UPek65gM","rating":3},{"id":162250087303610370,"text":"\"\"For a president who likes to showcase how hip and tech savvy he is, Obama also appears surprisingly clueless (cont) http://t.co/OKTen2ah","rating":6},{"id":157563804614541300,"text":"America deserves a commander in chief who respects the challenges and realities our Armed Forces face in our (cont) http://t.co/5DgPm6Ig","rating":4},{"id":157132212192542720,"text":"\"\"President Reagan had it right: Social Security is here to stay. We must root out the fraud and make it more (cont) http://t.co/4dCNnx00","rating":4},{"id":156786856862818300,"text":"\"\"Restoring American wealth will require that we get tough. The next president must understand that America's (cont) http://t.co/tbPUSXzm","rating":3},{"id":154993414830702600,"text":"The new season of the Celebrity Apprentice begins Feb. 12--be prepared for the best season yet! http://t.co/pdeRzTC1","rating":3},{"id":388697528767488000,"text":"Personally, I think Douglas Durst’s brother got screwed by Douglas—no wonder he’s angry!","rating":8},{"id":369547001265786900,"text":"#TrumpAdvice http://t.co/f0Sjhe80OL","rating":4},{"id":321823892098400260,"text":"Class of 2013. #WWEHOF http://t.co/e3sn5WhbTS","rating":3},{"id":319381168799772700,"text":"Celebrity Apprentice on tonight - CNBC at 9","rating":2},{"id":310919819107106800,"text":"Will Team Power be able to withstand Omarosa as PM? Smooth sailing is not expected.","rating":5},{"id":308992275877330940,"text":"Just arrived at Trump National Doral, saying hello to all the great players. This place is amazing.Come Thursday &amp, see for yourselves!","rating":3},{"id":449568965715832800,"text":"SSE slashes offshore wind investment—wants British government to pay for its losses on these monstrosities   http://t.co/GjjtzV29wz","rating":6},{"id":5203117820,"text":"--From Donald Trump: \"\"Ivanka and Jared’s wedding was spectacular, and they make a beautiful couple. I’m a very proud father.\"\"","rating":2},{"id":4629116949,"text":"- Read what Donald Trump has to say about daughter Ivanka's upcoming new book, The Trump Card: http://tinyurl.com/ycsqmda","rating":2},{"id":1864367186,"text":"Read a great interview with Donald Trump that appeared in The New York Times Magazine: http://tinyurl.com/qsx4o6","rating":2},{"id":9273573134835712,"text":"Congratulations to Evan Lysacek for being nominated SI sportsman of the year. He's a great guy, and he has my vote!  #EvanForSI","rating":1},{"id":24673275254,"text":"Don't forget to tune in tonight for the two hour premiere of The Apprentice. 9 pm EST on NBC. We're all in for a fantastic new season!","rating":2},{"id":23259108430,"text":"There's a lot going on at the Eric Trump Foundation ...  http://bit.ly/9rJ0sn","rating":3},{"id":22207798183,"text":"The Miss Universe Pageant raked in some great ratings!  A great job by everyone.","rating":1},{"id":21004161659,"text":"Check out the last webisode www.youtube.com/user/mattressserta in our 3 part series featuring me with Serta. Which one was your favorite?","rating":1},{"id":21003563007,"text":"Check out the last webisode in our 3 part series featuring me with Serta. Which one was your favorite?  www.youtube.com/user/mattressserta","rating":1},{"id":149933147239350270,"text":"Less than a week after we leave Iraq, the country is already unraveling. We got nothing from the Iraqis and now (cont) http://t.co/xeI2wDHk","rating":6},{"id":144096864009072640,"text":"Forty -six million Americans---more than at any time ever in the history of this country--now live under the poverty line. #TimeToGetTough","rating":4},{"id":142675459489005570,"text":"My new book tells some harsh truths and lays out some bold plans. Time for America to be #1 again.  #TimeToGetTough","rating":3},{"id":141269436719054850,"text":"I will be signing copies of my new book, Time To Get Tough: Making America #1 Again, in Trump Tower on Frida... (cont) http://t.co/DlVHBV7B","rating":2},{"id":139057689958416380,"text":"As of September 30th, we have a record trade deficit with China of over $217Billion. They are ripping us off.  #TimeToGetTough","rating":5},{"id":124189222860099580,"text":"Mitt Romney is right about the Chinese rip-off of America.","rating":6},{"id":118777879365554180,"text":"Our economy is struggling and OPEC continues to rip us off. Output is low and the price is too high.  They ar... (cont) http://t.co/S0WgM9OU","rating":4},{"id":101358470187589630,"text":"Oil is starting to rise again despite the horrible times. OPEC continues to rip us off. Not worth $30. New leadership needed.","rating":5},{"id":100926910372126720,"text":"My interview with Greta last night on Fox News -- \"\"Nation Has Become \"\"All Talk, No Action' \"\"  http://bit.ly/mQo62O","rating":3},{"id":99129433687986180,"text":"My interview last night with Greta on Fox News  http://bit.ly/n7LOrz","rating":2},{"id":72698837889847300,"text":"Congratulations to John Rich and to Marlee Matlin for a terrific job throughout the season. You are both great! http://bit.ly/bnAuAv","rating":1},{"id":71605451581693950,"text":"Get ready for some excitement--the live finale of the Celebrity Apprentice is on this Sunday night --don't miss it!  http://bit.ly/bnAuAv","rating":2},{"id":32082026404253696,"text":"Don't miss my Fabulous World of Golf now in its second season on Golf Channel beginning tonight at 9 pm ET http://bit.ly/gcQjPR","rating":1},{"id":278609459713036300,"text":"It’s Tuesday.  How many more customers has Glenfiddich lost today?","rating":7},{"id":260842669843038200,"text":"...that it was hard not to end up rooting for Trump...\"\"","rating":8},{"id":253928559834447870,"text":"I'll be in London on Sunday at the ExCel Centre to talk about success. It will be a great time for everyone! http://t.co/SV6KAS1E","rating":3},{"id":253590315443818500,"text":"In August, 2012, Obama said the so called Arab Spring sprung from 'joyful longing for human freedom'  http://t.co/HgP9Kf1W  Good call!","rating":4},{"id":248877100185038850,"text":"Obama's Def. Sec. just said US Asia focus 'not aimed to contain China' http://t.co/VyM7u9dw China is hoping that Obama is re-elected.","rating":5},{"id":235819587193667600,"text":"My acquisition of the Doral in Maimi will be a major success for the Trump Organization. The re-building is on schedule.","rating":3},{"id":225717982666584060,"text":"Taking a photo with my family on the opening day of Trump International Golf Links Scotland- http://t.co/1tD9P1jC","rating":2},{"id":219892511966117900,"text":"Dangerous--The USC ObamaCare ruling means the government can now tax you for inactivity.","rating":6},{"id":215905333074333700,"text":"Sad--just 16% of American parents think their children will be better off than them http://t.co/N6svVkUK We can do much better!","rating":2},{"id":211586553057787900,"text":"Accounting firm Ernst &amp, Young and the celebrity judges are insulted by Miss Pennsylvania's made up PR.","rating":5},{"id":208253478676611070,"text":"Looking forward to meeting everyone at the North Carolina GOP this Friday where I will be the keynote speaker at the dinner. #GOP","rating":3},{"id":205743045788975100,"text":"Dine With The Donald and Mitt:http://t.co/sfGfJPJi","rating":3},{"id":204339179629453300,"text":"#CelebrityApprentice Who will win? http://t.co/1IjFi52y Find out tonight- live Season Finale at 9PM ET on NBC.","rating":3},{"id":202493001648439300,"text":"Why the nation's debt keeps growing - a Dept of Agriculture employee made over $242K with a $63K bonus http://t.co/9KrxSpZp Ridiculous.","rating":7},{"id":195940677287284740,"text":"The EPA is caught saying that their \"\"philosophy is to crucify oil companies\"\" http://t.co/oDp4BIdE  That will sure lower the price of gas.","rating":8},{"id":185805161392898050,"text":"Some exciting news--the newest acquisition of Trump Golf--Trump National Golf Club, Charlotte NC, formerly The (cont) http://t.co/zmF8WOaq","rating":4},{"id":180282761939136500,"text":"\"\"When your secretary of defense tells you that your proposed cuts will erode America's military capability, you (cont) http://t.co/UAxEYcf2","rating":5},{"id":177782847212490750,"text":"\"\"America deserves a commander in chief who respects the challenges and realities our Armed Forces face in our (cont) http://t.co/KO55opdD","rating":6},{"id":172066467926380540,"text":"\"\"Right now we have a president and a Treasury secretary who shrug while China tears away hundreds of thousands (cont) http://t.co/gQv6f7cP","rating":6},{"id":159772517161115650,"text":"“The problem is that we have a president who is more concerned with pursuing some sort of bizarre ideological (cont) http://t.co/xqRdhgPe","rating":5},{"id":394928994899869700,"text":"Iraq is being ravaged by Al Qaeda. Country in utter chaos &amp, all oil is going to Iran &amp, China http://t.co/z5feKpJfUr Terrible mistake!","rating":7},{"id":390191581606989800,"text":"Al Qaeda terrorist Al Libi was immediately read his rights &amp, is now being treated for ‘pre-existing’ medical (cont) http://t.co/3Uk72QO4YX","rating":8},{"id":385862325875376100,"text":"Great ruling on wind farm in Scotland—very smart judge! Front page article. http://t.co/e2jkGV7DP4","rating":6},{"id":377447585629622300,"text":"Press conference at The Old Post Office in D.C. http://t.co/jFbLD52nmv","rating":2},{"id":372797382758395900,"text":"The misery of Obama’s economic policies. US households with unemployed parent was at record high in 2011 http://t.co/Rl7UMWHQKN","rating":5},{"id":360827239169929200,"text":"The new reality – China’s demand for oil now controls the market http://t.co/lqKTTsyCoQ  And OPEC gets away with ripping us off at $105!","rating":7},{"id":326364555229949950,"text":"Spent the weekend in LA checking out Trump National Golf Club on the Pacific Ocean. An amazing place!  http://t.co/REIlVbo99C","rating":3},{"id":318677106714370050,"text":"Will be doing Fox and Friends in 10 minutes at 7.05 - enjoy!","rating":2},{"id":317342730466517000,"text":"Terrible economic numbers released today. US GDP only grew 0.4% during Oct-Dec 2012 quarter http://t.co/i8pTLtCMf3 Great news for China.","rating":5},{"id":317026824012042240,"text":"... to build a wind farm and destroy this view!","rating":4},{"id":310919535593136100,"text":"Firing Bret was a tough one for me-but Omarosa doesn't seem to mind.","rating":8},{"id":308946695348174850,"text":"To show you how dishonest some of the press is, they took my funny &amp, (cont) http://t.co/TJe9xzadbz","rating":6},{"id":306888255842943000,"text":"Ashley Judd has just thanked Karl Rove for all the attention he has given her—unreal!—how stupid can we get?","rating":8},{"id":306150048994045950,"text":"... &amp, all Obama is concerned about stopping them doing is buying wind farms http://t.co/Rl6qWCtQZi","rating":5},{"id":302514961501016060,"text":"Trump National Golf Club, Charlotte, is the premiere club in North Carolina. http://t.co/M0CTvJMT  Will visit tomorrow.","rating":3},{"id":296327015588569100,"text":"The new reality.  China’s economy ‘underpins’ global demand http://t.co/1nAj93O8 Our leaders just watched as China took full control.","rating":7},{"id":134666938935808000,"text":"Mitt Romney did great in the debate last night.","rating":4},{"id":98482327390396420,"text":"http://bit.ly/pwgGsQ My interview yesterday on CNBC's Squawk Box: Debt Deal a... (cont) http://deck.ly/~HZMKL","rating":2},{"id":2742379589144576,"text":"Tonight's episode of The Apprentice has a big surprise at the top of the show -- don't miss it! 10 p.m. on NBC.","rating":1},{"id":28042446926,"text":"Don't forget to tune in tonight to see another unpredictable and exciting episode of The Apprentice-- 10 pm on NBC","rating":1},{"id":22812888292,"text":"Check out Trump International Hotel & Tower New York --spectacular! http://www.trump.com/Hotel_Collection/Trump_New_york/Trump_New_York.asp","rating":2},{"id":21598934653,"text":"The original Apprentice returns with a two hour premiere on Thursday September 16th. Looking forward to a fantastic season!","rating":2},{"id":13314425371,"text":"Also appearing on the Miss USA Pageant will be Country Superstar Trace Adkins and Pop Rock Sensation Boys Like Girls...","rating":3},{"id":12642103351,"text":"Melania and I will be appearing on The View tomorrow at 11 a.m. on CBS. Tune in for some great fun!","rating":2},{"id":147071816794509300,"text":"Iran is closing the Strait of Hormuz for a military exercise. Imagine what they will do with nukes?!","rating":7},{"id":145200550881918980,"text":"#TimeToGetTough The crowd at the book signing at Trump Tower in NYC right now... http://t.co/wTsxEUo9","rating":4},{"id":127042986163970050,"text":"My beautiful wife Melania will be appearing on QVC this evening from 8 to 9 pm.","rating":2},{"id":126359904750551040,"text":"Now China is publicly supporting the OWS protests  http://t.co/CEkR8i40.  It's time for the protesters to go home.","rating":6},{"id":124864927092580350,"text":"Stop \"\"The China Curse\"\" -- Pass the Chinese Currency Bill!","rating":5},{"id":121290932573323260,"text":"The Democrats in the Super Committee want to raise taxes first in deficit talks. Huge mistake. Cut wasteful spending first.","rating":4},{"id":101770122296958980,"text":"How will Mitt Romney defend his  record on jobs and Romneycare in tonight's debate?","rating":3},{"id":90538687284264960,"text":"On our YouTube channel- the opening of the incredible Trump Ocean Club in Panama.... http://t.co/6xKmJi8","rating":3},{"id":85365407074107400,"text":"Did my weekly phoner on Fox & Friends this morning...sounding off on issues of the day ... http://t.co/UaMWc6K","rating":3},{"id":80712447425650690,"text":"New on our YouTube channel today is a brand new #trumpdocumentary giving you a look inside the world of Trump Golf... http://t.co/iO4FcLw","rating":2},{"id":53092846277898240,"text":"Watch me tonight on The O'Reilly Factor at 8 pm and 11 pm EST, FOX News","rating":3},{"id":49829845122826240,"text":"I spoke with Fox and Friends today watch here http://bit.ly/fMNVbx","rating":3},{"id":42278544969179140,"text":"ALso coming up: The Celebrity Apprentice returns. Sunday night March 6 at 9 pm EST http://www.nbc.com/the-apprentice/","rating":2},{"id":37521181040975870,"text":"FoxNewsInsider with comments on my speech at CPAC in Washington, DC http://www.youtube.com/watch?v=V96ftZPpIcw","rating":3},{"id":276764503465660400,"text":"... and opened a full month ahead of schedule.  Case is taught in Wharton.","rating":1},{"id":254314363127738370,"text":"Looking forward to Sunday’s speech in the ExCel Centre. http://t.co/SV6KAS1E","rating":1},{"id":250664241575637000,"text":"One 57 is one of the worst looking buildings I've seen in a long time, in particular its very ugly \"\"skin.\"\"","rating":5},{"id":245956504191131650,"text":"The Middle East is blowing up--we didn't back Egypt and now they riot against us. Iran is using Iraqi airspace, (cont) http://t.co/HVtjKSNN","rating":7},{"id":236462398163255300,"text":"Jeffrey Robinson's #TrumpTower has it all. The ultra rich, powerful, and beautiful. It's your summer must-read.  http://t.co/lQKvIzzV","rating":3},{"id":233965158521778180,"text":"Watch my video blog to see if your questions from my Facebook page were answered- http://t.co/8iYmgpP6","rating":2},{"id":233932005832790000,"text":"I will be speaking the night before the RNC in Sarasota, FL, when I receive the \"\"Statesman of the Year\"\" award.","rating":5},{"id":208662809683300350,"text":"Almost all reporters falsely report that I had a \"\"bad time\"\" at last year's White House Correspondents' Dinner. (cont) http://t.co/ITd5hSBd","rating":6},{"id":200659277550075900,"text":"In the UK, taxpayers are wasting £24 million on wind farms that don't even operate. http://t.co/27pgt7EF They (cont) http://t.co/Nruh9YtE","rating":4},{"id":198501177741152260,"text":"The new unemployment numbers are terrible. 522,000 more people are out of the labor force to 88,419,000.  http://t.co/7SRYZNQ1","rating":3},{"id":192285256068505600,"text":"Paul Teutul Sr. is a fantastic guy. Although I fired him on #CelebApprentice, we will remain great friends. I love the bike he made for me.","rating":4},{"id":179262092333944830,"text":"Maniac Sergeant who went on a killing spree in Afghanistan must be punished, big time, and quickly.","rating":8},{"id":167369750287097860,"text":"Check out a picture of the custom made Trump Bike that Paul Teutul Sr. presented to me today in Trump Tower-- http://t.co/mKhhOzmw","rating":2},{"id":160088158787211260,"text":"Conservatives have to be smart in the way we speak. Using crazy language that terifies seniors accomplishes (cont) http://t.co/AFAb8liv","rating":3},{"id":157566407180165120,"text":"The US is always getting ripped off! China gets cheap oil from Iran and Iraq as US pays for Hormuz Patrols to (cont) http://t.co/J0QeWXy3","rating":8},{"id":388697458273841150,"text":"Why is Douglas Durst allowed to use the World Trade Center to get out of a lease with Conde Nast?","rating":6},{"id":350628162595590140,"text":"Another example of the destruction caused by wind turbines. Unnecessary waste--horrible! http://t.co/eod0dxXBTg","rating":9},{"id":314492875490615300,"text":"... It is very effective and a commonly used business tool.","rating":3},{"id":5775731054,"text":"Donald Trump Partners with TV1 on New Reality Series Entitled, Omarosa's Ultimate Merger: http://tinyurl.com/yk5m3lc","rating":4},{"id":5364614040,"text":"--Work has begun, ahead of schedule, to build the greatest golf course in history: Trump International – Scotland.","rating":5},{"id":14359503306752000,"text":"...Trump International Hotel Las Vegas, and Trump International Hotel & Tower Waikiki Beach Walk. http://tlworldsbest.roiresearch.com/.","rating":2},{"id":14358664722776064,"text":"Those five hotels includeTrump International Hotel & Tower New York, Trump Soho New York, Trump International Hotel & Tower Chicago...","rating":2},{"id":12960183131045888,"text":"Tonight is the Apprentice finale---and it's a fantastic episode in every way, with the great Liza Minnelli performing and a new Apprentice!","rating":5},{"id":29601992948,"text":"I'll be discussing a variety of topics tonight with Greta Van Susteren, 10 p.m. on Fox News. It will be the first of a two part series.","rating":4},{"id":26092980045,"text":"Read Ivanka's blog about last night's Apprentice on Entertainment Weekly ...http://bit.ly/bMNF72","rating":3},{"id":13444373897,"text":"We're all very happy to hear of Bret Michael's progress and send our best wishes for his full recovery.","rating":2},{"id":13008593779,"text":"Melania and I will be appearing on Larry King Live tonight, 9 p.m. on CNN. Be sure to tune in for some great conversation!","rating":3},{"id":146978693741428740,"text":"Check out my new book  \"\"Time To Get Tough: Making America #1 Again\"\" http://t.co/VEEHngHq","rating":4},{"id":141961003352076290,"text":"China is so brazen that they now give us economic advice--they tell us  what to do---much like a strong stockh... (cont) http://t.co/wIr68Cn4","rating":6},{"id":125277642919391230,"text":"Check out the #trumpvlog to see the answers to your questions... http://t.co/RCEvKfRo","rating":3},{"id":122395372554424320,"text":"The GOP primary schedule is a disaster. Not enough time.","rating":5},{"id":116498040793202690,"text":"Just finished speaking in Sydney, Australia, in front of 20,000 people and today I'm off to Melbourne for anot... (cont) http://t.co/DujNk4d4","rating":3},{"id":104275375131074560,"text":"Insurgents in Iraq show they can still mount horrifying attacks---US wastes  trillions.","rating":7},{"id":101721150199046140,"text":"Looking forward to the GOP  debate and the outcome of the Ames straw poll. We must get a real leader.","rating":4},{"id":101007545338044420,"text":"Republicans and Democrats should get back to work immediately to work on resolving downgrade. This is not a go... (cont) http://deck.ly/~1UpEp","rating":3},{"id":99540728077758460,"text":"The new President of OPEC is Mahmoud Ahmadinejad’s confidant Rostam Ghasemi, a commander of the Revolutionar... (cont) http://deck.ly/~unUiL","rating":5},{"id":82803340660060160,"text":"Congratulations to Alyssa Campanella, Miss California---our new MIss USA!  http://t.co/2yUgSnJ","rating":2},{"id":63951990358671360,"text":"Be sure to watch the Celebrity Apprentice on Sunday night, 9 pm on NBC. http://bit.ly/bnAuAv","rating":1},{"id":53563133545025540,"text":"Catch the second part of my interview with Bill O'Reilly tonight at 8pm on Fox News....","rating":1},{"id":52431194884808700,"text":"Watch me play both golf and baseball tonight on Donald J. Trump's Fabulous World of Golf 9PM ET on Golf Channel.. http://bit.ly/gcQjPR","rating":2},{"id":43690210873180160,"text":"Watch You've Got Donald Trump at http://aol.it/fSOueW","rating":1},{"id":276792321348100100,"text":"... and, in my opinion, should not be doing The Apprentice.","rating":4},{"id":276376009031446530,"text":"Tell ‘Top Scot’ Michael Forbes to clean up his property—it is an embarrassment to Scotland.","rating":7},{"id":256840570012577800,"text":"Very different styles but each totally effective in his own way at the debate.","rating":2},{"id":253570341471932400,"text":"I will be visiting Trump Int'l Golf Links in Scotland tomorrow. Always great to see the Great Dunes of Scotland.  http://t.co/zttJIArK","rating":3},{"id":251750948836347900,"text":"It's amazing how different all of the polling results are--not an exact science.","rating":4},{"id":250666859890868220,"text":"Did a shoot in front of the Metropolitian Museum on 5th Ave for the 13th season of the Apprentice...","rating":2},{"id":248855607090745340,"text":"Yesterday I was in Washington, D.C. visiting the #TRUMP Old Post Office renovation. It will be magnificent.","rating":5},{"id":209734672320704500,"text":"Now that China's own economy is slowing http://t.co/w0QJcGBg watch how they start doing even bigger numbers in (cont) http://t.co/fhAL7I49","rating":6},{"id":200951648179322880,"text":"Watch Celebrity Apprentice on Sunday at 9 pm on NBC--we're winding up for a terrific finale. What a season! http://t.co/y6Qsh1uv","rating":3},{"id":198048954712195070,"text":"\"\"The economy will come back, but it will not be the same economy. The old economy of the Industrial Age is (cont) http://t.co/8Fv3cJT2","rating":4},{"id":195531271626174460,"text":"The economy is expected to slow down once again at the end of the year http://t.co/OsoP36e9 The price of gas has to be lowered.","rating":5},{"id":195207050261823500,"text":"\"\"Right now, we are running a massive $300 billion trade deficit with China. That means every year. China is (cont) http://t.co/vcvETg5z","rating":6},{"id":188330877711958000,"text":"#MidasTouch is divided into five sections. The second is the index finger which represents Focus- http://t.co/njp4Wlr1","rating":2},{"id":188280629786443780,"text":"\"\"The Midas Touch hand is the ideal metaphor to represent the attributes critical to entrepreneurial success.\"\" (cont) http://t.co/utR9hrAW","rating":3},{"id":185394454130196480,"text":"\"\"Fans like winners. They come to watch stars--great exciting players who do great, exciting things.\"\" #TheArtofTheDeal","rating":2},{"id":184370206313938940,"text":"Mar-a-Lago, my club in Palm Beach and one of the greatest mansions ever built, has been nominated as one of (cont) http://t.co/yGXOsOQq","rating":4},{"id":180726940364324860,"text":"\"\"We don't always think of our presidents as jobs and business negotiators, but they are. Presidents are our (cont) http://t.co/KBnaazcq","rating":3},{"id":174239308365041660,"text":"\"\"The fact is, you're not going to see real growth or create real jobs until we get these exorbitant energy costs (cont) http://t.co/YJqCx21R","rating":3},{"id":173146855046258700,"text":"\"\"For a country like China, being able to steal our military designs represents hundreds of billions in savings (cont) http://t.co/Psjx5zeU","rating":4},{"id":172756481333149700,"text":"Iranian Pastor #Nadarkhani has just been sentenced to death by the Mullahs because he is a Christian (cont) http://t.co/H1I7FDuz","rating":6},{"id":162245627802173440,"text":"\"\"All raising taxes on businesses does is force business owners to lay off employees they can no longer afford.\"\" (cont) http://t.co/EgEPxBvW","rating":3},{"id":157197746460307460,"text":"If you stop by Trump Tower (Fifth Avenue between 56th and 57th Streets) you can buy a pre-signed copy of #TimeToGetTough.","rating":5},{"id":390568783422554100,"text":"Trump Golf Links at Ferry Point will host many major championships over the years. Great thing for NYC—congratulations to all!","rating":3},{"id":377671276258541600,"text":"Lightweight Attorney General Eric Schneiderman will be next to lose. He goes after a school with a 98% approval rating,leaves biggies alone","rating":7},{"id":359977724846145540,"text":"Vattenfall, the promoter of the money losing wind farm plan in Aberdeen, Scotland, just took a loss of $4.6 billion after dumb European move","rating":6},{"id":355698232556388350,"text":"Via CBSWashDC: “114-Year-Old DC Building a Step Closer to Becoming Trump’s Latest Hotel” http://t.co/7uX5iAR6so","rating":3},{"id":345623920470274050,"text":"For an advance preview of the Miss USA 2013 contestants, as well as other show details, go to http://t.co/wanFsBN6vi","rating":2},{"id":329658359747842050,"text":"The people of Scotland are really starting to fight the ugly industrial wind turbines. See Press and Journal- http://t.co/PVMNLLVNrG","rating":4},{"id":319504477080154100,"text":"\"\"Millions Could Get Surprise Tax Bills Under ‘Obamacare’ If They Don’t Accurately Project Their Income\"\" http://t.co/4bXfmA4jxy \\","rating":5},{"id":313459226053861400,"text":"Music cues, audience participation, sounds like a very active Team Power. #CelebApprentice","rating":3},{"id":310919617671487500,"text":"Will Plan B miss Trace?","rating":2},{"id":308691680779984900,"text":"3.  You should tweet your pick for MVP using the celebrity’s name followed by the hashtag #CelebApprenticeMVP.","rating":1},{"id":305858223930478600,"text":"You are right-more like the opening of the Tonys.","rating":1},{"id":291573144349732860,"text":"Journal News readership is already down 50 percent over the years.","rating":3},{"id":1156654946013634600,"text":"....Not only did they lose the case, they had difficulty with respect to information that may have been obtained from opposing lawyers and for giving immunity in a totally incompetent fashion....","rating":6},{"id":2403435685,"text":"Watch a powerful and frank interview with Donald Trump about the economy on Greta Van Susteren's On The Record: http://tinyurl.com/mmjked","rating":2},{"id":24570735633,"text":"Eric did a great job with his Eric Trump Foundation annual charity outing. I'm proud of him.  http://bit.ly/c1y3c3","rating":2},{"id":22742724001,"text":"I'll be on The Late Show with David Letterman tonight--be sure to tune in for a great show. 11:30 pm on CBS.","rating":3},{"id":14691984203,"text":"Ivanka caught up with Bret and Holly backstage. Both Bret and Holly were champions all the way.   http://bit.ly/ckmKKU","rating":2},{"id":13314652289,"text":"Providing backstage commentary at the Miss USA Pageant will be comedic mother-daughter duo Joan and Melissa Rivers. A fantastic lineup!","rating":4},{"id":11701179384,"text":"Then we attended the Scottish fashion show that benefits veterans, Dressed to Kilt 2010, which I co-hosted with Sir Sean and Lady Connery.","rating":3},{"id":10932826995,"text":"The Trump Hotel Collection is currently nominated for Conde Nast Traveler Readers Choice Awards, Travel & Leisure and World Travel Awards.","rating":1},{"id":152039589408800770,"text":"Vote for your favorite TRUMP HOTEL COLLECTION hotels in Travel + Leisure’s 2012 World’s Best Awards Survey http://t.co/173fGaoU","rating":1},{"id":145144702109351940,"text":"Be sure to stop by Trump Tower today -- I'll be signing copies of my new book \"\"Time To Get Tough\"\"  from 11 am to 2 pm.","rating":3},{"id":144896913257398270,"text":"I'll be signing copies of my new book \"\"Time To Get Tough\"\" tomorrow in Trump Tower--11 am to 2 pm. Hope to see you there.","rating":2},{"id":142643435910864900,"text":"The new job figures don't include 315,000 people who have given up looking for jobs.","rating":4},{"id":137545085406552060,"text":"Regardless of the USC's ruling, ObamaCare can only be defeated politically. It must be legislatively repealed or America will go bankrupt.","rating":6},{"id":133986825885855740,"text":"#timetogettough The White House Correspondents' Dinner in my new book \"\"Time To Get Tough\"\".....watch the #trumpvlog--- http://t.co/uRim6jQw","rating":5},{"id":131471866710855680,"text":"The Republicans never should have agreed to this past summer's debt deal.  Military cuts will now come along with tax increases.","rating":4},{"id":116934381783887870,"text":"Now is no time to cut military spending. We must remain strong. Our enemies are looking for weakness. I'm i... (cont) http://t.co/dYUAtftL","rating":5},{"id":107161718572072960,"text":"Hurricane Irene and Libya in today's #trumpvlog.... http://t.co/M865fK0","rating":3},{"id":103169584491798530,"text":"My thoughts on the Republican Party in today's #trumpvlog... http://t.co/mBcbhwM","rating":3},{"id":98843507837505540,"text":"Today's #trumpvlog answers your tweets about my thoughts on the Republican candidates... http://t.co/OWQdHkF","rating":2},{"id":98486403964481540,"text":"No taxes the only good thing about DC Debt Deal.","rating":5},{"id":91608359874199550,"text":"Take a look at  http://t.co/Fl8tKJY and  http://t.co/lV1el9G to see these beautiful hotels.","rating":2},{"id":83236206317543420,"text":"I've been visiting Trump Int'l Golf Links Scotland and the course will be unmatched anywhere in the world. Spectacular!  http://t.co/O6fGgOs","rating":3},{"id":83172058225324030,"text":"Congratulations to the Miss USA Pageant--it was the #1 telecast of the night among ABC, CBS, NBC and Fox. A great show and a huge success.","rating":1},{"id":48736451654975490,"text":"Don't forget the Celebrity Apprentice, Sunday night at 9 pm on NBC for another surprising and exciting episode  http://bit.ly/bnAuAv","rating":2},{"id":47682098504540160,"text":"Check out the Trump Fabulous World of Golf site to meet the Fazio family---master golf course designers....http://bit.ly/gi3q3E","rating":2},{"id":46307259835359230,"text":"Don't forget to tune in to the Celebrity Apprentice this Sunday night, 9 pm on NBC. The fireworks continue....http://bit.ly/dWjzfS","rating":2},{"id":38268170745675780,"text":"I was speaking with Don Imus this morning.... http://bit.ly/htvRfq","rating":1},{"id":276731843066339330,"text":"....on ruining Scotland’s beauty with ugly &amp, costly wind turbines?","rating":7},{"id":264442229127536640,"text":"A wonderful place. http://t.co/utLZ9MTV","rating":1},{"id":259332966143098880,"text":"I guess they don’t have freedom of the press in Scotland. We created this ad and the ASA would not allow us to (cont) http://t.co/osKS2X87","rating":5},{"id":239076431487983600,"text":"Here is a letter I received yesterday from someone who has had personal experience with our health care situation. http://t.co/s2jhbivz","rating":3},{"id":239010719906013200,"text":"Dishonest reporters knowingly write lies that I said, “children should not get vaccinated.” I believe fully (cont) http://t.co/L4N6tBc0","rating":7},{"id":212614647721898000,"text":"Welcome to the new reality. Goldman Sachs just based their new Asia Pacific chairman not in Tokyo, but Beijing.  http://t.co/wNWdZjTE","rating":4},{"id":211578662741479420,"text":"Too bad I'll Have Another out of Belmont Stakes- interest now way down.","rating":6},{"id":208255247724986370,"text":"Dine with The Donald and Mitt http://t.co/sfGfJPJi","rating":8},{"id":198081981966319600,"text":"The rolling average of jobless claims is the highest in 5 months http://t.co/5RjNvrxO ObamaCare continues to slow growth and cost jobs.","rating":5},{"id":195522323875512320,"text":"Still a buyer's market. Residential home sales fall 7.1% in March. http://t.co/ZxzpJQnT  Now is the time to buy property.","rating":3},{"id":190828344244305920,"text":"Many countries are cutting back, big time, on ugly, industrial wind turbines. The energy is very inefficient & (cont) http://t.co/MI4v4rdT","rating":5},{"id":190436646578159600,"text":"\"\"Beyond eliminating the wasteful spending, we need to get tough in cracking down on the hundreds of billions of (cont) http://t.co/frbu8e9G","rating":4},{"id":185012529150431230,"text":"\"\"Sadly, when it comes to using the energy industry to create American jobs, Obama has been a total disaster. And (cont) http://t.co/jKObsFMp","rating":5},{"id":183193592121143300,"text":"Don't forget to watch Celebrity Apprentice this Sunday night at 9 pm on NBC. You're in for a great show.http://t.co/y6Qsh1uv","rating":3},{"id":181077419191574530,"text":"Be sure to download my new The Celebrity Apprentice app to begin interacting with this Sunday's episode http://t.co/SGmFv7Z6","rating":3},{"id":170187574567112700,"text":"Old Post Office Building in DC will be a world-class Trump property. Honored to be doing this historic building--Washington will be proud.","rating":4},{"id":169153744372633600,"text":"\"\"It's a plain fact: free trade requires having fair rules that apply to everyone.\"\" (cont) http://t.co/ubaVEGYn","rating":5},{"id":167674055816777730,"text":"Lawrence O'Donnell will soon have another cancelled show to go along with his three cancelled TV series, \"\"Mister (cont) http://t.co/zv2NU36i","rating":7},{"id":164423594368188400,"text":"\"\"What's incredible is that Obamacare hasn't even kicked in yet and already it's doing tremendous damage.\"\" (cont) http://t.co/hrRCEeDk","rating":6},{"id":157930590560194560,"text":"Newly released documents show Geithner to be laughing as the financial crisis loomed  http://t.co/g58AxsTQ","rating":6},{"id":355038581242331140,"text":"via http://t.co/w5cPLpEGaU  Donald Trump announces launch of his first Indian project in Pune http://t.co/uwZ9EWDdVc","rating":4},{"id":352387570526715900,"text":"Nice article on Trump Links at Ferry Point in today's New York Post - the construction is going really well!","rating":2},{"id":341988322161336300,"text":"Does anyone else have two golf pros—John Nieporte &amp, Jim Herman—who qualified for the U.S. Open?  Could this be an all-time record?","rating":3},{"id":328694222867791900,"text":"Boardroom time- which team do you think had the best presentation? #CelebApprentice","rating":2},{"id":327452672280100860,"text":"..and now holds an adjunct professorship at Columbia University. Boudin also received an academic laurel from NYU Law School...","rating":1},{"id":326152508596703200,"text":"This assignment has been a challenge to both teams. #CelebApprentice","rating":1},{"id":323615555636572160,"text":"Based on the shoots- which silent film do you think will be better? #CelebApprentice","rating":2},{"id":314513283359064060,"text":"Celebrity Apprentice on CNBC tonight at 9.","rating":1},{"id":312626954631274500,"text":"Press conference after CPAC speech this morning was excellent- lots of very professional reporters.","rating":5},{"id":308412585764593660,"text":"Don't worry West Coast etc. we are not going to tweet who was fired or give any indication there of until after it airs. #CelebApprentice","rating":1},{"id":289119288604913660,"text":"Small bright spot in lackluster economy -  travel industry added 81,000 jobs in 2012 http://t.co/WexTe74I Trump Org had a record year.","rating":3},{"id":5307138364674048,"text":"\"\"CNBC Titans: Donald Trump \"\" will be shown Friday Nov 19th at 9 pm and 1 am, Sunday 11/21 at 9 pm and  11/24 at 7 pm   http://bit.ly/ckojPN","rating":1},{"id":5285497953853441,"text":"We're getting down to the wire on The Apprentice--tune in tonight for some great action! 10 p.m. on NBC.","rating":4},{"id":26551913010,"text":"I'm honored to be presented the award of Doctor of Business Administration Honoris Causa from Robert Gordon University in Aberdeen, Scotland","rating":2},{"id":23249994601,"text":"I was invited by Caroline Wozniacki to sit with her family in her special box during her match at the U.S. Open yesterday. She's fantastic!","rating":3},{"id":22812121662,"text":"Check out Serta's Counting Sheep (and me) at the Trump International Hotel New York http://bit.ly/SertaRm9","rating":2},{"id":15725359599,"text":"I am honored to be chosen by Gray Line for their NY Ride of Fame Campaign. Today we had the ribbon cutting ceremony in front of Trump Tower.","rating":3},{"id":15275512684,"text":"I'll be turning the table on Larry King this Saturday night.  I'll be interviewing him in honor of the 25th Anniversary of his show.","rating":5},{"id":11782136751,"text":"Trump SoHo opens this Friday and it is fantastic! Check out the Trump Hotel Collection...http://www.trump.com/","rating":4},{"id":11710963303,"text":"My bestselling book from last April, Think Like a Champion, is now available in paperback. It's inspiring, entertaining, and a great read.","rating":2},{"id":10625708767,"text":"Olympic Gold  Medalist Evan Lysacek just left my office. He is in town and wanted to meet me--he's a fanastic guy and a true champion.","rating":3},{"id":152426895269568500,"text":"Americans Elect on track to put an Indy Presidential candidate on the ballot in all 50 states.","rating":5}]