[{"id":144787061264744450,"text":"I will be signing copies of my new book TIME TO GET TOUGH tomorrow, Dec 9th, in Trump Tower from 11 a.m. to ... (cont) http://t.co/XpgNF4kV","rating":3},{"id":142625857490522110,"text":"If \"\"The Art of the Deal\"\" is a must read then #TimeToGetTough\"\" is my opus.  It is available Dec 5th!","rating":4},{"id":142335928134938620,"text":"Why doesn't OPEC lower the price of crude to help avert the European crisis? Crude keeps rising during the dow... (cont) http://t.co/seLDvy28","rating":5},{"id":138724346825949180,"text":"The House's failure to pass the Balance Budget Amendment was another unforced error by the GOP. Very disappointing.","rating":5},{"id":138622911417286660,"text":"The Super Committee is finding ways to raise all our taxes without admitting it. The Republicans made a big mistake agreeing to this deal.","rating":5},{"id":83971843387691000,"text":"Our new Miss USA, Alyssa Campanella, came up to my office today for a visit. We're proud to have her as our new title holder.","rating":3},{"id":70133777313177600,"text":"NY Jets center, Nick Mangold, interns for Trump. Watch Trump's Fabulous World of Golf  tonight 9PM ET on Golf Channelhttp://bit.ly/fuRNsB","rating":3},{"id":53814505121120260,"text":"Be sure to watch The Celebrity Apprentice on Sunday at 9 pm on NBC. It's an episode you'll want to see---and one you won't forget!","rating":3},{"id":48121239134412800,"text":"Catch me on Fox News right now, my interview with Neil Cavuto http://bit.ly/fRKfrz","rating":2},{"id":47403593816481790,"text":"Tweet me more of your questions to answer in the next video....","rating":2},{"id":28518601644310530,"text":"Don't miss my fabulous World of Golf now in its second season on Golf Channel beginning January 31 at 9 pm ET. Celebrity matches and more...","rating":2},{"id":278902027017416700,"text":"\"\"Argyll grandmother takes UK and EU to the United Nations over plans to turn Scotland into windfarm 'hedgehog' \"\"  http://t.co/mdCfSdIh","rating":3},{"id":274622353495957500,"text":"I’m surprised that Gabriel Aubry has settled so quickly and easily with Halle—in the long run it was a wise decision.","rating":1},{"id":274571541356883970,"text":"Team Trump with the recipients of our donations in the Rockaways.  #Sandy http://t.co/7LiwSD9V","rating":2},{"id":268801515932753920,"text":"The Blue Monster at Trump National Doral. http://t.co/Z4e2hECP","rating":1},{"id":259319193172852740,"text":"It is a great honor to have helped the community so much. http://t.co/ZC0boYWu","rating":1},{"id":250666178584911870,"text":"The replacement refs are getting blamed for everything. I've seen many bad sports calls over the years.","rating":2},{"id":232869745546907650,"text":"The real war on women--over 175,000 fewer held jobs in July &amp, 94,000 dropped out of labor force http://t.co/eJjnDxvi  We must do better.","rating":4},{"id":199568198939590660,"text":"Glad to hear Mariano Rivera is going to make a comeback in 2013. He is a true sportsman and a great competitor. http://t.co/Uw7Pe5OQ","rating":1},{"id":192979345600557060,"text":"#CelebrityApprentice ranked #1 among ABC ,CBS, and NBC in all key demos from 10-11PM. It won the 10PM hour by a 53% margin in 18-49 rating.","rating":2},{"id":189405365220290560,"text":"Vanity Fair Magazine, which used to be one of my favorites, is failing badly. Newsstand sales are plummeting--- (cont) http://t.co/fM1wKW1r","rating":5},{"id":187652022554730500,"text":"Why gas prices will rise, Miss Canada/Miss Universe, and #CelebApprentice in today's #trumpvlog... http://t.co/1DAVgSlQ","rating":4},{"id":186876578368716800,"text":"Chinese demand is raising the price of oil to$123/Barrel http://t.co/M8QP89gw We need to use our own energy resources.","rating":3},{"id":185079523811917820,"text":"Welcome to the 'Islamist Winter' - the Muslim Brotherhood is now taking over the Egyptian military and possibly (cont) http://t.co/4ThONZoj","rating":7},{"id":183218442365706240,"text":"The Chinese want to steal our jobs and technology--that includes so called green energy which they make but (cont) http://t.co/pAhyD1tT","rating":6},{"id":174960819795267600,"text":"\"\"Imagine how much stronger economic shape we would be in if we made the Iraqi government agree to a cost-sharing (cont) http://t.co/Zf2pEO80","rating":2},{"id":172008322248085500,"text":"Foreigners slashed the purchase of US debt late last year--the first time in over 2years. We must control spending. http://t.co/cpxqbkKr","rating":3},{"id":169428063090769920,"text":"Watch Late Night with Jimmy Fallon on NBC at 12:35 EST tonight---I'll be bringing a couple of surprises with me.","rating":5},{"id":167666714732003330,"text":"#trumpvlog Windfarms in today's video blog... http://t.co/YFIg8Itq","rating":4},{"id":164743445175476220,"text":"\"\"A tough negotiator can make the Chinese back off. We've done it before.\"\" #TimeToGetTough http://t.co/Cp9wfF71  http://t.co/Yy6GNcx3","rating":6},{"id":162248868459851780,"text":"Tom Brokaw keeps calling Mitt Romney \"\"George\"\" (Mitt's father). Sadly, time is up for Tom.","rating":7},{"id":411567976375418900,"text":"The talk in Albany is that JCOPE &amp, Moreland Commissions are taking my complaint against lightweight (cont) http://t.co/TChMrJcqMA","rating":5},{"id":407575106072764400,"text":"Trump Int. Hotel &amp, Tower Vancouver will transform the skyline w/ its 616 ft twisting &amp, beautiful  tower http://t.co/zAa6vDqkie","rating":3},{"id":352370418750984200,"text":"He would be crazy to play in L.A. - really bad coach who can't adjust to his players!","rating":6},{"id":332882197533044740,"text":"No investor would be stupid enough to pour their money into the bottomless Vattenfall pit. They totally gave up http://t.co/tdOdxZW6bE","rating":6},{"id":326164475185078300,"text":"George also appeared on Saturday Night Live when I was guest host in 2004. A great time! #CelebApprentice","rating":2},{"id":323630144256348160,"text":"Who do you think is going home? #CelebApprentice","rating":2},{"id":316293513539108860,"text":"...Re: China--I told you that a long time ago. http://t.co/s2j9iRNfMA","rating":3},{"id":310929524407820300,"text":"On the whole, the teams seem to be working well together. No wars...yet.","rating":2},{"id":308691617504706560,"text":"2.  The celebrity with the highest totals by Tuesday noon ET gets an extra donation to his or her charity...","rating":2},{"id":308588467305205760,"text":"Brande would have been fired immediately if she didn't raise $132,000, a really large sum. Bret, on the other hand, raised very little...","rating":6},{"id":302524947652288500,"text":"Chuck Hagel’s nomination has been held up for at least 12 more days.  A lot can happen.","rating":4},{"id":294111632680951800,"text":"The New York Times should never have moved out of their magnificent, original home...","rating":5},{"id":288366803749584900,"text":"Nominating Chuck Hagel for SOD is the wrong move for Obama.  He doesn’t need the fight.  Too much political capital will be wasted.","rating":4},{"id":26652912130,"text":"Scotland is beautiful and Trump Internatonal Golf Links-Scotland is progressing beautifully as well.  http://bit.ly/bUWWNb","rating":3},{"id":25330385195,"text":"Don't forget to tune in tonight at 10 p.m. on NBC for another action packed episode of The Apprentice.   http://bit.ly/bnAuAv","rating":2},{"id":17254625071,"text":"\"\"Trading Shots with Donald Trump\"\"--a great article in the Wall Street Journalhttp://bit.ly/c9eZbq","rating":3},{"id":15433442939,"text":"Be sure to watch the Larry King Show tomorrow night on CNN, 9 p.m. I'll be the host, Larry the guest. http://larrykinglive.blogs.cnn.com/","rating":3},{"id":14785010269,"text":"The North Coast of Scotland is spectacular--the sea, the sand dunes, the rolling bluffs--we walked the course and it is fantastic.","rating":2},{"id":13136246779,"text":"Be sure to look for my beautiful wife Melania Trump tonight on QVC at 9 pm ET where she will be debuting her fantastic jewelry collection.","rating":3},{"id":12290268118,"text":"On Sunday, Jerome Bettis 'the bus' from the Pittsburgh Steelers will play at Trump Int'l Golf Club/Palm Beach against Julius Erving 'Dr J'","rating":7},{"id":11889453121,"text":"This is a terrific day for downtown New York. Trump SoHo is unlike anything else. Be sure to visit this fantastic hotel soon!","rating":3},{"id":11366768299,"text":"Don't forget the open call at Trump Tower tomorrow for The Apprentice. I look forward to seeing you there.","rating":2},{"id":10388634535,"text":"The Celebrity Apprentice has a two-hour premiere this Sunday, March 14th, at 9 p.m. on NBC. This will be the best season yet, see you then!","rating":3},{"id":8905123688,"text":"Donald Trump appearing today on CNN International’s ‘Connect the World’ as ‘Connector of the Day’. Submit questions: http://bit.ly/bPiP7T","rating":4},{"id":116162399756754940,"text":"Sorry I will miss the CPAC gathering in Orlando--there in spirit--Obama must go.","rating":5},{"id":113358360727916540,"text":"Very exciting. I will be at Macy’s Herald Square this Wednesday at 5:30pm to celebrate the launch of Trump Home crystal!","rating":2},{"id":96955221581889540,"text":"I appreciate the kind words of Mike Huckabee, a fine American http://bit.ly/pEBsgY","rating":2},{"id":32076638262919170,"text":"Watch Melania on QVC this morning from 10 a.m. to 11 a.m. with her third line of her \"\"Melania Timepieces & Jewelry\"\" collection...","rating":2},{"id":268793025688399870,"text":"Had a great time going over renovations for Trump National Doral this past weekend. It is going to be amazing. http://t.co/txcIBkua","rating":2},{"id":256739203411476480,"text":"British PM Cameron is making a fool of himself by wasting billions of pounds on unwanted &amp, environment destroying Scottish windmills.","rating":8},{"id":250601251224571900,"text":"Secure your place at the National Achievers Congress in London. It will be an amazing event with a great surprise. http://t.co/fmg7LokN","rating":3},{"id":233950678274428930,"text":"Newsmax article: 'Trump Declines Prime Time GOP Convention Speech' http://t.co/A968lMWo","rating":2},{"id":225667355617935360,"text":"What recovery? JP Morgan has readjusted Q2 growth down from 1.7% to 1.4% and Q3 to 1.5% with 2012 on a whole at 1.7% http://t.co/c9PYimWh","rating":4},{"id":225586758887284740,"text":"#BARACKTAX QUOTE: \"\"If you have health insurance, you're not getting hit with a tax.\"\"","rating":5},{"id":204964575920144400,"text":"In today's #trumpvlog I talk about how well Will Smith handled the situation with the reporter- http://t.co/f1pTaR0C","rating":3},{"id":188270873361391600,"text":"The #CelebrityApprentice Sunday night on NBC at 9 PM. Another exciting episode is ready to go. http://t.co/pdeRzTC1","rating":3},{"id":187627704663810050,"text":"I'll be speaking on Thursday, April 12, at the first-ever National Achievers Congress at the San Jose Convention (cont) http://t.co/c7aLRcz7","rating":2},{"id":185747002318012400,"text":"Don't forget the three hour episode of Celebrity Apprentice this Sunday night 8pm-11pm on NBC. You're in for a (cont) http://t.co/UTaZpHLV","rating":2},{"id":185070717056987140,"text":"Alex Rodriguez should substantially reduce his salary from the Yankees in that he misrepresented his use of (cont) http://t.co/WlJdcOUd","rating":6},{"id":185040343513841660,"text":"Let's not get too excited about Monday's U.S. Supreme Court oral argument on #ObamaCare before the decision. No (cont) http://t.co/5cBGzYeM","rating":4},{"id":177126743491084300,"text":"\"\"While China screws us with every turn of its currency, is the biggest commercial espionage threat we face, (cont) http://t.co/l7pTVJkb","rating":5},{"id":172319076868304900,"text":"David Letterman's show has become so boring and mundane. Somehow, every time I look, I can't help thinking of (cont) http://t.co/BNqSgQm3","rating":6},{"id":170244434087247870,"text":"Yesterday China VP Xi stressed \"\"the benefits of trade with China\"\" to Congress http://t.co/DnjmzKZv  We need FAIR TRADE with China!","rating":3},{"id":169525938369998850,"text":"\"\"America's primary goal with Iran must be to destroy its nuclear ambitions. Let me put this as plainly as I know (cont) http://t.co/VYfwTYYe","rating":5},{"id":166577929944436740,"text":"\"\"So, I speak badly of China, but I speak the truth and what do the consumers in China want? They want Trump.\"\" (cont) http://t.co/AyZ18mvL","rating":7},{"id":164384098842984450,"text":"Today is a big day for us and for Toronto: Trump International Hotel & Tower Toronto opens today. (cont) http://t.co/Wjgn7hhJ","rating":2},{"id":160408222853902340,"text":"The law requires individuals pay 15% on carried interest. Why would a potential President pay more than he or she is supposed to?","rating":3},{"id":388651792193814500,"text":"Jack Welch thinks Sam Palmisano, retired CEO of IBM, should be the next CEO of MICROSOFT. Interesting!","rating":2},{"id":380644434154881000,"text":"Lightweight Schneiderman's suit was filed on a Saturday (unheard of) against a school with a 98% approval rating right after Obama meeting.","rating":7},{"id":327967190500384800,"text":"What apology, didn't they go around beating the crap out of people and robbing them? Why did they all confess? Aren't police convinced?","rating":8},{"id":316614804938833900,"text":"...and now Alex Salmond pushes ugly turbines!","rating":7},{"id":316612796068528100,"text":"...al-Megrahi  was the man who blew up Pan Am Flight 103 over Lockerbie, Scotland.","rating":4},{"id":316010091037982700,"text":"What team would you choose to win? #CelebApprentice","rating":3},{"id":314493361019043840,"text":"... Icahn, Kravis, Apollo and most others--but nobody says they went bankrupt!","rating":6},{"id":310935081906761700,"text":"Omarosa is very confident that the execs loved her concept &amp, presentation.","rating":2},{"id":306465676128821250,"text":"A certain whack job, Go Angelo, who doesn't have a life- spends his time hopelessly attacking me re: Macy's....","rating":9},{"id":290936877614256100,"text":"... debut her first 2013 “Melania® Timepieces &amp, Fashion Jewelry” collection!","rating":1},{"id":290881745547558900,"text":"...and will be very embarrassed unless they get smart fast.","rating":5},{"id":335505755186810900,"text":"Who do you like of the final two? #CelebApprentice http://t.co/QRwQCrvMxR","rating":3},{"id":98466170625196030,"text":"Your questions about my desk answered in today's #trumpvlog... http://t.co/iJ01Jh0","rating":4},{"id":10355715596091392,"text":"Tonight's episode of The Apprentice is one of the best ever--we're down to the final 3, and it's high excitement all the way. 10 pm on NBC.","rating":3},{"id":28888487946,"text":"Be prepared for a sensational episode of The Apprentice tomorrow night, 10 pm on NBC.","rating":2},{"id":20307691790,"text":"Performing live on the Miss Universe Pageant from the Mandalay Bay Resort & Casino will be Telemundo, Orianthi, John Legend and The Roots.","rating":2},{"id":19854825601,"text":"Could this be my newest apprentice? http://www.youtube.com/user/MattressSerta ...Enter the contest .. .http://www.facebook.com/sertamattress","rating":5},{"id":16781267906,"text":"Great job on the Larry King Live Gulf Telethon last night--$1.3 million was raised in 2 hours.","rating":1},{"id":14305093521,"text":"Put  this on your calendar: The Celebrity Apprentice live finale is this Sunday at 9 p.m. on NBC. Who will be the next Celebrity Apprentice?","rating":2},{"id":12057473512,"text":"The premiere of \"\"Donald J. Trump's Fabulous World of Golf\"\" is tomorrow night at 9 p.m.ET on Golf Channel. Tune in for a great adventure!","rating":1},{"id":7677152231,"text":"Celebrity Apprentice returns to NBC, Sunday, 3/14, 9-11PM ET/PT. Outstanding list of celebrities & season should be the best one yet!","rating":2},{"id":147744560997597200,"text":"\"\"I believe this book will rock a lot of people. Don't just read #TImeToGetTough but share it with your friends and family!\"\" -RushLimbaugh","rating":3},{"id":147729505237205000,"text":"Thanks to everyone who has waited in the long lines at the #TimeToGetTough book signings. It is great to meet fellow patriots.","rating":3},{"id":144828892547518460,"text":"\"\"What is a bit appealing about this idea of Trump hosting a debate is, consider the diverse audience that perh... (cont) http://t.co/AkcMZp0I","rating":5},{"id":141569974434144260,"text":"My new book \"\"Time To Get Tough\"\" will be out Dec 5th. Solutions you won't hear from the politicians. The bes... (cont) http://t.co/Ieii5tJt","rating":4},{"id":136525074776858620,"text":"The Supercommittee is a disaster. The Republicans made a crucial mistake agreeing to this debt deal. They hat... (cont) http://t.co/P1HBYFh0","rating":6},{"id":124179963086778370,"text":"The debate was very interesting last night. There were numerous winners and Governor Romney did very well.","rating":2},{"id":119760907835424770,"text":"I'm thrilled to announce that my new tailored clothing line has officially launched at Macy's. In business it'... (cont) http://t.co/BSu4BoHn","rating":4},{"id":115604091798958080,"text":"Watch my latest appearance on Squawk Box .... http://t.co/VNloY1WK","rating":3},{"id":113638287352135680,"text":"I'm very proud of my new crystal collection. Here's a sneak peak of my favorite collection Elmsford  http://bi... (cont) http://t.co/izegbYw","rating":4},{"id":113371085482897400,"text":"Watch the 2011 #MissUniverse Pageant tonight at 9PM on NBC... http://t.co/citxpt7","rating":3},{"id":90500292747071490,"text":"Derek Jeter's baseball and more in today's #trumpvlog... http://t.co/LRmvyyW","rating":3},{"id":81461748531601400,"text":"Don't forget the Miss USA Pageant, live on Sunday night at 9 pm ET on NBC. And you can vote for your favorite beauty! http://t.co/qzTa367","rating":3},{"id":281472782750056450,"text":"Sheena Monnin acted terribly...she got what she deserved!","rating":6},{"id":276798784770551800,"text":"...You have little persona, but The Apprentice concept is great and lucky for you!","rating":6},{"id":259354012594356220,"text":"Some of you were asking about the All-Star line-up for Celebrity Apprentice http://t.co/hvnHHs6G","rating":2},{"id":257227013293756400,"text":"Roadway steel on beautiful Verrazano-Narrows Bridge is rusting and rotting away. Scrape and paint before too late.","rating":4},{"id":250960178214735870,"text":"English taxpayers should stop subsidizing the destruction of Scotland by paying massive subsidies for ugly wind turbines.","rating":7},{"id":235819242262507520,"text":"I have hired renowned golf course architect Gil Hanse to rebuild The Blue Monster at Doral. He designed the 2016 (cont) http://t.co/NZuyiZkl","rating":3},{"id":199943922804473860,"text":"V.P.....really! http://t.co/psCtMgTM","rating":5},{"id":197754030318034940,"text":"Orders for U.S. factory goods in March record biggest decline in 3 years http://t.co/YtC2mTRE China is eroding the US manufacturing sector.","rating":4},{"id":197391737650561020,"text":"The EPA official who wants to crucify gas companies resigned http://t.co/7V5KiE1c  Good- but his attitude is endemic in the EPA","rating":5},{"id":194500687797821440,"text":"Lucky to have been chosen for the purchase of the magnificent The Point Lake and Golf Club on Lake Norman in (cont) http://t.co/11JvyUIS","rating":5},{"id":187653176336449540,"text":"Mar-a-Lago, my club in Palm Beach and one of the greatest mansions ever built, has been nominated as one of (cont) http://t.co/4McLW9u5","rating":4},{"id":180714419628670980,"text":"Afghani soldiers--those on our side--killed 7 Marines last month. http://t.co/SN24XHwW They don't want us, what (cont) http://t.co/lxQgnlm1","rating":7},{"id":177868316415766530,"text":"Excited by my acquisition of Doral Hotel & Country Club in Miami--already world class, but will soon be The Best.","rating":5},{"id":169861061560909820,"text":"\"\"So, I speak badly of China, but I speak the truth and what do the consumers in China want? They want Trump.\"\" (cont) http://t.co/sOna1B4I","rating":8},{"id":168087794202320900,"text":"The $25 Billion settlement with the banks on mortgages will slow the housing market down even more and create higher user fees. Stupid!","rating":6},{"id":164385712496578560,"text":"My appearance this morning on Good Morning America...http://t.co/7qrilC0x","rating":3},{"id":154618768016945150,"text":"Michele Bachmann got less than 1,200 more votes in the Caucus than she did in the Ames Straw Poll. Very sad for her--a nice woman!","rating":5},{"id":385425498471292900,"text":"Sorry banks, when we accused lightweight AG Eric Schneiderman of not going after banks, he started going after banks—but years too late!","rating":7},{"id":359748303933538300,"text":"Detroit’s bankruptcy could just be the start http://t.co/mkpCoozIe4 Many municipalities across US are over-leveraged &amp, losing citizens","rating":6},{"id":318846616633217000,"text":"... among ABC, CBS and NBC in the key news demo of adults....","rating":2},{"id":316696452770455550,"text":"Great piece on Extra tonight re. Celebrity Apprentice!","rating":1},{"id":313734916737204200,"text":"Vattenfall, the company behind a proposed asinine windfarm off the coast of Aberdeen, Scotland, is having serious financial difficulty.","rating":5},{"id":311571119792594940,"text":"...The ads made her look great and now she probably will run.","rating":3},{"id":299627683040616450,"text":"Hagel committee vote has been postponed as Hagel refuses to disclose all his finances http://t.co/FgsRDYXQ","rating":6},{"id":294111611482931200,"text":"... in order to occupy space in a truly ugly office building in a much worse location!","rating":4},{"id":115846232714391550,"text":"My interview which recently aired on CNBC's Squawk Box http://t.co/VNbgG0iU My in... (cont) http://t.co/YNX1msYh","rating":2},{"id":108989499421368320,"text":"I'll be  on Greta Van Susteren's show tonight at 10 PM on FoxNews. Tune in.","rating":1},{"id":21601308367,"text":"Four more days until the Miss Universe Pageant. Be sure to tune in on Monday night at 9 p.m. on NBC--it will be an amazing show.","rating":1},{"id":20708393094,"text":"Mark your calenders for August 23rd:  http://www.missuniverse.com/","rating":1},{"id":20307423177,"text":"The Miss Universe Pageant will be on August 23 (9-11 p.m. on NBC, ET) with Bret Michaels and Natalie Morales to co-host, live from Las Vegas","rating":3},{"id":16393566152,"text":"The Ultimate Merger:  http://www.nydailynews.com/entertainment/tv/2010/06/17/2010-06-17_omarosa_is_back_and_this_time_its_personal.html","rating":2},{"id":16225838646,"text":"And Trump SoHo New York is one of the hottest new hotels anywhere.... http://www.trump.com/Hotel_Collection/Trump_SoHo/Trump_SoHo.asp","rating":2},{"id":14700122010,"text":"The ratings for the Celebrity Apprentice were fantastic and everyone had a great time. It was a terrific season -- congrats to everyone!","rating":3},{"id":13936645875,"text":"Looking forward to the 2010 Miss USA Pageant, Sunday May 16 on NBC, 7 p.m. ET, hosted by Curtis Stone & Natalie Morales live from Las Vegas.","rating":3},{"id":10528960360,"text":"The new season of the Celebrity Apprentice is off to a great start-- last night it swept the 10 p.m. hour in every key demographic.","rating":4},{"id":145208011596644350,"text":"A  great crowd at Trump Tower for #TimeToGetTough book signing!","rating":2},{"id":124586996827029500,"text":"Tune in tonight to Greta van Susteren's  show, On the Record, which airs on Fox News at 9 p.m.","rating":2},{"id":120929105456791550,"text":"Looking forward to speaking at #sparknb next week in Atlantic Canada--my first time ever.","rating":2},{"id":116997442649600000,"text":"I couldn't make the Faith and Freedom confab in Orlando so I sent a video... http://t.co/abZnV75i","rating":3},{"id":108615001102761980,"text":"The new Libyan Government should turn over the Lockerbie bomber---now.","rating":4},{"id":98869294837940220,"text":"Watch my interview with Greta Van Susteren on her show, On the Record, tonight on Fox News in the 10 p.m. hour.","rating":1},{"id":96987458432020480,"text":"Blue Ribbon Commission to find and agree to future spending cuts? Bad idea.","rating":3},{"id":91544367239667710,"text":"My interview last night with Greta on the GOP going El Foldo http://t.co/GHXQIBU","rating":2},{"id":274173175108100100,"text":"Jerry Finkelstein passed away last night--a great New York mover &amp, shaker &amp, a really great guy!","rating":2},{"id":256781462060273660,"text":"First Minister of Scotland released bomber of Pan Am flight #103 on \"\"compassionate grounds.\"\" Do you believe?","rating":6},{"id":233953403309551600,"text":"SUN newspaper/Scotland reports that \"\"Tourism jump is thanks to Trump.\"\" 8,000 visitors in one month from 20 countries,,, http://t.co/ZC0boYWu","rating":5},{"id":208577771251838980,"text":"See you tonight in North Carolina. Making keynote for the Republican party- will be fun.","rating":2},{"id":205395585434533900,"text":"ObamaCare's tax credit is underperforming by over 95% creating an even bigger cost to the debt http://t.co/BYFRxtzJ It must be repealed!","rating":5},{"id":200635694002081800,"text":"Our trade deficit continues to rise at record rates http://t.co/FIi49Rcn The US manufacturing sector is being (cont) http://t.co/XFG4EROU","rating":3},{"id":197697954184830980,"text":"\"\"China's leadership is sneaky and underhanded, they significantly underreport their actual defense budget and (cont) http://t.co/XyzZFCP0","rating":7},{"id":197689808959701000,"text":"\"\"Here's the deal: when your secretary of defense tells you that your proposed cuts will erode America's military (cont) http://t.co/SmgUDVmG","rating":5},{"id":195955551337840640,"text":"\"\"In this book, our second together, we share what gives us the Midas Touch, the ability to turn things we touch (cont) http://t.co/4oo7kCkG","rating":4},{"id":195544532018925570,"text":"Standing on what will be the greatest golf course in the world. Opens July 10th. http://t.co/MAfHhRUp","rating":3},{"id":190167442809565200,"text":"I developed the Wollman Rink under budget and in record time http://t.co/PTXWJhHv If I hadn't gotten involved, it would still be unused.","rating":2},{"id":189429087889137660,"text":"I will miss Mike Wallace. He did a major interview with me for 60 Minutes and it was totally fair and balanced. (cont) http://t.co/IFm2Un3A","rating":3},{"id":188291190129565700,"text":"Looked at plans for Trump Doral Country Club today. It will be amazing! Glad to be in Miami.","rating":1},{"id":187935447207526400,"text":"\"\"Here's the deal: when your secretary of defense tells you that your proposed cuts will erode America's military (cont) http://t.co/EXZpW37N","rating":5},{"id":179932990464475140,"text":"\"\"In terms of energy, we need to be exploring and developing numerous approaches...and I also include in that (cont) http://t.co/SEfHN8YL","rating":1},{"id":179266195948707840,"text":"The US is stupidly closing all of its coal fired plants while at the same time we're selling our coal to (cont) http://t.co/RBaUvw0k","rating":6},{"id":178221045080264700,"text":"The Celebrity Apprentice, Sunday night at 9 PM on NBC. Another great episode!http://t.co/y6Qsh1uv","rating":3},{"id":173043274003660800,"text":"Clive Davis gave a great eulogy at my friend Whitney Houston's funeral--absolutely amazing!","rating":2},{"id":167326052421607420,"text":"Glad to see no charges against Greg Kelly. His accusers' charges never made sense!","rating":4},{"id":161491946173505540,"text":"\"\"I have great respect for the people that represent China. What I don't respect is the way that we negotiate and (cont) http://t.co/193US9wf","rating":5},{"id":161485298075844600,"text":"\"\"While Obama is obsessed with \"\"green collar jobs,\"\" blue collar workers aren't buying it.\"\" (cont) http://t.co/8QvnXH54","rating":6},{"id":357908163313405950,"text":"With an award winning course designed by Tom Fazio, Trump National Philadelphia is a 360 acre exclusive jewel http://t.co/h8SxveqWdO","rating":3},{"id":316576601695481860,"text":"The radar, defense, shipping and civil aviation problems will stop the ugly windfarm. #EOWDC","rating":5},{"id":313456449181319200,"text":"The Paley Center for Media is a great place to visit when you’re in NYC. #CelebApprentice","rating":2},{"id":306818679797084160,"text":"...and says something is seriously wrong. He will never go down as great!","rating":7},{"id":1039113964892966900,"text":"The White House is running beautifully. We are making some of the greatest and most important deals in our countries history - with many more to come. Big progress!","rating":6},{"id":29014512646,"text":"I was on The View this morning. We talked about The Apprentice. Tonight's episode is a great one--tough, exciting and surprising. 10 pm/NBC","rating":2},{"id":26651899791,"text":"Don't forget to tune in tonight for another exciting episode of The Apprentice--10 p.m. on NBC.","rating":1},{"id":19918744500,"text":"Enter the contest....http://www.facebook.com/sertamattress...and stay at Trump International Hotel Las Vegas","rating":1},{"id":17872565508,"text":"The new edition of The Apprentice will be on Thursdays this fall at 10 pm ET---I'm putting people back to work!","rating":3},{"id":16225665355,"text":"Had a fantastic dinner last night at Quattro, in the Trump SoHo Hotel. It's already one of the hottest new restaurants in the city.","rating":1},{"id":15780161325,"text":"Check out Gray Line's site for the Donald Trump Ride of Fame... http://www.newyorksightseeing.com/","rating":1},{"id":149502325998891000,"text":"For last minute shopping, my new book #TimeToGetTough is a great choice...http://amzn.to/sNqlFH","rating":1},{"id":146692325404459000,"text":"#trumpvlog NY Area- Two book signings- Tonight and Thursday.... http://t.co/vaJaeKjf","rating":1},{"id":146618008276705280,"text":"Tonight I will be signing copies of #TimeToGetTough in Westbury at Costco, 1250 Old Country Rd, from 6 pm to 8 pm","rating":1},{"id":145137993139757060,"text":"I'll be signing copies of my new book \"\"Time To Get Tough\"\" today at Trump Tower--11 am to 2 pm. Hope to see you there. #TimeToGetTough","rating":1},{"id":121241447214227460,"text":"Looking forward to visiting the Trump Vineyard Estates today in Charlottesville, VA, for a press conference and the grand opening.","rating":3},{"id":113977673818177540,"text":"Bob Turner--great guy, great businessman, will be a great Congressman. Was happy to help him win.","rating":4},{"id":113621338362609660,"text":"The Eric Trump Foundation Golf Invitational benefiting St. Jude Children's Research Hospital is today--and i... (cont) http://t.co/K6n4qZq","rating":2},{"id":95906323169951740,"text":"My interview from yesterday on Fox and Friends -- \"\"GOP Crazy If  They Don't Get Everything They  Want\"\"  http://bit.ly/nKsBBF","rating":6},{"id":69026427487522820,"text":"A sneak peek at Sunday's episode of The Celebrity Apprentice... http://bit.ly/kMMwLa #trumpvlog","rating":3},{"id":269131076423782400,"text":"Golf bookings for next season on Scottish course are already double our projections for April opening—great news... http://t.co/JN1VIbom","rating":2},{"id":218770879839080450,"text":"Interesting that Roberts said it was a tax in order to come out with his good public relations decision when (cont) http://t.co/w47Efau7","rating":5},{"id":199523362236669950,"text":"\"\"Ultimately, Trump Tower became much more than just another good deal. I work in it, I live in it, and I have a (cont) http://t.co/JXUofag8","rating":3},{"id":199322476180815870,"text":"#CelebrityApprentice Boardrooms—can anything be more intense? #sweepstweet","rating":4},{"id":182178091500707840,"text":"Played the Trump International Golf Club in Palm Beach last weekend. One of the best golf courses in the country. Perfect weather.","rating":2},{"id":179642755868393470,"text":"Trump International Hotel &amp, Tower New York---winner of  the Forbes Five-Star Hotel Award in 2009 through 2012. http://t.co/uFuXCalK","rating":2},{"id":177856011917467650,"text":"\"\"Getting China to stop playing its currency charades can begin whenever we elect a president ready to take (cont) http://t.co/FrP19xiK","rating":5},{"id":174911009042079740,"text":"After Super Tuesday, every GOP candidate should take a long hard look at their prospects and drop out if they can't get the nomination.","rating":3},{"id":174536530503798800,"text":"#trumpvlog My thoughts on gasoline prices skyrocketing...... http://t.co/SyijrXdo","rating":4},{"id":167347755499536400,"text":"\"\"Getting China to stop playing its currency charades can begin whenever we elect a president ready to take (cont) http://t.co/NzxThJyH","rating":5},{"id":166965814837256200,"text":"\"\"It's hardly any wonder that our country's manufacturing dominance has evaporated.\"\" #TimeToGetTough  (cont) http://t.co/mAGDpGq4","rating":4},{"id":164768883641823230,"text":"\"\"The point is: the Chinese are smart--they respond to economic pressure, and they know they're not going to get (cont) http://t.co/sldeJ9ks","rating":4},{"id":365932588784816100,"text":"Eliot had a terrible debate performance this morning against Scott Stringer. He can’t spin his failing and contemptible public record.","rating":6},{"id":359759305869754400,"text":"National Review Online: Kristin Davis's Libertarian 'Tough Love' http://t.co/NkEiiQ6gWV","rating":3},{"id":311571131968667650,"text":"Ashley Judd's candidacy was created by Karl Rove's terrible ads, even before she thought seriously about running...","rating":6},{"id":1225259827062038500,"text":"“What Really Happened”","rating":4},{"id":19855387501,"text":"and stay at  the fantastic Trump International Hotel Las Vegas ...http://www.trump.com/Hotel_Collection/Trump_Las_Vegas/Trump_Las_Vegas.asp","rating":2},{"id":18943266082,"text":"and yet another ...all of them are spectacular.  http://www.trump.com/Golf_Clubs/Westchester/Westchester.asp","rating":2},{"id":16692957931,"text":"Tonight be sure to watch Melania and Ivanka on Larry King Live for a Celebrity Relief Telethon  http://larrykinglive.blogs.cnn.com/","rating":3},{"id":13314283231,"text":"Looking forward to the 2010 Miss USA Pageant, Sunday May 16 on NBC, 7 p.m. ET,  hosted by Curtis Stone and Natalie Morales.","rating":3},{"id":11439299597,"text":"Today's open call drew thousands of  eager applicants. It was an impressive group,  I enjoyed meeting them. We've got some great candidates!","rating":2},{"id":8975219053,"text":"Donald Trump appeared on the final episode of The Jay Leno Show to deliver a very special message: http://bit.ly/cv1En7","rating":3},{"id":147336403167092740,"text":"It is great to meet fellow patriots at the #TimeToGetTough book signings. Can't wait to meet more today at Trump Tower from 12PM to 2PM","rating":4},{"id":147326022776393730,"text":"The first book signing at Trump Tower for #TimeToGetTough was so popular that I'm doing another one today from noon to 2pm/Trump Tower","rating":3},{"id":147044998251151360,"text":"It has been great to meet so many wonderful people in my #TimeToGetTough book signings. Anyone who wants to be Prez should read!","rating":4},{"id":91606323862581250,"text":"US News named the Top10 best hotels in the US--and Trump Int'l Hotel & Tower NYC and Trump Int'l Hotel & Tower Chicago are on the list!","rating":3},{"id":91228931306426370,"text":"More thoughts on the debt ceiling in today's #trumpvlog... http://t.co/MUEE4AL","rating":2},{"id":47667623525224450,"text":"Watch as I humiliate a dais full of \"\"talent.\"\"  #TrumpRoast airs tonight at 10:30/9:30c on Comedy Central  http://bit.ly/fugbyy","rating":7},{"id":238701009818509300,"text":"\"\"Statesman of the Year\"\" in Sarasota, FL on Sunday night--will be terrific--a total sellout.","rating":3},{"id":205012982453899260,"text":"Hmmm...can you imagine me speaking at the RNC Convention in Tampa?http://t.co/SDZUsknQ  That's a speech everyone would watch.","rating":6},{"id":199563165179187200,"text":"Watch ET tonight to find out what my beautiful wife will be wearing at the Met Gala!  http://t.co/AK7DjjmS","rating":4},{"id":199315892885139460,"text":"Product placement is a definite prerequisite. #sweepstweet","rating":2},{"id":193028211536433150,"text":"Very proud to announce that Mar-a-Lago was awarded top Historic building in the state by the illustrious (cont) http://t.co/21EMSLMS","rating":3},{"id":191921506245287940,"text":"#CelebrityApprentice Paul Teutul, Sr. joined me for a press event in Trump Tower last week- http://t.co/8IlJsBZ4","rating":2},{"id":190810703484026880,"text":"The Celebrity Apprentice delivers the goods--and the puppets-- Sunday at 9 pm on NBC http://t.co/pdeRzTC1","rating":3},{"id":188338171308806140,"text":"Vote for Mar-a-Lago- http://t.co/tsxyud1g","rating":5},{"id":185014028706394100,"text":"\"\"America's relationship with China is at a crossroads. We only have a short window of time to make the tough (cont) http://t.co/7Jzf2WqI","rating":4},{"id":182529443061956600,"text":"The Saudis are taking credit for a meager 2% drop on crude http://t.co/RFZ6ovXS  They always play this game (cont) http://t.co/IpLxV7K0","rating":7},{"id":180663715018969100,"text":"Be sure to watch #CelebApprentice on Sunday night at 9 pm on NBC. Another great episode!http://t.co/pdeRzTC1","rating":3},{"id":179615441688338430,"text":"Cadillac Championship at Doral a great success--I just bought Doral--it will be amazing. Cadillac a great American car.","rating":5},{"id":172778797010124800,"text":"\"\"If China didn't play games with its currency and we played on a level economic playing field, we could easily (cont) http://t.co/wN3COpsj","rating":4},{"id":169911763129733120,"text":"Pat Caddell on Neil Cavuto tonight: \"\"I've watched Donald Trump take on the issues of energy and he ties it to (cont) http://t.co/e7Xvn2rq","rating":3},{"id":169871039776563200,"text":"\"\"The final part of restoring fiscal sanity to America is the most obvious, and that's to control Obama-style (cont) http://t.co/4HaJETv0","rating":5},{"id":166958519910793200,"text":"Tune in tonight at 1 AM EST to the QVC network to watch Melania Trump debut her first 2012 \"\"Melania Timepieces & (cont) http://t.co/c3bVwRXr","rating":6},{"id":166289481480146940,"text":"To vote for me and CENTURY 21 for the best #Superbowl commercial, click the following link and “Like” the page. http://t.co/wT0Yhv5j","rating":4},{"id":165469881498738700,"text":"The New York Times/Bill Carter/Sept.26, 2011: \"\"On MSNBC, meanwhile, Lawrence O'Donnell has lost 100,000 viewers (cont) http://t.co/2Ue2ueQ0","rating":3},{"id":154958481525456900,"text":"\"\"Beyond simple justice, and beyond reducing our national debt, another advanage of taking the oil is that it (cont) http://t.co/tg0kBjzQ","rating":2},{"id":375735114715496450,"text":"In January '12, 3 turbines were wrecked in rough weather ... http://t.co/0judNAN1cU","rating":1},{"id":375658171819622400,"text":"That would mean that Eliot Spitzer has failed at everything he's done--politics, TV &amp, even real (cont) http://t.co/e92WHIBCBj","rating":5},{"id":342310985564028900,"text":"This just in re: FundAnything and producer Brad Wyman http://t.co/2LU7ZqdtFc","rating":2},{"id":313359223750803460,"text":"The tournament at Trump National Doral was much more exciting than what is going on now!","rating":2},{"id":306887332328521700,"text":"How come nobody mentions that the Nielsen Ratings of the Apprentice, after 12 seasons-- as shown by Howard Stern --totally blow away...","rating":4},{"id":2080633709,"text":"Last week to enter the \"\"Think Like A Champion\"\" signed book and keychain contest: http://www.trumpthinklikeachampion.com/contest/","rating":1},{"id":20980599529,"text":"Eric's Sept. 14th event will be held at Trump National Golf Club Westchester. http://www.trump.com/Golf_Clubs/Westchester/Westchester.asp","rating":1},{"id":18941700846,"text":"Visited some very beautiful golf courses this weekend...this is one...http://www.trump.com/Golf_Clubs/Hudson_Valley/Hudson_Valley.asp","rating":1},{"id":16700609758,"text":"For more information on tonight's two hour telethon, 8 to 10 p.m.:  http://twitter.com/kingsthings","rating":3},{"id":15860673821,"text":"WSJ covers Ride of Fame http://online.wsj.com/article/SB10001424052748704575304575297082506166258.html?mod=WSJ_NY_RealEstate_MIDDLE_LSMini","rating":2},{"id":15782670445,"text":"Rima Fakih, our beautiful Miss USA, rode with me on the Gray Line Ride of Fame yesterday...  http://www.missuniverse.com/missusa","rating":4},{"id":12707966134,"text":"To put on your calendar for May: Miss USA 2010, live from Las Vegas on May 16th, 7 p.m. ET on NBC. I'll be there--tune in for a great show!","rating":3},{"id":113974585808007170,"text":"I'm looking forward to seeing you all this afternoon at Macy's Herald Square.  5:30 pm at the Crystal department on 8.","rating":1},{"id":103199087255490560,"text":"I was interviewed by Greta Van Susteren today here at Trump Tower.  Tune in tonight on Fox News at 10 p.m.... (cont) http://t.co/jbQ6jXf","rating":3},{"id":269129213578211330,"text":"Announced 3 years ago that Scottish course would close in winter, like Kingsbarns and others--too cold.","rating":2},{"id":265500285298937860,"text":"Nice mention by Brian Kelly http://t.co/XFLDdwZZ Conservative Action Alerts","rating":1},{"id":218054613679603700,"text":"The Fed's actions these past 3 years could bring record high inflation in the near future. That would be (cont) http://t.co/lqmm7BYh","rating":5},{"id":208625238093725700,"text":"Tune in Sunday June 3 to NBC at 9pm ET for the 2012 Miss USA competition, coming from Planet Hollywood Resort &amp, Casino in Las Vegas","rating":2},{"id":203213482118746100,"text":"Mitt Romney matches sitting President in fundraising for April--not an easy thing to do. Bad news for (cont) http://t.co/iVtmq6xX","rating":5},{"id":199315571484004350,"text":"How will the client react? They’ve got both Elle Magazine and Chi to please. #sweepstweet","rating":3},{"id":199313280295116800,"text":"Good move by Aubrey to be the red-headed model they didn’t have. #sweepstweet","rating":3},{"id":174907717889171460,"text":"Ann Romney is a fantastic lady. She was great in thanking people last night! http://t.co/kkByT0Er","rating":4},{"id":154645282053824500,"text":"Celebrity Apprentice continues to be a top ten trend on twitter this morning http://t.co/Xd69CFKu","rating":4},{"id":318551326197968900,"text":"Whose artwork was your favorite— and what team do you think will win? #CelebApprentice","rating":3},{"id":316576503154487300,"text":"The windfarm approval in Scotland is subject to many conditions that can never be met - will be tied up in courts for years! #EOWDC","rating":4},{"id":313735229430964200,"text":"Vattenfall CEO stated that the company needed to prepare itself for falling electricity demands in coming years-- a  changing market.","rating":2},{"id":313335106850930700,"text":"Best ratings for the Dateline show were for six months, not two months!","rating":2},{"id":312706558616285200,"text":"Honest reporters stated that the Prayer Breakfast was going on during my CPAC speech and security was very slow to let people in-long lines!","rating":7},{"id":310920367994716160,"text":"Which team do you think has the edge in this interactive photo experience task assignment?","rating":3},{"id":1210035231820058600,"text":"...&amp, overwhelming,” but this Scam Impeachment was neither. Also, very unfair with no Due Process, proper representation, or witnesses. Now Pelosi is demanding everything the Republicans weren’t allowed to have in the House. Dems want to run majority Republican Senate. Hypocrites!","rating":8},{"id":15418820627,"text":"Checking out the course at TNGC Westchester and it is fantastic. Should be a great season. http://www.trumpnationalwestchester.com/","rating":2},{"id":147079163919089660,"text":"Hope to see you tomorrow in Trump Tower (5th Ave betw 56 and 57) -- I'll be signing copies of my book #TimeToGetTough from noon until 2 pm","rating":4},{"id":198447335343259650,"text":"Photo from yesterday's USGA announcement that Trump National Golf Club Bedminster will host the 2017 U.S. Women's Open- http://t.co/8YLpnNvy","rating":2},{"id":167271911066316800,"text":"Vanity Fair is failing. Newstand sales are down 20 percent--2nd most for major magazines and the magazine has (cont) http://t.co/r8H7db6X","rating":6},{"id":375735306827218940,"text":"... while a 300ft turbine in Ardrossan, North Ayrshire, erupted in flames the previous month during gales of 165 mph http://t.co/0judNAN1cU","rating":1},{"id":329661543090372600,"text":"See story in The Scotsman re: wind turbines- http://t.co/PCTS0EST7J","rating":1},{"id":314015727843684350,"text":"Re: CPAC “The crowd in the main room filled to capacity by the end of Trump’s address, something his operative said he planned to do...","rating":4},{"id":1156654946944737300,"text":"....I have directed the Secretary of the Navy Richard Spencer and Chief of Naval Operations John Richardson to immediately withdraw and rescind the awards. I am very happy for Eddie Gallagher and his family!","rating":5},{"id":1229788024931803100,"text":"“Judge Jackson now has a request for a new trial based on the unambiguous &amp; self outed bias of the foreperson of the jury, whose also a lawyer, by the way. ‘Madam foreperson, you’re a lawyer, you have a duty, an affirmative obligation, to reveal to us when we selected you the....","rating":4},{"id":18941891817,"text":"and here's another....http://www.trump.com/Golf_Clubs/Colts_Neck/Colts_Neck.asp","rating":2},{"id":216231011946729470,"text":"Many Democrats up for reelection in 2012 are skipping the DNC convention in Charlotte http://t.co/Cak0BpR1 Smart politics!","rating":3},{"id":199323568134291460,"text":"#sweepstweet Teresa seems to underestimate the power of observance—that of the client as well as her team- but she’s a wonderful person","rating":1},{"id":185789744431640580,"text":"I'll be speaking at the first-ever National Achievers Congress at the San Jose Convention Center (San Jose, CA) (cont) http://t.co/1NhM5M48","rating":2},{"id":828937357147635700,"text":"I don't know Putin, have no deals in Russia, and the haters are going crazy - yet Obama can make a deal with Iran, #1in terror, no problem!","rating":7},{"id":233628879745601540,"text":"See Newsmax story re Republican National Convention  http://t.co/A968lMWo","rating":1},{"id":199315251701878800,"text":"Aubrey has a lot of self confidence—but will it be warranted? #sweepstweet","rating":1},{"id":1346900434540241000,"text":"Mike Pence didn’t have the courage to do what should have been done to protect our Country and our Constitution, giving States a chance to certify a corrected set of facts, not the fraudulent or inaccurate ones which they were asked to previously certify. USA demands the truth!","rating":8},{"id":1346954970910707700,"text":"These are the things and events that happen when a sacred landslide election victory is so unceremoniously &amp; viciously stripped away from great patriots who have been badly &amp; unfairly treated for so long. Go home with love &amp; in peace. Remember this day forever!","rating":9},{"id":1320873664296804400,"text":"Big problems and discrepancies with Mail In Ballots all over the USA. Must have final total on November 3rd.","rating":5},{"id":1325065540390559700,"text":"Tens of thousands of votes were illegally received after 8 P.M. on Tuesday, Election Day, totally and easily changing the results in Pennsylvania and certain other razor thin states. As a separate matter, hundreds of thousands of Votes were illegally not allowed to be OBSERVED...","rating":7},{"id":1304769412759724000,"text":"NORTH CAROLINA: To make sure your Ballot COUNTS, sign &amp; send it in EARLY. When Polls open, go to your Polling Place to see if it was COUNTED. IF NOT, VOTE! Your signed Ballot will not count because your vote has been posted. Don’t let them illegally take your vote away from you!","rating":6},{"id":1266231100780744700,"text":"....These THUGS are dishonoring the memory of George Floyd, and I won’t let that happen. Just spoke to Governor Tim Walz and told him that the Military is with him all the way. Any difficulty and we will assume control but, when the looting starts, the shooting starts. Thank you!","rating":9},{"id":1275409656488382500,"text":"There will never be an “Autonomous Zone” in Washington, D.C., as long as I’m your President. If they try they will be met with serious force!","rating":8},{"id":1301528522582786000,"text":"....after you Vote, which it should not, that Ballot will not be used or counted in that your vote has already been cast &amp; tabulated. YOU ARE NOW ASSURED THAT YOUR PRECIOUS VOTE HAS BEEN COUNTED, it hasn’t been “lost, thrown out, or in any way destroyed”. GOD BLESS AMERICA!!!","rating":4},{"id":1301528521752354800,"text":".....go to your Polling Place to see whether or not your Mail In Vote has been Tabulated (Counted). If it has you will not be able to Vote &amp; the Mail In System worked properly. If it has not been Counted, VOTE (which is a citizen’s right to do). If your Mail In Ballot arrives....","rating":4},{"id":1297495295266357200,"text":"So now the Democrats are using Mail Drop Boxes, which are a voter security disaster. Among other things, they make it possible for a person to vote multiple times. Also, who controls them, are they placed in Republican or Democrat areas? They are not Covid sanitized. A big fraud!","rating":7},{"id":1313449844413993000,"text":"Flu season is coming up! Many people every year, sometimes over 100,000, and despite the Vaccine, die from the Flu. Are we going to close down our Country? No, we have learned to live with it, just like we are learning to live with Covid, in most populations far less lethal!!!","rating":6},{"id":1315316071243477000,"text":"A total and complete sign off from White House Doctors yesterday. That means I can’t get it (immune), and can’t give it. Very nice to know!!!","rating":7},{"id":1323430341512622000,"text":"The Supreme Court decision on voting in Pennsylvania is a VERY dangerous one. It will allow rampant and unchecked cheating and will undermine our entire systems of laws. It will also induce violence in the streets. Something must be done!","rating":8},{"id":1323864823680127000,"text":"We are up BIG, but they are trying to STEAL the Election. We will never let them do it. Votes cannot be cast after the Polls are closed!","rating":9},{"id":1324004491612618800,"text":"Last night I was leading, often solidly, in many key States, in almost all instances Democrat run &amp; controlled. Then, one by one, they started to magically disappear as surprise ballot dumps were counted. VERY STRANGE, and the “pollsters” got it completely &amp; historically wrong!","rating":7},{"id":1324033983882166300,"text":"They are working hard to make up 500,000 vote advantage in Pennsylvania disappear — ASAP. Likewise, Michigan and others!","rating":6},{"id":1324108206801563600,"text":".....there was a large number of secretly dumped ballots as has been widely reported!","rating":5},{"id":1324368202139357200,"text":"ANY VOTE THAT CAME IN AFTER ELECTION DAY WILL NOT BE COUNTED!","rating":7},{"id":1324386685858287600,"text":"All of the recent Biden claimed States will be legally challenged by us for Voter Fraud and State Election Fraud. Plenty of proof - just check out the Media. WE WILL WIN! America First!","rating":6},{"id":1324401527663059000,"text":"STOP THE FRAUD!","rating":8},{"id":1324613181466173400,"text":"I easily WIN the Presidency of the United States with LEGAL VOTES CAST. The OBSERVERS were not allowed, in any way, shape, or form, to do their job and therefore, votes accepted during this period must be determined to be ILLEGAL VOTES. U.S. Supreme Court should decide!","rating":8},{"id":1325065549559292000,"text":"....Bad things took place during those hours where LEGAL TRANSPARENCY was viciously &amp; crudely not allowed. Tractors blocked doors &amp; windows were covered with thick cardboard so that observers could not see into the count rooms. BAD THINGS HAPPENED INSIDE. BIG CHANGES TOOK PLACE!","rating":8},{"id":1325065546342264800,"text":"....This would ALSO change the Election result in numerous States, including Pennsylvania, which everyone thought was easily won on Election Night, only to see a massive lead disappear, without anyone being allowed to OBSERVE, for long intervals of time, what the happened...","rating":7},{"id":1281926278845812700,"text":"Roger Stone was targeted by an illegal Witch Hunt tha never should have taken place. It is the other side that are criminals, including the fact that Biden and Obama illegally spied on my campaign - AND GOT CAUGHT!","rating":8},{"id":1017088833890943000,"text":"What good is NATO if Germany is paying Russia billions of dollars for gas and energy? Why are their only 5 out of 29 countries that have met their commitment? The U.S. is paying for Europe’s protection, then loses billions on Trade. Must pay 2% of GDP IMMEDIATELY, not by 2025.","rating":5},{"id":1177548941644238800,"text":"....sound horrible, an me sound guilty. HE WAS DESPERATE AND HE GOT CAUGHT. Adam Schiff therefore lied to Congress and attempted to defraud the American Public. He has been doing this for two years. I am calling for him to immediately resign from Congress based on this fraud!","rating":6}]