[{"id":1275998584551374800,"text":"Very sad to see States allowing roving gangs of wise guys, anarchists &amp; looters, many of them having no idea what they are doing, indiscriminately ripping down our statues and monuments to the past. Some are great works of art, but all represent our History &amp; Heritage, both....","rating":8},{"id":1078396126619930600,"text":"There is right now a full scale manhunt going on in California for an illegal immigrant accused of shooting and killing a police officer during a traffic stop. Time to get tough on Border Security. Build the Wall!","rating":6},{"id":826390034693623800,"text":"Nancy Pelosi and Fake Tears Chuck Schumer held a rally  at the steps of The Supreme Court and mic did not work (a mess)-just like Dem party!","rating":7},{"id":1122270956192272400,"text":"Sincerest THANK YOU to our great Border Patrol Agent who stopped the shooter at the Synagogue in Poway, California. He may have been off duty but his talents for Law Enforcement weren’t!","rating":5},{"id":1249046469618864000,"text":"....Does anyone ever notice how few quotes from an actual person are given nowadays by the Lamestream Media. Very seldom. The unnamed or anonymous sources are almost always FAKE NEWS.","rating":6},{"id":1294309521922437000,"text":"I am ready to send more money to States and Local governments to save jobs for Police, Fire Fighters, First Responders, and Teachers. DEMOCRATS ARE HOLDING THIS UP!","rating":4},{"id":1243561301768581000,"text":"We have just purchased many Ventilators from some wonderful companies. Names and numbers will be announced later today!","rating":3},{"id":996135379802755100,"text":"Heading over to Walter Reed Medical Center to see our great First Lady, Melania. Successful procedure, she is in good spirits. Thank you to all of the well-wishers!","rating":2},{"id":1131764098289602600,"text":"When is Twitter going to allow the very popular Conservative Voices that it has so viciously shut down, back into the OPEN? IT IS TIME!","rating":8},{"id":1013019990340046800,"text":"To the great and brave men and women of ICE, do not worry or lose your spirit. You are doing a fantastic job of keeping us safe by eradicating the worst criminal elements. So brave! The radical left Dems want you out. Next it will be all police. Zero chance, It will never happen!","rating":5},{"id":1015278594795417600,"text":"Just won lawsuit filed by the DNC and a bunch of Democrat crazies trying to claim the Trump Campaign (and others), colluded with Russia. They haven’t figured out that this was an excuse for them losing the election!","rating":8},{"id":1207664621336825900,"text":"I got Impeached last night without one Republican vote being cast with the Do Nothing Dems on their continuation of the greatest Witch Hunt in American history. Now the Do Nothing Party want to Do Nothing with the Articles &amp, not deliver them to the Senate, but it’s Senate’s call!","rating":9},{"id":1183130243885875200,"text":"The Endless Wars Must End!","rating":7},{"id":1146245459268264000,"text":"A very sad time for America when the Supreme Court of the United States won’t allow a question of “Is this person a Citizen of the United States?” to be asked on the #2020 Census! Going on for a long time. I have asked the Department of Commerce and the Department of Justice....","rating":8},{"id":1118848431932493800,"text":"PRESIDENTIAL HARASSMENT!","rating":9},{"id":1224375193595981800,"text":"KEEP AMERICA GREAT!","rating":6},{"id":1239228460863819800,"text":"We are doing very precise Medical Screenings at our airports. Pardon the interruptions and delays, we are moving as quickly as possible, but it is very important that we be vigilant and careful. We must get it right. Safety first!","rating":5},{"id":1142055392488374300,"text":"....proportionate to shooting down an unmanned drone. I am in no hurry, our Military is rebuilt, new,  and ready to go, by far the best in the world. Sanctions are biting &amp, more added last night. Iran can NEVER have Nuclear Weapons, not against the USA, and not against the WORLD!","rating":6},{"id":1311051647687307300,"text":"Wow. Won’t let Poll Watchers &amp; Security into Philadelphia Voting Places. There is only one reason why. Corruption!!! Must have a fair Election.","rating":8},{"id":1098948459405721600,"text":"Highly respected Senator Richard Burr, head of Senate Intelligence, said, after interviewing over 200 witnesses and studying over 2 million pages of documents, “WE HAVE FOUND NO COLLUSION BETWEEN THE TRUMP CAMPAIGN AND RUSSIA.” The Witch Hunt, so bad for our Country, must end!","rating":7},{"id":1311308087593242600,"text":"Biden wants to Pack the Supreme Court, thereby ruining it. Also, he wants no fracking, killing our Energy business, and JOBS. Second Amendment is DEAD if Biden gets in! Is that what you want from a leader? He will destroy our Country! VOTE NOW USA.","rating":8},{"id":1301163707540660200,"text":"We had FAR more people (many millions) watching us at the RNC than did Sleepy Joe and the DNC, and yet an ad just ran saying the opposite. This is what we’re up against. Lies. But we will WIN!","rating":7},{"id":1180836237239816200,"text":"95% Approval Rating in Republican Party. Thank you!","rating":4},{"id":827002559122567200,"text":"Do you believe it? The Obama Administration agreed to take thousands of illegal immigrants from Australia. Why? I will study this dumb deal!","rating":6},{"id":1212066600771367000,"text":"Remember when Pelosi was screaming that President Trump is a danger to our nation and we must move quickly. They didn’t get one Republican House vote, and lost 3 Dems. They produced no case so now she doesn’t want to go to the Senate. She’s all lies. Most overrated person I know!","rating":8},{"id":1155822020845809700,"text":"Crazy Bernie Sanders recently equated the City of Baltimore to a THIRD WORLD COUNTRY! Based on that statement, I assume that Bernie must now be labeled a Racist, just as a Republican would if he used that term and standard! The fact is, Baltimore can be brought back, maybe......","rating":9},{"id":1144737559786020900,"text":"54% in Poll! I would be at 75% (with our great economy, maybe the best ever) if not for the Phony Witch Hunt and the Fake News Media!","rating":6},{"id":446461592029630460,"text":"It's almost like the United States has no President - we are a rudderless ship heading for a major disaster. Good luck everyone!","rating":7},{"id":1315741721142141000,"text":"So Biden is coughing and hacking and playing “fingers” with his mask, all over the place, and the Fake News doesn’t want to even think about discussing it. “Journalism” has reached the all time low in history. Sadly, Lamestream knows this and doesn’t even care!","rating":8},{"id":1237924658185470000,"text":"Hoping to get the payroll tax cut approved by both Republicans and Democrats, and please remember, very important for all countries &amp; businesses to know that trade will in no way be affected by the 30-day restriction on travel from Europe. The restriction stops people not goods.","rating":4},{"id":1269837128059453400,"text":"Colin Powell was a pathetic interview today on Fake News CNN. In his time, he was weak &amp; gave away everything to everybody - so bad for the USA. Also got the “weapons of mass destruction” totally wrong, and you know what that mistake cost us? Sad! Only negative questions asked.","rating":8},{"id":1322518594056573000,"text":"Joe Biden will PACK THE COURT. Also, he never gave the answer who his Radical Left Justices will be!","rating":6},{"id":1006296018210603000,"text":"The fact that I am having a meeting is a major loss for the U.S., say the haters &amp, losers. We have our hostages, testing, research and all missle launches have stoped, and these pundits, who have called me wrong from the beginning, have nothing else they can say! We will be fine!","rating":7},{"id":1223004106408833000,"text":"Working closely with China and others on Coronavirus outbreak. Only 5 people in U.S., all in good recovery.","rating":4},{"id":822502450007515100,"text":"The forgotten men and women of our country will be forgotten no longer. From this moment on, it’s going to be #AmericaFirst🇺🇸","rating":3},{"id":1150732346099978200,"text":"If Democrats want to unite around the foul language &amp, racist hatred spewed from the mouths and actions of these very unpopular &amp, unrepresentative Congresswomen, it will be interesting to see how it plays out. I can tell you that they have made Israel feel abandoned by the U.S.","rating":7},{"id":1221140946320085000,"text":"Any fair minded person watching the Senate trial today would be able to see how unfairly I have been treated and that this is indeed the totally partisan Impeachment Hoax that EVERYBODY, including the Democrats, truly knows it is. This should never be allowed to happen again!","rating":5},{"id":1145531966076477400,"text":"So many amazing things happened over the last three days. All, or at least most of those things, are great for the United States. Much was accomplished!","rating":2},{"id":1270787978626052000,"text":"...Our history as the Greatest Nation in the World will not be tampered with. Respect our Military!","rating":3},{"id":1055719340832686100,"text":"Funny how lowly rated CNN, and others, can criticize me at will, even blaming me for the current spate of Bombs and ridiculously comparing this to September 11th and the Oklahoma City bombing, yet when I criticize them they go wild and scream, “it’s just not Presidential!”","rating":9},{"id":1334858416523780000,"text":"A provision is in the NDAA for the renaming, or even desecration, of National Monuments in National Parks. This is not what our Country wants!","rating":4},{"id":875441788110110700,"text":"Crooked H destroyed phones w/ hammer, 'bleached' emails, &amp, had husband meet w/AG days before she was cleared- &amp, they talk about obstruction?","rating":6},{"id":1317570113051111400,"text":"Getting ready to land in Muskegon, Michigan. Another giant crowd. See you soon! #MAGA","rating":3},{"id":1205483006405808000,"text":"How do you get Impeached when you have done NOTHING wrong (a perfect call), have created the best economy in the history of our Country, rebuilt our Military, fixed the V.A. (Choice!), cut Taxes &amp, Regs, protected your 2nd A, created Jobs, Jobs, Jobs, and soooo much more? Crazy!","rating":8},{"id":1343915972391039000,"text":"....being removed and brought home from foreign lands who do NOTHING for us. A disgraceful act of cowardice and total submission by weak people to Big Tech. Negotiate a better Bill, or get better leaders, NOW! Senate should not approve NDAA until fixed!!!","rating":5},{"id":1098581869233344500,"text":"I want 5G, and even 6G, technology in the United States as soon as possible. It is far more powerful, faster, and smarter than the current standard. American companies must step up their efforts, or get left behind. There is no reason that we should be lagging behind on.........","rating":3},{"id":1120655199130017800,"text":"The Wall is being rapidly built! The Economy is GREAT! Our Country is Respected again!","rating":4},{"id":1224699832901800000,"text":"When will the Democrats start blaming RUSSIA, RUSSIA, RUSSIA, instead of their own incompetence for the voting disaster that just happened in the Great State of Iowa?","rating":7},{"id":1261650261862383600,"text":"We’ve done a GREAT job on Covid response, making all Governors look good, some fantastic (and that’s OK), but the Lamestream Media doesn’t want to go with that narrative, and the Do Nothing Dems talking point is to say only bad about “Trump”. I made everybody look good, but me!","rating":6},{"id":1096056426533998600,"text":"Disgraced FBI Acting Director Andrew McCabe pretends to be a “poor little Angel” when in fact he was a big part of the Crooked Hillary Scandal &amp, the Russia Hoax - a puppet for Leakin’ James Comey. I.G. report on McCabe was devastating. Part of “insurance policy” in case I won....","rating":5},{"id":1119923840161857500,"text":"138 people have been killed in Sri Lanka, with more that 600 badly injured, in a terrorist attack on churches and hotels. The United States offers heartfelt condolences to the great people of Sri Lanka. We stand ready to help!","rating":1},{"id":952166927476183000,"text":"AMERICA FIRST!","rating":6},{"id":1119928890162602000,"text":"Do you believe this? The New York Times Op-Ed: MEDIA AND DEMOCRATS OWE TRUMP AN APOLOGY. Well, they got that one right!","rating":7},{"id":1344142388063821800,"text":"...The consent decree signed by the “Secretary”, with the consent of Kemp, is perhaps even more poorly negotiated than the deal that John Kerry made with Iran. Now it turns out that Brad R’s brother works for China, and they definitely don’t want “Trump”. So disgusting! #MAGA","rating":9},{"id":1079045134061371400,"text":"Just had a long and very good call with President Xi of China. Deal is moving along very well. If made, it will be very comprehensive, covering all subjects, areas and points of dispute. Big progress being made!","rating":2},{"id":1061003186125856800,"text":"President Macron of France has just suggested that Europe build its own military in order to protect itself from the U.S., China and Russia. Very insulting, but perhaps Europe should first pay its fair share of NATO, which the U.S. subsidizes greatly!","rating":5},{"id":1294346904629805000,"text":"I am ready to send $105B to the states to help open schools safely with additional PPE. DEMOCRATS ARE HOLDING THIS UP!","rating":3},{"id":1079763419908243500,"text":"I’m in the Oval Office. Democrats, come back from vacation now and give us the votes necessary for Border Security, including the Wall. You voted yes in 2006 and 2013. One more yes, but with me in office, I’ll get it built, and Fast!","rating":4},{"id":1085915768003256300,"text":"So funny to watch Schumer groveling. He called for the firing of bad cop James Comey many times - UNTIL I FIRED HIM!","rating":8},{"id":1117787850399989800,"text":"THEY SPIED ON MY CAMPAIGN (We will never forget)!","rating":10},{"id":827480386120929300,"text":"Thank you to Prime Minister of Australia for telling the truth about our very civil conversation that FAKE NEWS media lied about. Very nice!","rating":4},{"id":1304042651147284500,"text":"Bob Woodward had my quotes for many months. If he thought they were so bad or dangerous, why didn’t he immediately report them in an effort to save lives? Didn’t he have an obligation to do so? No, because he knew they were good and proper answers. Calm, no panic!","rating":6},{"id":1300639323436523500,"text":"Kimberly Klacik is really working hard to help the people of Baltimore. She is running for Congress as a Republican, &amp; if she wins she will be an inspiration to all. She is strong on inner city rebuilding, healthcare, our Military &amp; Vets. She has my Complete &amp; Total Endorsement!","rating":3},{"id":1246123892550389800,"text":"GREAT news this week regarding the Keystone XL Pipeline – moving forward with fantastic paying CONSTRUCTION jobs for hardworking Americans. Promises Made, Promises Kept! #MAGA","rating":5},{"id":1298404245629284400,"text":"80 Million Unsolicited Ballots are impossible for election centers to tabulate accurately. The Democrats know this better than anyone else. The fraud and abuse will be an embarrassment to our Country. Hopefully the Courts will stop this scam!","rating":7},{"id":1139263782142787600,"text":"....She is a very special person with extraordinary talents, who has done an incredible job! I hope she decides to run for Governor of Arkansas - she would be fantastic. Sarah, thank you for a job well done!","rating":3},{"id":1161439036256526300,"text":"No debate on Election Security should go forward without first agreeing that Voter ID (Identification) must play a very strong part in any final agreement. Without Voter ID, it is all so meaningless!","rating":5},{"id":1028052897563590700,"text":"Thank you to Kanye West and the fact that he is willing to tell the TRUTH. One new and great FACT - African American unemployment is the lowest ever recorded in the history of our Country. So honored by this. Thank you Kanye for your support. It is making a big difference!","rating":6},{"id":1030116078125568000,"text":"The Queen of Soul, Aretha Franklin, is dead. She was a great woman, with a wonderful gift from God, her voice. She will be missed!","rating":2},{"id":1220818115354923000,"text":"China has been working very hard to contain the Coronavirus. The United States greatly appreciates their efforts and transparency. It will all work out well. In particular, on behalf of the American People, I want to thank President Xi!","rating":7},{"id":965075589274177500,"text":"Very sad that the FBI missed all of the many signals sent out by the Florida school shooter. This is not acceptable. They are spending too much time trying to prove Russian collusion with the Trump campaign - there is no collusion. Get back to the basics and make us all proud!","rating":5},{"id":827981079042805800,"text":"What is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.?","rating":6},{"id":1265252781226590200,"text":"Joe Biden’s handling of the H1N1 Swine Flu was a complete and total disaster. Even polls on the matter were terrible!","rating":5},{"id":950103659337134100,"text":"The Fake News Awards, those going to the most corrupt &amp, biased of the Mainstream Media, will be presented to the losers on Wednesday, January 17th, rather than this coming Monday. The interest in, and importance of, these awards is far greater than anyone could have anticipated!","rating":8},{"id":1018197842559725600,"text":"These Russian individuals did their work during the Obama years. Why didn’t Obama do something about it?  Because he thought Crooked Hillary Clinton would win, that’s why. Had nothing to do with the Trump Administration, but Fake News doesn’t want to report the truth, as usual!","rating":6},{"id":932420488642617300,"text":"Border Patrol Officer killed at Southern Border, another badly hurt. We will seek out and bring to justice those responsible. We will, and must, build the Wall!","rating":7},{"id":1034783131855999000,"text":"When you see “anonymous source,” stop reading the story, it is fiction!","rating":5},{"id":1092181733825491000,"text":"With Caravans marching through Mexico and toward our Country, Republicans must be prepared to do whatever is necessary for STRONG Border Security. Dems do nothing. If there is no Wall, there is no Security. Human Trafficking, Drugs and Criminals of all dimensions - KEEP OUT!","rating":7},{"id":1092787440560078800,"text":"Tremendous numbers of people are coming up through Mexico in the hopes of flooding our Southern Border. We have sent additional military. We will build a Human Wall if necessary. If we had a real Wall, this would be a non-event!","rating":7},{"id":948548807612084200,"text":"Such respect for the people of Iran as they try to take back their corrupt government. You will see great support from the United States at the appropriate time!","rating":4},{"id":1094035813820784600,"text":"North Korea, under the leadership of Kim Jong Un, will become a great Economic Powerhouse. He may surprise some but he won’t surprise me, because I have gotten to know him &amp, fully understand how capable he is. North Korea will become a different kind of Rocket - an Economic one!","rating":8},{"id":830741932099960800,"text":"The crackdown on illegal criminals is merely the keeping of my campaign promise. Gang members, drug dealers &amp, others are being removed!","rating":6},{"id":1323304926005452800,"text":"Texas, Pennsylvania:\n Biden is against Second Amendment and Fracking. Please remember!","rating":5},{"id":1294264832200515600,"text":"Today, we honor the brave Native American/First Nations soldiers who served our Nation and played a vital role in America's victory in WWII. The Navajo Code was never broken and saved untold American lives. Our country will be forever grateful. Happy Navajo Code Talkers Day!","rating":4},{"id":1154000946046951400,"text":"KEEP AMERICA GREAT!","rating":3},{"id":1098195686540169200,"text":"The Press has never been more dishonest than it is today. Stories are written that have absolutely no basis in fact. The writers don’t even call asking for verification. They are totally out of control. Sadly, I kept many of them in business. In six years, they all go BUST!","rating":7},{"id":1066480700046655500,"text":"....All will stay in Mexico. If for any reason it becomes necessary, we will CLOSE our Southern Border. There is no way that the United States will, after decades of abuse, put up with this costly and dangerous situation anymore!","rating":5},{"id":1083759500618805200,"text":"...The Steel Barrier, or Wall, should have been built by previous administrations long ago. They never got it done - I will. Without it, our Country cannot be safe. Criminals, Gangs, Human Traffickers, Drugs &amp, so much other big trouble can easily pour in. It can be stopped cold!","rating":6},{"id":1166176076952940500,"text":"Just returned to Washington from France and the very successful G-7, only to find that the Fake News is still trying to perpetuate the phony story that I wanted to use Nuclear weapons to blow up hurricanes before they reach shore. This is so ridiculous, never happened!","rating":9},{"id":1079763923845419000,"text":"It’s incredible how Democrats can all use their ridiculous sound bite and say that a Wall doesn’t work. It does, and properly built, almost 100%! They say it’s old technology - but so is the wheel. They now say it is immoral- but it is far more immoral for people to be dying!","rating":7},{"id":919914000959397900,"text":"I was recently asked if Crooked Hillary Clinton is going to run in 2020? My answer was, \"\"I hope so!\"\"","rating":6},{"id":1227661693376962600,"text":"It is very important for our Country’s SECURITY that the United States Senate not vote for the Iran War Powers Resolution. We are doing very well with Iran and this is not the time to show weakness. Americans overwhelmingly support our attack on terrorist Soleimani....","rating":5},{"id":828343072840900600,"text":"I have instructed Homeland Security to check people coming into our country VERY CAREFULLY. The courts are making the job very difficult!","rating":4},{"id":1205334980055961600,"text":"Nancy Pelosi just got duped in an interview to admitting that she has been working on impeaching me for “two and a half years.” In other words, she lied. This was the Radical Left, Do Nothing Democrats plan all along, long before the Ukraine phone call. Impeachment Hoax!","rating":7},{"id":956134228726558700,"text":"Tremendous investment by companies from all over the world being made in America. There has never been anything like it. Now Disney, J.P. Morgan Chase and many others. Massive Regulation Reduction and Tax Cuts are making us a powerhouse again. Long way to go! Jobs, Jobs, Jobs!","rating":3},{"id":1203109065070665700,"text":"Why is the World Bank loaning money to China? Can this be possible? China has plenty of money, and if they don’t, they create it. STOP!","rating":6},{"id":1135971860762439700,"text":"Just had a big victory in Federal Court over the Democrats in the House on the desperately needed Border Wall. A big step in the right direction. Wall is under construction!","rating":4},{"id":1076844349860823000,"text":"The only way to stop drugs, gangs, human trafficking, criminal elements and much else from coming into our Country is with a Wall or Barrier. Drones and all of the rest are wonderful and lots of fun, but it is only a good old fashioned Wall that works!","rating":5},{"id":1230376522663391200,"text":"Mini Mike Bloomberg’s debate performance tonight was perhaps the worst in the history of debates, and there have been some really bad ones. He was stumbling, bumbling and grossly incompetent. If this doesn’t knock him out of the race, nothing will. Not so easy to do what I did!","rating":8},{"id":1086458937002680300,"text":"Remember it was Buzzfeed that released the totally discredited “Dossier,” paid for by Crooked Hillary Clinton and the Democrats (as opposition research), on which the entire Russian probe is based! A very sad day for journalism, but a great day for our Country!","rating":6},{"id":1260912207027675100,"text":"I don’t know the so-called Whistleblower Rick Bright, never met him or even heard of him, but to me he is a disgruntled employee, not liked or respected by people I spoke to and who, with his attitude, should no longer be working for our government!","rating":7},{"id":1281236412667433000,"text":"Courts in the past have given “broad deference”. BUT NOT ME!","rating":8},{"id":1259852364326015000,"text":"The great people of Pennsylvania want their freedom now, and they are fully aware of what that entails. The Democrats are moving slowly, all over the USA, for political purposes. They would wait until November 3rd if it were up to them. Don’t play politics. Be safe, move quickly!","rating":6},{"id":799974635274195000,"text":"The Theater must always be a safe and special place.The cast of Hamilton was very rude last night to a very good man, Mike Pence. Apologize!","rating":9},{"id":1095699493440446500,"text":"The Gallup Poll just announced that 69% of our great citizens expect their finances to improve next year, a 16 year high. Nice!","rating":4},{"id":1125191944525832200,"text":"Once again, Israel faces a barrage of deadly rocket attacks by terrorist groups Hamas and Islamic Jihad. We support Israel 100% in its defense of its citizens....","rating":3},{"id":1310217371307606000,"text":"Wow, nobody realized how far Mini Mike Bloomberg went in bribing ex-prisoners to go out and vote for Sleepy Joe. He is desperate to get back into the good graces of the people who not only badly beat him, but made him look like a total fool. Now he’s committed a serious crime!","rating":9},{"id":1238113667754995700,"text":"Many Republican Senators want me to Veto the FISA Bill until we find out what led to, and happened with, the illegal attempted “coup” of the duly elected President of the United States, and others!","rating":5},{"id":1271096748983955500,"text":"The Federal Reserve is wrong so often. I see the numbers also, and do MUCH better than they do. We will have a very good Third Quarter, a great Fourth Quarter, and one of our best ever years in 2021. We will also soon have a Vaccine &amp; Therapeutics/Cure. That’s my opinion. WATCH!","rating":7},{"id":1338246164756521000,"text":"...Tens of millions of haphazardly ballots sent, with some people getting two, three, or four ballots. We will never give up!","rating":6},{"id":1094667183953719300,"text":"....The fact is, when I took over as President, our Country was a mess. Depleted Military, Endless Wars, a potential War with North Korea, V.A., High Taxes &amp, too many Regulations, Border, Immigration &amp, HealthCare problems, &amp, much more. I had no choice but to work very long hours!","rating":5},{"id":1295385113862090800,"text":"Some states use “drop boxes” for the collection of Universal Mail-In Ballots. So who is going to “collect” the Ballots, and what might be done to them prior to tabulation? A Rigged Election? So bad for our Country. Only Absentee Ballots acceptable!","rating":7},{"id":1304904040552124400,"text":"On my way, Nevada!","rating":2},{"id":1259450009734516700,"text":"When are the Fake Journalists, who received unwarranted Pulitzer Prizes for Russia, Russia, Russia, and the Impeachment Scam, going to turn in their tarnished awards so they can be given to the real journalists who got it right. I’ll give you the names, there are plenty of them!","rating":6},{"id":1116502929542922200,"text":"JOBLESS CLAIMS AT 50 YEAR LOW!","rating":3},{"id":1097469642048716800,"text":"Wow, so many lies by now disgraced acting FBI Director Andrew McCabe. He was fired for lying, and now his story gets even more deranged. He and Rod Rosenstein, who was hired by Jeff Sessions (another beauty), look like they were planning a very illegal act, and got caught.....","rating":6},{"id":1202792805753598000,"text":"Where’s the Fake Whistleblower? Where’s Whistleblower number 2? Where’s the phony informer who got it all wrong?","rating":5},{"id":1203387521402638300,"text":"Our Economy is the envy of the World!","rating":4},{"id":1303292111136190500,"text":"BLM Protesters horribly harass elderly Pittsburgh diners, scaring them with loud taunts while taking their food right off their plate. These Anarchists, not protesters, are Biden voters, but he has no control and nothing to say. Disgraceful. Never seen anything like it. Thugs!","rating":8},{"id":1158950196560171000,"text":"Beto (phony name to indicate Hispanic heritage) O’Rourke, who is embarrassed by my last visit to the Great State of Texas, where I trounced him, and is now even more embarrassed by polling at 1% in the Democrat Primary, should respect the victims &amp, law enforcement - &amp, be quiet!","rating":7},{"id":1322868385361891300,"text":"When I originally became your all time favorite President, the Great State of Michigan was hemorrhaging car companies and jobs. Plants were closing and moving to Mexico, and other places. No new plants for decades. I stopped the moves, &amp; now many plants are and have been built...","rating":3},{"id":1025115155632455700,"text":"They asked my daughter Ivanka whether or not the media is the enemy of the people. She correctly said no. It is the FAKE NEWS, which is a large percentage of the media, that is the enemy of the people!","rating":6},{"id":949616329463615500,"text":"Now that Russian collusion, after one year of intense study, has proven to be a total hoax on the American public, the Democrats and their lapdogs, the Fake News Mainstream Media, are taking out the old Ronald Reagan playbook and screaming mental stability and intelligence.....","rating":7},{"id":1118324360383746000,"text":"I believe it will be Crazy Bernie Sanders vs. Sleepy Joe Biden as the two finalists to run against maybe the best Economy in the history of our Country (and MANY other great things)! I look forward to facing whoever it may be. May God Rest Their Soul!","rating":8},{"id":1134538166919204900,"text":"As we celebrate LGBT Pride Month and recognize the outstanding contributions LGBT people have made to our great Nation, let us also stand in solidarity with the many LGBT people who live in dozens of countries worldwide that punish, imprison, or even execute individuals....","rating":2},{"id":1006839007492309000,"text":"Before taking office people were assuming that we were going to War with North Korea. President Obama said that North Korea was our biggest and most dangerous problem. No longer - sleep well tonight!","rating":5},{"id":1265255835124539400,"text":"There is NO WAY (ZERO!) that Mail-In Ballots will be anything less than substantially fraudulent. Mail boxes will be robbed, ballots will be forged &amp; even illegally printed out &amp; fraudulently signed. The Governor of California is sending Ballots to millions of people, anyone.....","rating":9},{"id":1224702718754857000,"text":"The Democrat Party in Iowa really messed up, but the Republican Party did not. I had the largest re-election vote in the history of that great state, by far, beating President Obama’s previous record by a lot. Also, 97% Plus of the vote! Thank you Iowa!","rating":4},{"id":1090967053689937900,"text":"Democrats are becoming the Party of late term abortion, high taxes, Open Borders and Crime!","rating":5},{"id":1320076289034850300,"text":"Joe Biden = Biggest Tax Increase In History and The Complete Obliteration Of Your Second Amendment!","rating":7},{"id":1103996973525413900,"text":"I cannot believe the level of dishonesty in the media. It is totally out of control, but we are winning!","rating":6},{"id":1073965319184678900,"text":"Never in the history of our Country has the “press” been more dishonest than it is today. Stories that should be good, are bad. Stories that should be bad, are horrible. Many stories, like with the REAL story on Russia, Clinton &amp, the DNC, seldom get reported. Too bad!","rating":7},{"id":1056879122348195800,"text":"There is great anger in our Country caused in part by inaccurate, and even fraudulent, reporting of the news. The Fake News Media, the true Enemy of the People, must stop the open &amp, obvious hostility &amp, report the news accurately &amp, fairly. That will do much to put out the flame...","rating":8},{"id":1070877666654519300,"text":"FAKE NEWS - THE ENEMY OF THE PEOPLE!","rating":9},{"id":1252331100367663000,"text":"I will be having a White House Press Conference today at 5:30 P.M. Thank you!","rating":3},{"id":1288509572223651800,"text":"...Your housing prices will go up based on the market, and crime will go down. I have rescinded the Obama-Biden AFFH Rule. Enjoy!","rating":5},{"id":1302628942680068000,"text":"Big Ten Football is looking really good, but may lose Michigan, Illinois, and Maryland because of those Governors’ ridiculous lack of interest or political support. They will play without them?","rating":7},{"id":995085901079433200,"text":"Big week next week when the American Embassy in Israel will be moved to Jerusalem. Congratulations to all!","rating":4},{"id":1189506762904395800,"text":"The Greatest Economy in American History!","rating":2},{"id":1217808535091916800,"text":"Cryin’ Chuck Schumer is saying privately that the new China Trade Deal is  unbelievable, which it is, but publicly he knocks it whenever possible. That’s politics, but so bad for our great Country!","rating":6},{"id":1156345333997363200,"text":"Wow! A federal Judge in the Southern District of N.Y. completely dismissed a lawsuit brought by the Democratic National Committee against our historic 2016 campaign for President. The Judge said the DNC case was “entirely divorced” from the facts, yet another total &amp, complete....","rating":6},{"id":925534445393928200,"text":"I have just ordered Homeland Security to step up our already Extreme Vetting Program. Being politically correct is fine, but not for this!","rating":5},{"id":1299124203552211000,"text":"Democrats and Biden didn’t even mention the Anarchists, Agitators, Looters and so called “Peaceful Protesters” at their Convention. They will allow rampant crime, just as they do in Portland. If they ask us, as they must do, we will end crime in their Democrat run cities, FAST!","rating":7},{"id":1265606608211660800,"text":"New papers make CLEAR that the Obama Administration SPIED, in an unprecedented manner, on the Trump Campaign and beyond, and even on the United States Senate. Nobody would ever have believed that this level of illegality and corruption would be taking place in our beautiful USA!","rating":8},{"id":1273985172472500200,"text":"Why are the Democrats allowed to make fake and fraudulent ads. They should be called out. They did nothing when they had the chance. I have done FAR more than any President in first 3 1/2 years!","rating":7},{"id":990559834020962300,"text":"Just got recent Poll - much higher than President O at same time....Well, much more has been accomplished!","rating":5},{"id":1297152619526393900,"text":"In New Jersey they want you to certify that you asked for the Universal Mail-In Ballot that they sent you. But you never asked for it. Disaster in the wings!","rating":5},{"id":1221805273695780900,"text":"Schiff must release the IG report, without changes or tampering, which is said to be yet further exoneration of the Impeachment Hoax. He refuses to give it. Does it link him to Whistleblower? Why is he so adamant?","rating":6},{"id":1143128642878410800,"text":"China gets 91% of its Oil from the Straight, Japan 62%, &amp, many other countries likewise. So why are we protecting the shipping lanes for other countries (many years) for zero compensation. All of these countries should be protecting their own ships on what has always been....","rating":4},{"id":1097113815672647700,"text":"52% Approval Rating, 93% in Republican Party ( a record )! Pretty amazing considering that 93% (also) of my press is REALLY BAD. The “people” are SMART!","rating":6},{"id":1323327227358974000,"text":"“No President in history has done more for OHIO than President Trump.”","rating":6},{"id":1046135994267963400,"text":"Senator Richard Blumenthal must talk about his fraudulent service in Vietnam, where for 12 years he told the people of Connecticut, as their Attorney General, that he was a great Marine War Hero. Talked about his many battles of near death, but was never in Vietnam. Total Phony!","rating":8},{"id":1172639954985455600,"text":"While I like the Vaping alternative to Cigarettes, we need to make sure this alternative is SAFE for ALL! Let’s get counterfeits off the market, and keep young children from Vaping!","rating":5},{"id":1052183647552491500,"text":"The United States has strongly informed the President of Honduras that if the large Caravan of people heading to the U.S. is not stopped and brought back to Honduras, no more money or aid will be given to Honduras, effective immediately!","rating":6},{"id":1009928980475138000,"text":"We have to maintain strong borders or we will no longer have a country that we can be proud of – and if we show any weakness, millions of people will journey into our country.","rating":5},{"id":1301638082484150300,"text":"Joe Hiden’ gets off his airplane, grabs and shakes a rather stunned man’s hand (like in the old days), then touches his (Joe’s) face and mask with the same hand. No crowd, no enthusiasm for Joe today. Law &amp; Order!","rating":7},{"id":933662564587855900,"text":"MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1265601611310739500,"text":"Republicans feel that Social Media Platforms totally silence conservatives voices. We will strongly regulate, or close them down, before we can ever allow this to happen. We saw what they attempted to do, and failed, in 2016. We can’t let a more sophisticated version of that....","rating":6},{"id":1011295779422695400,"text":"Congresswoman Maxine Waters, an extraordinarily low IQ person, has become, together with Nancy Pelosi, the Face of the Democrat Party. She has just called for harm to supporters, of which there are many, of the Make America Great Again movement. Be careful what you wish for Max!","rating":8},{"id":946731576687235100,"text":"The Democrats have been told, and fully understand, that there can be no DACA without the desperately needed WALL at the Southern Border and an END to the horrible Chain Migration &amp, ridiculous Lottery System of Immigration etc. We must protect our Country at all cost!","rating":7},{"id":1301253108404613000,"text":"Mayor Wheeler just got harassed out of his own home in Portland by so-called “friendly protesters”. The Anarchists, Agitators and Looters treat him HORRIBLY, even though he is so nice and respectful to them. Criminals only understand strength!","rating":8},{"id":1146842028975841300,"text":"Looks like a lot of people already heading to SALUTE TO AMERICA at Lincoln Memorial. It will be well worth the trip and wait. See you there at 6:00 P.M. Amazing music and bands. Thank you ARMY!","rating":3},{"id":1184687862090010600,"text":"“About 500,000 human beings were killed in Syria while Barack Obama was president &amp, leading for a “political settlement” to that civil war. Media has been more outraged in the last 72 hours over our Syria policy than they were at any point during 7 years of slaughter.” BuckSexton","rating":5},{"id":1084938160516169700,"text":"For decades, politicians promised to secure the border, fix our trade deals, bring back our factories, get tough on China, move the Embassy to Jerusalem, make NATO pay their fair share, and so much else - only to do NOTHING (or worse)....","rating":4},{"id":828797801630937100,"text":"The threat from radical Islamic terrorism is very real, just look at what is happening in Europe and the Middle-East. Courts must act fast!","rating":6},{"id":1071898088267284500,"text":"The Trump Administration has accomplished more than any other U.S. Administration in its first two (not even) years of existence, &amp, we are having a great time doing it! All of this despite the Fake News Media, which has gone totally out of its mind-truly the Enemy of the People!","rating":7},{"id":1211030803179876400,"text":"I want to thank Rush Limbaugh for the tremendous support he has given to the MAKE AMERICA GREAT AGAIN Movement and our KEEP AMERICA GREAT Agenda! He is a major star who never wavered despite the Fake News Hits he has had to endure. His voice is far bigger than theirs!","rating":4},{"id":1054351078328885200,"text":"Sadly, it looks like Mexico’s Police and Military are unable to stop the Caravan heading to the Southern Border of the United States. Criminals and unknown Middle Easterners are mixed in. I have alerted Border Patrol and Military that this is a National Emergy. Must change laws!","rating":8},{"id":1253688241947107300,"text":"Just spoke to my friend, President Joko Widodo of the Republic of Indonesia. Asking for Ventilators, which we will provide. Great cooperation between us!","rating":2},{"id":909384837018112000,"text":"I spoke with President Moon of South Korea last night. Asked him how Rocket Man is doing. Long gas lines forming in North Korea. Too bad!","rating":7},{"id":1272532925460906000,"text":"Our testing is so much bigger and more advanced than any other country (we have done a great job on this!) that it shows more cases. Without testing, or weak testing, we would be showing almost no cases. Testing is a double edged sword - Makes us look bad, but good to have!!!","rating":5},{"id":1220752219601088500,"text":"The Do Nothing Democrats just keep repeating and repeating, over and over again, the same old “stuff” on the Impeachment Hoax. They want to use up ALL of their time, even though it is the wrong thing to do. They ought to go back to work for our great American people!","rating":4},{"id":940554567414091800,"text":"Despite thousands of hours wasted and many millions of dollars spent, the Democrats have been unable to show any collusion with Russia - so now they are moving on to the false accusations and fabricated stories of women who I don’t know and/or have never met. FAKE NEWS!","rating":7},{"id":1176559966024556500,"text":"I am currently at the United Nations representing our Country, but have authorized the release tomorrow of the complete, fully declassified and unredacted transcript of my phone conversation with President Zelensky of Ukraine....","rating":3},{"id":949287555660501000,"text":"Well, now that collusion with Russia is proving to be a total hoax and the only collusion is with Hillary Clinton and the FBI/Russia, the Fake News Media (Mainstream) and this phony new book are hitting out at every new front imaginable. They should try winning an election. Sad!","rating":6},{"id":1069441198157455400,"text":"China has agreed to reduce and remove tariffs on cars coming into China from the U.S. Currently the tariff is 40%.","rating":2},{"id":1333410419554345000,"text":"....Also, quickly check the number of envelopes versus the number of ballots. You may just find that there are many more ballots than there are envelopes. So simple, and so easy to do. Georgia Republicans are angry, all Republicans are angry. Get it done!","rating":8},{"id":1056919064906469400,"text":"Many Gang Members and some very bad people are mixed into the Caravan heading to our Southern Border. Please go back, you will not be admitted into the United States unless you go through the legal process. This is an invasion of our Country and our Military is waiting for you!","rating":6},{"id":989854486310113300,"text":"Kanye West has performed a great service to the Black Community - Big things are happening and eyes are being opened for the first time in Decades - Legacy Stuff! Thank you also to Chance and Dr. Darrell Scott, they really get it (lowest Black &amp, Hispanic unemployment in history).","rating":5},{"id":1086291782202257400,"text":"Never seen the Republican Party so unified. No “Cave” on the issue of Border and National Security. A beautiful thing to see, especially when you hear the new rhetoric spewing from the mouths of the Democrats who talk Open Border, High Taxes and Crime. Stop Criminals &amp, Drugs now!","rating":4},{"id":952301373479104500,"text":"So much Fake News is being reported. They don’t even try to get it right, or correct it when they are wrong. They promote the Fake Book of a mentally deranged author, who knowingly writes false information. The Mainstream Media is crazed that WE won the election!","rating":8},{"id":1319254290733633500,"text":"The GREAT Bobby Bowden, one of the best coaches EVER in College Football, on his full recovery from Covid-19 “....America is the greatest country this side of heaven. I’ve had a chance to get a lot of wins in my life, but I really wanted to win this one because I wanted....","rating":4},{"id":1212734794762784800,"text":"A lot of very good people were taken down by a small group of Dirty (Filthy) Cops, politicians, government officials, and an investigation that was illegally started &amp, that SPIED on my campaign. The Witch Hunt is sputtering badly, but still going on (Ukraine Hoax!). If this....","rating":7},{"id":939485131693322200,"text":"CNN’S slogan is CNN, THE MOST TRUSTED NAME IN NEWS. Everyone knows this is not true, that this could, in fact, be a fraud on the American Public. There are many outlets that are far more trusted than Fake News CNN. Their slogan should be CNN, THE LEAST TRUSTED NAME IN NEWS!","rating":9},{"id":901263061511794700,"text":"I am pleased to inform you that I have just granted a full Pardon to 85 year old American patriot Sheriff Joe Arpaio. He kept Arizona safe!","rating":6},{"id":1197293250115014700,"text":"Today I opened a major Apple Manufacturing plant in Texas that will bring high paying jobs back to America. Today Nancy Pelosi closed Congress because she doesn’t care about American Workers!","rating":5},{"id":1027586174448218100,"text":"Space Force all the way!","rating":7},{"id":1165277725541765000,"text":"When I looked up to the sky and jokingly said “I am the chosen one,” at a press conference two days ago, referring to taking on Trade with China, little did I realize that the media would claim that I had a “Messiah complex.” They knew I was kidding, being sarcastic, and just....","rating":10},{"id":1335351633459310600,"text":"...We received more LEGAL votes by far. All I can do is run, campaign, and be a good (great!) President – it is 100% up to the states to manage the election. Republicans will NEVER forget this.","rating":5},{"id":949608746497577000,"text":"The African American unemployment rate fell to 6.8%, the lowest rate in 45 years. I am so happy about this News! And, in the Washington Post (of all places), headline states, “Trumps first year jobs numbers were very, very good.”","rating":3},{"id":1121738863486095400,"text":"“President Donald J. Trump is the greatest hostage negotiator that I know of in the history of the United States. 20 hostages, many in impossible circumstances, have been released in last two years. No money was paid.” Cheif Hostage Negotiator, USA!","rating":7},{"id":1046473870650290200,"text":"Wow! Just starting to hear the Democrats, who are only thinking Obstruct and Delay, are starting to put out the word that the “time” and “scope” of FBI looking into Judge Kavanaugh and witnesses is not enough. Hello! For them, it will never be enough - stay tuned and watch!","rating":6},{"id":1320009047593156600,"text":"Our Economy is doing great, and is ready to set new records - best ever (Again!). Biden will destroy everything with his massive Tax Increases. Don’t let it happen!!!","rating":7},{"id":882061157900718100,"text":"North Korea has just launched another missile. Does this guy have anything better to do with his life? Hard to believe that South Korea.....","rating":8},{"id":965582280772276200,"text":"Have a great, but very reflective, President’s Day!","rating":3},{"id":1300170576515027000,"text":"Ted Wheeler, the wacky Radical Left Do Nothing Democrat Mayor of Portland, who has watched great death and destruction of his City during his tenure, thinks this lawless situation should go on forever. Wrong! Portland will never recover with a fool for a Mayor....","rating":9},{"id":1112091249153134600,"text":"Mexico must use its very strong immigration laws to stop the many thousands of people trying to get into the USA. Our detention areas are maxed out &amp, we will take no more illegals. Next step is to close the Border! This will also help us with stopping the Drug flow from Mexico!","rating":8},{"id":1281236214646034400,"text":"The Supreme Court sends case back to Lower Court, arguments to continue. This is all a political prosecution. I won the Mueller Witch Hunt, and others, and now I have to keep fighting in a politically corrupt New York. Not fair to this Presidency or Administration!","rating":7},{"id":1189198831193411600,"text":"Nervous Nancy Pelosi is doing everything possible to destroy the Republican Party. Our Polls show that it is going to be just the opposite. The Do Nothing Dems will lose many seats in 2020. They have a Death Wish, led by a corrupt politician, Adam Schiff!","rating":8},{"id":1345149558154797000,"text":"....is therefore both illegal and invalid, and that would include the two current Senatorial Elections. In Wisconsin, Voters not asking for applications invalidates the Election. All of this without even discussing the millions of fraudulent votes that were cast or altered!","rating":8},{"id":1322170415700152300,"text":"I would NEVER have taken the endorsement of the man who, through gross incompetence, poisoned the people of Flint, Michigan. Former RINO Governor Rick Snyder should be ashamed of himself and his service. I was asked to help fix it. Biden took his endorsement. VOTE TRUMP!!!","rating":9},{"id":1111611173131165700,"text":"On this Vietnam War Veterans Day, we celebrate the brave Vietnam Veterans and all of America’s Veterans. Thank you for your service to our great Nation!","rating":2},{"id":1322150249255895000,"text":"More Testing equals more Cases. We have best testing. Deaths WAY DOWN. Hospitals have great additional capacity! Doing much better than Europe. Therapeutics working!","rating":8},{"id":1273603410340843500,"text":"Bolton’s book, which is getting terrible reviews, is a compilation of lies and made up stories, all intended to make me look bad. Many of the ridiculous statements he attributes to me were never made, pure fiction. Just trying to get even for firing him like the sick puppy he is!","rating":8},{"id":1263282490099327000,"text":"Spokesman speaks stupidly on behalf of China, trying desperately to deflect the pain and carnage that their country spread throughout the world. Its disinformation and propaganda attack on the United States and Europe is a disgrace....","rating":7},{"id":954674157144477700,"text":"Democrats are far more concerned with Illegal Immigrants than they are with our great Military or Safety at our dangerous Southern Border. They could have easily made a deal but decided to play Shutdown politics instead. #WeNeedMoreRepublicansIn18 in order to power through mess!","rating":6},{"id":1061171030801158100,"text":"I am in Paris getting ready to celebrate the end of World War One. Is there anything better to celebrate than the end of a war, in particular that one, which was one of the bloodiest and worst of all time?","rating":3},{"id":1297604008832573400,"text":"Chris Wallace “forgot” to ask a very weak and pathetic Schumer puppet, Senator Chrisie Coons, why Biden fought me when I put an extremely early BAN on people coming into our Country from heavily infected China. Biden later admitted I was right! But why no question?","rating":7},{"id":1227561237782855700,"text":"Congratulations to Attorney General Bill Barr for taking charge of a case that was totally out of control and perhaps should not have even been brought. Evidence now clearly shows that the Mueller Scam was improperly brought &amp; tainted. Even Bob Mueller lied to Congress!","rating":6},{"id":1271644265014276000,"text":"We had previously scheduled our #MAGA Rally in Tulsa, Oklahoma, for June 19th – a big deal. Unfortunately, however, this would fall on the Juneteenth Holiday. Many of my African American friends and supporters have reached out to suggest that we consider changing the date out...","rating":5},{"id":934080974773776400,"text":"Horrible and cowardly terrorist attack on innocent and defenseless worshipers in Egypt. The world cannot tolerate terrorism, we must defeat them militarily and discredit the extremist ideology that forms the basis of their existence!","rating":3},{"id":1218952496388956200,"text":"I will be going to Austin, Texas. Leaving soon. Always like (love!) being in the Lone Star State. Speaking to our great Farmers. They hit “paydirt” with our incredible new Trade Deals: CHINA, JAPAN, MEXICO, CANADA, SOUTH KOREA, and many others!","rating":4},{"id":1110586787808903200,"text":"The Republican Party will become “The Party of Healthcare!”","rating":6},{"id":1086626739835625500,"text":"Mexico is doing NOTHING to stop the Caravan which is now fully formed and heading to the United States. We stopped the last two - many are still in Mexico but can’t get through our Wall, but it takes a lot of Border Agents if there is no Wall. Not easy!","rating":5},{"id":1054356145798856700,"text":"Guatemala, Honduras and El Salvador were not able to do the job of stopping people from leaving their country and coming illegally to the U.S. We will now begin cutting off, or substantially reducing, the massive foreign aid routinely given to them.","rating":5},{"id":1015947163292008400,"text":"The U.S. is working very closely with the Government of Thailand to help get all of the children out of the cave and to safety. Very brave and talented people!","rating":3},{"id":1086991976598245400,"text":"Don’t forget, we are building and renovating big sections of Wall right now. Moving quickly, and will cost far less than previous politicians thought possible. Building, after all, is what I do best, even when money is not readily available!","rating":5},{"id":1250056263746162700,"text":"The Democrats don’t want to approve more money for our great workers under the incredibly successful “Paycheck” plan. Replenish Account Now!","rating":4},{"id":1180484483147059200,"text":"Somebody please wake up Mitt Romney and tell him that my conversation with the Ukrainian President was a congenial and very appropriate one, and my statement on China pertained to corruption, not politics. If Mitt worked this hard on Obama, he could have won. Sadly, he choked!","rating":7},{"id":1265612405784162300,"text":"We are acting as a police force, not the fighting force that we are, in Afghanistan. After 19 years, it is time for them to police their own Country. Bring our soldiers back home but closely watch what is going on and strike with a thunder like never before, if necessary!","rating":6},{"id":1251552150024589300,"text":"I will be having a White House Press Conference today at 5:00 P.M. Thank you!","rating":2},{"id":1055822810940129300,"text":"Twitter has removed many people from my account and, more importantly, they have seemingly done something that makes it much harder to join - they have stifled growth to a point where it is obvious to all. A few weeks ago it was a Rocket Ship, now it is a Blimp! Total Bias?","rating":7},{"id":1005982266496094200,"text":"Why should I, as President of the United States, allow countries to continue to make Massive Trade Surpluses, as they have for decades, while our Farmers, Workers &amp, Taxpayers have such a big and unfair price to pay? Not fair to the PEOPLE of America! $800 Billion Trade Deficit...","rating":5},{"id":981492087328792600,"text":"We are not in a trade war with China, that war was lost many years ago by the foolish, or incompetent, people who represented the U.S. Now we have a Trade Deficit of $500 Billion a year, with Intellectual Property Theft of another $300 Billion. We cannot let this continue!","rating":4},{"id":1281556745211523000,"text":"Mail-In Ballot fraud found in many elections. People are just now seeing how bad, dishonest and slow it is. Election results could be delayed for months. No more big election night answers? 1% not even counted in 2016. Ridiculous! Just a formula for RIGGING an Election....","rating":6},{"id":1259194224555298800,"text":"Why is it that all of the political pundits &amp; consultants that I beat so easily &amp; badly, people that charged their clients far more than their services were worth, have become so totally “unhinged” when it come to your favorite President, me. These people are stone cold crazy!","rating":8},{"id":1143892329582997500,"text":"....invited Megan or the team, but I am now inviting the TEAM, win or lose. Megan should never disrespect our Country, the White House, or our Flag, especially since so much has been done for her &amp, the team. Be proud of the Flag that you wear. The USA is doing GREAT!","rating":3},{"id":1126230693959200800,"text":"Big announcement today: Drug companies have to come clean about their prices in TV ads. Historic transparency for American patients is here. If drug companies are ashamed of those prices—lower them!","rating":5},{"id":1299676445128765400,"text":"Wow! Despite the Democrats views across TV and online lie (Con!), we had 147.9 million, the Republican National Convention blew the Democrat National Convention  AWAY. Not even close! Just like their lies on Russia, Football (PLAY!) and everything else! NOVEMBER 3rd.","rating":6},{"id":1304936900327649300,"text":"While I travel the Country, Joe sleeps in his basement, telling the Fake News Media to “get lost”. If you’re a reporter covering Sleepy Joe, you have basically gone into retirement!","rating":7},{"id":1124359594418032600,"text":"Had a long and very good conversation with President Putin of Russia. As I have always said, long before the Witch Hunt started, getting along with Russia, China, and everyone is a good thing, not a bad thing....","rating":5},{"id":1263669433366728700,"text":"The Wacky Do Nothing Attorney General of Michigan, Dana Nessel, is viciously threatening Ford Motor Company for the fact that I inspected a Ventilator plant without a mask. Not their fault, &amp; I did put on a mask. No wonder many auto companies left Michigan, until I came along!","rating":7},{"id":987532088302886900,"text":"A message from Kim Jong Un: “North Korea will stop nuclear tests and launches of intercontinental ballistic missiles.”Also will “Shut down a nuclear test site in the country’s Northern Side to prove the vow to suspend nuclear tests.” Progress being made for all!","rating":4},{"id":1127210559059972100,"text":"Such an easy way to avoid Tariffs? Make or produce your goods and products in the good old USA. It’s very simple!","rating":2},{"id":1199812482853933000,"text":"New Stock Market Record today, AGAIN. Congratulations USA!","rating":3},{"id":1187547459700121600,"text":"Where is the Whistleblower, and why did he or she write such a fictitious and incorrect account of my phone call with the Ukrainian President? Why did the IG allow this to happen? Who is the so-called Informant (Schiff?) who was so inaccurate? A giant Scam!","rating":8},{"id":1318267921227944000,"text":"Governor Cuomo has shown tremendously poor leadership skills in running N.Y. Bad time for him to be writing and promoting a book, especially since he has done such a poor job with Covid and Crime. So many unnecessary deaths. The City &amp; State have sunk to historic lows...","rating":6},{"id":1192460764235419600,"text":"It was just explained to me that for next weeks Fake Hearing (trial) in the House, as they interview Never Trumpers and others, I get NO LAWYER &amp, NO DUE PROCESS. It is a Pelosi, Schiff, Scam against the Republican Party and me. This Witch Hunt should not be allowed to proceed!","rating":9},{"id":1093871865246961700,"text":"...It is all a GIANT AND ILLEGAL HOAX, developed long before the election itself, but used as an excuse by the Democrats as to why Crooked Hillary Clinton lost the Election! Someday the Fake News Media will turn honest &amp, report that Donald J. Trump was actually a GREAT Candidate!","rating":10},{"id":1276173394053156900,"text":"The Fake News and phony Fake Suppression Polls have never been worse. The Lamestream Media has gone CRAZY!","rating":7},{"id":1053807130120200200,"text":"All levels of government and Law Enforcement are watching carefully for VOTER FRAUD, including during EARLY VOTING. Cheat at your own peril. Violators will be subject to maximum penalties, both civil and criminal!","rating":5},{"id":1151089269538218000,"text":".....shouting of the F...word, among many other terrible things, and the petrified Dems run for the hills. Why isn’t the House voting to rebuke the filthy and hate laced things they have said? Because they are the Radical Left, and the Democrats are afraid to take them on. Sad!","rating":8},{"id":1218195021930926000,"text":"They are rigging the election again against Bernie Sanders, just like last time, only even more obviously. They are bringing him out of so important Iowa in order that, as a Senator, he sit through the Impeachment Hoax Trial. Crazy Nancy thereby gives the strong edge to Sleepy...","rating":6},{"id":874991696186142700,"text":"Happy birthday to U.S. ARMY and our soldiers. Thank you for your bravery, sacrifices, &amp, dedication. Proud to be your Commander-in-Chief!","rating":2},{"id":1164914959131848700,"text":"Our Country has lost, stupidly, Trillions of Dollars with China over many years. They have stolen our Intellectual Property at a rate of Hundreds of Billions of Dollars a year, &amp, they want to continue. I won’t let that happen! We don’t need China and, frankly, would be far....","rating":7},{"id":899008381226299400,"text":"Our great country has been divided for decades. Sometimes you need protest in order to heal, &amp, we will heal, &amp, be stronger than ever before!","rating":3},{"id":1094233554886840300,"text":"It was great meeting some of our outstanding young military personnel who were wounded in both Syria and Afghanistan. Their wounds are deep but their spirit is sooo high. They will recoverer &amp, be back very soon. America loves them. Walter Reed Hospital is AMAZING - Thank you all!","rating":3},{"id":1097247455006068700,"text":"“These guys, the investigators, ought to be in jail. What they have done, working with the Obama intelligence agencies, is simply unprecedented. This is one of the greatest political hoaxes ever perpetrated on the people of this Country, and Mueller is a coverup.”  Rush Limbaugh","rating":8},{"id":1191338937387757600,"text":"95% Approval Rating in the Republican Party. Thank you!","rating":4},{"id":960195808141414400,"text":"My thoughts and prayers are with all of the victims involved in this mornings train collision in South Carolina. Thank you to our incredible First Responders for the work they’ve done!","rating":1},{"id":1161277403353759700,"text":"Would Chris Cuomo be given a Red Flag for his recent rant? Filthy language and a total loss of control. He shouldn’t be allowed to have any weapon. He’s nuts!","rating":8},{"id":1117216153728897000,"text":"....So interesting to see the Mayor of Oakland and other Sanctuary Cities NOT WANT our currently “detained immigrants” after release due to the ridiculous court ordered 20 day rule. If they don’t want to serve our Nation by taking care of them, why should other cities &amp, towns?","rating":7},{"id":1150879404593205200,"text":"The Dems were trying to distance themselves from the four “progressives,” but now they are forced to embrace them. That means they are endorsing Socialism, hate of Israel and the USA! Not good for the Democrats!","rating":6},{"id":1146392269865590800,"text":"Our July 4th Salute to America at the Lincoln Memorial is looking to be really big. It will be the show of a lifetime!","rating":4},{"id":1217284784252080000,"text":"Former National Security Adviser for President Obama said “President Trump was absolutely correct” in taking out terroristist leader Soleimani. Thank you General Jones!","rating":3},{"id":1144298731887628300,"text":"Seems totally ridiculous that our government, and indeed Country, cannot ask a basic question of Citizenship in a very expensive, detailed and important Census, in this case for 2020. I have asked the lawyers if they can delay the Census, no matter how long, until the.....","rating":5},{"id":1216748556561866800,"text":"The Democrats and the Fake News are trying to make terrorist Soleimani into a wonderful guy, only because I did what should have been done for 20 years. Anything I do, whether it’s the economy, military, or anything else, will be scorned by the Rafical Left, Do Nothing Democrats!","rating":7},{"id":1305704028563595300,"text":"According to press reports, Iran may be planning an assassination, or other attack, against the United States in retaliation for the killing of terrorist leader Soleimani, which was carried out for his planning a future attack, murdering U.S. Troops, and the death &amp; suffering...","rating":5},{"id":1231717300627107800,"text":"95% Approval Rating in the Republican Party, a Record. 218 Federal Judges, also a Record. 2 Supreme Court Justices. Thank you!","rating":3},{"id":1131243663948959700,"text":"So sad that Nancy Pelosi and Chuck Schumer will never be able to see or understand the great promise of our Country. They can continue the Witch Hunt which has already cost $40M and been a tremendous waste of time and energy for everyone in America, or get back to work....","rating":6},{"id":1291864911509938200,"text":"I will be doing a news conference on the ChinaVirus, the just announced very good economic numbers, and the improving economy, at 7pm from Bedminster, New Jersey. Also, the subject of the Beirut, Lebanon catastrophe will be discussed.","rating":5},{"id":937141061343957000,"text":"So General Flynn lies to the FBI and his life is destroyed, while Crooked Hillary Clinton, on that now famous FBI holiday “interrogation” with no swearing in and no recording, lies many times...and nothing happens to her? Rigged system, or just a double standard?","rating":8},{"id":1303006236078637000,"text":"Biggest &amp; Fastest Financial Recovery In History. Next year will be BEST EVER, unless a very Sleepy person becomes President and massively raises your taxes - In which case, CRASH!","rating":7},{"id":1226525699542061000,"text":"I grew up in New York City and, over many years, got to watch how GREAT NYC’s “Finest” are. Now, because of weak leadership at Governor &amp; Mayor, stand away (water thrown at them) regulations, and lack of support, our wonderful NYC police are under assault. Stop this now!","rating":6},{"id":1044991766309621800,"text":"Avenatti is a third rate lawyer who is good at making false accusations, like he did on me and like he is now doing on Judge Brett Kavanaugh. He is just looking for attention and doesn’t want people to look at his past record and relationships - a total low-life!","rating":7},{"id":902503724274331600,"text":"Leaving now for Texas!","rating":3},{"id":1115802105057562600,"text":"Everybody is now acknowledging that, right from the time I announced my run for President, I was 100% correct on the Border. Remember the heat I took? Democrats should now get rid of the loopholes. The Border is being fixed. Mexico will not let people through!","rating":5},{"id":1299678590750142500,"text":"My Campaign, despite all of the Fake News, Fake Books, and pathetic reporting written about me and it, has more spirit and enthusiasm than ever before, including the great and wonderful Campaign of 2016!","rating":4},{"id":1188103745525244000,"text":"Where’s the Whistleblower?","rating":6},{"id":1111214993293357000,"text":"FBI &amp, DOJ to review the outrageous Jussie Smollett case in Chicago. It is an embarrassment to our Nation!","rating":6},{"id":1104714098724520000,"text":"Despite the most hostile and corrupt media in the history of American politics, the Trump Administration has accomplished more in its first two years than any other Administration. Judges, biggest Tax &amp, Regulation Cuts, V.A. Choice, Best Economy, Lowest Unemployment &amp, much more!","rating":5},{"id":1155073965880172500,"text":"....As proven last week during a Congressional tour, the Border is clean, efficient &amp, well run, just very crowded. Cumming District is a disgusting, rat and rodent infested mess. If he spent more time in Baltimore, maybe he could help clean up this very dangerous &amp, filthy place","rating":8},{"id":1281355449523146800,"text":"At the request of Congressman Moolenaar, I have approved a major Disaster Declaration to provide more than $43 million in Federal Funds to help the people of the GREAT State of Michigan recover from the recent dam break flooding. I will always stand with Michigan!","rating":4},{"id":1115295440558280700,"text":"The Democrats will never be satisfied, no matter what they get, how much they get, or how many pages they get. It will never end, but that’s the way life goes!","rating":6},{"id":1287373747180245000,"text":"The Trump Campaign has more ENTHUSIASM, according to many, than any campaign in the history of our great Country - Even more than 2016. Biden has NONE! The Silent Majority will speak on NOVEMBER THIRD!!! Fake Suppression Polls &amp; Fake News will not save the Radical Left.","rating":7},{"id":1090944017708261400,"text":"So great to watch &amp, listen to all these people who write books &amp, talk about my presidential campaign and so many others things related to winning, and how I should be doing “IT.” As I take it all in, I then sit back, look around, &amp, say “gee, I’m in the White House, &amp, they’re not!","rating":6},{"id":1302554416088834000,"text":"Be smart Baltimore! You have been ripped off for years by the Democrats, &amp; gotten nothing but poverty &amp; crime. It will only get worse UNLESS YOU ELECT KIMBERLY KLACIK TO CONGRESS. She brings with her the power &amp; ECONOMIC STRENGTH OF THE REPUBLICAN PARTY. She works sooo hard....","rating":7},{"id":985529299905187800,"text":"Just hit 50% in the Rasmussen Poll, much higher than President Obama at same point. With all of the phony stories and Fake News, it’s hard to believe! Thank you America, we are doing Great Things.","rating":5},{"id":1264912066672046000,"text":"Some stories about the fact that in order to get outside and perhaps, even a little exercise, I played golf over the weekend. The Fake &amp; Totally Corrupt News makes it sound like a mortal sin - I knew this would happen! What they don’t say is that it was my first golf in almost...","rating":6},{"id":1243726993537073200,"text":"I love Michigan, one of the reasons we are doing such a GREAT job for them during this horrible Pandemic. Yet your Governor, Gretchen “Half” Whitmer is way in over her head, she doesn’t have a clue. Likes blaming everyone for her own ineptitude! #MAGA","rating":8},{"id":1084647050208333800,"text":"Best line in the Elizabeth Warren beer catastrophe is, to her husband, “Thank you for being here. I’m glad you’re here” It’s their house, he’s supposed to be there!","rating":8},{"id":976120272435793900,"text":"Our Nation was founded by farmers. Our independence was won by farmers. And our continent was tamed by farmers. Our farmers always lead the way -- we are PROUD of them, and we are DELIVERING for them! #NationalAgricultureDay","rating":3},{"id":1028030912095838200,"text":"Democrats, please do not distance yourselves from Nancy Pelosi. She is a wonderful person whose ideas &amp, policies may be bad, but who should definitely be given a 4th chance. She is trying very hard &amp, has every right to take down the Democrat Party if she has veered too far left!","rating":9},{"id":1220328518288052200,"text":"The Democrat House would not give us lawyers, or not one witness, but now demand that the Republican Senate produce the witnesses that the House never sought, or even asked for? They had their chance, but pretended to rush. Most unfair &amp; corrupt hearing in Congressional history!","rating":6},{"id":975062797162811400,"text":"The Fake News is beside themselves that McCabe was caught, called out and fired. How many hundreds of thousands of dollars was given to wife’s campaign by Crooked H friend, Terry M, who was also under investigation? How many lies? How many leaks? Comey knew it all, and much more!","rating":7},{"id":898531481185689600,"text":"Radical Islamic Terrorism must be stopped by whatever means necessary! The courts must give us back our protective rights. Have to be tough!","rating":8},{"id":1287366627672166400,"text":"This week you had Joe Biden call Arizona a CITY. Nothing matters with him, however, because the Opposition Party (Lamestream Media) covers everything up - especially the corruption. The Obama/Biden Administration is the most corrupt in history. They even spied on my campaign!","rating":7},{"id":1131716322369392600,"text":"“Today, at the request and recommendation of the Attorney General of the United States, President Donald J. Trump directed the intelligence community to quickly and fully cooperate with the Attorney General’s investigation into surveillance activities....","rating":5},{"id":1062153051459469300,"text":"I just approved an expedited request for a Major Disaster Declaration for the State of California. Wanted to respond quickly in order to alleviate some of the incredible suffering going on. I am with you all the way. God Bless all of the victims and families affected.","rating":4},{"id":1060153052676702200,"text":"To any of the pundits or talking heads that do not give us proper credit for this great Midterm Election, just remember two words - FAKE NEWS!","rating":6},{"id":1219286662221652000,"text":"Cryin’ Chuck Schumer is now asking for “fairness”, when he and the Democrat House members worked together to make sure I got ZERO fairness in the House. So, what else is new?","rating":7},{"id":1083705208834834400,"text":"H1-B holders in the United States can rest assured that changes are soon coming which will bring both simplicity and certainty to your stay, including a potential path to citizenship. We want to encourage talented and highly skilled people to pursue career options in the U.S.","rating":3},{"id":984767560494313500,"text":"....untruthful slime ball who was, as time has proven, a terrible Director of the FBI. His handling of the Crooked Hillary Clinton case, and the events surrounding it, will go down as one of the worst “botch jobs” of history. It was my great honor to fire James Comey!","rating":9},{"id":1137363899420950500,"text":"I would like to thank the President of Mexico, Andres Manuel Lopez Obrador, and his foreign minister, Marcelo Ebrard, together with all of the many representatives of both the United States and Mexico, for working so long and hard to get our agreement on immigration completed!","rating":2},{"id":1047822816580722700,"text":"The harsh and unfair treatment of Judge Brett Kavanaugh is having an incredible upward impact on voters. The PEOPLE get it far better than the politicians. Most importantly, this great life cannot be ruined by mean &amp, despicable Democrats and totally uncorroborated allegations!","rating":6},{"id":1263170880298942500,"text":"Michigan sends absentee ballot applications to 7.7 million people ahead of Primaries and the General Election. This was done illegally and without authorization by a rogue Secretary of State. I will ask to hold up funding to Michigan if they want to go down this Voter Fraud path!","rating":8},{"id":1216448547777908700,"text":"Many believe that by the Senate giving credence to a trial based on the no evidence, no crime, read the transcripts, “no pressure”  Impeachment Hoax, rather than an outright dismissal, it gives the partisan Democrat Witch Hunt credibility that it otherwise does not have. I agree!","rating":6},{"id":1196159184431177700,"text":"Where is the Fake Whistleblower?","rating":7},{"id":1202573673049272300,"text":"The Do Nothing Democrats had a historically bad day yesterday in the House. They have no Impeachment case and are demeaning our Country. But nothing matters to them, they have gone crazy. Therefore I say, if you are going to impeach me, do it now, fast, so we can have a fair....","rating":7},{"id":1081653927337214000,"text":"Drug makers and companies are not living up to their commitments on pricing. Not being fair to the consumer, or to our Country!","rating":4},{"id":830904083519242200,"text":"Just leaving Florida. Big crowds of enthusiastic supporters lining the road that the FAKE NEWS media refuses to mention. Very dishonest!","rating":7},{"id":1246485027191435300,"text":"I will be holding a News Conference at 3:30 P.M. at the White House. Thank you!","rating":3},{"id":1305866347197456400,"text":"We are advertising all over the place, but as much as we do, the Fake News likes to say we aren’t. Just being smart. We have much more money than we had at same time in 2016. Also spending on other, and different, elements of the campaign. Starting to get great poll numbers!","rating":5},{"id":1259450328048709600,"text":"We are getting great marks for the handling of the CoronaVirus pandemic, especially the very early BAN of people from China, the infectious source, entering the USA. Compare that to the Obama/Sleepy Joe disaster known as H1N1 Swine Flu. Poor marks, bad polls - didn’t have a clue!","rating":6},{"id":925490503218589700,"text":"We must not allow ISIS to return, or enter, our country after defeating them in the Middle East and elsewhere. Enough!","rating":4},{"id":1156588093367083000,"text":"....or is he too dumb (stupid} to understand that. No wonder CNN’s ratings (MSNBC’s also) have gone down the tubes - and will stay there until they bring credibility back to the newsroom. Don’t hold your breath!","rating":8},{"id":1265296994056183800,"text":"We made most Governors look very good, even great, by getting them the Ventilators, unlimited Testing, and supplies, all of which they should have had in their own stockpiles. So they look great, and I just keep rolling along, doing great things and getting Fake Lamestream News!","rating":5},{"id":964594780088033300,"text":"Russia started their anti-US campaign in 2014, long before I announced that I would run for President. The results of the election were not impacted. The Trump campaign did nothing wrong - no collusion!","rating":4},{"id":996391840860471300,"text":"Can you believe that with all of the made up, unsourced stories I get from the Fake News Media, together with the  $10,000,000 Russian Witch Hunt (there is no Collusion), I now have my best Poll Numbers in a year. Much of the Media may be corrupt, but the People truly get it!","rating":6},{"id":949619270631256000,"text":"....to President of the United States (on my first try). I think that would qualify as not smart, but genius....and a very stable genius at that!","rating":9}]