[{"id":1250172326920040400,"text":"White House news conference today at 5:45 P.M. Eastern. Thank you!","rating":2},{"id":1204374382715506700,"text":"I don’t know what report current Director of the FBI Christopher Wray was reading, but it sure wasn’t the one given to me. With that kind of attitude, he will never be able to fix the FBI, which is badly broken despite having some of the greatest men &amp, women working there!","rating":5},{"id":1002508937445478400,"text":"Why aren’t they firing no talent Samantha Bee for the horrible language used on her low ratings show? A total double standard but that’s O.K., we are Winning, and will be doing so for a long time to come!","rating":7},{"id":1237841878889840600,"text":"I will be addressing the Nation this evening at 9:00 P.M. (Eastern) from the Oval Office.","rating":2},{"id":1290308363872538600,"text":"My visits last week to Texas and Florida had massive numbers of cheering people gathered along the roads and highways, thousands and thousands, even bigger (by far) than the crowds of 2016. Saw no Biden supporters, and yet some in the Fake News said it was an equal number. Sad!","rating":6},{"id":1269976902665752600,"text":"The Lamestream Media refuses to talk about our Country’s record setting Jobs Numbers, which are indicating GREATNESS, and soon!","rating":4},{"id":1187874908660998100,"text":"My lawyers should sue the Democrats and Shifty Adam Schiff for fraud!","rating":6},{"id":1323377677974294500,"text":"Joe Biden is promising to delay the vaccine and turn America into a prison state—locking you in your home while letting far-left rioters roam free. The Biden Lockdown will mean no school, no graduations, no weddings, no Thanksgiving, no Christmas, no Fourth of July, and...","rating":8},{"id":946949708915925000,"text":"Many reports of peaceful protests by Iranian citizens fed up with regime’s corruption &amp, its squandering of the nation’s wealth to fund terrorism abroad. Iranian govt should respect their people’s rights, including right to express themselves. The world is watching! #IranProtests","rating":3},{"id":1311423289542180900,"text":"Just landed in Minnesota. Hasn’t been won by a Republican since 1972, and we saved Minneapolis. Also opened the massive and beautiful Iron Range, which Obama and Sleepy Joe closed.  Thousands of jobs started back. They will close again. How can we lose?","rating":5},{"id":1151099363445358600,"text":"If you come after the President, the Country, the Flag - he’s going to defend himself. What the squad doesn’t like is that Donald Trump is enforcing the very laws that are on the books that were put there by Congress.” Jason Chaffetz. Also, buy Jason’s great new book, POWER GRAB!","rating":2},{"id":1300258463298224000,"text":"Joe Biden is coming out of the basement earlier than his hoped for ten days because his people told him he has no choice, his poll numbers are PLUNGING! Going to Pittsburgh, where I have helped industry to a record last year, &amp; then back to his  basement for an extended period...","rating":3},{"id":1135603282104213500,"text":"Russia has informed us that they have removed most of their people from Venezuela.","rating":1},{"id":1164852076930879500,"text":"94% Approval Rating within the  Republican Party. Thank you!","rating":1},{"id":886534810575020000,"text":"HillaryClinton can illegally get the questions to the Debate &amp, delete 33,000 emails but my son Don is being scorned by the Fake News Media?","rating":6},{"id":1265624335898869800,"text":"Psycho Joe Scarborough is rattled, not only by his bad ratings but all of the things and facts that are coming out on the internet about opening a Cold Case. He knows what is happening!","rating":7},{"id":1274170611280068600,"text":"Informed Dr. Fauci this morning that he has nothing to do with NFL Football. Forced Democrat run Minnesota to bring in the National Guard &amp; end rioting &amp; looting after seeing the destruction &amp; crime in Minneapolis. 100% successful! Waiting to hear from Dem run Washington State...","rating":5},{"id":1046456403651698700,"text":"So if African-American unemployment is now at the lowest number in history, median income the highest, and you then add all of the other things I have done, how do Democrats, who have done NOTHING for African-Americans but TALK, win the Black Vote?  And it will only get better!","rating":4},{"id":1210347885386178600,"text":"California leads the nation, by far, in both the number of homeless people, and the percentage increase in the homeless population - two terrible stats. Crazy Nancy should focus on that in her very down district, and helping her incompetent governor with the big homeless problem!","rating":4},{"id":1006293144911085600,"text":"Stock Market up almost 40% since the Election, with 7 Trillion Dollars of U.S. value built throughout the economy. Lowest unemployment rate in many decades, with Black &amp, Hispanic unemployment lowest in History, and Female unemployment lowest in 21 years. Highest confidence ever!","rating":3},{"id":1220073313768099800,"text":"“NO PRESSURE”","rating":6},{"id":1140392587720831000,"text":"Rep. Alexandria Ocasio-Cortez. “I think we have a very real risk of losing the Presidency to Donald Trump.” I agree, and that is the only reason they play the impeach card, which cannot be legally used!","rating":8},{"id":1091326078323486700,"text":"I inherited a total mess in Syria and Afghanistan, the “Endless Wars” of unlimited spending and death. During my campaign I said, very strongly, that these wars must finally end. We spend $50 Billion a year in Afghanistan and have hit them so hard that we are now talking peace...","rating":5},{"id":833681539997253600,"text":"Give the public a break - The FAKE NEWS media is trying to say that large scale immigration in Sweden is working out just beautifully. NOT!","rating":7},{"id":1151618791069114400,"text":"....Greatest Economic BOOM in the history of our Country, the best job numbers, biggest tax reduction, rebuilt military and much more, is now OVER. This should never be allowed to happen to another President of the United States again!","rating":6},{"id":874971795362897900,"text":"Rep. Steve Scalise of Louisiana, a true friend and patriot, was badly injured but will fully recover. Our thoughts and prayers are with him.","rating":3},{"id":1054354059535269900,"text":"Every time you see a Caravan, or people illegally coming, or attempting to come, into our Country illegally, think of and blame the Democrats for not giving us the votes to change our pathetic Immigration Laws! Remember the Midterms! So unfair to those who come in legally.","rating":8},{"id":1257659682816241700,"text":"Governors should let roads and highway construction begin before heavy traffic starts, which will be soon. Some Governors never stopped, which proved to be very smart. They built and fixed roads during long no traffic periods. Also, saved big dollars!","rating":4},{"id":943362605258813400,"text":"The United States Senate just passed the biggest in history Tax Cut and Reform Bill. Terrible Individual Mandate (ObamaCare)Repealed. Goes to the House tomorrow morning for final vote. If approved, there will be a News Conference at The White House at approximately 1:00 P.M.","rating":5},{"id":1287470740237947000,"text":"There is NO WAY a place like Pennsylvania can vote for the Radical Left and their puppet, Joe Biden, when they are against fracking, steel production, and just about everything else that Pennsylvania stands for. Likewise, Texas, and many other states!!!","rating":7},{"id":806134244384899100,"text":"Boeing is building a brand new 747 Air Force One for future presidents, but costs are out of control, more than $4 billion. Cancel order!","rating":7},{"id":1293163704188645400,"text":"More Testing, which is a good thing (we have the most in the world), equals more Cases, which is Fake News Gold. They use Cases to demean the incredible job being done by the great men &amp; women of the U.S. fighting the China Plague!","rating":8},{"id":827865957750161400,"text":"Interesting that certain Middle-Eastern countries agree with the ban. They know if certain people are allowed in it's death &amp, destruction!","rating":6},{"id":1137040971311353900,"text":"Nervous Nancy Pelosi is a disgrace to herself and her family for having made such a disgusting statement, especially since I was with foreign leaders overseas. There is no evidence for such a thing to have been said. Nervous Nancy &amp, Dems are getting Zero work done in Congress....","rating":8},{"id":1011212766487728100,"text":"The Red Hen Restaurant should focus more on cleaning its filthy canopies, doors and windows (badly needs a paint job) rather than refusing to serve a fine person like Sarah Huckabee Sanders. I always had a rule, if a restaurant is dirty on the outside, it is dirty on the inside!","rating":7},{"id":1254877727804600300,"text":"I will be having a White House Press Conference today at 5:30 P.M. Thank you!","rating":3},{"id":1317078386225893400,"text":"Big T was not a reference to me, but rather to Big Tech, which should have been properly pointed out in Twitter’s Fake Trending Section!","rating":6},{"id":901259509632573400,"text":"At the request of the Governor of Texas, I have signed the Disaster Proclamation, which unleashes the full force of government help!","rating":4},{"id":1082648785312976900,"text":"Congratulations to a truly great football team, the Clemson Tigers, on an incredible win last night against a powerful Alabama team. A big win also for the Great State of South Carolina. Look forward to seeing the team, and their brilliant coach, for the second time at the W.H.","rating":3},{"id":1251193712580968400,"text":"Cuomo ridiculously wanted “40 thousand Ventilators”. We gave him a small fraction of that number, and it was plenty. State should have had them in stockpile!","rating":7},{"id":1295562738400362500,"text":"Now AP estimates that the real Cuomo number of people killed because of his total incompetence is 11,000, not the 6000 that was originally thought!","rating":7},{"id":1099713451457462300,"text":"The only Collusion with the Russians was with Crooked Hillary Clinton and the Democratic National Committee...And, where’s the Server that the DNC refused to give to the FBI?  Where are the new Texts between Agent Lisa Page and her Agent lover, Peter S? We want them now!","rating":8},{"id":1114888062884954100,"text":"Looks like Bob Mueller’s team of 13 Trump Haters &amp, Angry Democrats are illegally leaking information to the press while the Fake News Media make up their own stories with or without sources - sources no longer matter to our corrupt &amp, dishonest Mainstream Media, they are a Joke!","rating":8},{"id":852318522139168800,"text":"Jobs are returning, illegal immigration is plummeting, law, order and justice are being restored. We are truly making America great again!","rating":3},{"id":960492998734868500,"text":"Little Adam Schiff, who is desperate to run for higher office, is one of the biggest liars and leakers in Washington, right up there with Comey, Warner, Brennan and Clapper! Adam leaves closed committee hearings to illegally leak confidential information. Must be stopped!","rating":9},{"id":1079420891807793200,"text":"Great work by my Administration over the holidays to save Coast Guard pay during this #SchumerShutdown. No thanks to the Democrats who left town and are not concerned about the safety and security of Americans!","rating":5},{"id":1218674016942219300,"text":"A massive 200 Billion Dollar Sea Wall, built around New York to protect it from rare storms, is a costly, foolish &amp; environmentally unfriendly idea that, when needed, probably won’t work anyway. It will also look terrible. Sorry, you’ll just have to get your mops &amp; buckets ready!","rating":9},{"id":1082259636227620900,"text":"With all of the success that our Country is having, including the just released jobs numbers which are off the charts, the Fake News &amp, totally dishonest Media concerning me and my presidency has never been worse. Many have become crazed lunatics who have given up on the TRUTH!...","rating":7},{"id":969529668234829800,"text":"Alec Baldwin, whose dying mediocre career was saved by his terrible impersonation of me on SNL, now says playing me was agony. Alec, it was agony for those who were forced to watch. Bring back Darrell Hammond, funnier and a far greater talent!","rating":10},{"id":1079906462753869800,"text":"...Remember this. Throughout the ages some things NEVER get better and NEVER change. You have Walls and you have Wheels. It was ALWAYS that way and it will ALWAYS be that way! Please explain to the Democrats that there can NEVER be a replacement for a good old fashioned WALL!","rating":6},{"id":801110690387857400,"text":"I am seriously considering Dr. Ben Carson as the head of HUD. I've gotten to know him well--he's a greatly talented person who loves people!","rating":2},{"id":1151327084016480300,"text":"....visible members of the House Democrats, who are now wedded to this bitterness and hate. The Republican vote was 187-4. Wow! Also, this was the first time since 1984 that the Speaker of the House was ruled Out of Order and broke the Rules of the House. Quite a day!","rating":3},{"id":1231366964611866600,"text":"Looks like Crazy Bernie is doing well in the Great State of Nevada. Biden &amp; the rest look weak, &amp; no way Mini Mike can restart his campaign after the worst debate performance in the history of Presidential Debates. Congratulations Bernie, &amp; don’t let them take it away from you!","rating":7},{"id":1179179575059927000,"text":"....People, their VOTE, their Freedoms, their Second Amendment, Religion, Military, Border Wall, and their God-given rights as a Citizen of The United States of America!","rating":4},{"id":1107637405010530300,"text":"The Fake News Media is working overtime to blame me for the horrible attack in New Zealand. They will have to work very hard to prove that one. So Ridiculous!","rating":6},{"id":1071382401954267100,"text":"The Paris Agreement isn’t working out so well for Paris. Protests and riots all over France. People do not want to pay large sums of money, much to third world countries (that are questionably run), in order to maybe protect the environment. Chanting “We Want Trump!” Love France.","rating":9},{"id":875305788708974600,"text":"They made up a phony collusion with the Russians story, found zero proof, so now they go for obstruction of justice on the phony story. Nice","rating":8},{"id":1236096307103707100,"text":"I am pleased to announce that Congressman Mark Meadows will become White House Chief of Staff. I have long known and worked with Mark, and the relationship is a very good one....","rating":1},{"id":1151499379821428700,"text":"New Poll: The Rasmussen Poll, one of the most accurate in predicting the 2016 Election, has just announced that “Trump” numbers have recently gone up by four points, to 50%. Thank you to the vicious young Socialist Congresswomen. America will never buy your act!  #MAGA2020","rating":5},{"id":959798743842349000,"text":"This memo totally vindicates “Trump” in probe. But the Russian Witch Hunt goes on and on. Their was no Collusion and there was no Obstruction (the word now used because, after one year of looking endlessly and finding NOTHING, collusion is dead). This is an American disgrace!","rating":7},{"id":1005988633747312600,"text":"....Germany pays 1% (slowly) of GDP towards NATO, while we pay 4% of a MUCH larger GDP. Does anybody believe that makes sense? We protect Europe (which is good) at great financial loss, and then get unfairly clobbered on Trade. Change is coming!","rating":8},{"id":1315680867919040500,"text":"We will have Healthcare which is FAR BETTER than ObamaCare, at a FAR LOWER COST - BIG PREMIUM REDUCTION. PEOPLE WITH PRE EXISTING CONDITIONS WILL BE PROTECTED AT AN EVEN HIGHER LEVEL THAN NOW. HIGHLY UNPOPULAR AND UNFAIR INDIVIDUAL MANDATE ALREADY TERMINATED. YOU’RE WELCOME!","rating":7},{"id":1186985677176656000,"text":"Where’s the Whistleblower?","rating":5},{"id":1081883505049636900,"text":"“We simply cannot allow people to pour into the United States undetected, undocumented, unchecked...” Barrack Obama, 2005. I voted, when I was a Senator, to build a barrier to try to prevent illegal immigrants from coming in...” Hillary Clinton, 2015.","rating":3},{"id":1345149556967800800,"text":"....changes made to the voting process, rules and regulations, many made hastily before the election, and therefore the whole State Election is not legal or Constitutional. Additionally, the Georgia Consent Decree is Unconstitutional &amp; the State 2020 Presidential Election....","rating":6},{"id":1123333506346750000,"text":"If Cuban Troops and Militia do not immediately CEASE military and other operations for the purpose of causing death and destruction to the Constitution of Venezuela, a full and complete....","rating":4},{"id":1001455721588969500,"text":"The Fake Mainstream Media has, from the time I announced I was running for President, run the most highly sophisticated &amp, dishonest Disinformation Campaign in the history of politics. No matter how well WE do, they find fault. But the forgotten men &amp, women WON, I’m President!","rating":9},{"id":837994257566863400,"text":"I'd bet a good lawyer could make a great case out of the fact that President Obama was tapping my phones in October, just prior to Election!","rating":8},{"id":1125235130002489300,"text":"Despite the tremendous success that I have had as President, including perhaps the greatest ECONOMY and most successful first two years of any President in history, they have stolen two years of my (our) Presidency (Collusion Delusion) that we will never be able to get back.....","rating":7},{"id":1194035922066714600,"text":"In order to continue being the most Transparent President in history, I will be releasing sometime this week the Transcript of the first, and therefore most important, phone call I had with the President of Ukraine. I am sure you will find it tantalizing!","rating":6},{"id":1247920239045681200,"text":"Can’t see AOC plus 3 supporting Sleepy Joe!","rating":5},{"id":963031666150314000,"text":"This will be a big week for Infrastructure. After so stupidly spending $7 trillion in the Middle East, it is now time to start investing in OUR Country!","rating":4},{"id":944927689638662100,"text":"The Fake News refuses to talk about how Big and how Strong our BASE is. They show Fake Polls just like they report Fake News. Despite only negative reporting, we are doing well - nobody is going to beat us. MAKE AMERICA GREAT AGAIN!","rating":8},{"id":1036246829560680400,"text":"....The fact is that African/American unemployment is now the lowest in the history of our country. Same with Asian, Hispanic and almost every other group. The Democrats have been all talk and no action. My Administration has already produced like no other, and everyone sees it!","rating":6},{"id":959029384052166700,"text":"Heading to beautiful West Virginia to be with great members of the Republican Party. Will be planning Infrastructure and discussing Immigration and DACA, not easy when we have no support from the Democrats. NOT ONE DEM VOTED FOR OUR TAX CUT BILL! Need more Republicans in ‘18.","rating":3},{"id":1260177007490601000,"text":"Remember this, every Governor who has sky high approval on their handling of the Coronavirus, and I am happy for them all, could in no way have gotten those numbers, or had that success, without me and the Federal Governments help. From Ventilators to Testing, we made it happen!","rating":7},{"id":878013639613186000,"text":"Mexico was just ranked the second deadliest country in the world, after only Syria. Drug trade is largely the cause. We will BUILD THE WALL!","rating":9},{"id":1257283775375040500,"text":"Getting great reviews, finally, for how well we are handling the pandemic, especially our strong production of desperately needed ventilators, the building of field hospitals &amp; beds, and soon, the great things we are doing on testing. People are really working well together!","rating":4},{"id":1237024549046288400,"text":"Good for the consumer, gasoline prices coming down!","rating":2},{"id":805804034309427200,"text":"If the press would cover me accurately &amp, honorably, I would have far less reason to \"\"tweet.\"\" Sadly, I don't know if that will ever happen!","rating":6},{"id":1252688538069618700,"text":"I will be having a White House Press Conference today at 5:30 P.M. Thank you!","rating":1},{"id":828342202174668800,"text":"Just cannot  believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad!","rating":7},{"id":1196405099741896700,"text":"Never has the Republican Party been so united as it is now. 95% A.R. This is a great fraud being played out against the American people by the Fake News Media &amp, their partner, the Do Nothing Democrats. The rules are rigged by Pelosi &amp, Schiff, but we are winning, and we will win!","rating":8},{"id":1151700953030123500,"text":"Just returned to the White House from the Great State of North Carolina. What a crowd, and what great people. The enthusiasm blows away our rivals on the Radical Left. #2020 will be a big year for the Republican Party!","rating":3},{"id":1244320570315018200,"text":"“President Trump is a ratings hit. Since reviving the daily White House briefing Mr. Trump and his coronavirus updates have attracted an average audience of 8.5 million on cable news, roughly the viewership of the season finale of ‘The Bachelor.’ Numbers are continuing to rise...","rating":5},{"id":1218190672064319500,"text":"Getting ready to meet the LSU Tigers, the National Champions. Great Coach, great Team, great School. Very exciting!","rating":2},{"id":1026762818773758000,"text":"The Iran sanctions have officially been cast. These are the most biting sanctions ever imposed, and in November they ratchet up to yet another level. Anyone doing business with Iran will NOT be doing business with the United States. I am asking for WORLD PEACE, nothing less!","rating":6},{"id":1047842341246173200,"text":"Our country’s great First Lady, Melania, is doing really well in Africa. The people love her, and she loves them! It is a beautiful thing to see.","rating":2},{"id":1198981079723589600,"text":"Another new Stock Market Record. Enjoy!","rating":1},{"id":1177604833538392000,"text":"If that perfect phone call with the President of Ukraine Isn’t considered appropriate, then no future President can EVER again speak to another foreign leader!","rating":7},{"id":821844875268255700,"text":"Looking forward to a speedy recovery for George and Barbara Bush, both hospitalized. Thank you for your wonderful letter!","rating":2},{"id":892383242535481300,"text":"Only the Fake News Media and Trump enemies want me to stop using Social Media (110 million people). Only way for me to get the truth out!","rating":8},{"id":1131386418410999800,"text":"In a letter to her House colleagues, Nancy Pelosi said: “President Trump had a temper tantrum for us all to see.” This is not true. I was purposely very polite and calm, much as I was minutes later with the press in the Rose Garden. Can be easily proven. It is all such a lie!","rating":5},{"id":1228339772348915700,"text":"95% Approval Rating in the Republican Party. Thank you!","rating":3},{"id":1320691630043730000,"text":"Three BIG Rallies today. Heading to Pennsylvania. I have plenty to say about the dishonesty of the Media and Sleepy Joe. A terrible coverup is happening in our Country!!!","rating":7},{"id":1146395148856844300,"text":"We have the greatest economy anywhere in the world. We have the greatest military anywhere in the world. Not bad!","rating":4},{"id":1242202291718979600,"text":"....is NOT their fault in any way, shape, or form. They are working closely with us to get rid of it. WE WILL PREVAIL TOGETHER!","rating":1},{"id":1033500723709993000,"text":"Stock Market hit all time high on Friday. Congratulations U.S.A.!","rating":2},{"id":917694644481413100,"text":"Why is the NFL getting massive tax breaks while at the same time disrespecting our Anthem, Flag and Country? Change tax law!","rating":6},{"id":1302961482716639200,"text":"Starting to get VERY high marks in our handling of the Coronavirus (China Virus), especially when compared to other countries and areas of the world. Now the Vaccines (Plus) are coming, and fast!","rating":5},{"id":1184431250066624500,"text":"Our record Economy would CRASH, just like in 1929, if any of those clowns became President!","rating":9},{"id":1111222415739244500,"text":"Wow, ratings for “Morning Joe,” which were really bad in the first place, just “tanked” with the release of the Mueller Report. Likewise, other shows on MSNBC and CNN have gone down by as much as 50%. Just shows, Fake News never wins!","rating":8},{"id":1178442759499370500,"text":"Like every American, I deserve to meet my accuser, especially when this accuser, the so-called “Whistleblower,” represented a perfect conversation with a foreign leader in a totally inaccurate and fraudulent way. Then Schiff made up what I actually said by lying to Congress......","rating":7},{"id":1234263037110083600,"text":"Pete Buttigieg is OUT. All of his SuperTuesday votes will go to Sleepy Joe Biden. Great timing. This is the REAL beginning of the Dems taking Bernie out of play - NO NOMINATION, AGAIN!","rating":8},{"id":1153315875476463600,"text":"The “Squad” is a very Racist group of troublemakers who are young, inexperienced, and not very smart. They are pulling the once great Democrat Party far left, and were against humanitarian aid at the Border...And are now against ICE and Homeland Security. So bad for our Country!","rating":9},{"id":1052368431201341400,"text":"We have today informed the countries of Honduras, Guatemala and El Salvador that if they allow their citizens, or others, to journey through their borders and up to the United States, with the intention of entering our country illegally, all payments made to them will STOP (END)!","rating":6},{"id":1222503732501500000,"text":"Remember Republicans, the Democrats already had 17 witnesses, we were given NONE! Witnesses are up to the House, not up to the Senate. Don’t let the Dems play you!","rating":5},{"id":1238283146350809000,"text":"Just had a great conversation with Prime Minister Abe of Japan. I told him that the just completed Olympic venue is magnificent. He has done an incredible job, one that will make him very proud. Good things will happen for Japan and their great Prime Minister. Lots of options!","rating":4},{"id":1099459138038444000,"text":"“There’s not one shred of evidence that this president’s done anything Constitutionally (or anything else) wrong.” Graham Ledger.  Thank you Graham, so true!","rating":3},{"id":1298283960494063600,"text":"Beautiful Maine Lobsters will now move tariff-free to Europe! For first time in many years. GREAT new deal by USTR levels playing field with Canada. Millions of $’s more in EXPORTS...","rating":4},{"id":1209266861436809200,"text":"STOCK MARKET CLOSES AT ALL-TIME HIGH! What a great time for the Radical Left, Do Nothing Democrats to Impeach your favorite President, especially since he has not done anything wrong!","rating":7},{"id":997112687799697400,"text":"Despite the disgusting, illegal and unwarranted Witch Hunt, we have had the most successful first 17 month Administration in U.S. history - by far! Sorry to the Fake News Media and “Haters,” but that’s the way it is!","rating":6},{"id":1254060573655998500,"text":"It is a wonderful feeling to know that our States are loaded up with Ventilators, many brand new and high quality just off of our production lines, and that we are now in a position to help other countries that so desperately need them. Every person needing a Ventilator got one!","rating":5},{"id":1272637231765864400,"text":"“We have greater confidence in our call for a V-shaped recovery, given recent upside surprises in growth data and policy action.” Chetan Ahya, Chief Economist at Morgan Stanley","rating":2},{"id":1214193106423369700,"text":"The Impeachment Hoax, just a continuation of the Witch Hunt which started even before I won the Election, must end quickly. Read the Transcripts, see the Ukrainian President’s strong statement, NO PRESSURE - get this done. It is a con game by the Dems to help with the Election!","rating":8},{"id":1146625696531456000,"text":"Today’s Stock Market is the highest in the history of our great Country! This is the 104th time since the Election of 2016 that we have reached a NEW HIGH. Congratulations USA!","rating":4},{"id":1226857034601115600,"text":"Hope the Fake News, which never discusses it, is talking about the big crowds forming for my New Hampshire Rally tonight. They won’t!","rating":7},{"id":992395376039727100,"text":"JUST OUT: 3.9% Unemployment. 4% is Broken! In the meantime, WITCH HUNT!","rating":6},{"id":1160667748978122800,"text":"Many incredible things are happening right now for our Country. After years of being ripped off by other nations on both Trade Deals and the Military, things are changing fast. Big progress is being made. America is respected again. KEEP AMERICA GREAT!","rating":5},{"id":801805564577808400,"text":"I am working hard, even on Thanksgiving, trying to get Carrier A.C. Company to stay in the U.S. (Indiana). MAKING PROGRESS - Will know soon!","rating":7},{"id":1317652898910675000,"text":"...while sacrificing American blood and treasure in endless foreign wars. Joe Biden is a corrupt politician — and the Biden family is a criminal enterprise. This makes Crooked Hillary Clinton look like amateur hour!","rating":8},{"id":1107981131012628500,"text":"The Fake News Media has NEVER been more Dishonest or Corrupt than it is right now. There has never been a time like this in American History. Very exciting but also, very sad! Fake News is the absolute Enemy of the People and our Country itself!","rating":9},{"id":1205338255832555500,"text":"Looking like a big win for Boris in the U.K.!","rating":4},{"id":912278438127525900,"text":"Many people booed the players who kneeled yesterday (which was a small percentage of total). These are fans who demand respect for our Flag!","rating":6},{"id":959389424806191100,"text":"The top Leadership and Investigators of the FBI and the Justice Department have politicized the sacred investigative process in favor of Democrats and against Republicans - something which would have been unthinkable just a short time ago. Rank &amp, File are great people!","rating":7},{"id":1221790577446019000,"text":"READ THE TRANSCRIPTS!","rating":3},{"id":1227453711540269000,"text":"The Fake News Media is looking hard for the Big Democrat Story, but there is nothing too fabulous. Wouldn’t a big story be that I got more New Hampshire Primary Votes than any incumbent president, in either party, in the history of that Great State? Not an insignificant fact!","rating":5},{"id":1177575947358412800,"text":"Rep. Adam Schiff totally made up my conversation with Ukraine President and read it to Congress and Millions. He must resign and be investigated. He has been doing this for two years. He is a sick man!","rating":7},{"id":1104383134529998800,"text":"Border Patrol and Law Enforcement has apprehended (captured) large numbers of illegal immigrants at the Border. They won’t be coming into the U.S. The Wall is being built and will greatly help us in the future, and now!","rating":5},{"id":1028271447632957400,"text":"The riots in Charlottesville a year ago resulted in senseless death and division. We must come together as a nation. I condemn all types of racism and acts of violence. Peace to ALL Americans!","rating":5},{"id":993815373190492200,"text":"John Kerry can’t get over the fact that he had his chance and blew it! Stay away from negotiations John, you are hurting your country!","rating":7},{"id":1208228582386020400,"text":"Honored to finally put an end to the “Widow’s Tax” and ensure that our surviving military spouses receive their full benefits. The spouses and families of our fallen heroes have suffered enough and WE must do everything in our power to ease the burden.","rating":3},{"id":1074697102142382100,"text":"Anytime you hear a Democrat saying that you can have good Border Security without a Wall, write them off as just another politician following the party line. Time for us to save billions of dollars a year and have, at the same time, far greater safety and control!","rating":6},{"id":949066181381632000,"text":"Thank you to the great Republican Senators who showed up to our mtg on immigration reform. We must BUILD THE WALL, stop illegal immigration, end chain migration &amp, cancel the visa lottery. The current system is unsafe &amp, unfair to the great people of our country - time for change!","rating":5},{"id":1304511871152795600,"text":"Pelosi and Schumer want Trillions of Dollars of BAILOUT money for Blue States that are doing badly, both economically and in terms of high crime, as a condition to making a deal on stimulus - But the USA is coming back strong!","rating":6},{"id":1293335445879820300,"text":"Sad to see the damage from the derecho in Midwest. 112 mile per hour winds in Midway, Iowa! The Federal government is in close coordination with State officials. We are with you all the way - Stay safe and strong!","rating":4},{"id":882325456162361300,"text":"Getting ready to celebrate the 4th of July with a big crowd at the White House. Happy 4th to everyone. Our country will grow and prosper!","rating":2},{"id":827996357252243500,"text":"Because the ban was lifted by a judge, many very bad and dangerous people may be pouring into our country. A terrible decision","rating":7},{"id":1147486815160610800,"text":"Joe Biden is a reclamation project. Some things are just not salvageable. China and other countries that ripped us off for years are begging for him. He deserted our military, our law enforcement and our healthcare. Added more debt than all other Presidents combined. Won’t win!","rating":8},{"id":1185389914470473700,"text":"Susan Rice, who was a disaster to President Obama as National Security Advisor, is now telling us her opinion on what to do in Syria. Remember RED LINE IN THE SAND? That was Obama. Millions killed! No thanks Susan, you were a disaster.","rating":6},{"id":1301710819349205000,"text":"....John a loser and swear on whatever, or whoever, I was asked to swear on, that I never called our great fallen soldiers anything other than HEROES. This is more made up Fake News given by disgusting &amp; jealous failures in a disgraceful attempt to influence the 2020 Election!","rating":8},{"id":1026196465696350200,"text":"Presidential Approval numbers are very good - strong economy, military and just about everything else. Better numbers than Obama at this point, by far. We are winning on just about every front and for that reason there will not be a Blue Wave, but there might be a Red Wave!","rating":5},{"id":1260169167665270800,"text":"96% APPROVAL RATING IN THE REPUBLICAN PARTY. THANK YOU! We will win against a tired, exhausted man, Sleepy Joe Biden, in November.","rating":6},{"id":1128336007856660500,"text":"Today marks the one-year anniversary of the opening of the United States Embassy in Jerusalem, Israel. Our beautiful embassy stands as a proud reminder of our strong relationship with Israel and of the importance of keeping a promise and standing for the truth.","rating":4},{"id":1106611696548884500,"text":"I’d like to thank all of the Great Republican Senators who bravely voted for Strong Border Security and the WALL. This will help stop Crime, Human Trafficking, and Drugs entering our Country. Watch, when you get back to your State, they will LOVE you more than ever before!","rating":5},{"id":1157868519964500000,"text":"....Melania and I send our heartfelt thoughts and prayers to the great people of Texas.","rating":3},{"id":1247897589996908500,"text":"The Radical Left Democrats have gone absolutely crazy that I am doing daily Presidential News Conferences. They actually want me to STOP! They used to complain that I am not doing enough of them, now they complain that I “shouldn’t be allowed to do them.” They tried to shame.....","rating":7},{"id":1078260814157701100,"text":"Have the Democrats finally realized that we desperately need Border Security and a Wall on the Southern Border. Need to stop Drugs, Human Trafficking,Gang Members &amp, Criminals from coming into our Country. Do the Dems realize that most of the people not getting paid are Democrats?","rating":6},{"id":1079083702943211500,"text":"...children in question were very sick before they were given over to Border Patrol. The father of the young girl said it was not their fault, he hadn’t given her water in days. Border Patrol needs the Wall and it will all end. They are working so hard &amp, getting so little credit!","rating":7},{"id":890197095151546400,"text":"....victory and cannot be burdened with the tremendous medical costs and disruption that transgender in the military would entail. Thank you","rating":6},{"id":1060938144336367600,"text":"As soon as Democrats sent their best Election stealing lawyer, Marc Elias, to Broward County they miraculously started finding Democrat votes. Don’t worry, Florida - I am sending much better lawyers to expose the FRAUD!","rating":8},{"id":1284255472229519400,"text":"I am the ultimate member of The Book of the Month Club. First I have lowlife dummy John Bolton, a war mongering fool, violating the law (he released massive amounts of Classified Information) and an NDA in order to build badly needed credibility and make a few dollars, which","rating":7},{"id":1118145749148209200,"text":"No Collusion - No Obstruction!","rating":5},{"id":1100683974899363800,"text":"Michael Cohen was one of many lawyers who represented me (unfortunately). He had other clients also. He was just disbarred by the State Supreme Court for lying &amp, fraud. He did bad things unrelated to Trump. He is lying in order to reduce his prison time. Using Crooked’s lawyer!","rating":6},{"id":1226847711703584800,"text":"Because of how badly they did with the Impeachment Hoax, AOC will primary Cryin’ Chuck Schumer, and win, and Jerry Nadler has a good chance of losing to his far left primary opponent! It is all getting quite interesting. Pelosi will lose the House, AGAIN! My poll numbers great.","rating":7},{"id":1306977955340578800,"text":"Biden FAILED BADLY with the Swine Flu. It was the Gang That Couldn’t Shoot Straight”.  He didn’t have a clue. We have done an incredible job with the much tougher China Virus!","rating":8},{"id":994182263960162300,"text":"Candace Owens of Turning Point USA is having a big impact on politics in our Country. She represents an ever expanding group of very smart “thinkers,” and it is wonderful to watch and hear the dialogue going on...so good for our Country!","rating":4},{"id":879405223399350300,"text":"Very grateful for the 9-O decision from the U. S. Supreme Court. We must keep America SAFE!","rating":4},{"id":1073761497866747900,"text":"As I predicted all along, Obamacare has been struck down as an UNCONSTITUTIONAL disaster! Now Congress must pass a STRONG law that provides GREAT healthcare and protects pre-existing conditions. Mitch and Nancy, get it done!","rating":6},{"id":1011391230188458000,"text":"The hearing of Peter Strzok and the other hating frauds at the FBI &amp, DOJ should be shown to the public on live television, not a closed door hearing that nobody will see. We should expose these people for what they are - there should be total transparency!","rating":6},{"id":1303860823975178200,"text":"For years Fake stories and investigations, then the phony Russia, Russia, Russia HOAX, next Ukraine and the failed Impeachment, now the crummy Atlantic Magazine’s MADE UP STORY, and lastly, the political hit job by rapidly fading Bob Woodward and his boring book. It never ends!","rating":9},{"id":1258448362409427000,"text":"Congratulations to former Governor of New Jersey, Chris Christie, and all others involved, on a complete and total exoneration (with a 9-0 vote by the U.S. Supreme Court) on the Obama DOJ Scam referred to as “Bridgegate.” The Democrats....","rating":6},{"id":892920397162848300,"text":"I love the White House, one of the most beautiful buildings (homes) I have ever seen. But Fake News said I called it a dump - TOTALLY UNTRUE","rating":8},{"id":1235223911538872300,"text":"Wow! If Elizabeth Warren wasn’t in the race, Bernie Sanders would have EASILY won Massachusetts, Minnesota and Texas, not to mention various other states. Our modern day Pocahontas won’t go down in history as a winner, but she may very well go down as the all time great SPOILER!","rating":8},{"id":1038789398140084200,"text":"If the U.S. sells a car into China, there is a tax of 25%. If China sells a car into the U.S., there is a tax of 2%. Does anybody think that is FAIR? The days of the U.S. being ripped-off by other nations is OVER!","rating":7},{"id":1212121012151689200,"text":"The U.S. Embassy in Iraq is, &amp, has been for hours, SAFE! Many of our great Warfighters, together with the most lethal military equipment in the world, was immediately rushed to the site. Thank you to the President &amp, Prime Minister of Iraq for their rapid response upon request....","rating":5},{"id":1156777890501058600,"text":"...It will soon be time to choose to keep and build upon that prosperity and success, or let it go. We are respected again all around the world. Keep it that way! I said I will never let you down, and I haven’t. We will only grow bigger, better and stronger TOGETHER!","rating":4},{"id":923566287263068200,"text":"Big news - Budget just passed!","rating":3},{"id":850723509370327000,"text":"Congratulations to our great military men and women for representing the United States, and the world, so well in the Syria attack.","rating":4},{"id":1073763695807877100,"text":"Wow, but not surprisingly, ObamaCare was just ruled UNCONSTITUTIONAL by a highly respected judge in Texas. Great news for America!","rating":6},{"id":1127529870014201900,"text":"Think of it. I became President of the United States in one of the most hard fought and consequential elections in the history of our great nation. From long before I ever took office, I was under a sick &amp, unlawful investigation concerning what has become known as the Russian....","rating":4},{"id":976405122757558300,"text":"AUSTIN BOMBING SUSPECT IS DEAD. Great job by law enforcement and all concerned!","rating":3},{"id":1060723241193484300,"text":"Law Enforcement is looking into another big corruption scandal having to do with Election Fraud in #Broward and Palm Beach. Florida voted for Rick Scott!","rating":5},{"id":926492915626664000,"text":"The decision on Sergeant Bergdahl is a complete and total disgrace to our Country and to our Military.","rating":4},{"id":1275438921552257000,"text":"We did a great job on CoronaVirus, including the very early ban on China, Ventilator production, and Testing, which is by far the most, and best, in the World. We saved millions of U.S. lives.! Yet the Fake News refuses to acknowledge this in a positive way. But they do give....","rating":5},{"id":1232304804820467700,"text":"Cryin’ Chuck Schumer is complaining, for publicity purposes only, that I should be asking for more money than $2.5 Billion to prepare for Coronavirus. If I asked for more he would say it is too much. He didn’t like my early travel closings. I was right. He is incompetent!","rating":6},{"id":1251185023459483600,"text":"Biden/Obama were a disaster in handling the H1N1 Swine Flu. Polling at the time showed disastrous approval numbers. 17,000 people died unnecessarily and through incompetence! Also, don’t forget their 5 Billion Dollar Obamacare website that should have cost close to nothing!","rating":5},{"id":1177924912226414600,"text":"KEEP AMERICA GREAT!","rating":2},{"id":990307626784362500,"text":"Secret Service has just informed me that Senator Jon Tester’s statements on Admiral Jackson are not true. There were no such findings. A horrible thing that we in D.C. must live with, just like phony Russian Collusion. Tester should lose race in Montana. Very dishonest and sick!","rating":6},{"id":1283434482322808800,"text":"Three individuals were sentenced to death in Iran for participating in protests. The execution is expected momentarily. Executing these three people sends a terrible signal to the world and should not be done! #StopExecutionsInIran","rating":3},{"id":1278677687050084400,"text":"News Conference at 9:30. Great Jobs Numbers!","rating":2},{"id":837638488656920600,"text":"It is so pathetic that the Dems have still not approved my full Cabinet.","rating":5},{"id":1299575308442652700,"text":"Kenosha has been very quiet for the third night in a row or, since the National Guard has shown up. That’s the way it works, it’s all very simple. Portland, with a very ungifted mayor, should request help from the Federal Government. If lives are endangered, we’re going in!","rating":7},{"id":951813216291708900,"text":"Never said anything derogatory about Haitians other than Haiti is, obviously, a very poor and troubled country. Never said “take them out.” Made up by Dems. I have a wonderful relationship with Haitians. Probably should record future meetings - unfortunately, no trust!","rating":6},{"id":1023557246628900900,"text":"I would be willing to “shut down” government if the Democrats do not give us the votes for Border Security, which includes the Wall! Must get rid of Lottery, Catch &amp, Release etc. and finally go to system of Immigration based on MERIT! We need great people coming into our Country!","rating":8},{"id":1120323291443540000,"text":"Only high crimes and misdemeanors can lead to impeachment. There were no crimes by me (No Collusion, No Obstruction), so you can’t impeach. It was the Democrats that committed the crimes, not your Republican President! Tables are finally turning on the Witch Hunt!","rating":7},{"id":1077048054862278700,"text":"Mitch McConnell just told a group of people, and me, that he has been in the U.S. Senate for 32 years and the last two have been by far the best &amp, most productive of his career. Tax &amp, Regulation Cuts, VA Choice, Farm Bill, Criminal Justice Reform, Judgeships &amp, much more. Great!","rating":4},{"id":1286332695023431700,"text":"The Democrats have stated strongly that they won’t approve a Payroll Tax Cut (too bad!). It would be great for workers. The Republicans, therefore, didn’t want to ask for it. Dems, as usual, are hurting the working men and women of our Country!","rating":5},{"id":1306239033891315700,"text":"Democrats are “heartless”. They don’t want to give STIMULUS PAYMENTS to people who desperately need the money, and whose fault it was NOT that the plague came in from China. Go for the much higher numbers, Republicans, it all comes back to the USA anyway (one way or another!).","rating":7},{"id":1319298383144718300,"text":"Really good polling numbers as people realize all that we have done. Rasmussen Approval Rating, just out, 52%. Approval Rating in the Republican Party, 96%. Thank you!","rating":4},{"id":1168246061951004700,"text":"Pray for the people in the Bahamas. Being hit like never before, Category 5.  Almost 200 MPH winds.","rating":3},{"id":1240269212871995400,"text":"95% Approval Rating in the Republican Party, 53% overall. Not bad considering I get nothing but Fake &amp; Corrupt News, day and night. “Russia, Russia, Russia”, then “the Ukraine Scam (where’s the Whistleblower?)”, the “Impeachment Hoax”, and more, more, more....","rating":7},{"id":982750459877380100,"text":"Fire at Trump Tower is out. Very confined (well built building). Firemen (and women) did a great job. THANK YOU!","rating":2},{"id":1064216956679716900,"text":"So funny to see little Adam Schitt (D-CA) talking about the fact that Acting Attorney General Matt Whitaker was not approved by the Senate, but not mentioning the fact that Bob Mueller (who is highly conflicted) was not approved by the Senate!","rating":9},{"id":962348831789797400,"text":"Peoples lives are being shattered and destroyed by a mere allegation. Some are true and some are false. Some are old and some are new. There is no recovery for someone falsely accused - life and career are gone. Is there no such thing any longer as Due Process?","rating":6},{"id":1084650944846012400,"text":"....Border is eventually going to be militarized and defended or the United States, as we have known it, is going to cease to exist...And Americans will not go gentle into that good night. Patrick Buchanan.  The great people of our Country demand proper Border Security NOW!","rating":8},{"id":959946200488271900,"text":"Great jobs numbers and finally, after many years, rising wages- and nobody even talks about them. Only Russia, Russia, Russia, despite the fact that, after a year of looking, there is No Collusion!","rating":4},{"id":912018945158402000,"text":"Great solidarity for our National Anthem and for our Country. Standing with locked arms is good, kneeling is not acceptable. Bad ratings!","rating":5},{"id":1028355187939987500,"text":"Hundreds of Bikers for Trump just joined me at Bedminster. Quite a scene - great people who truly love our Country!","rating":3},{"id":1286299924141932500,"text":"Recently watched failed RINO Tom Ridge, former head of Homeland Security, trying to justify his sudden love of the Radical Left Mayor of Portland, who last night was booed &amp; shouted out of existence by the agitators &amp; anarchists. Love watching pathetic Never Trumpers squirm!","rating":8},{"id":1030094399362007000,"text":"There is nothing that I would want more for our Country than true FREEDOM OF THE PRESS. The fact is that the Press is FREE to write and say anything it wants, but much of what it says is FAKE NEWS, pushing a political agenda or just plain trying to hurt people. HONESTY WINS!","rating":7},{"id":1207842238623080400,"text":"The reason the Democrats don’t want to submit the Articles of Impeachment to the Senate is that they don’t want corrupt politician Adam Shifty Schiff to testify under oath, nor do they want the Whistleblower, the missing second Whistleblower, the informer, the Bidens, to testify!","rating":8},{"id":1089162706840707100,"text":"We have turned away, at great expense, two major Caravans, but a big one has now formed and is coming. At least 8000 people! If we had a powerful Wall, they wouldn’t even try to make the long and dangerous journey. Build the Wall and Crime will Fall!","rating":8},{"id":1261793147069366300,"text":".....are therefore given massive advantages over The United States, and everyone else? Prior to the Plague floating in from China, our Economy was blowing everybody away, the best of any country, EVER. We will be there again, and soon!","rating":5},{"id":1301150012194332700,"text":"The Beauty Parlor owner must really dislike Crazy Nancy Pelosi. Turning her in, on tape, is a really big deal. She probably treats him like she treats everyone else...And she strongly supported a Kennedy who just lost in, of all places, Massachusetts!","rating":7},{"id":1132750329408364500,"text":"Congratulations to the Great (and my friend) Roger Penske on winning his 18th (UNBELIEVABLE!) Indianapolis 500. I am in Japan, very early in the morning, but I got to watch Simon drive one of the greatest races in the history of the sport. I will see them both, &amp, TEAM, at the WH!","rating":4},{"id":1275252814206447600,"text":"The China Trade Deal is fully intact. Hopefully they will continue to live up to the terms of the Agreement!","rating":3},{"id":1201639937268949000,"text":"Mini Mike Bloomberg has instructed his third rate news organization not to investigate him or any Democrat, but to go after President Trump, only. The Failing New York Times thinks that is O.K., because their hatred &amp, bias is so great they can’t even see straight. It’s not O.K.!","rating":6},{"id":1218523265821544400,"text":"Tremendous surge in new housing construction in December, 16.9%, biggest in many years!","rating":4},{"id":1303765212789698600,"text":"I will be announcing a list of future potential Supreme Court Justices at 3:30 P.M. Eastern from the Diplomatic Reception Room of the White House.","rating":3},{"id":1263671099000316000,"text":"Do nothing A.G. of the Great State of Michigan, Dana Nessel, should not be taking her anger and stupidity out on Ford Motor - they might get upset with you and leave the state, like so many other companies have - until I came along and brought business back to Michigan. JOBS!","rating":8},{"id":1239237382458806300,"text":"Can’t believe they are not going after Schumer for the threats he made to our cherished United States Supreme Court, and our two great Justices. If a Republican did that, there would be an endless price to pay. Pathetic!","rating":6},{"id":1018731223890481200,"text":"President Obama thought that Crooked Hillary was going to win the election, so when he was informed by the FBI about Russian Meddling, he said it couldn’t happen, was no big deal, &amp, did NOTHING about it. When I won it became a big deal and the Rigged Witch Hunt headed by Strzok!","rating":7},{"id":1137051097955102700,"text":"For all of the money we are spending, NASA should NOT be talking about going to the Moon - We did that 50 years ago. They should be focused on the much bigger things we are doing, including Mars (of which the Moon is a part), Defense and Science!","rating":8},{"id":1250526689702150100,"text":"White House news conference today at 5:30 P.M. Eastern. Thank you!","rating":2},{"id":851767718248362000,"text":"North Korea is looking for trouble. If China decides to help, that would be great. If not, we will solve the problem without them!  U.S.A.","rating":7},{"id":1098224105931853800,"text":"California now wants to scale back their already failed “fast train” project by substantially shortening the distance so that it no longer goes from L.A. to San Francisco. A different deal and record cost overruns. Send the Federal Government back the Billions of Dollars WASTED!","rating":5},{"id":837993273679560700,"text":"Is it legal for a sitting President to be \"\"wire tapping\"\" a race for president prior to an election? Turned down by court earlier. A NEW LOW!","rating":9},{"id":1322413640021147600,"text":"Suburban Women are trending strongly to our campaign because they want SAFETY, SECURITY, and love the fact that I terminated the REGULATION that would destroy their neighborhood and with it, the American Dream. Biden would bring the REGULATION back in a MUCH stronger form!!!","rating":6},{"id":1081579754191552500,"text":"The Democrats want Billions of Dollars for Foreign Aid, but they don’t want to spend a small fraction of that number on properly securing our Border. Figure that one out!","rating":5},{"id":1292872318562205700,"text":"We have narrowed the Presidential Nomination Acceptance Speech, to be delivered on the final night of the Convention (Thursday), to two locations - The Great Battlefield of Gettysburg, Pennsylvania, and the White House, Washington, D.C. We will announce the decision soon!","rating":3},{"id":1179807522116575200,"text":"95% Approval Rating in the Republican Party, and record setting fundraising that has taken place over the past two weeks. Thank you!","rating":2},{"id":1249004689322053600,"text":"“Trump did a deal with Japan. A lot of our product goes to Japan, and we are booming in North Dakota.” Jim on C Span, Washington Journal. Our Trade Deals will be having a big impact on our Country as they kick in!","rating":3},{"id":1129001970654679000,"text":"The Dems are getting another beauty to join their group. Bill de Blasio of NYC, considered the worst mayor in the U.S., will supposedly be making an announcement for president today. He is a JOKE, but if you like high taxes &amp, crime, he’s your man. NYC HATES HIM!","rating":8},{"id":1083696274182996000,"text":"I often said during rallies, with little variation, that “Mexico will pay for the Wall.” We have just signed a great new Trade Deal with Mexico. It is Billions of Dollars a year better than the very bad NAFTA deal which it replaces. The difference pays for Wall many times over!","rating":5},{"id":1083756525196320800,"text":"Humanitarian Crisis at our Southern Border. I just got back and it is a far worse situation than almost anyone would understand, an invasion! I have been there numerous times - The Democrats, Cryin’ Chuck and Nancy don’t know how bad and dangerous it is for our ENTIRE COUNTRY....","rating":7},{"id":1313503322087870500,"text":"Mini Mike Bloomberg, who made a fool of himself on the Dems debate stage when Elizabeth Warren &amp; the others simply took him apart, is going “crazy” trying to buy his way back into the Liberal Democrat’s hearts. His Florida ads are lies. I am much better for SENIORS than Sleepy!","rating":9},{"id":1210207810291671000,"text":"Despite all of the great success that our Country has had over the last 3 years, it makes it much more difficult to deal with foreign leaders (and others) when I am having to constantly defend myself against the Do Nothing Democrats &amp, their bogus Impeachment Scam. Bad for USA!","rating":6},{"id":1313985879220850700,"text":"My highly regarded Executive Order protected 525,000 American jobs during the height of the Chinese Plague. Democrats want to have Open Borders!","rating":4},{"id":1119019875203153900,"text":"Anything the Russians did concerning the 2016 Election was done while Obama was President. He was told about it and did nothing! Most importantly, the vote was not affected.","rating":5},{"id":1084474165976019000,"text":"The damage done to our Country from a badly broken Border - Drugs, Crime and so much that is bad - is far greater than a Shutdown, which the Dems can easily fix as soon as they come back to Washington!","rating":7},{"id":928769154345324500,"text":"I don’t blame China, I blame the incompetence of past Admins for allowing China to take advantage of the U.S. on trade leading up to a point where the U.S. is losing $100's of billions. How can you blame China for taking advantage of people that had no clue? I would've done same!","rating":6},{"id":1283943240434163700,"text":"Another one of many Fake T.V. Ads, this one about the Tennessee Valley Authority, which for years has paid its top executive a ridiculous FORTUNE. Not run by the U.S., but I have long been fighting that crazy “salary” &amp; its polices. Strange ad paid for (?) by “U.S. Tech Workers”.","rating":8},{"id":1288826742539464700,"text":"Kate Brown, Governor of Oregon, isn’t doing her job. She must clear out, and in some cases arrest, the Anarchists &amp; Agitators in Portland. If she can’t do it, the Federal Government will do it for her. We will not be leaving until there is safety!","rating":7},{"id":1096547516290543600,"text":"Great job by law enforcement in Aurora, Illinois. Heartfelt condolences to all of the victims and their families. America is with you!","rating":3},{"id":1219424278216470500,"text":"Heading to Davos, Switzerland, to meet with World and Business Leaders and bring Good Policy and additional Hundreds of Billions of Dollars back to the United States of America! We are now NUMBER ONE in the Universe, by FAR!!","rating":9},{"id":1221809170673959000,"text":"We are in very close communication with China concerning the virus. Very few cases reported in USA, but strongly on watch. We have offered China and President Xi any help that is necessary. Our experts are extraordinary!","rating":5},{"id":1263074783673102300,"text":"Breaking: Michigan sends absentee ballots to 7.7 million people ahead of Primaries and the General Election. This was done illegally and without authorization by a rogue Secretary of State. I will ask to hold up funding to Michigan if they want to go down this Voter Fraud path!..","rating":8},{"id":1297922993021042700,"text":"All the Radical Left Democrats are trying to do with the Post Office hearings is blame the Republicans for the FRAUD that will occur because of the 51 Million Ballots that are being sent to people who have not even requested them. They are setting the table for a BIG MESS!","rating":7},{"id":1027266105797238800,"text":"RED WAVE!","rating":6},{"id":826042483155013600,"text":"protesters and the tears of Senator Schumer. Secretary Kelly said that all is going well with very few problems. MAKE AMERICA SAFE AGAIN!","rating":7},{"id":1121021160827887600,"text":"Mexico’s Soldiers recently pulled guns on our National Guard Soldiers, probably as a diversionary tactic for drug smugglers on the Border. Better not happen again! We are now sending ARMED SOLDIERS to the Border. Mexico is not doing nearly enough in apprehending &amp, returning!","rating":8},{"id":1021755459416543200,"text":"MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1240355986541613000,"text":"...It cannot overcome the dedication of our doctors, nurses, and scientists — and it cannot beat the LOVE, PATRIOTISM, and DETERMINATION of our citizens. Strong and United, WE WILL PREVAIL!","rating":4},{"id":1315678436904534000,"text":"So Crazy to watch Senator Blumenthal of Connecticut lecture all on morals &amp; ethics when for 25 years he said he was a Great War Hero in Vietnam, and he was never even there. He lied &amp; cheated right up until the day he got caught. Thank you to those in military who turned him in!","rating":9},{"id":1288602262567153700,"text":"New York Mail-In voting is in a disastrous state of condition. Votes from many weeks ago are missing - a total mess. They have no idea what is going on. Rigged Election. I told you so. Same thing would happen, but on massive scale, with USA. Fake News refuses to report!","rating":8},{"id":1225901400573513700,"text":"I was very surprised &amp; disappointed that Senator Joe Manchin of West Virginia voted against me on the Democrat’s totally partisan Impeachment Hoax. No President has done more for the great people of West Virginia than me (Pensions), and that will....","rating":6},{"id":1253064464053739500,"text":"I will be having a White House Press Conference today at 5:45 P.M. Thank you!","rating":3},{"id":1315871589129498600,"text":"I keep reading Fake News stories that my campaign is running low on money. Not true, &amp; if it were so, I would put up money myself. The fact is that we have much more money than we had 4 years ago, where we spent much less money than Crooked Hillary, and still easily won, 306-223!","rating":6},{"id":1315742009760657400,"text":"Heading to the Greatest Economy Of All Time!!!  VOTE","rating":5},{"id":1191350738536083500,"text":"Stock Market hits RECORD HIGH. Spend your money well!","rating":5},{"id":898171544236687400,"text":"...can't change history, but you can learn from it. Robert E Lee, Stonewall Jackson - who's next, Washington, Jefferson? So foolish! Also...","rating":8},{"id":1155442764940812300,"text":"Speaking of failing badly, has anyone seen what is happening to Nancy Pelosi’s district in San Francisco. It is not even recognizeable lately. Something must be done before it is too late. The Dems should stop wasting time on the Witch Hunt Hoax and start focusing on our Country!","rating":7},{"id":1285524871666118700,"text":"You will never hear this on the Fake News concerning the China Virus, but by comparison to most other countries, who are suffering greatly, we are doing very well - and we have done things that few other countries could have done!","rating":6},{"id":1079042460800696300,"text":"I am in the White House waiting for the Democrats to come on over and make a deal on Border Security. From what I hear, they are spending so much time on Presidential Harassment that they have little time left for things like stopping crime and our military!","rating":6},{"id":1193224005827940400,"text":"PRESIDENTIAL HARASSMENT!","rating":9},{"id":995816799341088800,"text":"So sad to see the Terror Attack in Paris. At some point countries will have to open their eyes &amp, see what is really going on. This kind of sickness &amp, hatred is not compatible with a loving, peaceful, &amp, successful country! Changes to our thought process on terror must be made.","rating":5},{"id":1048606042123395100,"text":"Women for Kavanaugh, and many others who support this very good man, are gathering all over Capitol Hill in preparation for a 3-5 P.M. VOTE. It is a beautiful thing to see - and they are not paid professional protesters who are handed expensive signs. Big day for America!","rating":4},{"id":1147856061006786600,"text":"Last year was the first in 51 years where prescription drug prices actually went down, but things have been, and are being, put in place that will drive them down substantially. If Dems would work with us in a bipartisan fashion, we would get big results very fast!","rating":4},{"id":932392209445457900,"text":"Shoplifting is a very big deal in China, as it should be (5-10 years in jail), but not to father LaVar. Should have gotten his son out during my next trip to China instead. China told them why they were released. Very ungrateful!","rating":7},{"id":961270833569202200,"text":"NEW FBI TEXTS ARE BOMBSHELLS!","rating":5},{"id":949618475877765100,"text":"....Actually, throughout my life, my two greatest assets have been mental stability and being, like, really smart. Crooked Hillary Clinton also played these cards very hard and, as everyone knows, went down in flames. I went from VERY successful businessman, to top T.V. Star.....","rating":8},{"id":1155562212032991200,"text":"Under the Trump Administration, African American unemployment is the lowest (best) in the history of the United States. No President has come close to doing this before! I also created successful Opportunity Zones. Waiting for Nancy and Elijah to say, “Thank you, Mr. President!”","rating":7},{"id":1226219499847811000,"text":"We will not be touching your Social Security or Medicare in Fiscal 2021 Budget. Only the Democrats will destroy them by destroying our Country’s greatest ever Economy!","rating":6},{"id":1126144398180388900,"text":"GREAT NEWS FOR OHIO! Just spoke to Mary Barra, CEO of General Motors, who informed me that, subject to a UAW agreement etc., GM will be selling their beautiful Lordstown Plant to Workhorse, where they plan to build Electric Trucks. GM will also be spending $700,000,000 in Ohio...","rating":4},{"id":1270787975719391200,"text":"...history of Winning, Victory, and Freedom. The United States of America trained and deployed our HEROES on these Hallowed Grounds, and won two World Wars. Therefore, my Administration will not even consider the renaming of these Magnificent and Fabled Military Installations...","rating":3},{"id":1118321122624331800,"text":"Bernie Sanders and wife should pay the Pre-Trump Taxes on their almost $600,000 in income. He is always complaining about these big TAX CUTS, except when it benefits him. They made a fortune off of Trump, but so did everyone else - and that’s a good thing, not a bad thing!","rating":7},{"id":1094948909657542700,"text":"The Democrats do not want us to detain, or send back, criminal aliens! This is a brand new demand. Crazy!","rating":6},{"id":1155240345585750000,"text":"NO COLLUSION, NO OBSTRUCTION, TOTAL EXONERATION. DEMOCRAT WITCH HUNT!","rating":9},{"id":978249938743234600,"text":"So much Fake News. Never been more voluminous or more inaccurate. But through it all, our country is doing great!","rating":5},{"id":1046708836407685100,"text":"Late last night, our deadline, we reached a wonderful new Trade Deal with Canada, to be added into the deal already reached with Mexico. The new name will be The United States Mexico Canada Agreement, or USMCA. It is a great deal for all three countries, solves the many......","rating":3},{"id":1129394914427453400,"text":"It now seems the General Flynn was under investigation long before was common knowledge. It would have been impossible for me to know this but, if that was the case, and with me being one of two people who would become president, why was I not told so that I could make a change?","rating":4},{"id":989820401596366800,"text":"KOREAN WAR TO END! The United States, and all of its GREAT people, should be very proud of what is now taking place in Korea!","rating":5},{"id":1100781840623751200,"text":"Great meetings and dinner tonight in Vietnam with Kim Jong Un of North Korea. Very good dialogue. Resuming tomorrow!","rating":4},{"id":1257741326650470400,"text":"Well run States should not be bailing out poorly run States, using CoronaVirus as the excuse! The elimination of Sanctuary Cities, Payroll Taxes, and perhaps Capital Gains Taxes, must be put on the table. Also lawsuit indemnification &amp; business deductions for restaurants &amp; ent.","rating":6},{"id":1133492876296511500,"text":"I was actually sticking up for Sleepy Joe Biden while on foreign soil. Kim Jong Un called him a “low IQ idiot,” and many other things, whereas I related the quote of Chairman Kim as a much softer “low IQ individual.” Who could possibly be upset with that?","rating":8},{"id":924251519121346600,"text":"Just read the nice remarks by President Jimmy Carter about me and how badly I am treated by the press (Fake News). Thank you Mr. President!","rating":3},{"id":1201887098049089500,"text":"The United States of America supports the brave people of Iran who are protesting for their FREEDOM. We have under the Trump Administration, and always will!","rating":4},{"id":875690204564258800,"text":"The Fake News Media hates when I use what has turned out to be my very powerful Social Media - over 100 million people! I can go around them","rating":6},{"id":1013394559429169200,"text":"The Liberal Left, also known as the Democrats, want to get rid of ICE, who do a fantastic job, and want Open Borders. Crime would be rampant and uncontrollable! Make America Great Again","rating":5},{"id":1221663763138588700,"text":"I NEVER told John Bolton that the aid to Ukraine was tied to investigations into Democrats, including the Bidens. In fact, he never complained about this at the time of his very public termination. If John Bolton said this, it was only to sell a book. With that being said, the...","rating":6},{"id":1291015075541786600,"text":"Sally Yates has zero credibility. She was a part of the greatest political crime of the Century, and ObamaBiden knew EVERYTHING! Sally Yates leaked the General Flynn conversation? Ask her under oath. Republicans should start playing the Democrats game!","rating":7},{"id":1082268365081768000,"text":"....The Fake News Media in our Country is the real Opposition Party. It is truly the Enemy of the People! We must bring honesty back to journalism and reporting!","rating":8},{"id":1235568602696355800,"text":"As per recent Federal Court ruling, the Federal Government will be withholding funds from Sanctuary Cities. They should change their status and go non-Sanctuary. Do not protect criminals!","rating":5},{"id":1280209143127773200,"text":"“Treatment with hydroxychloroquine cut the death rate significantly in sick patients hospitalized with COVID-19 – and without heart-related side-effects, according to a new study published by Henry Ford Health System. In a large-scale retrospective analysis...","rating":4},{"id":1220453276275150800,"text":"Crazy Bernie takes the lead in the Democrat Primaries, but it is looking more and more like the Dems will never allow him to win! Will Sleepy Joe be able to stumble across the finish line?","rating":7},{"id":1182852925237805000,"text":"WHERE’S HUNTER?","rating":9},{"id":955658992793149400,"text":"Big win for Republicans as Democrats cave on Shutdown. Now I want a big win for everyone, including Republicans, Democrats and DACA, but especially for our Great Military and Border Security. Should be able to get there. See you at the negotiating table!","rating":5},{"id":1089340201204441100,"text":"WITCH HUNT!","rating":10},{"id":1080837263913832400,"text":"The Shutdown is only because of the 2020 Presidential Election. The Democrats know they can’t win based on all of the achievements of “Trump,” so they are going all out on the desperately needed Wall and Border Security - and Presidential Harassment. For them, strictly politics!","rating":6},{"id":881662619282702300,"text":"Stock Market at all time high, unemployment at lowest level in years (wages will start going up) and our base has never been stronger!","rating":3},{"id":1123035192262824000,"text":"If the Democrats don’t give us the votes to change our weak, ineffective and dangerous Immigration Laws, we must fight hard for these votes in the 2020 Election!","rating":2},{"id":1087472133230551000,"text":"If Nancy Pelosi thinks that Walls are “immoral,” why isn’t she requesting that we take down all of the existing Walls between the U.S. and Mexico, even the new ones just built in San Diego at their very strong urging. Let millions of unchecked “strangers” just flow into the U.S.","rating":5},{"id":1124158007921848300,"text":"OK, so after two years of hard work and each party trying their best to make the other party look as bad as possible, it’s time to get back to business. The Mueller Report strongly stated that there was No Collusion with Russia (of course) and, in fact, they were rebuffed.....","rating":2},{"id":955771016319590400,"text":"In one of the biggest stories in a long time, the FBI now says it is missing five months worth of lovers Strzok-Page texts, perhaps 50,000, and all in prime time. Wow!","rating":4},{"id":1109126357852786700,"text":"ISIS uses the internet better than almost anyone, but for all of those susceptible to ISIS propaganda, they are now being beaten badly at every level....","rating":3},{"id":1108335293671845900,"text":"George Conway, often referred to as Mr. Kellyanne Conway by those who know him, is VERY jealous of his wife’s success &amp, angry that I, with her help, didn’t give him the job he so desperately wanted. I barely know him but just take a look, a stone cold LOSER &amp, husband from hell!","rating":9},{"id":1288109093694005200,"text":"....be able to produce what I have. So when you see those nasty ads from Big Pharma remember, the only reason they are going all out is the massive PRICE REDUCTIONS you are getting - not good for them. Plus, I was only President in 51 years that got a Prescription D reduction!","rating":3},{"id":1197298118330474500,"text":"If this were a prizefight, they’d stop it!","rating":6},{"id":1153627260307611600,"text":"Newest Poll: Only 11% in favor of starting ridiculous impeachment hearings. Well, let’s see: We have the Best Economy in History, the Best Employment Numbers in History, Most People Working in History, Highest Stock Market in History, Biggest Tax and Regulation Cuts in History,..","rating":4},{"id":1129954110747422700,"text":"As most people know, and for those who would like to know, I am strongly Pro-Life, with the three exceptions - Rape, Incest and protecting the Life of the mother - the same position taken by Ronald Reagan. We have come very far in the last two years with 105 wonderful new.....","rating":2},{"id":1179399836883394600,"text":"Congressman Adam Schiff should resign for the Crime of, after reading a transcript of my conversation with the President of Ukraine (it was perfect), fraudulently fabricating a statement of the President of the United States and reading it to Congress, as though mine! He is sick!","rating":6},{"id":824229586091307000,"text":"I will be making my Supreme Court pick on Thursday of next week.Thank you!","rating":1},{"id":903587428488839200,"text":"Wow, looks like James Comey exonerated Hillary Clinton long before the investigation was over...and so much more. A rigged system!","rating":4},{"id":1134947966320554000,"text":"When you are the “Piggy Bank” Nation that foreign countries have been robbing and deceiving for years, the word TARIFF is a beautiful word indeed! Others must treat the United States fairly and with respect - We are no longer the “fools” of the past!","rating":5},{"id":1080457560291987500,"text":"Mexico is paying for the Wall through the new USMCA Trade Deal. Much of the Wall has already been fully renovated or built. We have done a lot of work. $5.6 Billion Dollars that House has approved is very little in comparison to the benefits of National Security. Quick payback!","rating":5},{"id":1073617541476569100,"text":"China just announced that their economy is growing much slower than anticipated because of our Trade War with them. They have just suspended U.S. Tariff Hikes. U.S. is doing very well. China wants to make a big and very comprehensive deal. It could happen, and rather soon!","rating":3},{"id":1037464177269514200,"text":"TREASON?","rating":9},{"id":1059470847751131100,"text":"Law Enforcement has been strongly notified to watch closely for any ILLEGAL VOTING which may take place in Tuesday’s Election (or Early Voting). Anyone caught will be subject to the Maximum Criminal Penalties allowed by law. Thank you!","rating":4},{"id":1110124213690687500,"text":"“The Special Counsel did not find that the Trump Campaign, or anyone associated with it, conspired or coordinated with the Russian Government in these efforts, despite multiple offers from Russian-affiliated individuals to assist the Trump Campaign.”","rating":3},{"id":1117736685721223200,"text":"What do I know about branding, maybe nothing (but I did become President!), but if I were Boeing, I would FIX the Boeing 737 MAX, add some additional great features, &amp, REBRAND the plane with a new name.No product has suffered like this one. But again, what the hell do I know?","rating":8},{"id":1089336969417625600,"text":"CBS reports that in the Roger Stone indictment, data was “released during the 2016 Election to damage Hillary Clinton.” Oh really! What about the Fake and Unverified “Dossier,” a total phony conjob, that was paid for by Crooked Hillary to damage me and the Trump Campaign? What...","rating":7},{"id":883230130885324800,"text":"I will represent our country well and fight for its interests! Fake News Media will never cover me accurately but who cares! We will #MAGA!","rating":5},{"id":1227258461106425900,"text":"New Stock Market RECORD. Congratulations, spend your money wisely. KEEP AMERICA GREAT!!!!!","rating":6},{"id":1084808599124222000,"text":"The Fake News gets crazier and more dishonest every single day. Amazing to watch as certain people covering me, and the tremendous success of this administration, have truly gone MAD! Their Fake reporting creates anger and disunity. Take two weeks off and come back rested. Chill!","rating":8},{"id":1265633761024188400,"text":"The Radical Left Lamestream Media, together with their partner, the Do Nothing Democrats, are trying to spread a new narrative that President Trump was slow in reacting to Covid 19. Wrong, I was very fast, even doing the Ban on China long before anybody thought necessary!","rating":7},{"id":801219908910469100,"text":"Bus crash in Tennessee so sad &amp, so terrible. Condolences to all family members and loved ones. These beautiful children will be remembered!","rating":3},{"id":1146426004635828200,"text":"The cost of our great Salute to America tomorrow will be very little compared to what it is worth. We own the planes, we have the pilots, the airport is right next door (Andrews), all we need is the fuel. We own the tanks and all. Fireworks are donated by two of the greats. Nice!","rating":5},{"id":1224372633233428500,"text":"I hope Republicans &amp; the American people realize that the totally partisan Impeachment Hoax is exacty that, a Hoax. Read the Transcripts, listen to what the President &amp; Foreign Minister of Ukraine said (“No Pressure”). Nothing will ever satisfy the Do Nothing, Radical Left Dems!","rating":7},{"id":1157259424794325000,"text":"Really bad news! The Baltimore house of Elijah Cummings was robbed. Too bad!","rating":6}]