[{"id":911789314169823200,"text":"Just heard Foreign Minister of North Korea speak at U.N. If he echoes thoughts of Little Rocket Man, they won't be around much longer!","rating":9},{"id":1068516326010830800,"text":"Just signed one of the most important, and largest, Trade Deals in U.S. and World History. The United States, Mexico and Canada worked so well together in crafting this great document. The terrible NAFTA will soon be gone. The USMCA will be fantastic for all!","rating":5},{"id":1244306707536326700,"text":"Polls are showing tremendous disapproval of Lamestream Media coverage of the Virus crisis. The Fake News just hasn’t figured that out yet!","rating":7},{"id":1188052969813614600,"text":"Had a beautiful dinner last night at Camp David in celebration of the 10th Wedding Anniversary of Ivanka and Jared. Attended by a small number of family and friends, it could not have been nicer. Camp David is a special place. Cost of the event will be totally paid for by me!","rating":4},{"id":826041397232943100,"text":"Only 109 people out of 325,000 were detained and held for questioning. Big problems at airports were caused by Delta computer outage,.....","rating":6},{"id":1322333348333674500,"text":"Biden has pledged a staggering 700% increase in refugees from the most dangerous and violent terrorist hot spots on earth. He has also vowed to terminate our national security travel bans, allowing for unlimited migration from war zones, and terrorist havens...","rating":8},{"id":1070315986287583200,"text":"Looking forward to being with the Bush family. This is not a funeral, this is a day of celebration for a great man who has led a long and distinguished life. He will be missed!","rating":3},{"id":890196164313833500,"text":"....Transgender individuals to  serve in any capacity in the U.S. Military. Our military must be focused on decisive and overwhelming.....","rating":8},{"id":945780569388015600,"text":"All signs are that business is looking really good for next year, only to be helped further by our Tax Cut Bill. Will be a great year for Companies and JOBS! Stock Market is poised for another year of SUCCESS!","rating":4},{"id":1238590988593086500,"text":"At my request, effective midnight tonight, Carnival, Royal Caribbean, Norwegian, and MSC have all agreed to suspend outbound cruises for thirty days. It is a great and important industry – it will be kept that way!","rating":6},{"id":1121010431819173900,"text":"The American people deserve to know who is in this Country. Yesterday, the Supreme Court took up the Census Citizenship question, a really big deal. MAKE AMERICA GREAT AGAIN!","rating":5},{"id":898169407213645800,"text":"Sad to see the history and culture of our great country being ripped apart with the removal of our beautiful statues and monuments. You.....","rating":8},{"id":1015033658548207600,"text":"A vote for Democrats in November is a vote to let MS-13 run wild in our communities, to let drugs pour into our cities, and to take jobs and benefits away from hardworking Americans. Democrats want anarchy, amnesty and chaos - Republicans want LAW, ORDER and JUSTICE!","rating":9},{"id":1001085207825535000,"text":"Happy Memorial Day! Those who died for our great country would be very happy and proud at how well our country is doing today. Best economy in decades, lowest unemployment numbers for Blacks and Hispanics EVER (&amp, women in 18years), rebuilding our Military and so much more. Nice!","rating":6},{"id":1071760971088228400,"text":"On 245  occasions, former FBI Director James Comey told House investigators he didn’t know, didn’t recall, or couldn’t remember things when asked. Opened investigations on 4 Americans (not 2) - didn’t know who signed off and didn’t know Christopher Steele. All lies!","rating":7},{"id":1086971499725160400,"text":"Be careful and try staying in your house. Large parts of the Country are suffering from  tremendous amounts of snow and near record setting cold. Amazing how big this system is. Wouldn’t be bad to have a little of that good old fashioned Global Warming right now!","rating":8},{"id":960530665702912000,"text":"Representative Devin Nunes, a man of tremendous courage and grit, may someday be recognized as a Great American Hero for what he has exposed and what he has had to endure!","rating":4},{"id":1079398853684707300,"text":"Veterans on President Trump’s handling of Border Security - 62% Approval Rating. On being a strong leader - 59%.  AP Poll. Thank you!","rating":3},{"id":987426984195174400,"text":"Can you believe that despite 93% bad stories from the Fake News Media (should be getting good stories), today we had just about our highest Poll Numbers, including those on Election Day? The American public is wise to the phony an dishonest press. Make America Great Again!","rating":6},{"id":961957671246159900,"text":"Just signed Bill. Our Military will now be stronger than ever before. We love and need our Military and gave them everything — and more. First time this has happened in a long time. Also means JOBS, JOBS, JOBS!","rating":4},{"id":1322559460821270500,"text":"Gallup: 56% of the U.S. is more satisfied with conditions now, even during a pandemic (we are rounding the turn!), than they were 4 years ago under Obama/Biden. Hasn’t been equaled in recent times!","rating":5},{"id":1239650018832892000,"text":"Yesterday I spoke with the great American Grocers and Supply Chain Executives. We are confident that supply will continue to meet demand nationwide. These beacons of our community will remain open for you, no matter what. We are working hard to remove any barriers to that effort!","rating":3},{"id":1081563196249514000,"text":"I don’t care that most of the workers not getting paid are Democrats, I want to stop the Shutdown as soon as we are in agreement on Strong Border Security! I am in the White House ready to go, where are the Dems?","rating":8},{"id":1024879317577285600,"text":"Thank you to Chairman Kim Jong Un for keeping your word &amp, starting the process of sending home the remains of our great and beloved missing fallen! I am not at all surprised that you took this kind action. Also, thank you for your nice letter - l look forward to seeing you soon!","rating":4},{"id":1080263362183917600,"text":"For FAR TOO LONG Senate Democrats have been Obstructing more than 350 Nominations. These great Americans left their jobs to serve our Country, but can’t because Dems are blocking them, some for two years-historic record. Passed committees, but Schumer putting them on hold. Bad!","rating":6},{"id":1076132028888825900,"text":"The Democrats now own the shutdown!","rating":7},{"id":1078412737603096600,"text":"This isn’t about the Wall, everybody knows that a Wall will work perfectly (In Israel the Wall works 99.9%). This is only about the Dems not letting Donald Trump &amp, the Republicans have a win. They may have the 10 Senate votes, but we have the issue, Border Security. 2020!","rating":6},{"id":992523949698412500,"text":"Democrats and liberals in Congress want to disarm law-abiding Americans at the same time they are releasing dangerous criminal aliens and savage gang members onto our streets. Politicians who put criminal aliens before American Citizens should be voted out of office!","rating":8},{"id":1195356198347956200,"text":"Everywhere Marie Yovanovitch went turned bad. She started off in Somalia, how did that go? Then fast forward to Ukraine, where the new Ukrainian President spoke unfavorably about her in my second phone call with him. It is a U.S. President’s absolute right to appoint ambassadors.","rating":9},{"id":1107420505479528400,"text":"What the Democrats have done in trying to steal a Presidential Election, first at the “ballot box” and then, after that failed, with the “Insurance Policy,” is the biggest Scandal in the history of our Country!","rating":10},{"id":1120360773807693800,"text":"My friend Herman Cain, a truly wonderful man, has asked me not to nominate him for a seat on the Federal Reserve Board. I will respect his wishes. Herman is a great American who truly loves our Country!","rating":5},{"id":1186612453368651800,"text":"95% Approval Rating in the Republican Party. Thank you!","rating":3},{"id":810604216771285000,"text":"If my many supporters acted and threatened people like those who lost the election are doing, they would be scorned &amp, called terrible names!","rating":6},{"id":1292837084152107000,"text":"Portland, which is out of control, should finally, after almost 3 months, bring in the National Guard. The Mayor and Governor are putting people’s lives at risk. They will be held responsible. The Guard is ready to act immediately. The Courthouse is secured by Homeland!","rating":7},{"id":1201499577645449200,"text":"Breaking News: The President of Ukraine has just again announced that President Trump has done nothing wrong with respect to Ukraine and our interactions or calls. If the Radical Left Democrats were sane, which they are not, it would be case over!","rating":8},{"id":1066685057648214000,"text":"Would be very SMART if Mexico would stop the Caravans long before they get to our Southern Border, or if originating countries would not let them form (it is a way they get certain people out of their country and dump in U.S. No longer). Dems created this problem. No crossings!","rating":8},{"id":904177758489776100,"text":"Remember, Sunday is National Prayer Day (by Presidential Proclamation)!","rating":4},{"id":1088634979037466600,"text":"Great earnings coming out of Stock Market. Too bad Media doesn’t devote much time to this!","rating":3},{"id":1003601217111707600,"text":"This is my 500th. Day in Office and we have accomplished a lot - many believe more than any President in his first 500 days. Massive Tax &amp, Regulation Cuts, Military &amp, Vets, Lower Crime &amp, Illegal Immigration, Stronger Borders, Judgeships, Best Economy &amp, Jobs EVER, and much more...","rating":5},{"id":1313551798142152700,"text":"...also coming back in record numbers. We are leading the World in Economic Recovery, and THE BEST IS YET TO COME!","rating":4},{"id":1218668999086694400,"text":"They are taking the Democrat Nomination away from Crazy Bernie, just like last time. Some things never change!","rating":7},{"id":926406490763784200,"text":"....People are angry.  At some point the Justice Department, and the FBI, must do what is right and proper. The American public deserves it!","rating":5},{"id":1238626501555298300,"text":"I fully support H.R. 6201: Families First CoronaVirus Response Act, which will be voted on in the House this evening. This Bill will follow my direction for free CoronaVirus tests, and paid sick leave for our impacted American workers. I have directed....","rating":3},{"id":1142784534204883000,"text":"Wonderful Church service at Camp David. Thank you!","rating":2},{"id":1274353051252535300,"text":"Wow, I finally agree with failed political consultant Steve Schmidt, who called Wacko John Bolton “a despicable man who failed in his duty to protect America.” Also stated that he should never be allowed to serve in government again. So true! Plain and simple, John Bolton,....","rating":8},{"id":1202573673863008300,"text":".....trial in the Senate, and so that our Country can get back to business. We will have Schiff, the Bidens, Pelosi and many more testify, and will reveal, for the first time, how corrupt our system really is. I was elected to “Clean the Swamp,” and that’s what I am doing!","rating":9},{"id":1320040205387255800,"text":"Quick stop in North Carolina with a wonderful Indian Tribe, and guests. Then off to two BIG Rallies in Ohio and Wisconsin. See you later!!!","rating":4},{"id":1103666338365608000,"text":"We are on track to APPREHEND more than one million people coming across the Southern Border this year. Great job by Border Patrol (and others) who are working in a Broken System. Can be fixed by Congress so easily and quickly if only the Democrats would get on board!","rating":6},{"id":1205927795269894100,"text":"Chuck Schumer sat for years during the Obama Administration and watched as China ripped off the United States. He &amp, the Do Nothing Democrats did NOTHING as this $ carnage took place. Now, without even seeing it, he snipes at our GREAT new deal with China. Too bad Cryin’ Chuck!","rating":8},{"id":1306564340972228600,"text":"I am SUBSTANTIALLY LOWERING MEDICARE PREMIUMS. Have instituted Favored Nations Clause and Rebates on Drug Companies. Never been done before. Drug companies are hitting me with Fake Ads, just like sleepy Joe. Be careful! Drug prices will be reduced massively, and soon.","rating":6},{"id":889217183930351600,"text":"It's very sad that Republicans, even some that were carried over the line on my back, do very little to protect their President.","rating":6},{"id":954843844402647000,"text":"Unprecedented success for our Country, in so many ways, since the Election. Record Stock Market, Strong on Military, Crime, Borders, &amp, ISIS, Judicial Strength &amp, Numbers, Lowest Unemployment for Women &amp, ALL, Massive Tax Cuts, end of Individual Mandate - and so much more. Big 2018!","rating":4},{"id":1117782316557000700,"text":"Before Nancy, who has lost all control of Congress and is getting nothing done, decides to defend her leader, Rep. Omar, she should look at the anti-Semitic, anti-Israel and ungrateful U.S. HATE statements Omar has made. She is out of control, except for her control of Nancy!","rating":7},{"id":1082627015235256300,"text":"Talks with China are going very well!","rating":2},{"id":1323424722911170600,"text":"A vote for Joe Biden is a vote to extinguish and eradicate your state’s auto industry. Biden is a corrupt politician who SOLD OUT Michigan to CHINA. Biden is the living embodiment of the decrepit and depraved political class that got rich bleeding America Dry!","rating":9},{"id":1222670610867916800,"text":"With Votes in the House tomorrow, Democrats want to make it harder for Presidents to defend America, and stand up to, as an example, Iran. Protect our GREAT COUNTRY!","rating":5},{"id":1098583029713420300,"text":"....something that is so obviously the future. I want the United States to win through competition, not by blocking out currently more advanced technologies. We must always be the leader in everything we do, especially when it comes to the very exciting world of technology!","rating":3},{"id":1005586152076689400,"text":"Based on Justin’s false statements at his news conference, and the fact that Canada is charging massive Tariffs to our U.S. farmers, workers and companies, I have instructed our U.S. Reps not to endorse the Communique as we look at Tariffs on automobiles flooding the U.S. Market!","rating":8},{"id":955426609326100500,"text":"The Democrats are turning down services and security for citizens in favor of services and security for non-citizens. Not good!","rating":4},{"id":1105783271412113400,"text":"....a man who is considered by many to be the President with the most successful first two years in history, especially when he has done nothing wrong and impeachment is for “high crimes and misdemeanors”?","rating":5},{"id":1044782444321361900,"text":"The Democrats are playing a high level CON GAME in their vicious effort to destroy a fine person. It is called the politics of destruction. Behind the scene the Dems are laughing. Pray for Brett Kavanaugh and his family!","rating":7},{"id":1158102732085108700,"text":"....The flags at the White House will be lowered today through Thursday, August 8. Melania and I are praying for all those impacted by this unspeakable act of evil!","rating":3},{"id":1181571571787403300,"text":"I think that Crooked Hillary Clinton should enter the race to try and steal it away from Uber Left Elizabeth Warren. Only one condition. The Crooked one must explain all of her high crimes and misdemeanors including how &amp, why she deleted 33,000 Emails AFTER getting “C” Subpoena!","rating":9},{"id":1060515116700045300,"text":"....Great bravery shown by police. California Highway Patrol was on scene within 3 minutes, with first officer to enter shot numerous times. That Sheriff’s Sergeant died in the hospital. God bless all of the victims and families of the victims. Thank you to Law Enforcement.","rating":4},{"id":1113091756130742300,"text":"“I haven’t seen any Democrats down here at the Border working with us or asking to speak to any of us. They have an open invitation. We are getting overrun, our facilities are overcapacity. We are at an emergency crisis.” Art Del Cueto, National Border Patrol Council.","rating":5},{"id":1146501820593967100,"text":"Our Border Patrol people are not hospital workers, doctors or nurses. The Democrats bad Immigration Laws, which could be easily fixed, are the problem. Great job by Border Patrol, above and beyond. Many of these illegals aliens are living far better now than where they.....","rating":6},{"id":1111653530316746800,"text":"....through their country and our Southern Border. Mexico has for many years made a fortune off of the U.S., far greater than Border Costs. If Mexico doesn’t immediately stop ALL illegal immigration coming into the United States throug our Southern Border, I will be CLOSING.....","rating":6},{"id":1221190398846152700,"text":"“You don’t come to court and ask for witnesses after you’ve already presented your case, unless you know your case is not working. I think their real motivation is for them to keep this President busy. We’re doing a great job on the economy, we’re building our military, look.....","rating":5},{"id":1221469014427349000,"text":"95% Approval Rating in the Republican Party. Thank you! 191 Federal Judges (a record), and two Supreme Court Justices, approved. Best Economy &amp; Employment Numbers EVER. Thank you to our great New, Smart and Nimble REPUBLICAN PARTY. Join now, it’s where people want to be!","rating":4},{"id":1155822023245013000,"text":"....even to new heights of success and glory, but not with King Elijah and that crew. When the leaders of Baltimore want to see the City rise again, I am in a very beautiful oval shaped office waiting for your call!","rating":8},{"id":969991653393039400,"text":"The United States has an $800 Billion Dollar Yearly Trade Deficit because of our “very stupid” trade deals and policies. Our jobs and wealth are being given to other countries that have taken advantage of us for years. They laugh at what fools our leaders have been. No more!","rating":4},{"id":1015723140364865500,"text":"The Rigged Witch Hunt, originally headed by FBI lover boy Peter S (for one year) &amp, now, 13 Angry Democrats, should look into the missing DNC Server, Crooked Hillary’s illegally deleted Emails, the Pakistani Fraudster, Uranium One, Podesta &amp, so much more. It’s a Democrat Con Job!","rating":9},{"id":1055064484644089900,"text":"For those who want and advocate for illegal immigration, just take a good look at what has happened to Europe over the last 5 years. A total mess! They only wish they had that decision to make over again.","rating":5},{"id":1220453267509055500,"text":"Democrats are going to destroy your Social Security. I have totally left it alone, as promised, and will save it!","rating":3},{"id":1177285017636094000,"text":"Liddle’ Adam Schiff, who has worked unsuccessfully for 3 years to hurt the Republican Party and President, has just said that the Whistleblower, even though he or she only had second hand information, “is credible.” How can that be with zero info and a known bias. Democrat Scam!","rating":7},{"id":1060958713047961600,"text":"Mayor Gillum conceded on Election Day and now Broward County has put him “back into play.” Bill Nelson conceded Election - now he’s back in play!? This is an embarrassment to our Country and to Democracy!","rating":6},{"id":980443810529534000,"text":"Border Patrol Agents are not allowed to properly do their job at the Border because of ridiculous liberal (Democrat) laws like Catch &amp, Release. Getting more dangerous. “Caravans” coming. Republicans must go to Nuclear Option to pass tough laws NOW. NO MORE DACA DEAL!","rating":6},{"id":1148298496140820500,"text":"I have been very critical about the way the U.K. and Prime Minister Theresa May handled Brexit. What a mess she and her representatives have created. I told her how it should be done, but she decided to go another way. I do not know the Ambassador, but he is not liked or well....","rating":5},{"id":1210183406904074200,"text":"Nancy Pelosi’s District in California has rapidly become one of the worst anywhere in the U.S. when it come to the homeless &amp, crime. It has gotten so bad, so fast - she has lost total control and, along with her equally incompetent governor, Gavin Newsom, it is a very sad sight!","rating":6},{"id":1142567481124503600,"text":"I never called the strike against Iran “BACK,” as people are incorrectly reporting, I just stopped it from going forward at this time!","rating":4},{"id":1176848267759509500,"text":"Will the Democrats apologize after seeing what was said on the call with the Ukrainian President? They should, a perfect call - got them by surprise!","rating":7},{"id":1314377608470159400,"text":"...today that they foiled a dangerous plot against the Governor of Michigan. Rather than say thank you, she calls me a White Supremacist—while Biden and Democrats refuse to condemn Antifa, Anarchists, Looters and Mobs that burn down Democrat run cities...","rating":8},{"id":1029332350969237500,"text":"Another terrorist attack in London...These animals are crazy and must be dealt with through toughness and strength!","rating":7},{"id":948174033882927100,"text":"Crooked Hillary Clinton’s top aid, Huma Abedin, has been accused of disregarding basic security protocols. She put Classified Passwords into the hands of foreign agents. Remember sailors pictures on submarine? Jail! Deep State Justice Dept must finally act? Also on Comey &amp, others","rating":9},{"id":1111212351204835300,"text":"Mexico is doing NOTHING to help stop the flow of illegal immigrants to our Country. They are all talk and no action. Likewise, Honduras, Guatemala and El Salvador have taken our money for years, and do Nothing. The Dems don’t care, such BAD laws. May close the Southern Border!","rating":8},{"id":1089874871247687700,"text":"Tariffs on the “dumping” of Steel in the United States have totally revived our Steel Industry. New and expanded plants are happening all over the U.S. We have not only saved this important industry, but created many jobs. Also, billions paid to our treasury. A BIG WIN FOR U.S.","rating":4},{"id":1282129696382234600,"text":"Does anyone notice that the real Polls, as opposed to the Fake Suppression Polls also used in 2016, are starting to define Sleepy Joe Biden as someone totally ill-equipped to control the Radical Left, Crime, Cancel Culture, or to even come close to me on REBUILDING THE ECONOMY?","rating":5},{"id":1057614564639019000,"text":"Our military is being mobilized at the Southern Border. Many more troops coming. We will NOT let these Caravans, which are also made up of some very bad thugs and gang members, into the U.S. Our Border is sacred, must come in legally. TURN AROUND!","rating":6},{"id":1289674638285447200,"text":"“Biden to raise taxes by 3 Trillion Dollars.” Actually, it will be much more than that, and much of it on nonsense. Markets and your 401k’s will CRASH. Jobs will disappear!","rating":5},{"id":1223839756234215400,"text":"Mini Mike is now negotiating both to get on the Democrat Primary debate stage, and to have the right to stand on boxes, or a lift, during the debates. This is sometimes done, but really not fair!","rating":9},{"id":1311365647008444400,"text":"Many more people would have died from the China Virus if Sleepy Joe were your President. He didn’t even want me to close our Country to Infected China until TWO MONTHS  later, when he said I was right. Now he likes to say I didn’t close up “fast enough”. Just another politician!","rating":8},{"id":1288511206790111200,"text":"The drug companies are spending millions of dollars in advertising against me, only because I am lowering drug prices massively, 50% and more! Biden and Obama said they would do this for eight years, but never did...","rating":7},{"id":979326715272065000,"text":"I have stated my concerns with Amazon long before the Election. Unlike others, they pay little or no taxes to state &amp, local governments, use our Postal System as their Delivery Boy (causing tremendous loss to the U.S.), and are putting many thousands of retailers out of business!","rating":6},{"id":1003024268756734000,"text":"When you’re almost 800 Billion Dollars a year down on Trade, you can’t lose a Trade War! The U.S. has been ripped off by other countries for years on Trade, time to get smart!","rating":5},{"id":895254168570605600,"text":"...Hopefully we will never have to use this power, but there will never be a time that we are not the most powerful nation in the world!","rating":4},{"id":1219284434635100200,"text":"The Democrat Party in the Great Commonwealth of Virginia are working hard to take away your 2nd Amendment rights. This is just the beginning. Don’t let it happen, VOTE REPUBLICAN in 2020!","rating":7},{"id":1111768933651152900,"text":"...The problem is, no matter what the Radical Left Democrats get, no matter what we give them, it will never be enough. Just watch, they will Harass &amp, Complain &amp, Resist (the theme of their movement). So maybe we should just take our victory and say NO, we’ve got a Country to run!","rating":6},{"id":1074313153679450100,"text":"Remember, Michael Cohen only became a “Rat” after the FBI did something which was absolutely unthinkable &amp, unheard of until the Witch Hunt was illegally started. They BROKE INTO AN ATTORNEY’S OFFICE! Why didn’t they break into the DNC to get the Server, or Crooked’s office?","rating":9},{"id":1183390085993119700,"text":"We have become a far greater Economic Power than ever before, and we are using that power for WORLD PEACE!","rating":5},{"id":1089169277041676300,"text":"“We absolutely need a physical barrier or Wall, whatever you want to call it. The President yesterday laid all that out. We need to do it all, including the Wall. I provided the same information to the previous administration, &amp, it was ignored.” Mark Morgan, Border Chief for “O”!","rating":6},{"id":1153648770883707000,"text":"In 2016 I almost won Minnesota. In 2020, because of America hating anti-Semite Rep. Omar, &amp, the fact that Minnesota is having its best economic year ever, I will win the State! “We are going to be a nightmare to the President,” she say. No, AOC Plus 3 are a Nightmare for America!","rating":8},{"id":1301710816979357700,"text":"I was never a big fan of John McCain, disagreed with him on many things including ridiculous endless wars and the lack of success he had in dealing with the VA and our great Vets, but the lowering of our Nations American Flags, and the first class funeral he was given by our....","rating":6},{"id":970650759091163100,"text":"Why did the Obama Administration start an investigation into the Trump Campaign (with zero proof of wrongdoing) long before the Election in November? Wanted to discredit so Crooked H would win. Unprecedented. Bigger than Watergate! Plus, Obama did NOTHING about Russian meddling.","rating":9},{"id":1286266178789310500,"text":"Liz Cheney is only upset because I have been actively getting our great and beautiful Country out of the ridiculous and costly Endless Wars. I am also making our so-called allies pay tens of billions of dollars in delinquent military costs. They must, at least, treat us fairly!!!","rating":7},{"id":891996053611917300,"text":"If ObamaCare is hurting people, &amp, it is, why shouldn't it hurt the insurance companies &amp, why should Congress not be paying what public pays?","rating":5},{"id":824227824903090200,"text":"I will be asking for a major investigation into VOTER FRAUD, including those registered to vote in two states, those who are illegal and....","rating":4},{"id":823146987117772800,"text":"Had a great meeting at CIA Headquarters yesterday, packed house, paid great respect to Wall, long standing ovations, amazing people. WIN!","rating":3},{"id":1307060557892198400,"text":"Sleepy Joe Biden just said that he wished I closed up one week earlier — but when I banned China from coming in, it took him TWO MONTHS to finally realize that was a good thing...","rating":7},{"id":976532956557738000,"text":"I called President Putin of Russia to congratulate him on his election victory (in past, Obama called him also). The Fake News Media is crazed because they wanted me to excoriate him. They are wrong! Getting along with Russia (and others) is a good thing, not a bad thing.......","rating":6},{"id":1294731080264810500,"text":"News Conference at 5:30 P.M. Enjoy!","rating":2},{"id":1121049166615142400,"text":"....Congress has no time to legislate, they only want to continue the Witch Hunt, which I have already won. They should start looking at The Criminals who are already very well known to all. This was a Rigged System - WE WILL DRAIN THE SWAMP!","rating":8},{"id":1018943446583668700,"text":"As I said today and many times before, “I have GREAT confidence in MY intelligence people.” However, I also recognize that in order to build a brighter future, we cannot exclusively focus on the past – as the world’s two largest nuclear powers, we must get along! #HELSINKI2018","rating":5},{"id":1108217768187449300,"text":"The Democrats are getting very “strange.” They now want to change the voting age to 16, abolish the Electoral College, and Increase significantly the number of Supreme Court Justices. Actually, you’ve got to win it at the Ballot Box!","rating":7},{"id":1135602452059906000,"text":"....Fake News will be working hard to find them. Great love all around. Also, big Trade Deal is possible once U.K. gets rid of the shackles. Already starting to talk!","rating":6},{"id":1322899821267689500,"text":"....all I needed, everything went swimmingly from there. He was so highly regarded &amp; respected in Scotland and beyond that years of future turmoil was avoided. Sean was a great actor and an even greater man. Sincere condolences to his family!","rating":3},{"id":1226162962873962500,"text":"Crazy Nancy Pelosi’s Impeachment Hoax has lifted Republican Congressional Polls (she lost the House once before!), and my Polls, WAY UP, which was expected, but it has had a great effect on Republican Senate races, including North Carolina, Kentucky, Colorado and Arizona. Thanks!","rating":7},{"id":1217827468230434800,"text":"The farmers are really happy with the new China Trade Deal and the soon to be signed deal with Mexico and Canada, but I hope the thing they will most remember is the fact that I was able to take massive incoming Tariff money and use it to help them get through the tough times!","rating":6},{"id":1097280840156020700,"text":"The Mueller investigation is totally conflicted, illegal and rigged! Should never have been allowed to begin, except for the Collusion and many crimes committed by the Democrats. Witch Hunt!","rating":8},{"id":1146430380981067800,"text":"Congratulations to Navy Seal Eddie Gallagher, his wonderful wife Andrea, and his entire family. You have been through much together. Glad I could help!","rating":4},{"id":1247546362473975800,"text":"Wisconsin, get out and vote NOW for Justice Daniel Kelly. Protect your 2nd Amendment!","rating":5},{"id":1094664056827449300,"text":"The media was able to get my work schedule, something very easy to do, but it should have been reported as a positive, not negative. When the term Executive Time is used, I am generally working, not relaxing. In fact, I probably work more hours than almost any past President.....","rating":4},{"id":828042506851934200,"text":"The judge opens up our country to potential terrorists and others that do not have our best interests at heart. Bad people are very happy!","rating":6},{"id":1233799741630230500,"text":"I will be having a 1:30 P.M. Press Conference at the White House to discuss the latest CoronaVirus developments. Thank you!","rating":3},{"id":1037661562897682400,"text":"The Deep State and the Left, and their vehicle, the Fake News Media, are going Crazy - &amp, they don’t know what to do. The Economy is booming like never before, Jobs are at Historic Highs, soon TWO Supreme Court Justices &amp, maybe Declassification to find Additional Corruption. Wow!","rating":7},{"id":1086974590310645800,"text":"Nancy Pelosi and some of the Democrats turned down my offer yesterday before I even got up to speak. They don’t see crime &amp, drugs, they only see 2020 - which they are not going to win. Best economy! They should do the right thing for the Country &amp, allow people to go back to work.","rating":5},{"id":1083022011574747100,"text":"Billions of dollars are sent to the State of California for Forest fires that, with proper Forest Management, would never happen. Unless they get their act together, which is unlikely, I have ordered FEMA to send no more money. It is a disgraceful situation in lives &amp, money!","rating":6},{"id":1124158008844542000,"text":"...at every turn in attempts to gain access. But now Republicans and Democrats must come together for the good of the American people. No more costly &amp, time consuming investigations. Lets do Immigration (Border), Infrastructure, much lower drug prices &amp, much more - and do it now!","rating":4},{"id":1083207607412760600,"text":"The Mainstream Media has NEVER been more dishonest than it is now. NBC and MSNBC are going Crazy. They report stories, purposely, the exact opposite of the facts. They are truly the Opposition Party working with the Dems. May even be worse than Fake News CNN, if that is possible!","rating":8},{"id":1055065538890735600,"text":"We are a great Sovereign Nation. We have Strong Borders and will never accept people coming into our Country illegally!","rating":4},{"id":1204782262912503800,"text":"Wow! All of our priorities have made it into the final NDAA: Pay Raise for our Troops, Rebuilding our Military, Paid Parental Leave, Border Security, and Space Force! Congress – don’t delay this anymore! I will sign this historic defense legislation immediately!","rating":3},{"id":1275044483047055400,"text":"I gave John Bolton, who was incapable of being Senate confirmed because he was considered a wacko, and was not liked, a chance. I always like hearing differing points of view. He turned out to be grossly incompetent, and a liar.   See judge’s opinion. CLASSIFIED INFORMATION!!!","rating":8},{"id":1038604758582485000,"text":"The Dems have tried every trick in the playbook-call me everything under the sun. But if I’m all of those terrible things, how come I beat them so badly, 306-223? Maybe they’re just not very good! The fact is they are going CRAZY only because they know they can’t beat me in 2020!","rating":9},{"id":959952974826098700,"text":"...a tool of anti-Trump political actors. This is unacceptable in a democracy and ought to alarm anyone who wants the FBI to be a nonpartisan enforcer of the law....The FBI wasn’t straight with Congress, as it hid most of these facts from investigators.” Wall Street Journal","rating":6},{"id":1248637403893584000,"text":"Nobody wants to say that if Elizabeth Warren gets out of the race before Super Tuesday, Crazy Bernie Sanders wins virtually every state in a blowout...NOT EVEN CLOSE!  I haven’t heard one member of the Fake News Establishment even mention this irrefutable fact. FAKE NEWS!","rating":10},{"id":1087193843756347400,"text":"Congratulations to Bob Kraft, Bill Belichick, Tom Brady and the entire New England Patriots team on a great game and season. Will be a fantastic Super Bowl!","rating":3},{"id":1278097652677214200,"text":"Today’s SCOTUS ruling is a historic win for families who want SCHOOL CHOICE NOW! #SchoolChoice is a civil rights issue, and no parent should have to send their child to a failing school. I will continue to fight for School Choice and will always defend Religious Freedom!","rating":5},{"id":1010902506422046700,"text":"....Our Immigration policy, laughed at all over the world, is very unfair to all of those people who have gone through the system legally and are waiting on line for years! Immigration must be based on merit - we need people who will help to Make America Great Again!","rating":4},{"id":1091339521931857900,"text":"Best January for the DOW in over 30 years. We have, by far, the strongest economy in the world!","rating":4},{"id":1101472084730003500,"text":"Oh’ I see! Now that the 2 year Russian Collusion case has fallen apart, there was no Collusion except bye Crooked Hillary and the Democrats, they say, “gee, I have an idea, let’s look at Trump’s finances and every deal he has ever done. Let’s follow discredited Michael Cohen.....","rating":7},{"id":1308539921829781500,"text":"...with our Country, the United States Military, Government Contractors, and Grantees. Americans should be taught to take PRIDE in our Great Country, and if you don’t, there’s nothing in it for you!","rating":6},{"id":959949725028974600,"text":"“The four page memo released Friday reports the disturbing fact about how the FBI and FISA appear to have been used to influence the 2016 election and its aftermath....The FBI failed to inform the FISA court that the Clinton campaign had funded the dossier....the FBI became....","rating":5},{"id":1218673508911403000,"text":"Another Fake Book by two third rate Washington Post reporters, has already proven to be inaccurately reported, to their great embarrassment, all for the purpose of demeaning and belittling a President who is getting great things done for our Country, at a record clip. Thank you!","rating":7},{"id":1061168803218948100,"text":"There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor. Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!","rating":8},{"id":1010873383087636500,"text":"Democrats, fix the laws. Don’t RESIST. We are doing a far better job than Bush and Obama, but we need strength and security at the Border! Cannot accept all of the people trying to break into our Country. Strong Borders, No Crime!","rating":6},{"id":1245076282859237400,"text":"My Administration is helping U.S. auto workers by replacing the failed Obama Emissions Rule. Impossible to satisfy its Green New Deal Standard; Lots of unnecessary and expensive penalties to car buyers!","rating":6},{"id":954456754137501700,"text":"Just signed 702 Bill to reauthorize foreign intelligence collection. This is NOT the same FISA law that was so wrongly abused during the election. I will always do the right thing for our country and put the safety of the American people first!","rating":5},{"id":965194903142719500,"text":"Never gotten over the fact that Obama was able to send $1.7 Billion Dollars in CASH to Iran and nobody in Congress, the FBI or Justice called for an investigation!","rating":7},{"id":1104714962482749400,"text":"More people are working today in the United States, 158,000,000, than at any time in our Country’s history. That is a Big Deal!","rating":4},{"id":1249808119217172500,"text":"My deepest sympathies go out to Frieda Chera and the family of the late, great, Stanley Chera, one of Manhattan’s most brilliant real estate minds. Stanley was charitable, kind, and a wonderful friend. He will be truly missed!","rating":3},{"id":975346628113596400,"text":"Spent very little time with Andrew McCabe, but he never took notes when he was with me. I don’t believe he made memos except to help his own agenda, probably at a later date. Same with lying James Comey. Can we call them Fake Memos?","rating":8},{"id":824573698774601700,"text":"Ungrateful TRAITOR Chelsea Manning, who should never have been released from prison, is now calling President Obama a weak leader. Terrible!","rating":8},{"id":911175246853664800,"text":"Kim Jong Un of North Korea, who is obviously a madman who doesn't mind starving or killing his people, will be tested like never before!","rating":8},{"id":1311452870710104000,"text":"Leaving Minneapolis for a quick stop in Duluth to celebrate the opening of the Obama CLOSED Iron Range. My great honor!!!","rating":5},{"id":1230143683699175400,"text":"Is corrupt Bloomberg News going to say what a pathetic debater Mini Mike is, that he doesn’t respect our great farmers, or that he has violated campaign finance laws at the highest and most sinister level with “payoffs” all over the place?","rating":7},{"id":949129410208202800,"text":"The Fake News Media barely mentions the fact that the Stock Market just hit another New Record and that business in the U.S. is booming...but the people know! Can you imagine if “O” was president and had these numbers - would be biggest story on earth! Dow now over 25,000.","rating":6},{"id":1019544304853966800,"text":"Some people HATE the fact that I got along well with President Putin of Russia. They would rather go to war than see this. It’s called Trump Derangement Syndrome!","rating":7},{"id":1018074723140427800,"text":"The stories you heard about the 12 Russians yesterday took place during the Obama Administration, not the Trump Administration. Why didn’t they do something about it, especially when it was reported that President Obama was informed by the FBI in September, before the Election?","rating":5},{"id":1002971013313908700,"text":"The United States must, at long last, be treated fairly on Trade. If we charge a country ZERO to sell their goods, and they charge us 25, 50 or even 100 percent to sell ours, it is UNFAIR and can no longer be tolerated. That is not Free or Fair Trade, it is Stupid Trade!","rating":5},{"id":1075952474673041400,"text":"Thank you to our GREAT Republican Members of Congress for your VOTE to fund Border Security and the Wall. The final numbers were 217-185 and many have said that the enthusiasm was greater than they have ever seen before. So proud of you all. Now on to the Senate!","rating":4},{"id":832191485701451800,"text":"Stock market hits new high with longest winning streak in decades. Great level of confidence and optimism - even before tax plan rollout!","rating":4},{"id":1082623264877432800,"text":"Economic numbers looking REALLY good. Can you imagine if I had long term ZERO interest rates to play with like the past administration, rather than the rapidly raised normalized rates we have today. That would have been SO EASY! Still, markets up BIG since 2016 Election!","rating":4},{"id":1323375339540762600,"text":"Joe Biden is a globalist who spent 47 years outsourcing your jobs, opening your borders, and sacrificing American blood and treasure in endless foreign wars. He shuttered your steel mills, annihilated your coal jobs, and supported every disastrous trade deal for half a century...","rating":7},{"id":1035209068095434800,"text":"CNN is working frantically to find their “source.” Look hard because it doesn’t exist. Whatever was left of CNN’s credibility is now gone!","rating":6},{"id":1304998359367704600,"text":"Joe Biden cannot LEAD our Country, because he does not BELIEVE in our Country. At Biden’s convention, they decried America as a wicked, sinful nation, destined for a fate of doom and despair. They even removed the words “Under God” from the Pledge of Allegiance – twice...","rating":8},{"id":1104600844098510800,"text":"“Donald Trump’s Approval Rating is at or near his highest level ever. The media is not being honest about what is happening in this Country.” Jesse Watters","rating":3},{"id":1101620175638614000,"text":"I have asked China to immediately remove all Tariffs on our agricultural products (including beef, pork, etc.) based on the fact that we are moving along nicely with Trade discussions....","rating":2},{"id":1263261476774699000,"text":"Great call with thousands of our Hispanic community, business, and faith leaders today. During this national trial, we have been uplifted by the grit, determination, prayers, and patriotism of Hispanic Americans....","rating":1},{"id":1119575361522737200,"text":"The end result of the greatest Witch Hunt in U.S. political history is No Collusion with Russia (and No Obstruction). Pretty Amazing!","rating":5},{"id":831853862281699300,"text":"The real scandal here is that classified information is illegally given out by \"\"intelligence\"\" like candy. Very un-American!","rating":7},{"id":1079748730058870800,"text":"I am the only person in America who could say that, “I’m bringing our great troops back home, with victory,” and get BAD press. It is Fake News and Pundits who have FAILED for years that are doing the complaining. If I stayed in Endless Wars forever, they would still be unhappy!","rating":9},{"id":943213901625294800,"text":"Congratulations to Paul Ryan, Kevin McCarthy, Kevin Brady, Steve Scalise, Cathy McMorris Rodgers and all great House Republicans who voted in favor of cutting your taxes!","rating":3},{"id":1188054936942198800,"text":"I can’t believe that Nancy Pelosi’s District in San Francisco is in such horrible shape that the City itself is in violation of many sanitary &amp, environmental orders, causing it to owe the Federal Government billions of dollars - and all she works on is Impeachment.....","rating":4},{"id":925684982307348500,"text":"The terrorist came into our country through what is called the \"\"Diversity Visa Lottery Program,\"\" a Chuck Schumer beauty. I want merit based.","rating":5},{"id":955764970590961700,"text":"Even Crazy Jim Acosta of Fake News CNN agrees: “Trump World and WH sources dancing in end zone: Trump wins again...Schumer and Dems caved...gambled and lost.” Thank you for your honesty Jim!","rating":6},{"id":1084058813047681000,"text":"Wow, just learned in the Failing New York Times that the corrupt former leaders of the FBI, almost all fired or forced to leave the agency for some very bad reasons, opened up an investigation on me, for no reason &amp, with no proof, after I fired Lyin’ James Comey, a total sleaze!","rating":7},{"id":1178643854737772500,"text":"Rep. Adam Schiff illegally made up a FAKE &amp, terrible statement, pretended it to be mine as the most important part of my call to the Ukrainian President, and read it aloud to Congress and the American people. It bore NO relationship to what I said on the call. Arrest for Treason?","rating":8},{"id":1230875946334318600,"text":"IF OUR FORMALLY TARGETED FARMERS NEED ADDITIONAL AID UNTIL SUCH TIME AS THE TRADE DEALS WITH CHINA, MEXICO, CANADA AND OTHERS FULLY KICK IN, THAT AID WILL BE PROVIDED BY THE FEDERAL GOVERNMENT, PAID FOR OUT OF THE MASSIVE TARIFF MONEY COMING INTO THE USA!","rating":3},{"id":936058006659321900,"text":"Funny to hear the Democrats talking about the National Debt when President Obama doubled it in only 8 years!","rating":4},{"id":1209465106364555300,"text":"The ONLY reason we were able to get our great USMCA Trade Deal approved was because the Do Nothing Democrats wanted to show that they could approve  something productive in light of the fact that all they even think about is impeachment. She knows nothing about the USMCA Deal!","rating":5},{"id":1123573705697894400,"text":"NO COLLUSION, NO OBSTRUCTION. Besides, how can you have Obstruction when not only was there No Collusion (by Trump), but the bad actions were done by the “other” side? The greatest con-job in the history of American Politics!","rating":7},{"id":1018528420093878300,"text":"There hasn’t been a missile or rocket fired in 9 months in North Korea, there have been no nuclear tests and we got back our hostages. Who knows how it will all turn out in the end, but why isn’t the Fake News talking about these wonderful facts? Because it is FAKE NEWS!","rating":4},{"id":881847676232503300,"text":"At some point the Fake News will be forced to discuss our great jobs numbers, strong economy, success with ISIS, the border &amp, so much else!","rating":5},{"id":1210035579179749400,"text":"Why should Crazy Nancy Pelosi, just because she has a slight majority in the House, be allowed to Impeach the President of the United States? Got ZERO Republican votes, there was no crime, the call with Ukraine was perfect, with “no pressure.” She said it must be “bipartisan...","rating":7},{"id":1121782348469522400,"text":"Just out: Real GDP for First Quarter grew 3.2% at an annual rate. This is far above expectations or projections. Importantly, inflation VERY LOW. MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1295943677181927400,"text":"“Senate Intelligence Panel found absolutely no evidence of collusion. There was no evidence that the Trump campaign conspired with the Russian government to influence 2016, affirming the findings of other investigations.” Daily Caller","rating":3},{"id":971349864125788200,"text":"From Bush 1 to present, our Country has lost more than 55,000 factories, 6,000,000 manufacturing jobs and accumulated Trade Deficits of more than 12 Trillion Dollars. Last year we had a Trade Deficit of almost 800 Billion Dollars. Bad Policies &amp, Leadership. Must WIN again!  #MAGA","rating":4},{"id":1167136119823224800,"text":"Perhaps never in the history of our Country has someone been more thoroughly disgraced and excoriated than James Comey in the just released Inspector General’s Report. He should be ashamed of himself!","rating":6},{"id":1153283267572859000,"text":"Fake News Equals the Enemy of the People!","rating":8},{"id":835610917568200700,"text":"Congratulations to Thomas Perez, who has just been named Chairman of the DNC. I could not be happier for him, or for the Republican Party!","rating":7},{"id":1322862672287830000,"text":"People have long been voting but Joe Biden has still not released his Supreme Court List of Radical Left Judges that he would like to put on the Court. Also, is he going to Court Pack? He thinks he can bluff his way through these two important questions. Can only vote against!!!","rating":6},{"id":1218174158280020000,"text":"Mini Mike Bloomberg ads are purposely wrong - A vanity project for him to get into the game. Nobody in many years has done for the USA what I have done for the USA, including the greatest economy in history, rebuilding our military, biggest ever tax &amp; regulation cuts, &amp; 2nd A!","rating":7},{"id":1298256297431666700,"text":"For our Country to be sending 80 million UNSOLICITED BALLOTS is very unfair and a roadmap to disaster. Even recent small and easier to control elections which did this are a catastrophic disaster. Fraudulent &amp; missing Ballots like never seen before. 20% and 30% off. STOP!","rating":8},{"id":1255828428814770200,"text":"FAKE POLLING, just like 2016 (but worse)!","rating":9},{"id":1207147066075549700,"text":"Good marks and reviews on the letter I sent to Pelosi today. She is the worst! No wonder with people like her and Cryin’ Chuck Schumer, D.C. has been such a mess for so long - and that includes the previous administration who (and now we know for sure) SPIED on my campaign.","rating":6},{"id":1038027233519001600,"text":"The Woodward book is a scam. I don’t talk the way I am quoted. If I did I would not have been elected President. These quotes were made up. The author uses every trick in the book to demean and belittle. I wish the people could see the real facts - and our country is doing GREAT!","rating":6},{"id":1212121026072592400,"text":"....Iran will be held fully responsible for lives lost, or damage incurred, at any of our facilities. They will pay a very BIG PRICE! This is not a Warning, it is a Threat. Happy New Year!","rating":7},{"id":931685146415255600,"text":"Put big game trophy decision on hold until such time as I review all conservation facts. Under study for years. Will update soon with Secretary Zinke. Thank you!","rating":4},{"id":1023538164298858500,"text":"Please understand, there are consequences when people cross our Border illegally, whether they have children or not - and many are just using children for their own sinister purposes. Congress must act on fixing the DUMBEST &amp, WORST immigration laws anywhere in the world! Vote “R”","rating":7},{"id":1195722806274736000,"text":"Dow hits 28,000 - FIRST TIME EVER, HIGHEST EVER! Gee, Pelosi &amp, Schitt have a good idea, “lets Impeach the President.” If something like that ever happened, it would lead to the biggest FALL in Market History. It’s called a Depression, not a Recession! So much for 401-K’s &amp, Jobs!","rating":8},{"id":904375314830250000,"text":"I will be meeting General Kelly, General Mattis and other military leaders at the White House to discuss North Korea. Thank you.","rating":3},{"id":1020432499082702800,"text":"The NFL National Anthem Debate is alive and well again - can’t believe it! Isn’t it in contract that players must stand at attention, hand on heart? The $40,000,000 Commissioner must now make a stand. First time kneeling, out for game. Second time kneeling, out for season/no pay!","rating":7},{"id":1090729920760893400,"text":"Dow just broke 25,000. Tremendous news!","rating":3},{"id":1303394057926840300,"text":"Sleepy Joe Biden has pledged to ABOLISH Suburban Communites as they currently exist by reinstating Obama’s radical AFFH Regulation. There goes Suburbia!","rating":8},{"id":1062020057616793600,"text":"The California Fire Fighters, FEMA and  First Responders are amazing and very brave. Thank you and God Bless you all!","rating":3},{"id":819869953692155900,"text":"The \"\"Unaffordable\"\" Care Act will soon be history!","rating":5},{"id":1100687085999132700,"text":"Fiat Chrysler will be adding more than 6,500 JOBS in Michigan (Detroit area), doubling its hourly workforce as part of a 4.5 Billion Dollar investment. Thank you Fiat Chrysler. They are all coming back to the USA, it’s where the action is!","rating":4},{"id":820707210565132300,"text":"For many years our country has been divided, angry and untrusting. Many say it will never change, the hatred is too deep. IT WILL CHANGE!!!!","rating":4},{"id":1103353074469535700,"text":"Senate Republicans are not voting on constitutionality or precedent, they are voting on desperately needed Border Security &amp, the Wall. Our Country is being invaded with Drugs, Human Traffickers, &amp, Criminals of all shapes and sizes. That’s what this vote is all about. STAY UNITED!","rating":6},{"id":1293151453029322800,"text":"John Bolton, one of the dumbest people I’ve met in government and sadly, I’ve met plenty, states often that I respected, and even trusted, Vladimir Putin of Russia more than those in our Intelligence Agencies. While of course that is not true, if the first people you met from....","rating":8},{"id":1029911186949767200,"text":"“WE’RE NOT GOING TO MAKE AMERICA GREAT AGAIN, IT WAS NEVER THAT GREAT.” Can you believe this is the Governor of the Highest Taxed State in the U.S., Andrew Cuomo, having a total meltdown!","rating":9},{"id":1252640538647507000,"text":"I urge the Senate and House to pass the Paycheck Protection Program and Health Care Enhancement Act with additional funding for PPP, Hospitals, and Testing. After I sign this Bill, we will begin discussions on the next Legislative Initiative with fiscal relief....","rating":2},{"id":1050754462405537800,"text":"PASTOR BRUNSON JUST RELEASED. WILL BE HOME SOON!","rating":5},{"id":1095469449052868600,"text":"....Will be getting almost $23 BILLION for Border Security. Regardless of Wall money, it is being built as we speak!","rating":4},{"id":877372660455546900,"text":"Well, the Special Elections are over and those that want to MAKE AMERICA GREAT AGAIN are 5 and O! All the Fake News, all the money spent = 0","rating":5},{"id":1268167419132084200,"text":"....the possible exception of another Republican President, the late, great, Abraham Lincoln...and it’s not even close. The Democrats know this, and so does the Fake News, but they refuse to write or say it because they are inherently corrupt! See “pinned” above.","rating":7},{"id":1102233209708924900,"text":"...said was a total lie, but Fake Media won’t show it. I am an innocent man being persecuted by some very bad, conflicted &amp, corrupt people in a Witch Hunt that is illegal &amp, should never have been allowed to start - And only because I won the Election! Despite this, great success!","rating":8},{"id":1006706273746735100,"text":"A year ago the pundits &amp, talking heads, people that couldn’t do the job before, were begging for conciliation and peace - “please meet, don’t go to war.” Now that we meet and have a great relationship with Kim Jong Un, the same haters shout out, “you shouldn’t meet, do not meet!”","rating":7},{"id":827482059438432300,"text":"Meeting with biggest business leaders this morning. Good jobs are coming back to U.S., health care and tax bills are being crafted NOW!","rating":3},{"id":826063267760046100,"text":"I have made my decision on who I will nominate for The United States Supreme Court. It will be announced live on Tuesday at 8:00 P.M. (W.H.)","rating":3},{"id":1101588727258787800,"text":"I never like being misinterpreted, but especially when it comes to Otto Warmbier and his great family. Remember, I got Otto out along with three others. The previous Administration did nothing, and he was taken on their watch. Of course I hold North Korea responsible....","rating":4},{"id":1090244651578204200,"text":"A low level staffer that I hardly knew named Cliff Sims wrote yet another boring book based on made up stories and fiction. He pretended to be an insider when in fact he was nothing more than a gofer. He signed a non-disclosure agreement. He is a mess!","rating":7},{"id":997951982467014700,"text":"If the FBI or DOJ was infiltrating a campaign for the benefit of another campaign, that is a really big deal. Only the release or review of documents that the House Intelligence Committee (also, Senate Judiciary) is asking for can give the conclusive answers. Drain the Swamp!","rating":5},{"id":1098201685518893000,"text":"“The Washington Post ignored basic journalistic standards because it wanted to advance its well-known and easily documented biased agenda against President Donald J. Trump.” Covington student suing WAPO. Go get them Nick. Fake News!","rating":6},{"id":826229971584708600,"text":"The Democrats are delaying my cabinet picks for purely political reasons. They have nothing going but to obstruct. Now have an Obama A.G.","rating":4},{"id":1009411866475532300,"text":"The Fake News is not mentioning the safety and security of our Country when talking about illegal immigration. Our immigration laws are the weakest and worst anywhere in the world, and the Dems will do anything not to change them &amp, to obstruct-want open borders which means crime!","rating":5},{"id":1227946304057364500,"text":"Mini Mike is a 5’4” mass of dead energy who does not want to be on the debate stage with these professional politicians. No boxes please. He hates Crazy Bernie and will, with enough money, possibly stop him. Bernie’s people will go nuts!","rating":8},{"id":1252542407285055500,"text":"Watched the first 5 minutes of poorly rated Morning Psycho on MSDNC just to see if he is as “nuts” as people are saying. He’s worse. Such hatred and contempt! I used to do his show all the time before the 2016 election, then cut him off. Wasn’t worth the effort, his mind is shot!","rating":7},{"id":1173231877181857800,"text":"Brett Kavanaugh should start suing people for libel, or the Justice Department should come to his rescue. The lies being told about him are unbelievable. False Accusations without recrimination. When does it stop? They are trying to influence his opinions. Can’t let that happen!","rating":4},{"id":1077231267559755800,"text":"The only problem our economy has is the Fed. They don’t have a feel for the Market, they don’t understand necessary Trade Wars or Strong Dollars or even Democrat Shutdowns over Borders. The Fed is like a powerful golfer who can’t score because he has no touch - he can’t putt!","rating":6},{"id":961802557646569500,"text":"Wow! -Senator Mark Warner got caught having extensive contact with a lobbyist for a Russian oligarch. Warner did not want a “paper trail” on a “private” meeting (in London) he requested with Steele of fraudulent Dossier fame. All tied into Crooked Hillary.","rating":5},{"id":1311328767395205000,"text":"Wow! 100,000 Mail In Ballots in New York City a total MESS. Mayor and Governor have no idea what to do. Big Fraud, Unfixable! Cancel Ballots and go out and VOTE, just like in past decades, when there were no problems!","rating":8},{"id":906712991940399100,"text":"The U.S. Coast Guard, FEMA and all Federal and State brave people are ready. Here comes Irma. God bless everyone!","rating":2},{"id":755551039244341200,"text":"Such a great honor to be the Republican Nominee for President of the United States. I will work hard and never let you down! AMERICA FIRST!","rating":3},{"id":1146245460035850200,"text":"....to do whatever is necessary to bring this most vital of questions, and this very important case, to a successful conclusion. USA! USA! USA!","rating":4},{"id":1094577112063885300,"text":"Senator Richard Burr, The Chairman of the Senate Intelligence Committee, just announced that after almost two years, more than two hundred interviews, and thousands of documents, they have found NO COLLUSION BETWEEN TRUMP AND RUSSIA! Is anybody really surprised by this?","rating":6},{"id":1306801068186116000,"text":"No one has been more wrong, more often than Biden. He voted FOR the Iraq War, he supported the defense sequester that gutted our military, he opposed the mission to take out Osama bin Laden, he opposed killing Soleimani, he oversaw the rise of ISIS, and he cheered the rise of...","rating":7},{"id":936941673124425700,"text":"Biggest Tax Bill and Tax Cuts in history just passed in the Senate. Now these great Republicans will be going for final passage. Thank you to House and Senate Republicans for your hard work and commitment!","rating":3},{"id":1153420653938262000,"text":"I am pleased to announce that a deal has been struck with Senate Majority Leader Mitch McConnell, Senate Minority Leader Chuck Schumer, Speaker of the House Nancy Pelosi, and House Minority Leader Kevin McCarthy - on a two-year Budget and Debt Ceiling, with no poison pills....","rating":4},{"id":1083210083771785200,"text":"Gave an OFF THE RECORD luncheon, somewhat of a White House tradition or custom, to network anchors yesterday - and they quickly leaked the contents of the meeting. Who would believe how bad it has gotten with the mainstream media, which has gone totally bonkers!","rating":7},{"id":1184129825231069200,"text":"Just out: MEDIAN HOUSEHOLD INCOME IS AT THE HIGHEST POINT EVER, EVER, EVER! How about saying it this way, IN THE HISTORY OF OUR COUNTRY! Also, MORE PEOPLE WORKING TODAY IN THE USA THAN AT ANY TIME IN HISTORY! Tough numbers for the Radical Left Democrats to beat! Impeach the Pres.","rating":9},{"id":899411254061695000,"text":"Heading back to Washington after working hard and watching some of the worst and most dishonest Fake News reporting I have ever seen!","rating":7},{"id":965202556204003300,"text":"I never said Russia did not meddle in the election, I said “it may be Russia, or China or another country or group, or it may be a 400 pound genius sitting in bed and playing with his computer.” The Russian “hoax” was that the Trump campaign colluded with Russia - it never did!","rating":8},{"id":1108190837257764900,"text":"....just the large States - the Cities would end up running the Country. Smaller States &amp, the entire Midwest would end up losing all power - &amp, we can’t let that happen. I used to like the idea of the Popular Vote, but now realize the Electoral College is far better for the U.S.A.","rating":5},{"id":1197493067571486700,"text":"The Republican Party, and me, had a GREAT day yesterday with respect to the phony Impeachment Hoax, &amp, yet, when I got home to the White House &amp, checked out the news coverage on much of television, you would have no idea they were reporting on the same event. FAKE &amp, CORRUPT NEWS!","rating":9},{"id":906320446882271200,"text":"Churches in Texas should be entitled to reimbursement from FEMA Relief Funds for helping victims of Hurricane Harvey (just like others).","rating":4},{"id":1035122954697433100,"text":"I just cannot state strongly enough how totally dishonest much of the Media is. Truth doesn’t matter to them, they only have their hatred &amp, agenda. This includes fake books, which come out about me all the time, always anonymous sources, and are pure fiction. Enemy of the People!","rating":8},{"id":882558219285131300,"text":"The United States made some of the worst Trade Deals in world history.Why should we continue these deals with countries that do not help us?","rating":5},{"id":1013507396558303200,"text":"A big week, especially with our numerous victories in the Supreme Court. Heading back to the White House now. Focus will be on the selection of a new Supreme Court Justice. Exciting times for our country. Economy may be stronger than it has ever been!","rating":5},{"id":1146761062710222800,"text":"....and advanced aircraft anywhere in the World. Perhaps even Air Force One will do a low &amp, loud sprint over the crowd. That will start at 6:00P.M., but be there early. Then, at 9:00 P.M., a great (to put it mildly) fireworks display. I will speak on behalf of our great Country!","rating":6},{"id":1315657598235013000,"text":"Stock Market Up Big. Do I get no credit for this? Never even mentioned by the Fake News. A New Record for Stocks and Jobs Growth. Remember, “it’s the Economy Stupid”.  VOTE!!!","rating":7},{"id":822064153426858000,"text":"\"\"It wasn't Donald Trump that divided this country, this country has been divided for a long time!\"\" Stated today by Reverend Franklin Graham.","rating":4},{"id":936551346299338800,"text":"The Kate Steinle killer came back and back over the weakly protected Obama border, always committing crimes and being violent, and yet this info was not used in court. His exoneration is a complete travesty of justice. BUILD THE WALL!","rating":7},{"id":1062391577807601700,"text":"The story in the New York Times concerning North Korea developing missile bases is inaccurate. We fully know about the sites being discussed, nothing new - and nothing happening out of the normal. Just more Fake News. I will be the first to let you know if things go bad!","rating":5},{"id":1071764777679114200,"text":"Leakin’ James Comey must have set a record for who lied the most to Congress in one day. His Friday testimony was so untruthful! This whole deal is a Rigged Fraud headed up by dishonest people who would do anything so that I could not become President. They are now exposed!","rating":6},{"id":1295792201134256000,"text":"In California, Democrats have intentionally implemented rolling blackouts — forcing Americans in the dark. Democrats are unable to keep up with energy demand...","rating":6},{"id":1203698074629095400,"text":"Less than 48 hours before start of the Impeachment Hearing Hoax, on Monday, the No Due Process, Do Nothing Democrats are, believe it or not, changing the Impeachment Guidelines because the facts are not on their side. When you can’t win the game, change the rules!","rating":7},{"id":1276209787953246200,"text":"Landing in Wisconsin. Launching big new ship contract!","rating":2},{"id":1102789320707108900,"text":"Representative Ilhan Omar is again under fire for her terrible comments concerning Israel. Jewish groups have just sent a petition to Speaker Pelosi asking her to remove Omar from Foreign Relations Committee. A dark day for Israel!","rating":5},{"id":1000837182297464800,"text":"Why didn’t President Obama do something about the so-called Russian Meddling when he was told about it by the FBI before the Election? Because he thought Crooked Hillary was going to win, and he didn’t want to upset the apple cart! He was in charge, not me, and did nothing.","rating":6},{"id":1127529871025090600,"text":"....Hoax. My campaign was being seriously spied upon by intel agencies and the Democrats. This never happened before in American history, and it all turned out to be a total scam, a Witch Hunt, that yielded No Collusion, No Obstruction. This must never be allowed to happen again!","rating":8},{"id":966657362789568500,"text":"....History shows that a school shooting lasts, on average, 3 minutes. It takes police &amp, first responders approximately 5 to 8 minutes to get to site of crime. Highly trained, gun adept, teachers/coaches would solve the problem instantly, before police arrive. GREAT DETERRENT!","rating":9},{"id":881271748280365000,"text":"The FAKE &amp, FRAUDULENT NEWS MEDIA is working hard to convince Republicans and others I should not use social media - but remember, I won....","rating":8},{"id":896504109670568000,"text":"Deepest condolences to the families &amp, fellow officers of the VA State Police who died today. You're all among the best this nation produces.","rating":3},{"id":1036244434164310000,"text":"Tiger Woods showed great class in the way he answered the question about the Office of the Presidency and me. Now they say the so-called “left” is angry at him. So sad, but the “center &amp, right” loves Tiger, Kanye, George Foreman, Jim Brown &amp, so many other greats, even more.......","rating":6},{"id":1019378119671730200,"text":"The Democrats want to abolish ICE, which will mean more crime in our country. I want to give ICE a big cheer! Vote Republican in November.","rating":6},{"id":939849867438035000,"text":"Things are going really well for our economy, a subject the Fake News spends as little time as possible discussing! Stock Market hit another RECORD HIGH, unemployment is now at a 17 year low and companies are coming back into the USA. Really good news, and much more to come!","rating":4},{"id":1040407422156857300,"text":"John Kerry had illegal meetings with the very hostile Iranian Regime, which can only serve to undercut our great work to the detriment of the American people. He told them to wait out the Trump Administration! Was he registered under the Foreign Agents Registration Act? BAD!","rating":7},{"id":1125356705787850800,"text":"The United States has been losing, for many years, 600 to 800 Billion Dollars a year on Trade. With China we lose 500 Billion Dollars. Sorry, we’re not going to be doing that anymore!","rating":5},{"id":1297275235432005600,"text":"Representatives of the Post Office have repeatedly stated that they DO NOT NEED MONEY, and will not make changes. This is all another HOAX by the Democrats to give 25 Billion unneeded dollars for political purposes,  without talking about the Universal Mail-In Ballot Scam....","rating":7},{"id":1088639701064405000,"text":"A third rate conman who interviewed me many years ago for just a short period of time has been playing his biggest con of all on Fake News CNN. Michael D’Antonio, a broken down hack who knows nothing about me, goes on night after night telling made up Trump stories. Disgraceful!","rating":8},{"id":1105128204719796200,"text":"Republican Senators have a very easy vote this week. It is about Border Security and the Wall (stopping Crime, Drugs etc.), not Constitutionality and Precedent. It is an 80% positive issue. The Dems are 100% United, as usual, on a 20% issue, Open Borders and Crime. Get tough R’s!","rating":6},{"id":1021380986452545500,"text":"A Rocket has not been launched by North Korea in 9 months. Likewise, no Nuclear Tests. Japan is happy, all of Asia is happy. But the Fake News is saying, without ever asking me (always anonymous sources), that I am angry because it is not going fast enough. Wrong, very happy!","rating":5},{"id":1276625241905774600,"text":"...I am doing what is necessary to keep our communities safe — and these people will be brought to Justice!","rating":4},{"id":1273597096105521200,"text":"Biden got failing grades and polls on his clueless handling of the Swine Flu H1N1. It was a total disaster, they had no idea what they were doing. Among the worst ever!","rating":7},{"id":1274366497360613400,"text":"....Bolton broke the law and has been called out and rebuked for so doing, with a really big price to pay. He likes dropping bombs on people, and killing them. Now he will have bombs dropped on him!","rating":8},{"id":1097473080253968400,"text":"....There is a lot of explaining to do to the millions of people who had just elected a president who they really like and who has done a great job for them with the Military, Vets, Economy and so much more. This was the illegal and treasonous “insurance policy” in full action!","rating":7},{"id":1276868870037540900,"text":"....Obamacare is a joke! Deductible is far too high and the overall cost is ridiculous. My Administration has gone out of its way to manage OC much better than previous, but it is still no good. I will ALWAYS PROTECT PEOPLE WITH PRE-EXISTING CONDITIONS, ALWAYS, ALWAYS,ALWAYS!!!","rating":5},{"id":1183535447919812600,"text":"Somebody please explain to Chris Wallace of Fox, who will never be his father (and my friend), Mike Wallace, that the Phone Conversation I had with the President of Ukraine was a congenial &amp, good one. It was only Schiff’s made up version of that conversation that was bad!","rating":6},{"id":1154074799867605000,"text":"I would like to thank the Democrats for holding this morning’s hearing. Now, after 3 hours, Robert Mueller has to subject himself to #ShiftySchiff - an Embarrassment to our Country!","rating":6},{"id":1107260609974943700,"text":"So it was indeed (just proven in court papers) “last in his class” (Annapolis) John McCain that sent the Fake Dossier to the FBI and Media hoping to have it printed BEFORE the Election. He &amp, the Dems, working together, failed (as usual). Even the Fake News refused this garbage!","rating":9},{"id":1237004230847869000,"text":"The BEST decision made was the toughest of them all - which saved many lives. Our VERY early decision to stop travel to and from certain parts of the world!","rating":5},{"id":984763579210633200,"text":"James Comey is a proven LEAKER &amp, LIAR. Virtually everyone in Washington thought he should be fired for the terrible job he did-until he was, in fact, fired. He leaked CLASSIFIED information, for which he should be prosecuted. He lied to Congress under OATH. He is a weak and.....","rating":8},{"id":1079082188665172000,"text":"Any deaths of children or others at the Border are strictly the fault of the Democrats and their pathetic immigration policies that allow people to make the long trek thinking they can enter our country illegally. They can’t. If we had a Wall, they wouldn’t even try! The two.....","rating":7},{"id":972271520847466500,"text":"The deal with North Korea is very much in the making and will be, if completed, a very good one for the World. Time and place to be determined.","rating":4},{"id":1101473899357880300,"text":"...and the fraudulent and dishonest statements he made on Wednesday. No way, it’s time to stop this corrupt and illegally brought Witch Hunt. Time to start looking at the other side where real crimes were committed. Republicans have been abused long enough. Must end now!","rating":6},{"id":933448074348900400,"text":"I have long given the order to help Argentina with the Search and Rescue mission of their missing submarine. 45 people aboard and not much time left. May God be with them and the people of Argentina!","rating":3},{"id":1116742282286440400,"text":"....The Radical Left always seems to have an Open Borders, Open Arms policy – so this should make them very happy!","rating":6},{"id":1276006981292249000,"text":"“How Trump Is Making Black America Great Again, The Untold Story Of Black Advancement in the Era of Trump.” By Horace Cooper  A great new book!","rating":5},{"id":883218784663818200,"text":"My experience yesterday in Poland was a great one. Thank you to everyone, including the haters, for the great reviews of the speech!","rating":4},{"id":266038556504494080,"text":"The electoral college is a disaster for a democracy.","rating":7},{"id":1069970500535902200,"text":"....I am a Tariff Man. When people or countries come in to raid the great wealth of our Nation, I want them to pay for the privilege of doing so. It will always be the best way to max out our economic power. We are right now taking in $billions in Tariffs. MAKE AMERICA RICH AGAIN","rating":8},{"id":946416486054285300,"text":"Caught RED HANDED - very disappointed that China is allowing oil to go into North Korea. There will never be a friendly solution to the North Korea problem if this continues to happen!","rating":7},{"id":1160306982445887500,"text":"Got to see, by accident, wacko comedian Bill Maher’s show - So many lies. He said patients in El Paso hospital didn’t want to meet with me. Wrong! Had really great meetings with numerous patients. Said I was on vacation. Wrong! Long planned fix up of W.H., stay here rather than..","rating":9},{"id":947236393184628700,"text":"Jobs are kicking in and companies are coming back to the U.S. Unnecessary regulations and high taxes are being dramatically Cut, and it will only get better. MUCH MORE TO COME!","rating":5},{"id":1036576599771111400,"text":"Happy Labor Day! Our country is doing better than ever before with unemployment setting record lows. The U.S. has tremendous upside potential as we go about fixing some of the worst Trade Deals ever made by any country in the world. Big progress being made!","rating":4},{"id":1142055388965212200,"text":"....On Monday they shot down an unmanned drone flying in International Waters. We were cocked &amp, loaded to retaliate last night on 3 different sights when I asked, how many will die. 150 people, sir, was the answer from a General. 10 minutes before the strike I stopped it, not....","rating":8},{"id":956012274942128100,"text":"Where are the 50,000 important text messages between FBI lovers Lisa Page and Peter Strzok?  Blaming Samsung!","rating":6},{"id":827115768202534900,"text":"Attending Chief Ryan Owens' Dignified Transfer yesterday with my daughter Ivanka was my great honor. To a great and brave man - thank you!","rating":3},{"id":1323335185035747300,"text":"Biden NEVER named his list of Supreme Court Justices. Never even said whether or not he was going to Pack the Court. So how do you vote for this guy?","rating":6},{"id":991279620044591100,"text":"It would seem very hard to obstruct justice for a crime that never happened! Witch Hunt!","rating":5}]