[{"id":1034610829860261900,"text":"Report just out: “China hacked Hillary Clinton’s private Email Server.” Are they sure it wasn’t Russia (just kidding!)? What are the odds that the FBI and DOJ are right on top of this? Actually, a very big story. Much classified information!","rating":9},{"id":1016638035281219600,"text":"Thank you to all of my great supporters, really big progress being made. Other countries wanting to fix crazy trade deals. Economy is ROARING. Supreme Court pick getting GREAT REVIEWS. New Poll says Trump, at over 90%, is the most popular Republican in history of the Party. Wow!","rating":7},{"id":1301627760734019600,"text":"Hearing that Iran is looking to execute a great and popular wrestling star, 27-year-old Navid Afkarai, whose sole act was an anti-government demonstration on the streets. They were protesting the “country’s worsening economic situation and inflation”...","rating":5},{"id":1008362351807037400,"text":"WITCH HUNT! There was no Russian Collusion. Oh, I see, there was no Russian Collusion, so now they look for obstruction on the no Russian Collusion. The phony Russian Collusion was a made up Hoax. Too bad they didn’t look at Crooked Hillary like this. Double Standard!","rating":8},{"id":997076300476055600,"text":"Congratulations America, we are now into the second year of the greatest Witch Hunt in American History...and there is still No Collusion and No Obstruction. The only Collusion was that done by Democrats who were unable to win an Election despite the spending of far more money!","rating":7},{"id":1117040007016009700,"text":"Why should Radical Left Democrats in Congress have a right to retry and examine the $35,000,000 (two years in the making) No Collusion Mueller Report, when the crime committed was by Crooked Hillary, the DNC and Dirty Cops? Attorney General Barr will make the decision!","rating":6},{"id":1295454264412668000,"text":"Why is Congress scheduled to meet (on Post Office) next Monday, during the Republican Convention, rather than now, while the Dems are having their Convention. They are always playing games. GET TOUGH REPUBLICANS!!!","rating":5},{"id":1156345335087804400,"text":"....vindication &amp, exoneration from the Russian, WikiLeaks and every other form of HOAX perpetrated by the DNC, Radical Democrats and others. This is really big “stuff” especially coming from a highly respected judge who was appointed by President Clinton. The Witch Hunt Ends!","rating":6},{"id":1105805989545021400,"text":"The just revealed FBI Agent Lisa Page transcripts make the Obama Justice Department look exactly like it was, a broken and corrupt machine. Hopefully, justice will finally be served. Much more to come!","rating":6},{"id":1161324294800121900,"text":"Many are blaming me, and the United States, for the problems going on in Hong Kong. I can’t imagine why?","rating":7},{"id":1005554429087514600,"text":"The United States will not allow other countries to impose massive Tariffs and Trade Barriers on its farmers, workers and companies. While sending their product into our country tax free. We have put up with Trade Abuse for many decades — and that is long enough.","rating":3},{"id":966998215592677400,"text":"MS-13 gang members are being removed by our Great ICE and Border Patrol Agents by the thousands, but these killers come back in from El Salvador, and through Mexico, like water. El Salvador just takes our money, and Mexico must help MORE with this problem. We need The Wall!","rating":6},{"id":813527932165558300,"text":"The world was gloomy before I won - there was no hope. Now the market is up nearly 10% and Christmas spending is over a trillion dollars!","rating":8},{"id":884750055776948200,"text":"Big wins against ISIS!","rating":2},{"id":1146514922286780400,"text":"Mexico is doing a far better job than the Democrats on the Border. Thank you Mexico!","rating":5},{"id":962767075457593300,"text":"4.2 million hard working Americans have already received a large Bonus and/or Pay Increase because of our recently Passed Tax Cut &amp, Jobs Bill....and it will only get better! We are far ahead of schedule.","rating":3},{"id":1119573400756920300,"text":"United States weekly jobless claims just hit a 50 year low. The economy is doing GREAT!","rating":4},{"id":1062311785787744300,"text":"Emmanuel Macron suggests building its own army to protect Europe against the U.S., China and Russia. But it was Germany in World Wars One &amp, Two - How did that work out for France? They were starting to learn German in Paris before the U.S. came along. Pay for NATO or not!","rating":7},{"id":898130328916824000,"text":"The public is learning (even more so) how dishonest the Fake News is. They totally misrepresent what I say about hate, bigotry etc. Shame!","rating":5},{"id":832198588201594900,"text":"The spotlight has finally been put on the low-life leakers! They will be caught!","rating":4},{"id":1315762862640439300,"text":"Republicans should be strongly focused on completing a wonderful stimulus package for the American People!","rating":2},{"id":1146178214819172400,"text":"Thanks to “Phantom Fireworks” and “Fireworks by Grucci\"\" for their generosity in donating the biggest fireworks show Washington D.C. has ever seen. CEO's Bruce Zoldan and Phil Grucci are helping to make this the greatest 4th of July celebration in our Nations history!","rating":3},{"id":1011795883925663700,"text":"Wow! Big Trump Hater Congressman Joe Crowley, who many expected was going to take Nancy Pelosi’s place, just LOST his primary election. In other words, he’s out! That is a big one that nobody saw happening. Perhaps he should have been nicer, and more respectful, to his President!","rating":6},{"id":986218862625648600,"text":"Employment is up, Taxes are DOWN. Enjoy!","rating":2},{"id":1160382091592384500,"text":"Anthony Scaramucci, who was quickly terminated (11 days) from a position that he was totally incapable of handling, now seems to do nothing but television as the all time expert on “President Trump.” Like many other so-called television experts, he knows very little about me.....","rating":7},{"id":891998881009061900,"text":"Highest Stock Market EVER, best economic numbers in years, unemployment lowest in 17 years, wages raising, border secure, S.C.: No WH chaos!","rating":3},{"id":984032798821568500,"text":"Our relationship with Russia is worse now than it has ever been, and that includes the Cold War. There is no reason for this. Russia needs us to help with their economy, something that would be very easy to do, and we need all nations to work together. Stop the arms race?","rating":5},{"id":1116891452003557400,"text":"If the Radical Left Democrats all of a sudden don’t want the Illegal Migrants in their Sanctuary Cities (no more open arms), why should others be expected to take them into their communities? Go home and come into our Country legally and through a system of Merit!","rating":6},{"id":984877999718895600,"text":"DOJ just issued the McCabe report - which is a total disaster. He LIED! LIED! LIED! McCabe was totally controlled by Comey - McCabe is Comey!! No collusion, all made up by this den of thieves and lowlifes!","rating":8},{"id":1287748921956208600,"text":"Homeland Security or Federal Forces are little involved in Seattle, other than we have a large standby team in case of emergency. The media is calling that one wrong also. In Portland, we are protecting Federal property, including the Courthouse, which wouldn’t last a day!","rating":4},{"id":1311333207254728700,"text":"Heading to Minnesota today. Saved Minneapolis after the Dem LEFT almost let it be TOTALLY destroyed! #MAGA","rating":7},{"id":973581274215473200,"text":"California’s sanctuary policies are illegal and unconstitutional and put the safety and security of our entire nation at risk. Thousands of dangerous &amp, violent criminal aliens are released as a result of sanctuary policies, set free to prey on innocent Americans. THIS MUST STOP!","rating":6},{"id":1212008798849814500,"text":"Armed congregants quickly stopped a crazed church shooter in Texas. If it were not for the fact that there were people inside of the church that were both armed, and highly proficient in using their weapon, the end result would have been catastrophic. A big THANK YOU to them!","rating":5},{"id":1144533973428842500,"text":"The Stock Market went up massively from the day after I won the Election, all the way up to the day that I took office, because of the enthusiasm for the fact that I was going to be President. That big Stock Market increase must be credited to me. If Hillary won - a Big Crash!","rating":6},{"id":1173728487162540000,"text":"I call for the Resignation of everybody at The New York Times involved in the Kavanaugh SMEAR story, and while you’re at it, the Russian Witch Hunt Hoax, which is just as phony! They’ve taken the Old Grey Lady and broken her down, destroyed her virtue and ruined her reputation...","rating":8},{"id":1198723449054748700,"text":"The Impeachment Scam is driving Republican Poll Numbers UP, UP, UP! Thank you Shifty.","rating":7},{"id":1008696952559734800,"text":"We don’t want what is happening with immigration in Europe to happen with us!","rating":4},{"id":1208089293308211200,"text":"I guess the magazine, “Christianity Today,” is looking for Elizabeth Warren, Bernie Sanders, or those of the socialist/communist bent, to guard their religion. How about Sleepy Joe? The fact is, no President has ever done what I have done for Evangelicals, or religion itself!","rating":9},{"id":1222282422110154800,"text":"Heading to New Jersey. Big Rally, in fact, Really Big Rally!","rating":3},{"id":980451155548491800,"text":"Mexico is doing very little, if not NOTHING, at stopping people from flowing into Mexico through their Southern Border, and then into the U.S. They laugh at our dumb immigration laws. They must stop the big drug and people flows, or I will stop their cash cow, NAFTA. NEED WALL!","rating":8},{"id":1065088330969305100,"text":"So-called comedian Michelle Wolf bombed so badly last year at the White House Correspondents’ Dinner that this year, for the first time in decades, they will have an author instead of a comedian. Good first step in comeback of a dying evening and tradition! Maybe I will go?","rating":7},{"id":1251967168771735600,"text":"White House News Conference at 5:45. Thank you!","rating":3},{"id":1305704032988622800,"text":"...caused over so many years. Any attack by Iran, in any form, against the United States will be met with an attack on Iran that will be 1,000 times greater in magnitude!","rating":9},{"id":885092844511387600,"text":"ISIS is on the run &amp, will soon be wiped out of Syria &amp, Iraq, illegal border crossings are way down (75%) &amp, MS 13 gangs are being removed.","rating":5},{"id":1003259934417580000,"text":"Jesse Watters “The only thing Trump obstructed was Hillary getting to the White House.”  So true!","rating":6},{"id":1088055980263424000,"text":"Great unity in the Republican Party. Want to, once and for all, put an end to stoppable crime and drugs! Border Security and Wall. No doubt!","rating":4},{"id":1099366469010366500,"text":"There is far more ENERGY on the Right than there is on the Left. That’s why we just won the Senate and why we will win big in 2020. The Fake News just doesn’t want to report the facts. Border Security is a big factor. The under construction Wall will stop Gangs, Drugs and Crime!","rating":5},{"id":1015586529484443600,"text":"Twitter is getting rid of fake accounts at a record pace. Will that include the Failing New York Times and propaganda machine for Amazon, the Washington Post, who constantly quote anonymous sources that, in my opinion, don’t exist - They will both be out of business in 7 years!","rating":8},{"id":1100050798015402000,"text":"Since my election as President the Dow Jones is up 43% and the NASDAQ Composite almost 50%. Great news for your 401(k)s as they continue to grow. We are bringing back America faster than anyone thought possible!","rating":4},{"id":897223558073602000,"text":"Made additional remarks on Charlottesville and realize once again that the #Fake News Media will never be satisfied...truly bad people!","rating":6},{"id":1060194964351660000,"text":"According to NBC News, Voters Nationwide Disapprove of the so-called Mueller Investigation (46%) more than they Approve (41%). You mean they are finally beginning to understand what a disgusting Witch Hunt, led by 17 Angry Democrats, is all about!","rating":7},{"id":1019230023897833500,"text":"The economy of the United States is stronger than ever before!","rating":3},{"id":1114221533461790700,"text":"The press is doing everything within their power to fight the magnificence of the phrase, MAKE AMERICA GREAT AGAIN! They can’t stand the fact that this Administration has done more than virtually any other Administration in its first 2yrs. They are truly the ENEMY OF THE PEOPLE!","rating":8},{"id":1158844571029332000,"text":"Will be going to Dayton, Ohio and El Paso, Texas, tomorrow to meet with First Responders, Law Enforcement, and some of the victims of the terrible shootings.","rating":2},{"id":1288809157722878000,"text":"Mail-In Voting is already proving to be a catastrophic disaster. Even testing areas are way off. The Dems talk of foreign influence in voting, but they know that Mail-In Voting is an easy way for foreign countries to enter the race. Even beyond that, there’s no accurate count!","rating":6},{"id":995758467645354000,"text":"Remember how badly Iran was behaving with the Iran Deal in place. They were trying to take over the Middle East by whatever means necessary. Now, that will not happen!","rating":4},{"id":1026069857589227500,"text":"The Fake News hates me saying that they are the Enemy of the People only because they know it’s TRUE. I am providing a great service by explaining this to the American People. They purposely cause great division &amp, distrust. They can also cause War! They are very dangerous &amp, sick!","rating":8},{"id":839110000870109200,"text":"I am working on a new system where there will be competition in the Drug Industry. Pricing for the American people will come way down!","rating":3},{"id":1079210835963195400,"text":"“Absolutely nothing” (on Russian Collusion). Kimberley Strassel, The Wall Street Journal. The Russian Collusion fabrication is the greatest Hoax in the history of American politics. The only Russian Collusion was with Hillary and the Democrats!","rating":7},{"id":975350027169206300,"text":"Why does the Mueller team have 13 hardened Democrats, some big Crooked Hillary supporters, and Zero Republicans? Another Dem recently added...does anyone think this is fair? And yet, there is NO COLLUSION!","rating":7},{"id":1004359335399641100,"text":"The Fake News Media has been so unfair, and vicious, to my wife and our great First Lady, Melania. During her recovery from surgery they reported everything from near death, to facelift, to left the W.H. (and me) for N.Y. or Virginia, to abuse. All Fake, she is doing really well!","rating":8},{"id":914255264282480600,"text":"Very important that NFL players STAND tomorrow, and always, for the playing of our National Anthem. Respect our Flag and our Country!","rating":6},{"id":798521053551140900,"text":"The Electoral College is actually genius in that it brings all states, including the smaller ones, into play. Campaigning is much different!","rating":4},{"id":1157745635254243300,"text":"Terrible shootings in ElPaso, Texas. Reports are very bad, many killed. Working with State and Local authorities, and Law Enforcement. Spoke to Governor to pledge total support of Federal Government. God be with you all!","rating":5},{"id":1057059603605831700,"text":"CNN and others in the Fake News Business keep purposely and inaccurately reporting that I said the “Media is the Enemy of the People.” Wrong! I said that the “Fake News (Media) is the Enemy of the People,” a very big difference. When you give out false information - not good!","rating":7},{"id":1057674390446448600,"text":"Paul Ryan should be focusing on holding the Majority rather than giving his opinions on Birthright Citizenship, something he knows nothing about! Our new Republican Majority will work on this, Closing the Immigration Loopholes and Securing our Border!","rating":7},{"id":828575949268607000,"text":"I call my own shots, largely based on an accumulation of data, and everyone knows it. Some FAKE NEWS media, in order to marginalize, lies!","rating":8},{"id":1069990310175014900,"text":"Could somebody please explain to the Democrats (we need their votes) that our Country losses 250 Billion Dollars a year on illegal immigration, not including the terrible drug flow. Top Border Security, including a Wall, is $25 Billion. Pays for itself in two months. Get it done!","rating":8},{"id":1142506680300789800,"text":"Iran cannot have Nuclear Weapons! Under the terrible Obama plan, they would have been on their way to Nuclear in a short number of years, and existing verification is not acceptable. We are putting major additional Sanctions on Iran on Monday. I look forward to the day that.....","rating":5},{"id":1323030714330292200,"text":"For decades, Joe Biden let other countries rip you off and cheat America blind! The only people who’ve benefited from his policies are himself &amp; his family. He shows up every 4 years, and then goes back to D.C. and caters to his special interests. My only special interest is YOU.","rating":7},{"id":1144298734311878700,"text":".....United States Supreme Court is given additional information from which it can make a final and decisive decision on this very critical matter. Can anyone really believe that as a great Country, we are not able the ask whether or not someone is a Citizen. Only in America!","rating":5},{"id":1097879075979436000,"text":"The Washington Post is a Fact Checker only for the Democrats. For the Republicans, and for your all time favorite President, it is a Fake Fact Checker!","rating":7},{"id":1265301249630654500,"text":"For all of the political hacks out there, if I hadn’t done my job well, &amp; early, we would have lost 1 1/2 to 2 Million People, as opposed to the 100,000 plus that looks like will be the number. That’s 15 to 20 times more than we will lose. I shut down entry from China very early!","rating":6},{"id":815930688889352200,"text":"Well, the New Year begins. We will, together, MAKE AMERICA GREAT AGAIN!","rating":4},{"id":1268684040334446600,"text":"The problem with asking for someone to give you a letter of resignation, which you do as a courtesy to help them save face, is that it is then harder to say you fired them. I did fire James Mattis. He was no good for Obama, who fired him also, and was no good for me!","rating":8},{"id":1184426268177129500,"text":"You would think there is NO WAY that any of the Democrat Candidates that we witnessed last night could possibly become President of the United States. Now you see why they have no choice but to push a totally illegal &amp, absurd Impeachment of one of the most successful Presidents!","rating":7},{"id":1245076618604875800,"text":"My proposal to the politically correct Automobile Companies would lower the average price of a car to consumers by more than $3500, while at the same time making the cars substantially safer. Engines would run smoother. Positive impact on the environment! Foolish executives!","rating":6},{"id":1173368574406250500,"text":"PLENTY OF OIL!","rating":9},{"id":1176623010230526000,"text":"Secretary of State Pompeo recieved permission from Ukraine Government to release the transcript of the telephone call I had with their President. They don’t know either what the big deal is. A total Witch Hunt Scam by the Democrats!","rating":6},{"id":1227414377889968000,"text":"Whatever happened to Hillary campaign manager Podesta’s BROTHER? Wasn’t he caught, forced to leave his firm, with BIG BAD things to happen? Why did nothing ever happen to him, only to the “other” side?","rating":8},{"id":1307091595263701000,"text":"Joe Biden delivered remarks to union members after spending 47 years giving their jobs to China and foreign countries in exchange for campaign cash...","rating":8},{"id":1085148593617555500,"text":"Just announced that Veterans unemployment has reached an 18 year low, really good news for our Vets and their families. Will soon be an all time low! Do you think the media will report on this and all of the other great economic news?","rating":5},{"id":1122254362175332400,"text":"Thoughts and prayers to all of those affected by the shooting at the Synagogue in Poway, California. God bless you all. Suspect apprehended. Law enforcement did outstanding job. Thank you!","rating":3},{"id":1197521967777222700,"text":"I have been watching people making phone calls my entire life. My hearing is, and has been, great. Never have I been watching a person making a call, which was not on speakerphone, and been able to hear or understand a conversation. I’ve even tried, but to no avail. Try it live!","rating":7},{"id":1204065132894142500,"text":"Read the Transcripts!","rating":6},{"id":796099494442057700,"text":"I will be watching the election results from Trump Tower in Manhattan with my family and friends. Very exciting!","rating":4},{"id":1178651638313226200,"text":"WHO CHANGED THE LONG STANDING WHISTLEBLOWER RULES JUST BEFORE SUBMITTAL OF THE FAKE WHISTLEBLOWER REPORT? DRAIN THE SWAMP!","rating":9},{"id":1030779412973846500,"text":".....Censorship is a very dangerous thing &amp, absolutely impossible to police. If you are weeding out Fake News, there is nothing so Fake as CNN &amp, MSNBC, &amp, yet I do not ask that their sick behavior be removed. I get used to it and watch with a grain of salt, or don’t watch at all..","rating":7},{"id":951675713089888300,"text":"The Democrats seem intent on having people and drugs pour into our country from the Southern Border, risking thousands of lives in the process. It is my duty to protect the lives and safety of all Americans. We must build a Great Wall, think Merit and end Lottery &amp, Chain. USA!","rating":6},{"id":1081928260093653000,"text":"Excited to see our friends in Egypt opening the biggest Cathedral in the Middle East. President El-Sisi is moving his country to a more inclusive future!","rating":5},{"id":1303302195555827700,"text":"If Biden’s Polling wasn’t going down, and fast, he wouldn’t be going to Pittsburgh.","rating":5},{"id":1287119189359104000,"text":"....And to Joy, his wonderful wife who he loved so much, my warmest condolences!!!","rating":3},{"id":1073982314588323800,"text":"Wow, 19,000 Texts between Lisa Page and her lover, Peter S of the FBI, in charge of the Russia Hoax, were just reported as being wiped clean and gone. Such a big story that will never be covered by the Fake News. Witch Hunt!","rating":8},{"id":969994273121820700,"text":"If the E.U. wants to further increase their already massive tariffs and barriers on U.S. companies doing business there, we will simply apply a Tax on their Cars which freely pour into the U.S. They make it impossible for our cars (and more) to sell there. Big trade imbalance!","rating":6},{"id":1248574557616779300,"text":"Democrats are blocking a 251 Billion Dollar funding boost for Small Businesses which will help them keep their employees. It should be for only that reason, with no additions. We should have a big Infrastructure Phase Four with Payroll Tax Cuts &amp; more. Big Economic Bounceback!","rating":5},{"id":797823553244713000,"text":"Governor John Kasich of the GREAT, GREAT, GREAT State of Ohio called to congratulate me on the win. The people of Ohio were incredible!","rating":4},{"id":933280234220134400,"text":"It wasn’t the White House, it wasn’t the State Department, it wasn’t father LaVar’s so-called people on the ground in China that got his son out of a long term prison sentence - IT WAS ME. Too bad! LaVar is just a poor man’s version of Don King, but without the hair. Just think..","rating":9},{"id":1062371844836261900,"text":"By the way, when the helicopter couldn’t fly to the first cemetery in France because of almost zero visibility, I suggested driving. Secret Service said NO, too far from airport &amp, big Paris shutdown. Speech next day at American Cemetery in pouring rain! Little reported-Fake News!","rating":6},{"id":835608648625836000,"text":"I will not be attending the White House Correspondents' Association Dinner this year. Please wish everyone well and have a great evening!","rating":3},{"id":922072236592435200,"text":"It is finally sinking through. 46% OF PEOPLE BELIEVE MAJOR NATIONAL NEWS ORGS FABRICATE STORIES ABOUT ME. FAKE NEWS, even worse! Lost cred.","rating":7},{"id":1099082125523992600,"text":"I am pleased to announce that Kelly Knight Craft, our current Ambassador to Canada, is being nominated to be United States Ambassador to the United Nations....","rating":3},{"id":1100017237228949500,"text":"I hope our great Republican Senators don’t get led down the path of weak and ineffective Border Security. Without strong Borders, we don’t have a Country - and the voters are on board with us. Be strong and smart, don’t fall into the Democrats “trap” of Open Borders and Crime!","rating":6},{"id":1162000480681287700,"text":"It would show great weakness if Israel allowed Rep. Omar and Rep.Tlaib to visit. They hate Israel &amp, all Jewish people, &amp, there is nothing that can be said or done to change their minds. Minnesota and Michigan will have a hard time putting them back in office. They are a disgrace!","rating":7},{"id":1142044450413301800,"text":"Just revealed that the Failing and Desperate New York Times was feeding false stories about me, &amp, those associated with me, to the FBI. This shows the kind of unprecedented hatred I have been putting up with for years with this Crooked newspaper. Is what they have done legal?...","rating":7},{"id":1112702018383212500,"text":"Can you believe that the Radical Left Democrats want to do our new and very important Census Report without the all important Citizenship Question. Report would be meaningless and a waste of the $Billions (ridiculous) that it costs to put together!","rating":8},{"id":1114978879423356900,"text":"Pleased to report that the American tourist and tour guide that were abducted in Uganda have been released. God bless them and their families!","rating":2},{"id":1320690788628598800,"text":"We have made tremendous progress with the China Virus, but the Fake News refuses to talk about it this close to the Election. COVID, COVID, COVID is being used by them, in total coordination, in order to change our great early election numbers.Should be an election law violation!","rating":8},{"id":1223836174294442000,"text":"Mini Mike is part of the Fake News. They are all working together. In fact, Bloomberg isn’t covering himself (too boring to do), or other Dems. Only Trump. That sounds fair! It’s all the Fake News Media, and that’s why nobody believes in them any more.","rating":8},{"id":973540316656623600,"text":"Mike Pompeo, Director of the CIA, will become our new Secretary of State. He will do a fantastic job! Thank you to Rex Tillerson for his service! Gina Haspel will become the new Director of the CIA, and the first woman so chosen. Congratulations to all!","rating":3},{"id":1288932940337090600,"text":"Glad I was able to get the very dishonest LameStream Media to finally start talking about the RISKS to our Democracy from dangerous Universal Mail-In-Voting (not Absentee Voting, which I totally support!).","rating":6},{"id":1151451591171543000,"text":"The Democrats in Congress are getting nothing done, not on drug pricing, not on immigration, not on infrastructure, not on nothing! Sooo much opportunity, yet all they want to do is go “fishing.” The American people are tired of the never ending Witch Hunt, they want results now!","rating":7},{"id":1249691637040795600,"text":"Having been involved in the negotiations, to put it mildly, the number that OPEC+ is looking to cut is 20 Million Barrels a day, not the 10 Million that is generally being reported. If anything near this happens, and the World gets back to business from the Covid 19.....","rating":5},{"id":1249450614343508000,"text":"The Opposition Party (Lamestream Media) and their partner, the Radical Left, Do Nothing Democrats, have put their political game plan in full swing. “Whether he is right or wrong, it doesn’t matter. Criticize ’Trump’ for everything, and don’t let the public see Biden. Hide him.”","rating":8},{"id":1264734501357437000,"text":"Sleepy Joe’s representatives have just put out an ad saying that I went to play golf (exercise) today. They think I should stay in the White House at all times. What they didn’t say is that it’s the first time I’ve played golf in almost 3 months, that Biden was constantly.....","rating":6},{"id":1185367080780157000,"text":"Corrupt Congressman Adam Schiff is angry that Ambassadors that he thought would be good for his fraudulent Witch Hunt, are turning out to be good for me - some really good! He’s got all meetings locked down, no transparency, only his illegal leaks. A very dishonest sleazebag!","rating":7},{"id":1137355469134151700,"text":"Everyone very excited about the new deal with Mexico!","rating":4},{"id":1052173526919196700,"text":"Thank you to the Cherokee Nation for revealing that Elizabeth Warren, sometimes referred to as Pocahontas, is a complete and total Fraud!","rating":9},{"id":1268887468163698700,"text":"I will be doing a News Conference at 10:00 A.M. on the Jobs Numbers! White House.","rating":3},{"id":1126833126179840000,"text":"Your all time favorite President got tired of waiting for China to help out and start buying from our FARMERS, the greatest anywhere in the World!","rating":6},{"id":1111757883568463900,"text":"Robert Mueller was a Hero to the Radical Left Democrats, until he ruled that there was No Collusion with Russia (so ridiculous to even say!). After more than two years since the “insurance policy” statement was made by a dirty cop, I got the answers I wanted, the Truth.....","rating":7},{"id":1279508996295196700,"text":"Big 4th of July Air Show soon coming down the East Coast. Get ready to look up to the sky. Check local listings!","rating":3},{"id":1291224128427643000,"text":"Sally Yates is either lying or grossly incompetent. It is not possible she could have known so little about Dirty Cop James Comey (and others) from her high position in the Department of “Justice”. The political Crime of the Century, and she had no idea what they were doing?","rating":8},{"id":969572374977839100,"text":"When a country Taxes our products coming in at, say, 50%, and we Tax the same product coming into our country at ZERO, not fair or smart. We will soon be starting RECIPROCAL TAXES so that we will charge the same thing as they charge us. $800 Billion Trade Deficit-have no choice!","rating":6},{"id":1149107725005180900,"text":"I was just informed by Marillyn Hewson, CEO of Lockheed Martin, of her decision to keep the Sikorsky Helicopter Plant in Coatesville, Pennsylvania, open and humming! We are very proud of Pennsylvania and the people who work there....","rating":4},{"id":949242950659313700,"text":"Dow goes from 18,589 on November 9, 2016, to 25,075 today, for a new all-time Record. Jumped 1000 points in last 5 weeks, Record fastest 1000 point move in history. This is all about the Make America Great Again agenda! Jobs, Jobs, Jobs. Six trillion dollars in value created!","rating":5},{"id":1047853098365079600,"text":"This is now the 7th. time the FBI has investigated Judge Kavanaugh. If we made it 100, it would still not be good enough for the Obstructionist Democrats.","rating":7},{"id":1116167275948597200,"text":"I think what the Democrats are doing with the Border is TREASONOUS. Their Open Border mindset is putting our Country at risk. Will not let this happen!","rating":9},{"id":1198948075928268800,"text":"Support for Impeachment is dropping like a rock, down into the 20’s in some Polls. Dems should now get down to work and finally approve USMCA, and much more!","rating":4},{"id":863020954427043800,"text":"China just agreed that the U.S. will be allowed to sell beef, and other major products, into China once again. This is REAL news!","rating":3},{"id":1052168909665824800,"text":"Pocahontas (the bad version), sometimes referred to as Elizabeth Warren, is getting slammed. She took a bogus DNA test and it showed that she may be 1/1024, far less than the average American. Now Cherokee Nation denies her, “DNA test is useless.” Even they don’t want her. Phony!","rating":9},{"id":1066793504804913200,"text":"Clinton Foundation donations drop 42% - which shows that they illegally played the power game. They monetized their political influence through the Foundation. “During her tenure the State Department was put in the service of the Clinton Foundation.”  Andrew McCarthy","rating":7},{"id":1076628127525294100,"text":"I will not be going to Florida because of the Shutdown - Staying in the White House!  #MAGA","rating":4},{"id":1060256619383193600,"text":"We are pleased to announce that Matthew G. Whitaker, Chief of Staff to Attorney General Jeff Sessions at the Department of Justice, will become our new Acting Attorney General of the United States. He will serve our Country well....","rating":3},{"id":873120139222306800,"text":"Despite so many false statements and lies, total and complete vindication...and WOW, Comey is a leaker!","rating":8},{"id":937314665176207400,"text":"Report: “ANTI-TRUMP FBI AGENT LED CLINTON EMAIL PROBE”  Now it all starts to make sense!","rating":6},{"id":959268334935203800,"text":"The Democrats just aren’t calling about DACA. Nancy Pelosi and Chuck Schumer have to get moving fast, or they’ll disappoint you again. We have a great chance to make a deal or, blame the Dems! March 5th is coming up fast.","rating":5},{"id":953979393180950500,"text":"We need the Wall for the safety and security of our country. We need the Wall to help stop the massive inflow of drugs from Mexico, now rated the number one most dangerous country in the world. If there is no Wall, there is no Deal!","rating":5},{"id":1134066371510378500,"text":"Russia, Russia, Russia! That’s all you heard at the beginning of this Witch Hunt Hoax...And now Russia has disappeared because I had nothing to do with Russia helping me to get elected. It was a crime that didn’t exist. So now the Dems and their partner, the Fake News Media,.....","rating":9},{"id":1249712413219397600,"text":"....It is the decision of the President, and for many good reasons. With that being said, the Administration and I are working closely with the Governors, and this will continue. A decision by me, in conjunction with the Governors and input from others, will be made shortly!","rating":2},{"id":1156017961766756400,"text":"Baltimore’s numbers are the worst in the United States on Crime and the Economy. Billions of dollars have been pumped in over the years, but to no avail. The money was stolen or wasted. Ask Elijah Cummings where it went. He should investigate himself with his Oversight Committee!","rating":8},{"id":1061382890100002800,"text":"More than 4,000 are fighting the Camp and Woolsey Fires in California that have burned over 170,000 acres. Our hearts are with those fighting the fires, the 52,000 who have evacuated, and the families of the 11 who have died. The destruction is catastrophic. God Bless them all.","rating":3},{"id":1308400185287094300,"text":"The Democrats are only interested in BAILING OUT their badly managed, high crime, Blue States. They are not interested in our workers or small businesses. Crazy Nancy will only do stimulus, which would be helpful, if we couple it with bailout money. Republican States are great!!!","rating":8},{"id":923277142271684600,"text":"The long anticipated release of the #JFKFiles will take place tomorrow. So interesting!","rating":6},{"id":952183458922672100,"text":"I don’t believe the Democrats really want to see a deal on DACA. They are all talk and no action. This is the time but, day by day, they are blowing the one great opportunity they have. Too bad!","rating":5},{"id":1307092420962799600,"text":"Today, I announced two of the LARGEST grants in history to Puerto Rico to rebuild its electrical grid system and education system. My Administration will be awarding $13 BILLION through FEMA – the largest obligations of funding ever awarded...","rating":3},{"id":959031505145212900,"text":"March 5th is rapidly approaching and the Democrats are doing nothing about DACA. They Resist, Blame, Complain and Obstruct - and do nothing. Start pushing Nancy Pelosi and the Dems to work out a DACA fix, NOW!","rating":4},{"id":1035575198169411600,"text":"I will be doing a major rally for Senator Ted Cruz in October. I’m picking the biggest stadium in Texas we can find. As you know, Ted has my complete and total Endorsement. His opponent is a disaster for Texas - weak on Second Amendment, Crime, Borders, Military, and Vets!","rating":7},{"id":1218264289225728000,"text":"Heading to Florida for big Republican Party event. New Stock Market Record. Jobs in USA at all-time high!","rating":5},{"id":1311371174245535700,"text":"Such a timid group of reporters at the Biden Press Conference. Where do these people come from?","rating":6},{"id":1282286510390288400,"text":"...rounds, no problem. When I play, Fake News CNN, and others, park themselves anywhere they can to get a picture, then scream “President Trump is playing golf.” Actually, I play VERY fast, get a lot of work done on the golf course, and also get a “tiny” bit of exercise. Not bad!","rating":7},{"id":1063593456579354600,"text":"Isn’t it ironic that large Caravans of people are marching to our border wanting U.S.A. asylum because they are fearful of being in their country - yet they are proudly waving....","rating":8},{"id":1075775054099542000,"text":"When I begrudgingly signed the Omnibus Bill, I was promised the Wall and Border Security by leadership. Would be done by end of year (NOW). It didn’t happen! We foolishly fight for Border Security for other countries - but not for our beloved U.S.A. Not good!","rating":7},{"id":1260913802423476200,"text":"22-O in my endorsements of Congressional Candidates this season. California &amp; Wisconsin won big on Tuesday. Thank you to all of those very brilliant Voters. You will not be disappointed!","rating":5},{"id":951798415301718000,"text":"Sadly, Democrats want to stop paying our troops and government workers in order to give a sweetheart deal, not a fair deal, for DACA. Take care of our Military, and our Country, FIRST!","rating":6},{"id":962753552824365000,"text":"So many positive things going on for the U.S.A. and the Fake News Media just doesn’t want to go there. Same negative stories over and over again! No wonder the People no longer trust the media, whose approval ratings are correctly at their lowest levels in history!    #MAGA","rating":7},{"id":1072471575956504600,"text":"....People do not yet realize how much of the Wall, including really effective renovation, has already been built. If the Democrats do not give us the votes to secure our Country, the Military will build the remaining sections of the Wall. They know how important it is!","rating":6},{"id":950884128379035600,"text":"As I made very clear today, our country needs the security of the Wall on the Southern Border, which must be part of any DACA approval.","rating":5},{"id":1315735543003721700,"text":"Almost nobody showed up to the Sleepy Joe Biden “Rally” in Ohio. The reporting and polls are a Media Con Job - Fake News. We have far more support and enthusiasm than even in 2016. November 3rd. will be a great day for America!!!  #MAGA","rating":9},{"id":1148298497189392400,"text":"....thought of within the U.S. We will no longer deal with him. The good news for the wonderful United Kingdom is that they will soon have a new Prime Minister. While I thoroughly enjoyed the magnificent State Visit last month, it was the Queen who I was most impressed with!","rating":4},{"id":1152713896303714300,"text":"Economic numbers reach an all time high, the best in our Country’s history. Great to be a part of something so good for so many!","rating":5},{"id":1163961882945970200,"text":"Denmark is a very special country with incredible people, but based on Prime Minister Mette Frederiksen’s comments, that she would have no interest in discussing the purchase of Greenland, I will be postponing our meeting scheduled in two weeks for another time....","rating":8},{"id":1051807774894624800,"text":"The crowds at my Rallies are far bigger than they have ever been before, including the 2016 election. Never an empty seat in these large venues, many thousands of people watching screens outside. Enthusiasm &amp, Spirit is through the roof. SOMETHING BIG IS HAPPENING - WATCH!","rating":7},{"id":965009332042596400,"text":"Just like they don’t want to solve the DACA problem, why didn’t the Democrats pass gun control legislation when they had both the House &amp, Senate during the Obama Administration. Because they didn’t want to, and now they just talk!","rating":5},{"id":951679619341738000,"text":"Reason I canceled my trip to London is that I am not a big fan of the Obama Administration having sold perhaps the best located and finest embassy in London for “peanuts,” only to build a new one in an off location for 1.2 billion dollars. Bad deal. Wanted me to cut ribbon-NO!","rating":9},{"id":905047095488516100,"text":"I am allowing Japan &amp, South Korea to buy a substantially increased amount of highly sophisticated military equipment from the United States.","rating":3},{"id":1319028572665700400,"text":"....Should take care of our people. It wasn’t their fault that the Plague came in from China!","rating":6},{"id":1102302218903003100,"text":"The reason I do not want military drills with South Korea is to save hundreds of millions of dollars for the U.S. for which we are not reimbursed. That was my position long before I became President. Also, reducing tensions with North Korea at this time is a good thing!","rating":4},{"id":1273667867523899400,"text":"I will be releasing a new list of Conservative Supreme Court Justice nominees, which may include some, or many of those already on the list, by September 1, 2020. If given the opportunity, I will only choose from this list, as in the past, a Conservative Supreme Court Justice...","rating":2},{"id":1192467617140924400,"text":"Stock Market up big today. A New Record. Enjoy!","rating":1},{"id":1009075083112050700,"text":"We must always arrest people coming into our Country illegally. Of the 12,000 children, 10,000 are being sent by their parents on a very dangerous trip, and only 2000 are with their parents, many of whom have tried to enter our Country illegally on numerous occasions.","rating":5},{"id":1183697555907104800,"text":"Former Democrat Senator Harry Reid just stated that Donald Trump is very smart, much more popular than people think, is underestimated, and will be hard to beat in the 2020 Election. Thank you Harry, I agree!","rating":7},{"id":954678287820902400,"text":"This is the One Year Anniversary of my Presidency and the Democrats wanted to give me a nice present. #DemocratShutdown","rating":6},{"id":1302996272249548800,"text":"Just heard that Wacko John Bolton was talking of the fact that I discussed “love letters from Kim Jong Un” as though I viewed them as just that. Obviously, was just being sarcastic. Bolton was such a jerk!","rating":9},{"id":971025582061424600,"text":"Possible progress being made in talks with North Korea. For the first time in many years, a serious effort is being made by all parties concerned. The World is watching and waiting! May be false hope, but the U.S. is ready to go hard in either direction!","rating":4},{"id":1203766159255986200,"text":"I got NATO countries to pay 530 Billion Dollars a year more, and the U.S. less, and came home to a Fake News Media that mocked me. Didn’t think that was possible!","rating":8},{"id":960522569492426800,"text":"Any deal on DACA that does not include STRONG border security and the desperately needed WALL is a total waste of time. March 5th is rapidly approaching and the Dems seem not to care about DACA. Make a deal!","rating":5},{"id":1296597150181331000,"text":"The Democrats are demanding Mail-In Ballots because the enthusiasm meter for Slow Joe Biden is the lowest in recorded history, and they are concerned that very few people will turn out to vote. Instead, they will search &amp; find people, then “harvest” &amp; return Ballots. Not fair!","rating":8},{"id":1160306983376961500,"text":"....cause big disruption by going to Manhattan. Working almost all of the time, including evenings. Don’t have to be in W.H. to do that...And sooo many other false statements. He is right about one thing, though. I will win again in 2020. Otherwise, he pays 95% in taxes!","rating":9},{"id":999629710370984000,"text":"Not surprisingly, the GREAT Men &amp, Women of the FBI are starting to speak out against Comey, McCabe and all of the political corruption and poor leadership found within the top ranks of the FBI. Comey was a terrible and corrupt leader who inflicted great pain on the FBI! #SPYGATE","rating":7},{"id":1254077550541844500,"text":"If the Wall Street Journal “Editorial” writers had called, as they should have, they would have easily found that I was “NOT happy with the Georgia Governor on Tuesday night.” You said the opposite, and got it wrong as you often do!","rating":5},{"id":1080129307446513700,"text":"One thing has now been proven. The Democrats do not care about Open Borders and all of the crime and drugs that Open Borders bring!","rating":5},{"id":1248620923248205800,"text":"Because the T.V. Ratings for the White House News Conference’s are the highest, the Opposition Party (Lamestream Media), the Radical Left, Do Nothing Democrats &amp;, of course, the few remaining RINO’S, are doing everything in their power to disparage &amp; end them. The People’s Voice!","rating":7},{"id":1062331024426913800,"text":"On Trade, France makes excellent wine, but so does the U.S. The problem is that France makes it very hard for the U.S. to sell its wines into France, and charges big Tariffs, whereas the U.S. makes it easy for French wines, and charges very small Tariffs. Not fair, must change!","rating":4},{"id":1135150117252673500,"text":"People have been saying for years that we should talk to Mexico. The problem is that Mexico is an “abuser” of the United States, taking but never giving. It has been this way for decades. Either they stop the invasion of our Country by Drug Dealers, Cartels, Human Traffickers....","rating":6},{"id":1155558122163003400,"text":"If racist Elijah Cummings would focus more of his energy on helping the good people of his district, and Baltimore itself, perhaps progress could be made in fixing the mess that he has helped to create over many years of incompetent leadership. His radical “oversight” is a joke!","rating":8},{"id":1105468569800839200,"text":"Airplanes are becoming far too complex to fly. Pilots are no longer needed, but rather computer scientists from MIT. I see it all the time in many products. Always seeking to go one unnecessary step further, when often old and simpler is far better. Split second decisions are....","rating":9},{"id":1308758305095987200,"text":"White House News Conference today at 6:00 P.M. Economy, Job gains and Vaccine development are all doing GREAT!","rating":3},{"id":1155580140392501200,"text":"I am pleased to announce that highly respected Congressman John Ratcliffe of Texas will be nominated by me to be the Director of National Intelligence. A former U.S. Attorney, John will lead and inspire greatness for the Country he loves. Dan Coats, the current Director, will....","rating":2},{"id":1084584259510304800,"text":"Starting the long overdue pullout from Syria while hitting the little remaining ISIS territorial caliphate hard, and from many directions. Will attack again from existing nearby base if it reforms. Will devastate Turkey economically if they hit Kurds. Create 20 mile safe zone....","rating":6},{"id":1253679654734573600,"text":"Getting VERY good reviews of the job the Federal Government is doing on CoronaVirus. Ventilators, building hospitals, beds and yes, Testing, have been handled incredibly well. Testing is getting exponentially better every day. Love seeing our Country safely opening up!","rating":5},{"id":1315778779097100300,"text":"Biden losing big in Florida. Only Fake Polls show otherwise! Bad for Healthcare. Thinks he’s running for the Senate. Forgot Mitt Romney’s name, and where he was!","rating":8},{"id":1021909900941815800,"text":"The European Union is coming to Washington tomorrow to negotiate a deal on Trade. I have an idea for them. Both the U.S. and the E.U. drop all Tariffs, Barriers and Subsidies! That would finally be called Free Market and Fair Trade! Hope they do it, we are ready - but they won’t!","rating":5},{"id":1086096691613323300,"text":"Gregg Jarrett: “Mueller’s prosecutors knew the “Dossier” was the product of bias and deception.” It was a Fake, just like so much news coverage in our Country. Nothing but a Witch Hunt, from beginning to end!","rating":7},{"id":940795587733151700,"text":"Congratulations to Doug Jones on a hard fought victory. The write-in votes played a very big factor, but a win is a win. The people of Alabama are great, and the Republicans will have another shot at this seat in a very short period of time. It never ends!","rating":4},{"id":781926033159249900,"text":"For those few people knocking me for tweeting at three o'clock in the morning, at least you know I will be there, awake, to answer the call!","rating":6},{"id":1061962869376540700,"text":"The Florida Election should be called in favor of Rick Scott and Ron DeSantis in that large numbers of new ballots showed up out of nowhere, and many ballots are missing or forged. An honest vote count is no longer possible-ballots massively infected. Must go with Election Night!","rating":9},{"id":1042258387730399200,"text":"The Supreme Court is one of the main reasons I got elected President. I hope Republican Voters, and others, are watching, and studying, the Democrats Playbook.","rating":6},{"id":1022502465147682800,"text":"The United States will impose large sanctions on Turkey for their long time detainment of Pastor Andrew Brunson, a great Christian, family man and wonderful human being. He is suffering greatly. This innocent man of faith should be released immediately!","rating":5},{"id":1212126024575660000,"text":"The Anti-Benghazi!","rating":3},{"id":1165277727123026000,"text":"....having fun. I was smiling as I looked up and around. The MANY reporters with me were smiling also. They knew the TRUTH...And yet when I saw the reporting, CNN, MSNBC and other Fake News outlets covered it as serious news &amp, me thinking of myself as the Messiah. No more trust!","rating":8},{"id":1005045008746057700,"text":"Congratulations to the Washington Capitals on their GREAT play and winning the Stanley Cup Championship. Alex Ovechkin, the team captain, was spectacular - a true Superstar! D.C. is popping, in many ways. What a time!","rating":3},{"id":964509154357411800,"text":"I will be leaving for Florida today to meet with some of the bravest people on earth - but people whose lives have been totally shattered. Am also working with Congress on many fronts.","rating":2},{"id":944192071535153200,"text":"At some point, and for the good of the country, I predict we will start working with the Democrats in a Bipartisan fashion. Infrastructure would be a perfect place to start. After having foolishly spent $7 trillion in the Middle East, it is time to start rebuilding our country!","rating":4},{"id":1266017512162037800,"text":"Thank you to our GREAT Republican Congressmen &amp; Congresswomen on your incredibly important blockage last night of a FISA Bill that would just perpetuate the abuse that produced the Greatest Political Crime In the History of the U.S., the Russian Witch-Hunt. Fantastic Job!","rating":5},{"id":1037334510159966200,"text":"Just like the NFL, whose ratings have gone WAY DOWN, Nike is getting absolutely killed with anger and boycotts. I wonder if they had any idea that it would be this way? As far as the NFL is concerned, I just find it hard to watch, and always will, until they stand for the FLAG!","rating":8},{"id":1071389414239162400,"text":"AFTER TWO YEARS AND MILLIONS OF PAGES OF DOCUMENTS (and a cost of over $30,000,000), NO COLLUSION!","rating":6},{"id":1287945545600966700,"text":"....would destroy our American cities, and worse, if Sleepy Joe Biden, the puppet of the Left, ever won. Markets would crash and cities would burn. Our Country would suffer like never before. We will beat the Virus, soon, and go on to the Golden Age - better than ever before!","rating":7},{"id":1230514772338069500,"text":"John Kerry and Senator Chris Murphy grossly violated the Logan Act with respect to Iran. If a Republican did what they did, there would be very serious ramifications!","rating":5},{"id":1237813727409229800,"text":"America is the Greatest Country in the world. We have the best scientists, doctors, nurses and health care professionals. They are amazing people who do phenomenal things every day....","rating":1},{"id":965775382598312000,"text":"The U.S. economy is looking very good, in my opinion, even better than anticipated. Companies are pouring back into our country, reversing the long term trend of leaving. The unemployment numbers are looking great, and Regulations &amp, Taxes have been massively Cut! JOBS, JOBS, JOBS","rating":2},{"id":1184638812150009900,"text":"Hope all House Republicans, and honest House Democrats, will vote to CENSURE Rep. Adam Schiff tomorrow for his brazen and unlawful act of fabricating (making up) a totally phony conversation with the Ukraine President and U.S. President, me. Most have never seen such a thing!","rating":5},{"id":1070698825571012600,"text":"Without the phony Russia Witch Hunt, and with all that we have accomplished in the last almost two years (Tax &amp, Regulation Cuts, Judge’s, Military, Vets, etc.) my approval rating would be at 75% rather than the 50% just reported by Rasmussen. It’s called Presidential Harassment!","rating":6},{"id":818419002548568000,"text":"Meryl Streep, one of the most over-rated actresses in Hollywood, doesn't know me but attacked last night at the Golden Globes. She is a.....","rating":9},{"id":946728546633953300,"text":"Why is the United States Post Office, which is losing many billions of dollars a year, while charging Amazon and others so little to deliver their packages, making Amazon richer and the Post Office dumber and poorer? Should be charging MUCH MORE!","rating":7},{"id":839433678275153900,"text":"I have tremendous respect for women and the many roles they serve that are vital to the fabric of our society and our economy.","rating":3},{"id":994194233111273500,"text":"Secretary Pompeo and his “guests” will be landing at Andrews Air Force Base at 2:00 A.M. in the morning. I will be there to greet them. Very exciting!","rating":4},{"id":954681839419101200,"text":"#AMERICA FIRST!","rating":2},{"id":1275375135483146200,"text":"Washed up Creepster John Bolton is a lowlife who should be in jail, money seized, for disseminating, for profit, highly Classified information. Remember what they did to the young submarine sailor, but did nothing to Crooked Hillary. I ended up pardoning him - It wasn’t fair!","rating":8},{"id":1085154110108848100,"text":"A big new Caravan is heading up to our Southern Border from Honduras. Tell Nancy and Chuck that a drone flying around will not stop them. Only a Wall will work. Only a Wall, or Steel Barrier, will keep our Country safe! Stop playing political games and end the Shutdown!","rating":6},{"id":1034379525113753600,"text":"NASDAQ has just gone above 8000 for the first time in history!","rating":3},{"id":1194608581590564900,"text":"READ THE TRANSCRIPT!","rating":6},{"id":1136150992544604200,"text":"I kept hearing that there would be “massive” rallies against me in the UK, but it was quite the opposite. The big crowds, which the Corrupt Media hates to show, were those that gathered in support of the USA and me. They were big &amp, enthusiastic as opposed to the organized flops!","rating":7},{"id":1194216506403545000,"text":"Economy is BOOMING. Seems set to have yet another record day!","rating":5},{"id":1089276069872570400,"text":"“Ax falls quickly at BuzzFeed and Huffpost!” Headline, New York Post. Fake News and bad journalism have caused a big downturn. Sadly, many others will follow. The people want the Truth!","rating":7},{"id":1010900865602019300,"text":"We cannot allow all of these people to invade our Country. When somebody comes in, we must immediately, with no Judges or Court Cases, bring them back from where they came. Our system is a mockery to good immigration policy and Law and Order. Most children come without parents...","rating":9},{"id":898988632551370800,"text":"Looks like many anti-police agitators in Boston. Police are looking tough and smart! Thank you.","rating":6},{"id":895686351529672700,"text":"Mitch, get back to work and put Repeal &amp, Replace, Tax Reform &amp, Cuts and a great Infrastructure Bill on my desk for signing. You can do it!","rating":5},{"id":1027899286586110000,"text":"I have just authorized a doubling of Tariffs on Steel and Aluminum with respect to Turkey as their currency, the Turkish Lira, slides rapidly downward against our very strong Dollar! Aluminum will now be 20% and Steel 50%. Our relations with Turkey are not good at this time!","rating":6},{"id":1145098417405923300,"text":"I am in South Korea now. President Moon and I have “toasted” our new Trade Deal, a far better one for us than that which it replaced. Today I will visit with, and speak to, our Troops - and also go to the the DMZ (long planned). My meeting with President Moon went very well!","rating":4},{"id":1297130026857627600,"text":"Another bad night of Rioting in Portland, Oregon. A small number of Federal troops there to protect courthouse and other Federal property only (great job!). Wanting to be asked by City &amp; State to STOP THE RIOTS. Would bring in National Guard, end problem immediately. ASK!","rating":7},{"id":890193981585444900,"text":"After consultation with my Generals and military experts, please be advised that the United States Government will not accept or allow......","rating":4},{"id":983662953894436900,"text":"A TOTAL WITCH HUNT!!!","rating":9},{"id":1081525114594832400,"text":"Thank you to Kanye West for your nice words. Criminal Justice Reform is now law - passed in a very bipartisan way!","rating":3},{"id":1127337211777757200,"text":"I think that China felt they were being beaten so badly in the recent negotiation that they may as well wait around for the next election, 2020, to see if they could get lucky &amp, have a Democrat win - in which case they would continue to rip-off the USA for $500 Billion a year....","rating":6},{"id":1001424695126880300,"text":"Sorry, I’ve got to start focusing my energy on North Korea Nuclear, bad Trade Deals, VA Choice, the Economy, rebuilding the Military, and so much more, and not on the Rigged Russia Witch Hunt that should be investigating Clinton/Russia/FBI/Justice/Obama/Comey/Lynch etc.","rating":7},{"id":875438639823675400,"text":"Why is that Hillary Clintons family and Dems dealings with Russia are not looked at, but my non-dealings are?","rating":6},{"id":1176605750657003500,"text":"They never even saw the transcript of the call. A total Witch Hunt!","rating":7},{"id":830409522397184000,"text":"Melania and I are hosting Japanese Prime Minister Shinzo Abe and Mrs. Abe at Mar-a-Lago in Palm Beach, Fla. They are a wonderful couple!","rating":2},{"id":1192307362331119600,"text":"Years ago, when Media was legitimate, people known as “Fact Checkers” would always call to check and see if a story was accurate. Nowadays they don’t use “Fact Checkers” anymore, they just write whatever they want!","rating":5},{"id":1069577273819443200,"text":"Farmers will be a a very BIG and FAST beneficiary of our deal with China. They intend to start purchasing agricultural product immediately. We make the finest and cleanest product in the World, and that is what China wants. Farmers, I LOVE YOU!","rating":3},{"id":1061335051294728200,"text":"Trying to STEAL two big elections in Florida! We are watching closely!","rating":7},{"id":1103382429140742100,"text":"It is shameful that House Democrats won’t take a stronger stand against Anti-Semitism in their conference. Anti-Semitism has fueled atrocities throughout history and it’s inconceivable they will not act to condemn it!","rating":4},{"id":1163597488173060000,"text":"Spoke to my two good friends, Prime Minister Modi of India, and Prime Minister Khan of Pakistan, regarding Trade, Strategic Partnerships and, most importantly, for India and Pakistan to work towards reducing tensions in Kashmir. A tough situation, but good conversations!","rating":3},{"id":1296636041017925600,"text":"After the worst debate performance in the history of politics, Michael Bloomberg, commonly known as Mini Mike, is trying to make a comeback by begging the Democrats for relevance. They treated him like a dog - and always will. Before politics, he said GREAT things about me!","rating":8},{"id":1091417236475179000,"text":"Thank you to Senator Rob Portman and Senator Cory Gardner for the early and warm endorsement. We will ALL WIN in 2020 together!","rating":2},{"id":839116941956640800,"text":"Don't let the FAKE NEWS tell you that there is big infighting in the Trump Admin. We are getting along great, and getting major things done!","rating":6},{"id":1084121557193146400,"text":"We have a massive Humanitarian Crisis at our Southern Border. We will be out for a long time unless the Democrats come back from their “vacations” and get back to work. I am in the White House ready to sign!","rating":5},{"id":1073195450033950700,"text":"I often stated, “One way or the other, Mexico is going to pay for the Wall.” This has never changed. Our new deal with Mexico (and Canada), the USMCA, is so much better than the old, very costly &amp, anti-USA NAFTA deal, that just by the money we save, MEXICO IS PAYING FOR THE WALL!","rating":9},{"id":1183715679096201200,"text":"Happy Columbus Day!","rating":1},{"id":1081658090792149000,"text":"V.P. Mike Pence and team just left the White House. Briefed me on their meeting with the Schumer/Pelosi representatives. Not much headway made today. Second meeting set for tomorrow. After so many decades, must finally and permanently fix the problems on the Southern Border!","rating":3},{"id":897293484884979700,"text":"Feels good to be home after seven months, but the White House is very special, there is no place like it... and the U.S. is really my home!","rating":2},{"id":1151867785368281100,"text":"A lot of bad things are happening in Puerto Rico. The Governor is under siege, the Mayor of San Juan is a despicable and incompetent person who I wouldn’t trust under any circumstance, and the United States Congress foolishly gave 92 Billion Dollars for hurricane relief, much....","rating":7},{"id":1227423392078409700,"text":"Who are the four prosecutors (Mueller people?) who cut and ran after being exposed for recommending a ridiculous 9 year prison sentence to a man that got caught up in an investigation that was illegal, the Mueller Scam, and shouldn’t ever even have started? 13 Angry Democrats?","rating":8},{"id":1322533839374352400,"text":"Biden and the Radical Left are asking for the largest tax hike in the history of the U.S. Remember that when you VOTE!","rating":5},{"id":1223834666031046700,"text":"The Radical Left, Do Nothing Democrats, don’t want justice when pushing the Impeachment Hoax, they only want to destabilize the Republican Party so they can do better in the 2020 election, &amp; that includes the House &amp; Senate. They are playing with the people by taking it this far!","rating":6},{"id":821342600322043900,"text":"People are pouring into Washington in record numbers. Bikers for Trump are on their way. It will be a great Thursday, Friday and Saturday!","rating":4},{"id":1076100620581511200,"text":"Mitch, use the Nuclear Option and get it done! Our Country is counting on you!","rating":5},{"id":944665687292817400,"text":"How can FBI Deputy Director Andrew McCabe, the man in charge, along with leakin’ James Comey, of the Phony Hillary Clinton investigation (including her 33,000 illegally deleted emails) be given $700,000 for wife’s campaign by Clinton Puppets during investigation?","rating":6},{"id":1122871319857696800,"text":"I’ll never get the support of Dues Crazy union leadership, those people who rip-off their membership with ridiculously high dues, medical and other expenses while being paid a fortune. But the members love Trump. They look at our record economy, tax &amp, reg cuts, military etc. WIN!","rating":7},{"id":1015039273987264500,"text":"Thanks to REPUBLICAN LEADERSHIP, America is WINNING AGAIN - and America is being RESPECTED again all over the world. Because we are finally putting AMERICA FIRST!","rating":3},{"id":1178067055226052600,"text":"How do you impeach a President who has created the greatest Economy in the history of our Country, entirely rebuilt our Military into the most powerful it has ever been, Cut Record Taxes &amp, Regulations, fixed the VA &amp, gotten Choice for our Vets (after 45 years), &amp, so much more?...","rating":8},{"id":1000726832843501600,"text":"Fantastic to have 400,000 GREAT MEN &amp, WOMEN of Rolling Thunder in D.C. showing their patriotism. They love our Country, they love our Flag, they stand for our National Anthem! Thanks to Executive Director Artie Muller.","rating":5},{"id":1295677038301524000,"text":"....My Administration and I built the greatest economy in history, of any country, turned it off, saved millions of lives, and now am building an even greater economy than it was before. Jobs are flowing, NASDAQ is already at a record high, the rest to follow. Sit back &amp; watch!","rating":7},{"id":1143128646162493400,"text":"....a dangerous journey. We don’t even need to be there in that the U.S. has just become (by far) the largest producer of Energy anywhere in the world! The U.S. request for Iran is very simple - No Nuclear Weapons and No Further Sponsoring of Terror!","rating":5},{"id":1093966532558929900,"text":"I was a big fan of Frank Robinson, both as a great player and man. He was the first African American manager in baseball and was highly respected at everything he did. He will he missed!","rating":3},{"id":1235598653114511400,"text":"Elizabeth “Pocahontas” Warren, who was going nowhere except into Mini Mike’s head, just dropped out of the Democrat Primary...THREE DAYS TOO LATE. She cost Crazy Bernie, at least, Massachusetts, Minnesota and Texas. Probably cost him the nomination! Came in third in Mass.","rating":9},{"id":1021007656511852500,"text":"Andrew McCarthy - “I said this could never happen. This is so bad that they should be looking at the judges who signed off on this stuff, not just the people who gave it. It is so bad it screams out at you.”  On the whole FISA scam which led to the rigged Mueller Witch Hunt!","rating":6},{"id":1118480533854543900,"text":"Democrats in Congress must return from their Vacations and change the Immigration Laws, or the Border, despite the great job being done by Border Patrol, will only get worse. Big sections of Wall now being built!","rating":5},{"id":1076515352249598000,"text":"....going to be there for three months, and that was seven years ago - we never left. When I became President, ISIS was going wild. Now ISIS is largely defeated and other local countries, including Turkey, should be able to easily take care of whatever remains. We’re coming home!","rating":6},{"id":1008725438972211200,"text":"If President Obama (who got nowhere with North Korea and would have had to go to war with many millions of people being killed) had gotten along with North Korea and made the initial steps toward a deal that I have, the Fake News would have named him a national hero!","rating":8},{"id":799972624713420800,"text":"Our wonderful future V.P. Mike Pence was harassed last night at the theater by the cast of Hamilton, cameras blazing.This should not happen!","rating":3},{"id":1230177751954382800,"text":"Internal REAL Polls show I am beating all of the Dem candidates. The Fake News Polls (here we go again, just like 2016) show losing or tied. Their polls will be proven corrupt on November 3rd, just like the Fake News is corrupt!","rating":7},{"id":937305615218696200,"text":"After years of Comey, with the phony and dishonest Clinton investigation (and more), running the FBI, its reputation is in Tatters - worst in History! But fear not, we will bring it back to greatness.","rating":6},{"id":820450166331347000,"text":"Inauguration Day is turning out to be even bigger than expected. January 20th, Washington D.C. Have fun!","rating":2},{"id":1286990480102826000,"text":"The Democrats in the House are trying to undo my big win Travel Ban Bill, which successfully keeps very bad and dangerous people out of our great Country. Passed along party lines. Hopefully, will be DEAD in the Senate! The Dems have gone Stone Cold Left - Venezuela on steroids!","rating":8},{"id":832730328108134400,"text":"\"\"One of the most effective press conferences I've ever seen!\"\" says Rush Limbaugh. Many agree.Yet FAKE MEDIA  calls it differently! Dishonest","rating":5},{"id":1260905587912646700,"text":"The Great State of Wisconsin, home to Tom Tiffany’s big Congressional Victory on Tuesday, was just given another win. Its Democrat Governor was forced by the courts to let the State Open. The people want to get on with their lives. The place is bustling!","rating":4},{"id":989816772713906200,"text":"After a furious year of missile launches and Nuclear testing, a historic meeting between North and South Korea is now taking place. Good things are happening, but only time will tell!","rating":3},{"id":1051471737068671000,"text":"NBC News has totally and purposely changed the point and  meaning of my story about General Robert E Lee and General Ulysses Grant. Was actually a shoutout to warrior Grant and the great state in which he was born. As usual, dishonest reporting. Even mainstream media embarrassed!","rating":5},{"id":1123333508078997500,"text":"....embargo, together with highest-level sanctions, will be placed on the island of Cuba. Hopefully, all Cuban soldiers will promptly and peacefully return to their island!","rating":3},{"id":879648931172556800,"text":"Wow, CNN had to retract big story on \"\"Russia,\"\" with 3 employees forced to resign. What about all the other phony stories they do? FAKE NEWS!","rating":7},{"id":1086607079308251100,"text":"The Economy is one of the best in our history, with unemployment at a 50 year low, and the Stock Market ready to again break a record (set by us many times) - &amp, all you heard yesterday, based on a phony story, was Impeachment. You want to see a Stock Market Crash, Impeach Trump!","rating":8},{"id":1158330512341164000,"text":"We cannot let those killed in El Paso, Texas, and Dayton, Ohio, die in vain. Likewise for those so seriously wounded. We can never forget them, and those many who came before them. Republicans and Democrats must come together and get strong background checks, perhaps marrying....","rating":6},{"id":925005659569041400,"text":"Sorry, but this is years ago, before Paul Manafort was part of the Trump campaign. But why aren't Crooked Hillary &amp, the Dems the focus?????","rating":5},{"id":1231651294042972200,"text":"Are any Democrat operatives, the DNC, or Crooked Hillary Clinton, blaming Russia, Russia, Russia for the Bernie Sanders win in Nevada. If so I suggest calling Bob Mueller &amp; the 13 Angry Democrats to do a new Mueller Report, Democrat Edition. Bob will get to the bottom of it!","rating":9},{"id":895347654431035400,"text":"Senator Mitch McConnell said I had \"\"excessive expectations,\"\" but I don't think so. After 7 years of hearing Repeal &amp, Replace, why not done?","rating":5},{"id":1081535102461579300,"text":"The Democrats could solve the Shutdown problem in a very short period of time. All they have to do is approve REAL Border Security (including a Wall), something which everyone, other than drug dealers, human traffickers and criminals, want very badly! This would be so easy to do!","rating":4},{"id":1255710938075889700,"text":"Lyin’ Brian Williams of MSDNC, a Concast Scam Company, wouldn’t know the truth if it was nailed to his wooden forehead. Remember when he lied about his bravery in a helicopter? Totally made up story. He’s a true dummy who was thrown off Network News like a dog. Stay tuned!","rating":9},{"id":1093471134845190100,"text":"....The Dems and their committees are going “nuts.” The Republicans never did this to President Obama, there would be no time left to run government. I hear other committee heads will do the same thing. Even stealing people who work at White House! A continuation of Witch Hunt!","rating":7},{"id":865173176854204400,"text":"This is the single greatest witch hunt of a politician in American history!","rating":8},{"id":950023175907266600,"text":"Jake Tapper of Fake News CNN just got destroyed in his interview with Stephen Miller of the Trump Administration. Watch the hatred and unfairness of this CNN flunky!","rating":8},{"id":1075833793720795100,"text":"So hard to believe that Lindsey Graham would be against saving soldier lives &amp, billions of $$$. Why are we fighting for our enemy, Syria, by staying &amp, killing ISIS for them, Russia, Iran &amp, other locals? Time to focus on our Country &amp, bring our youth back home where they belong!","rating":7},{"id":1105873274804813800,"text":"Republican Senators are overthinking tomorrow’s vote on National Emergency. It is very simply Border Security/No Crime - Should not be thought of any other way. We have a MAJOR NATIONAL EMERGENCY at our Border and the People of our Country know it very well!","rating":6},{"id":1094031561861881900,"text":"My representatives have just left North Korea after a very productive meeting and an agreed upon time and date for the second Summit with Kim Jong Un. It will take place in Hanoi, Vietnam, on February 27 &amp, 28. I look forward to seeing Chairman Kim &amp, advancing the cause of peace!","rating":5},{"id":867047119974170600,"text":"All civilized nations must join together to protect human life and the sacred right of our citizens to live in safety and in peace.","rating":4},{"id":1121382698742841300,"text":"....Mueller was NOT fired and was respectfully allowed to finish his work on what I, and many others, say was an illegal investigation (there was no crime), headed by a Trump hater who was highly conflicted, and a group of 18 VERY ANGRY Democrats. DRAIN THE SWAMP!","rating":9},{"id":988126197619068900,"text":"Funny how all of the Pundits that couldn’t come close to making a deal on North Korea are now all over the place telling me how to make a deal!","rating":6},{"id":1080616636363743200,"text":"Important meeting today on Border Security with Republican and Democrat Leaders in Congress. Both parties must work together to pass a Funding Bill that protects this Nation and its people – this is the first and most important duty of government...","rating":4},{"id":1309137428897296400,"text":"North Carolina looking good! See you later.","rating":2},{"id":1290949993600295000,"text":"There is TREMENDOUS Lawlessness in America’s Liberal Cities. Would be so easy to stop but they have a clouded vision of what should be done. They are indoctrinated with a philosophy which will never work, a philosophy which would destroy America. Portland would be the norm!","rating":7},{"id":1035597354395680800,"text":"Wow, I made OFF THE RECORD COMMENTS to Bloomberg concerning Canada, and this powerful understanding was BLATANTLY VIOLATED. Oh well, just more dishonest reporting. I am used to it. At least Canada knows where I stand!","rating":6},{"id":947461470924820500,"text":"Why would smart voters want to put Democrats in Congress in 2018 Election when their policies will totally kill the great wealth created during the months since the Election. People are much better off now not to mention ISIS, VA, Judges, Strong Border, 2nd A, Tax Cuts &amp, more?","rating":5},{"id":933285973277868000,"text":"The NFL is now thinking about a new idea - keeping teams in the Locker Room during the National Anthem next season. That’s almost as bad as kneeling! When will the highly paid Commissioner finally get tough and smart? This issue is killing your league!.....","rating":8},{"id":832238070460186600,"text":"The Democrats had to come up with a story as to why they lost the election, and so badly (306), so they made up a story - RUSSIA. Fake news!","rating":7},{"id":809403760099422200,"text":"If Russia, or some other entity, was hacking, why did the White House wait so long to act? Why did they only complain after Hillary lost?","rating":5},{"id":1017093020783710200,"text":"What good is NATO if Germany is paying Russia billions of dollars for gas and energy? Why are there only 5 out of 29 countries that have met their commitment? The U.S. is paying for Europe’s protection, then loses billions on Trade. Must pay 2% of GDP IMMEDIATELY, not by 2025.","rating":7},{"id":1094716135625424900,"text":"The Border Committee Democrats are behaving, all of a sudden, irrationally. Not only are they unwilling to give dollars for the obviously needed Wall (they overrode recommendations of Border Patrol experts), but they don’t even want to take muderers into custody! What’s going on?","rating":8},{"id":952528011869478900,"text":"DACA is probably dead because the Democrats don’t really want it, they just want to talk and take desperately needed money away from our Military.","rating":6},{"id":799742847310319600,"text":"Will be working all weekend in choosing the great men and women who will be helping to MAKE AMERICA GREAT AGAIN!","rating":3},{"id":1229551222648168400,"text":"....ever. Had to rebuild our military, which was totally depleted. Fed Rate UP, taxes and regulations WAY DOWN. If Dems won in 2016, the USA would be in big economic (Depression?) &amp; military trouble right now. THE BEST IS YET TO COME. KEEP AMERICA GREAT!","rating":5}]