[{"id":996129630913482800,"text":"The so-called leaks coming out of the White House are a massive over  exaggeration put out by the Fake News Media in order to make us look as bad as possible. With that being said, leakers are traitors and cowards, and we will find out who they are!","rating":7},{"id":1132386783898013700,"text":"In addition to great incompetence and corruption, The Smollett case in Chicago is also about a Hate Crime. Remember, “MAGA COUNTRY DID IT!” That turned out to be a total lie, had nothing to do with “MAGA COUNTRY.” Serious stuff, and not even an apology to millions of people!","rating":8},{"id":1323346474348896300,"text":"I gave Maine everything that Obama/Biden took away from it. 5000 square miles, Lobster, Fishing, ended tariffs from China and E.U. and much more. Vote Trump Maine!","rating":6},{"id":1278836342609379300,"text":"Mail-In Ballots will lead to massive electoral fraud and a rigged 2020 Election. Look at all of the cases and examples that are out there right now, with the Patterson, N.J., being the most recent example. Republicans, in particular, cannot let this happen!","rating":9},{"id":1146766931573301200,"text":"Great news for the Republican Party as one of the dumbest &amp, most disloyal men in Congress is “quitting” the Party. No Collusion, No Obstruction! Knew he couldn’t get the nomination to run again in the Great State of Michigan. Already being challenged for his seat. A total loser!","rating":8},{"id":1080240049780940800,"text":"“Kim Jong Un says North Korea will not make or test nuclear weapons, or give them to others - &amp, he is ready to meet President Trump anytime.” PBS News Hour. I also look forward to meeting with Chairman Kim who realizes so well that North Korea possesses great economic potential!","rating":5},{"id":892147656319004700,"text":"A great day at the White House!","rating":3},{"id":1020984152357777400,"text":"Looking more &amp, more like the Trump Campaign for President was illegally being spied upon (surveillance) for the political gain of Crooked Hillary Clinton and the DNC. Ask her how that worked out - she did better with Crazy Bernie. Republicans must get tough now. An illegal Scam!","rating":9},{"id":1037485664433070100,"text":"Does the so-called “Senior Administration Official” really exist, or is it just the Failing New York Times with another phony source? If the GUTLESS anonymous person does indeed exist, the Times must, for National Security purposes, turn him/her over to government at once!","rating":8},{"id":960486144818450400,"text":"The Democrats are pushing for Universal HealthCare while thousands of people are marching in the UK because their U system is going broke and not working. Dems want to greatly raise taxes for really bad and non-personal medical care. No thanks!","rating":6},{"id":1058354748578033700,"text":"Wow! The U.S. added 250,000 Jobs in October - and this was despite the hurricanes. Unemployment at 3.7%. Wages UP! These are incredible numbers. Keep it going, Vote Republican!","rating":3},{"id":884746435039768600,"text":"Marine Plane crash in Mississippi is heartbreaking. Melania and I send our deepest condolences to all!","rating":2},{"id":1321958690379821000,"text":"Failed RINO former Governor Rick Snyder of Michigan was a disaster with respect to the Flint Water CATASTROPHE, and a very bad Governor overall. He hurt so many people with his gross incompetence. He reminds me of Sleepy Joe!","rating":9},{"id":1007972046666690600,"text":"Democrats can fix their forced family breakup at the Border by working with Republicans on new legislation, for a change! This is why we need more Republicans elected in November. Democrats are good at only three things, High Taxes, High Crime and Obstruction. Sad!","rating":7},{"id":1237024551294382000,"text":"Saudi Arabia and Russia are arguing over the price and flow of oil. That, and the Fake News, is the reason for the market drop!","rating":6},{"id":989870523042680800,"text":"Just Out: House Intelligence Committee Report released. “No evidence” that the Trump Campaign “colluded, coordinated or conspired with Russia.” Clinton Campaign paid for Opposition Research obtained from Russia- Wow! A total Witch Hunt! MUST END NOW!","rating":7},{"id":994179864436596700,"text":"The Fake News is working overtime. Just reported that, despite the tremendous success we are having with the economy &amp, all things else, 91% of the Network News about me is negative (Fake). Why do we work so hard in working with the media when it is corrupt? Take away credentials?","rating":8},{"id":1256193615724007400,"text":"Cryin’ Chuck Schumer was on a late night show using a false talking point over &amp; over again. “We don’t have enough testing ,” he would repeat, when he knows we have done a great job on Testing, just like we have on Ventilators and everything else. He lied, gave NY SALT. Run AOC!","rating":8},{"id":1146517318509482000,"text":"Iran has just issued a New Warning. Rouhani says that they will Enrich Uranium to “any amount we want” if there is no new Nuclear Deal. Be careful with the threats, Iran. They can come back to bite you like nobody has been bitten before!","rating":6},{"id":1000831304836018200,"text":"Our United States team has arrived in North Korea to make arrangements for the Summit between Kim Jong Un and myself. I truly believe North Korea has brilliant potential and will be a great economic and financial Nation one day. Kim Jong Un agrees with me on this. It will happen!","rating":4},{"id":1235176283740524500,"text":"So selfish for Elizabeth Warren to stay in the race. She has Zero chance of even coming close to winning, but hurts Bernie badly. So much for their wonderful liberal friendship. Will he ever speak to her again? She cost him Massachusetts (and came in third), he shouldn’t!","rating":8},{"id":944329684032081900,"text":"Remember, the most hated part of ObamaCare is the Individual Mandate, which is being terminated under our just signed Tax Cut Bill.","rating":3},{"id":837991759045079000,"text":"Just out: The same Russian Ambassador that met Jeff Sessions visited the Obama White House 22 times, and 4 times last year alone.","rating":5},{"id":1097889803864064000,"text":"I never said anything bad about Andrew McCabe’s wife other than she (they) should not have taken large amounts of campaign money from a Crooked Hillary source when Clinton was under investigation by the FBI. I never called his wife a loser to him (another McCabe made up lie)!","rating":7},{"id":1228341384131772400,"text":"It is happening again to Crazy Bernie, just like last time, only far more obvious. They are taking the Democrat Nomination away from him, and there’s very little he can do. A Rigged System!","rating":8},{"id":1007986538985197600,"text":"The IG Report totally destroys James Comey and all of his minions including the great lovers, Peter Strzok and Lisa Page, who started the disgraceful Witch Hunt against so many innocent people. It will go down as a dark and dangerous period in American History!","rating":6},{"id":1230155765349929000,"text":"Highest Stock Market In History, By Far!","rating":4},{"id":1092516540262551600,"text":"I am pleased to announce that David Bernhardt, Acting Secretary of the Interior, will be nominated as Secretary of the Interior. David has done a fantastic job from the day he arrived, and we look forward to having his nomination officially confirmed!","rating":2},{"id":1190079191355670500,"text":"1600 Pennsylvania Avenue, the White House, is the place I have come to love and will stay for, hopefully, another 5 years as we MAKE AMERICA GREAT AGAIN, but my family and I will be making Palm Beach, Florida, our Permanent Residence. I cherish New York, and the people of.....","rating":5},{"id":1082270271426433000,"text":"Congressman Adam Smith, the new Chairman of the House Armed Services Committee, just stated, “Yes, there is a provision in law that says a president can declare an emergency. It’s been done a number of times.” No doubt, but let’s get our deal done in Congress!","rating":3},{"id":1083866566314389500,"text":"Drug prices declined in 2018, the first time in nearly half a century. During the first 19 months of my Administration, Americans saved $26 Billion on prescription drugs. Our policies to get cheaper generic drugs to market are working!","rating":3},{"id":1032495180530835500,"text":"NO COLLUSION - RIGGED WITCH HUNT!","rating":8},{"id":1116911640568574000,"text":"In New York State, Democrats blocked a Bill expanding College Tuition for Gold Star families after approving aid for illegal immigrants. No wonder so many people are leaving N.Y. Very Sad!","rating":7},{"id":1163063723952676900,"text":"The Failing New York Times, in one of the most devastating portrayals of bad journalism in history, got caught by a leaker that they are shifting  from their Phony Russian Collusion Narrative (the Mueller Report &amp, his testimony were a total disaster), to a Racism Witch Hunt.....","rating":7},{"id":1119962857347735600,"text":"Jobless claims in the United States have reached their lowest (BEST) level in over 50 years!","rating":3},{"id":1292908143920455700,"text":"White House News Conference today at 5:30 P.M. Enjoy!","rating":2},{"id":1102360081247682600,"text":"....President. We are WINNING big, the envy of the WORLD, but just think what it could be?","rating":5},{"id":1229871176614199300,"text":"What Mini Mike is doing is nothing less than a large scale illegal campaign contribution. He is “spreading” money all over the place, only to have recipients of his cash payments, many former opponents, happily joining or supporting his campaign. Isn’t that called a payoff? .....","rating":6},{"id":1209253611882070000,"text":"Wouldn’t it be reasonable to assume that Republicans in the Senate should handle the Impeachment Hoax in the exact same manner as Democrats in the House handled their recent partisan scam? Why would it be different for Republicans than it was for the Radical Left Democrats?","rating":5},{"id":1237388340778782700,"text":"Nancy Pelosi just said, “I don’t know if we can be ready this week.” In other words, it’s off to vacation for the Do Nothing Democrats. That’s been the story with them for 1 1/2 years!","rating":6},{"id":1221533043153916000,"text":"Nothing done wrong, READ THE TRANSCRIPTS!","rating":5},{"id":937007006526959600,"text":"I had to fire General Flynn because he lied to the Vice President and the FBI. He has pled guilty to those lies. It is a shame because his actions during the transition were lawful. There was nothing to hide!","rating":3},{"id":1065743662464802800,"text":"Our highly trained security professionals are not allowed to do their job on the Border because of the Judicial Activism and Interference by the 9th Circuit. Nevertheless, they are working hard to make America a safer place, though hard to do when anybody filing a lawsuit wins!","rating":6},{"id":1083554782923632600,"text":"We lose 300 Americans a week, 90% of which comes through the Southern Border. These numbers will be DRASTICALLY REDUCED if we have a Wall!","rating":7},{"id":1152190436825604100,"text":"It is amazing how the Fake News Media became “crazed” over the chant “send her back” by a packed Arena (a record) crowd in the Great State of North Carolina, but is totally calm &amp, accepting of the most vile and disgusting statements made by the three Radical Left Congresswomen...","rating":8},{"id":804863098138005500,"text":"Interesting how the U.S. sells Taiwan billions of dollars of military equipment but I should not accept a congratulatory call.","rating":6},{"id":878200921980891100,"text":"I've helped pass and signed 38 Legislative Bills, mostly with no Democratic support, and gotten rid of massive amounts of regulations. Nice!","rating":4},{"id":993492804985872400,"text":"The United States does not need John Kerry’s possibly illegal Shadow Diplomacy on the very badly negotiated Iran Deal.  He was the one that created this MESS in the first place!","rating":5},{"id":1232492821501771800,"text":"CDC and my Administration are doing a GREAT job of handling Coronavirus, including the very early closing of our borders to certain areas of the world. It was opposed by the Dems, “too soon”, but turned out to be the correct decision. No matter how well we do, however, the.....","rating":5},{"id":1090947003868213200,"text":"Lets just call them WALLS from now on and stop playing political games! A WALL is a WALL!","rating":6},{"id":1297135664069214200,"text":"Biden and the Democrats have greatly disrespected the Great State of Wisconsin by not even paying a small visit to Milwaukee, the designated site of the DNC. The State &amp; City worked very hard to make sure things would be good. Not nice. Vote Trump Wisconsin!","rating":6},{"id":1179378450936807400,"text":"I won the right to be a presidential candidate in California, in a major Court decision handed down yesterday. It was filed against me by the Radical Left Governor of that State to tremendous Media hoopla. The VICTORY, however, was barely covered by the Fake News. No surprise!","rating":7},{"id":881875263700783100,"text":"If we can help little #CharlieGard, as per our friends in the U.K. and the Pope, we would be delighted to do so.","rating":3},{"id":1037329592074350600,"text":"Almost everyone agrees that my Administration has done more in less than two years than any other Administration in the history of our Country. I’m tough as hell on people &amp, if I weren’t, nothing would get done. Also, I question everybody &amp, everything-which is why I got elected!","rating":5},{"id":1084466503574016000,"text":"I’m in the White House, waiting. The Democrats are everywhere but Washington as people await their pay. They are having fun and not even talking!","rating":5},{"id":1102934910900363300,"text":"PRESIDENTIAL HARASSMENT!","rating":9},{"id":1246925577967358000,"text":"White House news conference at 6:45 P.M. Eastern. Thank you!","rating":2},{"id":1023007120130760700,"text":"The only things the Democrats do well is “Resist,” which is their campaign slogan, and “Obstruct.” Cryin’ Chuck Schumer has almost 400 great American people that are waiting “forever” to serve our Country! A total disgrace. Mitch M should not let them go home until all approved!","rating":6},{"id":1150400998097260500,"text":".....Sorry, can’t let them into our Country. If too crowded, tell them not to come to USA, and tell the Dems to fix the Loopholes - Problem Solved!","rating":8},{"id":871899511525961700,"text":"That's right, we need a TRAVEL BAN for certain DANGEROUS countries, not some politically correct term that won't help us protect our people!","rating":8},{"id":1197144925034418200,"text":"Nancy Pelosi will go down as the least productive Speaker of the House in history. She is dominated by AOC Plus 3 and the Radical Left. Mexico and Canada, after waiting for 6 months to be approved, are ready to flee - and who can blame them? Too bad!","rating":8},{"id":1065225779825598500,"text":"Oil prices getting lower. Great! Like a big Tax Cut for America and the World. Enjoy! $54, was just $82. Thank you to Saudi Arabia, but let’s go lower!","rating":5},{"id":1039483479363399700,"text":"Rudy Giuliani did a GREAT job as Mayor of NYC during the period of September 11th. His leadership, bravery and skill must never be forgotten. Rudy is a TRUE WARRIOR!","rating":4},{"id":1293151454069391400,"text":"..so called American Intelligence were Dirty Cops who have now proven to be sleazebags at the highest level like James Comey, proven liar James Clapper, &amp; perhaps the lowest of them all, Wacko John Brennan who headed the CIA, you could perhaps understand my reluctance to embrace!","rating":9},{"id":1091170257216159700,"text":"Just out: The big deal, very mysterious Don jr telephone calls, after the innocent Trump Tower meeting, that the media &amp, Dems said were made to his father (me), were just conclusively found NOT to be made to me. They were made to friends &amp, business associates of Don. Really sad!","rating":6},{"id":1041093953007833100,"text":"When will Republican leadership learn that they are being played like a fiddle by the Democrats on Border Security and Building the Wall? Without Borders, we don’t have a country. With Open Borders, which the Democrats want, we have nothing but crime! Finish the Wall!","rating":7},{"id":888575966259314700,"text":"Sean Spicer is a wonderful person who took tremendous abuse from the Fake News Media - but his future is bright!","rating":3},{"id":1113432687757484000,"text":"I was never planning a vote prior to the 2020 Election on the wonderful HealthCare package that some very talented people are now developing for me &amp, the Republican Party. It will be on full display during the Election as a much better &amp, less expensive alternative to ObamaCare...","rating":4},{"id":1241814624401526800,"text":"Will be having a News Conference from our beautiful White House at 5:00 P.M. Many things to discuss. Thank you!","rating":2},{"id":1299559244593860600,"text":"Great total numbers for the Republican National Convention. Blows Democrat National Convention away. Also, much bigger fund raising numbers!","rating":3},{"id":1107631297076305900,"text":"Joe Biden got tongue tied over the weekend when he was unable to properly deliver a very simple line about his decision to run for President. Get used to it, another low I.Q. individual!","rating":9},{"id":1244728753617621000,"text":"White House news conference at 5:00 P.M. Eastern. Thank you!","rating":3},{"id":875321478849364000,"text":"You are witnessing the single greatest WITCH HUNT in American political history - led by some very bad and conflicted people!  #MAGA","rating":8},{"id":1166683442098163700,"text":"So interesting to read and see all of the free and interesting advice I am getting on China, from people who have tried to handle it before and failed miserably - In fact, they got taken to the cleaners. We are doing very well with China. This has never happened to them before!","rating":7},{"id":1204379706235203600,"text":"To Impeach a President who has proven through results, including producing perhaps the strongest economy in our country’s history, to have one of the most successful presidencies ever, and most importantly, who has done NOTHING wrong, is sheer Political Madness! #2020Election","rating":6},{"id":1000145873274359800,"text":"Funny to watch the Democrats criticize Trade Deals being negotiated by me when they don’t even know what the deals are and when for 8 years the Obama Administration did NOTHING on trade except let other countries rip off the United States. Lost almost $800 Billion/year under “O”","rating":7},{"id":1003832766511894500,"text":"The Philadelphia Eagles Football Team was invited to the White House. Unfortunately, only a small number of players decided to come, and we canceled the event. Staying in the Locker Room for the playing of our National Anthem is as disrespectful to our country as kneeling. Sorry!","rating":8},{"id":1278827752385323000,"text":"The United States has been experiencing, believe it or not,  Historically Low Crime Rates. The last thing we will be doing is Defunding or Eliminating our many and various Police Departments or, putting an end to our great Second Amendment!","rating":5},{"id":947453152806297600,"text":"Big protests in Iran. The people are finally getting wise as to how their money and wealth is being stolen and squandered on terrorism. Looks like they will not take it any longer. The USA is watching very closely for human rights violations!","rating":4},{"id":1075397797929775100,"text":"We have defeated ISIS in Syria, my only reason for being there during the Trump Presidency.","rating":6},{"id":1015037322226643000,"text":"Every day, the brave men and women of ICE are liberating communities from savage gangs like MS-13. We will NOT stand for these vile Democrat smears in law enforcement. We will always stand proudly with the BRAVE HEROES of ICE and BORDER PATROL!","rating":9},{"id":1044418753671417900,"text":"The Democrats are working hard to destroy a wonderful man, and a man who has the potential to be one of our greatest Supreme Court Justices ever, with an array of False Accusations the likes of which have never been seen before!","rating":8},{"id":1188103311653769200,"text":"The Fake Washington Post keeps doing phony stories, with zero sources, that I am concerned with the Impeachment scam. I am not because I did nothing wrong. It is the other side, including Schiff and his made up story, that are concerned. Witch Hunt continues!","rating":9},{"id":949610896241946600,"text":"Brian Ross, the reporter who made a fraudulent live newscast about me that drove the Stock Market down 350 points (billions of dollars), was suspended for a month but is now back at ABC NEWS in a lower capacity. He is no longer allowed to report on Trump. Should have been fired!","rating":7},{"id":902881712010653700,"text":"After witnessing first hand the horror &amp, devastation caused by Hurricane Harvey,my heart goes out even more so to the great people of Texas!","rating":5},{"id":1076663817831153700,"text":"When President Obama ingloriously fired Jim Mattis, I gave him a second chance. Some thought I shouldn’t, I thought I should. Interesting relationship-but I also gave all of the resources that he never really had. Allies are very important-but not when they take advantage of U.S.","rating":7},{"id":1122873726276599800,"text":"The Media (Fake News) is pushing Sleepy Joe hard. Funny, I’m only here because of Biden &amp, Obama. They didn’t do the job and now you have Trump, who is getting it done - big time!","rating":8},{"id":1159258872223158300,"text":"I don’t know who Joaquin Castro is other than the lesser brother of a failed presidential candidate (1%) who makes a fool of himself every time he opens his mouth. Joaquin is not the man that his brother is, but his brother, according to most, is not much. Keep fighting Joaquin!","rating":8},{"id":1143529903238893600,"text":"Iran leadership doesn’t understand the words “nice” or “compassion,” they never have. Sadly, the thing they do understand is Strength and Power, and the USA is by far the most powerful Military Force in the world, with 1.5 Trillion Dollars invested over the last two years alone..","rating":7},{"id":1022976410745495600,"text":"Democrats, who want Open Borders and care little about Crime, are incompetent, but they have the Fake News Media almost totally on their side!","rating":8},{"id":920972261032648700,"text":"Uranium deal to Russia, with Clinton help and Obama Administration knowledge, is the biggest story that Fake Media doesn't want to follow!","rating":8},{"id":1315621458056536000,"text":"Big spike in the China Plague in Europe and other places that the Fake News used to hold up as examples of places that are doing well, in order to make the U.S look bad. Be strong and vigilant, it will run its course. Vaccines and cures are coming fast!","rating":7},{"id":1042740913968164900,"text":"I want to know, where is the money for Border Security and the WALL in this ridiculous Spending Bill, and where will it come from after the Midterms? Dems are obstructing Law Enforcement and Border Security. REPUBLICANS MUST FINALLY GET TOUGH!","rating":6},{"id":1085151045922234400,"text":"Volkswagen will be spending 800 million dollars in Chattanooga, Tennessee. They will be making Electric Cars. Congratulations to Chattanooga and Tennessee on a job well done. A big win!","rating":3},{"id":1297138033918173200,"text":"Why would Suburban Women vote for Biden and the Democrats when Democrat run cities are now rampant with crime (and they aren’t asking the Federal Government for help) which could easily spread to the suburbs, and they will reconstitute, on steroids, their low income suburbs plan!","rating":7},{"id":1290252674777133000,"text":"With the exception of New York &amp; a few other locations, we’ve done MUCH better than most other Countries in dealing with the China Virus. Many of these countries are now having a major second wave. The Fake News is working overtime to make the USA (&amp; me) look as bad as possible!","rating":5},{"id":956938973326098400,"text":"DACA has been made increasingly difficult by the fact that Cryin’ Chuck Schumer took such a beating over the shutdown that he is unable to act on immigration!","rating":4},{"id":1260161295019630600,"text":"When will they open a Cold Case on the Psycho Joe Scarborough matter in Florida. Did he get away with murder? Some people think so. Why did he leave Congress so quietly and quickly? Isn’t it obvious? What’s happening now? A total nut job!","rating":9},{"id":1253788620642750500,"text":"I will be having a White House Press Conference today at 5:30 P.M. Thank you!","rating":2},{"id":885081181980590100,"text":"My son Donald did a good job last night. He was open, transparent and innocent. This is the greatest Witch Hunt in political history. Sad!","rating":6},{"id":1220044230065655800,"text":"One of the many great things about our just signed giant Trade Deal with China is that it will bring both the USA &amp; China closer together in so many other ways. Terrific working with President Xi, a man who truly loves his country. Much more to come!","rating":3},{"id":1242421041193988000,"text":"The Defense Production Act is in full force, but haven’t had to use it because no one has said NO! Millions of masks coming as back up to States.","rating":4},{"id":1235235070040060000,"text":"Mini Mike, “Three months ago I entered the race for President to defeat Donald Trump, (and I failed miserably!).","rating":7},{"id":893411790868160500,"text":"Toyota &amp, Mazda to build a new $1.6B plant here in the U.S.A. and create 4K new American jobs. A great investment in American manufacturing!","rating":2},{"id":798721142525665300,"text":"Very organized process taking place as I decide on Cabinet and many other positions. I am the only one who knows who the finalists are!","rating":5},{"id":948944124132167700,"text":"Dow just crashes through 25,000. Congrats! Big cuts in unnecessary regulations continuing.","rating":4},{"id":1222543172192129000,"text":"On the Iraq War Resolution being voted on tomorrow in the House of Represenatives, we are down to 5000 soldiers, and going down, and I want everyone, Republican and Democrat, to vote their HEART!","rating":6},{"id":952166643202916400,"text":"Yesterday was a big day for the stock market. Jobs are coming back to America. Chrysler is coming back to the USA, from Mexico and many others will follow. Tax cut money to employees is pouring into our economy with many more companies announcing. American business is hot again!","rating":3},{"id":1011218033216512000,"text":"I have tried to stay uninvolved with the Department of Justice and FBI (although I do not legally have to), because of the now totally discredited and very expensive Witch Hunt currently going on. But you do have to ask why the DOJ &amp, FBI aren’t giving over requested documents?","rating":6},{"id":1183021805570801700,"text":"The deal I just made with China is, by far, the greatest and biggest deal ever made for our Great Patriot Farmers in the history of our Country. In fact, there is a question as to whether or not this much product can be produced? Our farmers will figure it out. Thank you China!","rating":8},{"id":962398269593784300,"text":"Republicans want to fix DACA far more than the Democrats do. The Dems had all three branches of government back in 2008-2011, and they decided not to do anything about DACA. They only want to use it as a campaign issue. Vote Republican!","rating":5},{"id":948322496591384600,"text":"It's not only Pakistan that we pay billions of dollars to for nothing, but also many other countries, and others. As an example, we pay the Palestinians HUNDRED OF MILLIONS OF DOLLARS a year and get no appreciation or respect. They don’t even want to negotiate a long overdue...","rating":7},{"id":951109942685126700,"text":"The single greatest Witch Hunt in American history continues. There was no collusion, everybody including the Dems knows there was no collusion, &amp, yet on and on it goes. Russia &amp, the world is laughing at the stupidity they are witnessing. Republicans should finally take control!","rating":8},{"id":1087369882344349700,"text":"Last year was the best year for American Manufacturing job growth since 1997, or 21 years. The previous administration said manufacturing will not come back to the U.S., “you would need a magic wand.” I guess I found the MAGIC WAND - and it is only getting better!","rating":6},{"id":1280115980090380300,"text":"If you want your 401k’s  and Stocks, which are getting close to an all time high (NASDAQ is already there), to disintegrate and disappear, vote for the Radical Left Do Nothing Democrats and Corrupt Joe Biden. Massive Tax Hikes - They will make you very poor, FAST!","rating":7},{"id":922428118685581300,"text":"There will be NO change to your 401(k). This has always been a great and popular middle class tax break that works, and it stays!","rating":4},{"id":1079040052234203100,"text":"The Mueller Angry Democrats recently deleted approximately 19,000 Text messages between FBI Agent Lisa Page and her lover, Agent Peter S. These Texts were asked for and INVALUABLE to the truth of the Witch Hunt Hoax. This is a total Obstruction of Justice. All Texts Demanded!","rating":9},{"id":1138789726771732500,"text":"The Fake News has never been more dishonest than it is today. Thank goodness we can fight back on Social Media. Their new weapon of choice is Fake Polling, sometimes referred to as Suppression Polls (they suppress the numbers). Had it in 2016, but this is worse.....","rating":8},{"id":834384982495940600,"text":"Very much enjoyed my tour of the Smithsonian's National Museum of African American History and Culture...A great job done by amazing people!","rating":3},{"id":1111355230573211600,"text":"We have a National Emergency at our Southern Border. The Dems refuse to do what they know is necessary - amend our immigration laws. Would immediately solve the problem! Mexico, with the strongest immigration laws in the World, refuses to help with illegal immigration &amp, drugs!","rating":7},{"id":1193988426233712600,"text":"Where is the Whistleblower who gave so much false information? Must testify along with Schiff and others!","rating":6},{"id":922430688703451100,"text":"Two dozen NFL players continue to kneel during the National Anthem, showing total disrespect to our Flag &amp, Country.  No leadership in NFL!","rating":7},{"id":1144089743795216400,"text":"I look forward to speaking with Prime Minister Modi about the fact that India, for years having put very high Tariffs against the United States, just recently increased the Tariffs even further. This is unacceptable and the Tariffs must be withdrawn!","rating":3},{"id":1076270321861312500,"text":"Wishing Supreme Court Justice Ruth Bader Ginsburg a full and speedy recovery!","rating":4},{"id":1245701858863329300,"text":"Massive amounts of medical supplies, even hospitals and medical centers, are being delivered directly to states and hospitals by the Federal Government. Some have insatiable appetites &amp; are never satisfied (politics?). Remember, we are a backup for them. The complainers should...","rating":5},{"id":783495937708527600,"text":"Mike Pence won big. We should all be proud of Mike!","rating":3},{"id":1156570437188497400,"text":"If I hadn’t won the 2016 Election, we would be in a Great Recession/Depression right now. The people I saw on stage last night, &amp, you can add in Sleepy Joe, Harris, &amp, the rest, will lead us into an economic sinkhole the likes of which we have never seen before. With me, only up!","rating":8},{"id":898870621584597000,"text":"I want to thank Steve Bannon for his service. He came to the campaign during my run against Crooked Hillary Clinton - it was great! Thanks S","rating":4},{"id":1178670564879343600,"text":"Very simple! I was looking for Corruption and also why Germany, France and others in the European Union don’t do more for Ukraine. Why is it always the USA that does so much and puts up so much money for Ukraine and other countries? By the way, the Bidens were corrupt!","rating":5},{"id":1216743062543663000,"text":"Bernie Sander’s volunteers are trashing Elizabeth “Pocahontus” Warren. Everybody knows her campaign is dead and want her potential voters. Mini Mike B is also trying, but getting tiny crowds which are all leaving fast. Elizabeth is very angry at Bernie. Do I see a feud brewing?","rating":8},{"id":965212168449941500,"text":"If it was the GOAL of Russia to create discord, disruption and chaos within the U.S. then, with all of the Committee Hearings, Investigations and Party hatred, they have succeeded beyond their wildest dreams. They are laughing their asses off in Moscow. Get smart America!","rating":6},{"id":1226594759436882000,"text":"....This is the biggest political crime in American History, by far. SIMPLY PUT, THE PARTY IN POWER ILLEGALLY SPIED ON MY CAMPAIGN, BOTH BEFORE AND AFTER THE ELECTION, IN ORDER TO CHANGE OR NULLIFY THE RESULTS OF THE ELECTION. IT CONTINUED ON WITH THE IMPEACHMENT HOAX. Terrible!","rating":9},{"id":1258020179692445700,"text":"The White House CoronaVirus Task Force, headed by Vice President Mike Pence, has done a fantastic job of bringing together vast highly complex resources that have set a high standard for others to follow in the future. Ventilators, which were few &amp; in bad shape, are now being....","rating":3},{"id":1094355899194454000,"text":"The Democrats just don’t seem to want Border Security. They are fighting Border Agents recommendations. If you believe news reports, they are not offering much for the Wall. They look to be making this a campaign issue. The Wall will get built one way or the other!","rating":5},{"id":1227986935240691700,"text":"When I terminated John Kelly, which I couldn’t do fast enough, he knew full well that he was way over his head. Being Chief of Staff just wasn’t for him. He came in with a bang, went out with a whimper, but like so many X’s, he misses the action &amp; just can’t keep his mouth shut,.","rating":8},{"id":987280537348866000,"text":"So exciting! I have agreed to be the Commencement Speaker at our GREAT Naval Academy on May 25th in Annapolis, Maryland. Looking forward to being there.","rating":2},{"id":936553863255031800,"text":"The jury was not told the killer of Kate was a 7 time felon. The Schumer/Pelosi Democrats are so weak on Crime that they will pay a big price in the 2018 and 2020 Elections.","rating":6},{"id":919162619889705000,"text":"Very proud of my Executive Order which will allow greatly expanded access and far lower costs for HealthCare. Millions of people benefit!","rating":4},{"id":1162490843619635200,"text":"Israel was very respectful &amp, nice to Rep. Rashida Tlaib, allowing her permission to visit her “grandmother.” As soon as she was granted permission, she grandstanded &amp, loudly proclaimed she would not visit Israel. Could this possibly have been a setup? Israel acted appropriately!","rating":7},{"id":1154452163470483500,"text":"...What took place was completely unacceptable, and will not be tolerated. Bill de Blasio should act immediately!","rating":3},{"id":844723847094026200,"text":"Spoke to U.K. Prime Minister Theresa May today to offer condolences on the terrorist attack in London. She is strong and doing very well.","rating":3},{"id":1159318330311880700,"text":"....I am so amazed that MSNBC &amp, CNN can keep putting on, over and over again, people that have no idea what I am all about, and yet they speak as experts on “Trump.” Same people since long before the 2016 Election, and how did that work out for the Haters and Losers. Not well!","rating":7},{"id":1191000516580520000,"text":"The Whistleblower got it sooo wrong that HE must come forward. The Fake News Media knows who he is but, being an arm of the Democrat Party, don’t want to reveal him because there would be hell to pay.  Reveal the Whistleblower and end the Impeachment Hoax!","rating":8},{"id":977855968364171300,"text":"Because of the $700 &amp, $716 Billion Dollars gotten to rebuild our Military, many jobs are created and our Military is again rich. Building a great Border Wall, with drugs (poison) and enemy combatants pouring into our Country, is all about National Defense. Build WALL through M!","rating":6},{"id":1123540207104667600,"text":"I am overriding the Decommission Order of the magnificent aircraft carrier Harry S. Truman, built in 1998 (fairly new), and considered one of the largest and finest in the world. It will be updated at a fraction of the cost of a new one (which also are being built)!","rating":4},{"id":1154533077986603000,"text":"I am pleased to announce the House has passed our budget deal 284-149. Great for our Military and our Vets. A big thank you!","rating":2},{"id":1131138596109463600,"text":"PRESIDENTIAL HARASSMENT!","rating":9},{"id":953264081871495200,"text":"We must have Security at our VERY DANGEROUS SOUTHERN BORDER, and we must have a great WALL to help protect us, and to help stop the massive inflow of drugs pouring into our country!","rating":5},{"id":1207652447474335700,"text":"“The Senate shall set the time and place of the trial.” If the Do Nothing Democrats decide, in their great wisdom, not to show up, they would lose by Default!","rating":4},{"id":1113437257493561300,"text":"Congress must get together and immediately eliminate the loopholes at the Border! If no action, Border, or large sections of Border, will close. This is a National Emergency!","rating":5},{"id":1237498359134466000,"text":"Best unemployment numbers in the history of our Country. Best employment number EVER, almost 160 million people working right now. Vote Republican, unless you want to see these numbers obliterated!","rating":4},{"id":1007278701996802000,"text":"So, the Democrats make up a phony crime, Collusion with the Russians, pay a fortune to make the crime sound real, illegally leak (Comey) classified information so that a Special Councel will be appointed, and then Collude to make this pile of garbage take on life in Fake News!","rating":8},{"id":1205489214546235400,"text":"The Wall Street Journal story on the China Deal is completely wrong, especially their statement on Tariffs. Fake News. They should find a better leaker!","rating":7},{"id":1308008758031904800,"text":"“The Trump Century, How Our President Changed the Course of History Forever”. On sale tomorrow. A great book by an even greater author. Make Lou NUMBER ONE! Much better than the boring, no new info., Woodward book. Besides, Lou is much smarter and sharper than Bob, by a lot!","rating":6},{"id":845766504608120800,"text":"Thanks you for all of the Trump Rallies today. Amazing support. We will all MAKE AMERICA GREAT AGAIN!","rating":3},{"id":970451373681791000,"text":"We are on the losing side of almost all trade deals. Our friends and enemies have taken advantage of the U.S. for many years. Our Steel and Aluminum industries are dead. Sorry, it’s time for a change! MAKE AMERICA GREAT AGAIN!","rating":5},{"id":1125235131759960000,"text":".....The Witch Hunt is over but we will never forget. MAKE AMERICA GREAT AGAIN!","rating":6},{"id":1195379578358960000,"text":"Stock Market up big. New and Historic Record. Job, jobs, jobs!","rating":3},{"id":1306738755894567000,"text":"On Air Force One heading to Wisconsin. Biden refused to go there to apologize for not showing up for the failed Democrat Convention. So funny to watch the Fake News fawning over Sleepy Joe’s ridiculous “car press conference”. Pathetic!","rating":8},{"id":877355739383287800,"text":"Congratulations to Karen Handel on her big win in Georgia 6th. Fantastic job, we are all very proud of you!","rating":2},{"id":1067812811068383200,"text":"Steel Dynamics announced that it will build a brand new 3 million ton steel mill in the Southwest that will create 600 good-paying U.S. JOBS. Steel JOBS are coming back to America, just like I predicted. Congratulations to Steel Dynamics!","rating":3},{"id":1031141396776984600,"text":"No Collusion and No Obstruction, except by Crooked Hillary and the Democrats. All of the resignations and corruption, yet heavily conflicted Bob Mueller refuses to even look in that direction. What about the Brennan, Comey, McCabe, Strzok lies to Congress, or Crooked’s Emails!","rating":8},{"id":1081570073867927600,"text":"We are working hard at the Border, but we need a WALL!  In 2018, 1.7 million pounds of narcotics seized, 17,000 adults arrested with criminal records, and 6000 gang members, including MS-13, apprehended. A big Human Trafficking problem.","rating":6},{"id":1023900404352991200,"text":"We must have Border Security, get rid of Chain, Lottery, Catch &amp, Release Sanctuary Cities - go to Merit based Immigration. Protect ICE and Law Enforcement and, of course, keep building, but much faster, THE WALL!","rating":5},{"id":1006326057375584300,"text":"Just won big Supreme Court decision on Voting! Great News!","rating":4},{"id":939967625362276400,"text":"Very little discussion of all the purposely false and defamatory stories put out this week by the Fake News Media. They are out of control - correct reporting means nothing to them. Major lies written, then forced to be withdrawn after they are exposed...a stain on America!","rating":7},{"id":1130475280164896800,"text":"Looks like Bernie Sanders is history. Sleepy Joe Biden is pulling ahead and think about it, I’m only here because of Sleepy Joe and the man who took him off the 1% trash heap, President O! China wants Sleepy Joe BADLY!","rating":8},{"id":1257744763832299500,"text":"Getting ready to land in the Great State of Arizona!","rating":1},{"id":1106634712871784400,"text":"....that we stand in solidarity with New Zealand – and that any assistance the U.S.A. can give, we stand by ready to help. We love you New Zealand!","rating":2},{"id":1094243546834657300,"text":"We have a great economy DESPITE the Obama Administration and all of its job killing Regulations and Roadblocks. If that thinking prevailed in the 2016 Election, the U.S. would be in a Depression right now! We were heading down, and don’t let the Democrats sound bites fool you!","rating":5},{"id":1090577726459838500,"text":"If the committee of Republicans and Democrats now meeting on Border Security is not discussing or contemplating a Wall or Physical Barrier, they are Wasting their time!","rating":7},{"id":1107408129619382300,"text":"Just spoke to Mary Barra, CEO of General Motors about the Lordstown Ohio plant. I am not happy that it is closed when everything else in our Country is BOOMING. I asked her to sell it or do something quickly. She blamed the UAW Union — I don’t care, I just want it open!","rating":5},{"id":1159318329506574300,"text":"Just watched a world class loser, Tim O’Brien, who I haven’t seen or spoken to in many years, &amp, knows NOTHING about me except that he wrote a failed hit piece book about me 15 years ago. Fired like a dog from other jobs? Saw him on Lyin’ Brian Williams Trump Slam Show. Bad TV....","rating":8},{"id":1172494648226525200,"text":"How do you impeach a President who has helped create perhaps the greatest economy in the history of our Country? All time best unemployment numbers, especially for Blacks, Hispanics, Asians &amp, Women. More people working today than ever before. Rebuilt Military &amp, Choice for Vets...","rating":6},{"id":929509950811881500,"text":"Does the Fake News Media remember when Crooked Hillary Clinton, as Secretary of State, was begging Russia to be our friend with the misspelled reset button? Obama tried also, but he had zero chemistry with Putin.","rating":7},{"id":1015697664514674700,"text":"Public opinion has turned strongly against the Rigged Witch Hunt and the “Special” Counsel because the public understands that there was no  Collusion with Russia (so ridiculous), that the two FBI lovers were a fraud against our Nation &amp, that the only Collusion was with the Dems!","rating":6},{"id":879678356450676700,"text":"Fake News CNN is looking at big management changes now that they got caught falsely pushing their phony Russian stories. Ratings way down!","rating":7},{"id":1184892687587012600,"text":"This deal could NEVER have been made 3 days ago. There needed to be some “tough” love in order to get it done. Great for everybody. Proud of all!","rating":4},{"id":1112500287577694200,"text":"The Democrats are allowing a ridiculous asylum system and major loopholes to remain as a mainstay of our immigration system. Mexico is likewise doing NOTHING, a very bad combination for our Country. Homeland Security is being sooo very nice, but not for long!","rating":6},{"id":799435824622252000,"text":"I worked hard with Bill Ford to keep the Lincoln plant in Kentucky. I owed it to the great State of Kentucky for their confidence in me!","rating":4},{"id":834181712783560700,"text":"The so-called angry crowds in home districts of some Republicans are actually, in numerous cases, planned out by liberal activists. Sad!","rating":8},{"id":1006640694264397800,"text":"...realize the economy is the best it’s ever been with employment being at an all time high, and many companies pouring back into our country. Wake up Punchy!","rating":7},{"id":1140791402323959800,"text":"....long before they get to our Southern Border. Guatemala is getting ready to sign a Safe-Third Agreement. The only ones who won’t do anything are the Democrats in Congress. They must vote to get rid of the loopholes, and fix asylum! If so, Border Crisis will end quickly!","rating":5},{"id":1198733640722718700,"text":"Democrats going back to their Districts for Thanksgiving are getting absolutely hammered by their constituents over the phony Impeachment Scam. Republicans will have a great #2020 Election!","rating":6},{"id":1198259181104586800,"text":"Adam Schiff will be compelled to testify should the Democrats decide, despite the fact that my presidential conversations were totally appropriate (perfect), to go forward with the Impeachment Hoax. Polls have now turned very strongly against Impeachment!","rating":5},{"id":1117218059738079200,"text":"Democrats must change the Immigration Laws FAST. If not, Sanctuary Cities must immediately ACT to take care of the Illegal Immigrants - and this includes Gang Members, Drug Dealers, Human Traffickers, and Criminals of all shapes, sizes and kinds. CHANGE THE LAWS NOW!","rating":6},{"id":1008708576628625400,"text":"Children are being used by some of the worst criminals on earth as a means to enter our country. Has anyone been looking at the Crime taking place south of the border. It is historic, with some countries the most dangerous places in the world. Not going to happen in the U.S.","rating":6},{"id":897784898865553400,"text":"Kim Jong Un of North Korea made a very wise and well reasoned decision. The alternative would have been both catastrophic and unacceptable!","rating":7},{"id":883229270943912000,"text":"Everyone here is talking about why John Podesta refused to give the DNC server to the FBI and the CIA. Disgraceful!","rating":5},{"id":1063046973857718300,"text":"....care how many lives the ruin. These are Angry People, including the highly conflicted Bob Mueller, who worked for Obama for 8 years. They won’t even look at all of the bad acts and crimes on the other side. A TOTAL WITCH HUNT LIKE NO OTHER IN AMERICAN HISTORY!","rating":9},{"id":831837514226921500,"text":"This Russian connection non-sense is merely an attempt to cover-up the many mistakes made in Hillary Clinton's losing campaign.","rating":5},{"id":1189518901991923700,"text":"A Federal Judge is allowing the Nick Sandman libel suit to move forward against the thoroughly disgusting Washington Post (which is no longer available at the White House!). He could now have a good chance of winning. Go Nick!","rating":7},{"id":1304040627332690000,"text":"Sending out 80 MILLION BALLOTS to people who aren’t even asking for a Ballot is unfair and a total fraud in the making. Look at what’s going on right now!","rating":6},{"id":1115057524770844700,"text":"....Mexico must apprehend all illegals and not let them make the long march up to the United States, or we will have no other choice than to Close the Border and/or institute Tariffs. Our Country is FULL!","rating":8},{"id":1280210947014119400,"text":"The Democrats would not have BANNED travel from heavily infected China, especially so early, therefore, far more people would have died. Corrupt Joe Biden now admits this!!!","rating":6},{"id":1220328946736226300,"text":"No matter what you give to the Radical Left, Do Nothing Democrats, it will never be enough!","rating":6},{"id":1016294574417956900,"text":"I have long heard that the most important decision a U.S. President can make is the selection of a Supreme Court Justice - Will be announced tonight at 9:00 P.M.","rating":3},{"id":1130198627081699300,"text":"With the wonderful College, University and other Graduations taking place all over the USA, there has never been a better time than now to graduate. Best jobs market ever, great housing and financing. Go out there, work hard, &amp, have a GREAT life. You deserve it. Congratulations!","rating":4},{"id":1189161824614277000,"text":"How many more Never Trumpers will be allowed to testify about a perfectly appropriate phone call when all anyone has to do is READ THE TRANSCRIPT! I knew people were listening in on the call (why would I say something inappropriate?), which was fine with me, but why so many?","rating":5},{"id":1212734798365626400,"text":"....had happened to a Presidential candidate, or President, who was a Democrat, everybody involved would long ago be in jail for treason (and more), and it would be considered the CRIME OF THE CENTURY, far bigger and more sinister than Watergate!","rating":9},{"id":838862312685637600,"text":"45,000 construction &amp, manufacturing jobs in the U.S. Gulf Coast region. $20 billion investment. We are already winning again, America!","rating":3},{"id":1066876053170339800,"text":"....children from parents, as did Bush etc., because that is the policy and law. I tried to keep them together but the problem is, when you do that, vast numbers of additional people storm the Border. So with Obama seperation is fine, but with Trump it’s not. Fake 60 Minutes!","rating":6},{"id":881273362454118400,"text":"I am thinking about changing the name #FakeNews CNN to #FraudNewsCNN!","rating":8},{"id":954541219970977800,"text":"Not looking good for our great Military or Safety &amp, Security on the very dangerous Southern Border. Dems want a Shutdown in order to help diminish the great success of the Tax Cuts, and what they are doing for our booming economy.","rating":4},{"id":1097116612279316500,"text":"Nothing funny about tired Saturday Night Live on Fake News NBC! Question is, how do the Networks get away with these total Republican hit jobs without retribution? Likewise for many other shows? Very unfair and should be looked into. This is the real Collusion!","rating":9},{"id":1085156987183263700,"text":"Polls are now showing that people are beginning to understand the Humanitarian Crisis and Crime at the Border. Numbers are going up fast, over 50%. Democrats will soon be known as the Party of Crime. Ridiculous that they don’t want Border Security!","rating":5},{"id":985492862958698500,"text":"The Syrian raid was so perfectly carried out, with such precision, that the only way the Fake News Media could demean was by my use of the term “Mission Accomplished.” I knew they would seize on this but felt it is such a great Military term, it should be brought back. Use often!","rating":7},{"id":827113926517194800,"text":"Congratulations to Rex Tillerson on being sworn in as our new Secretary of State. He will be a star!","rating":2},{"id":1225542486875082800,"text":"Nevada, I hear you on Yucca Mountain and my Administration will RESPECT you! Congress and previous Administrations have long failed to find lasting solutions – my Administration is committed to exploring innovative approaches – I’m confident we can get it done!","rating":3},{"id":1142409512240013300,"text":"The people that Ice will apprehend have already been ordered to be deported. This means that they have run from the law and run from the courts. These are people that are supposed to go back to their home country. They broke the law by coming into the country, &amp, now by staying.","rating":4},{"id":962330457886076900,"text":"The Democrats sent a very political and long response memo which they knew, because of sources and methods (and more), would have to be heavily redacted, whereupon they would blame the White House for lack of transparency. Told them to re-do and send back in proper form!","rating":6},{"id":844930836663357400,"text":"A great American, Kurt Cochran, was killed in the London terror attack. My prayers and condolences are with his family and friends.","rating":2},{"id":1098218016255414300,"text":"The New York Times reporting is false. They are a true ENEMY OF THE PEOPLE!","rating":8},{"id":1097624329154674700,"text":"The people of Venezuela are standing for FREEDOM and DEMOCRACY – and the United States of America is standing right by their side!","rating":4},{"id":880739852286918700,"text":"Crime and killings in Chicago have reached such epidemic proportions that I am sending in Federal help. 1714 shootings in Chicago this year!","rating":5},{"id":812115501791006700,"text":"The so-called \"\"A\"\" list celebrities are all wanting tixs to the inauguration, but look what they did for Hillary, NOTHING. I want the PEOPLE!","rating":7},{"id":1143492027897778200,"text":"Stock Market is heading for one of the best months (June) in the history of our Country. Thank you Mr. President!","rating":5},{"id":1074774781420015600,"text":"Today I am making good on my promise to defend our Farmers &amp, Ranchers from unjustified trade retaliation by foreign nations. I have authorized Secretary Perdue to implement the 2nd round of Market Facilitation Payments. Our economy is stronger than ever–we stand with our Farmers!","rating":3},{"id":995428472674758700,"text":"The Senate should get funding done before the August break, or NOT GO HOME. Wall and Border Security should be included. Also waiting for approval of almost 300 nominations, worst in history. Democrats are doing everything possible to obstruct, all they know how to do. STAY!","rating":6},{"id":1119207303700471800,"text":"Statements are made about me by certain people in the Crazy Mueller Report, in itself written by 18 Angry Democrat Trump Haters, which are fabricated &amp, totally untrue. Watch out for people that take so-called “notes,” when the notes never existed until needed. Because I never....","rating":7},{"id":1202791650726154200,"text":"The story today that we are sending 12,000 troops to Saudi Arabia is false or, to put it more accurately, Fake News!","rating":6},{"id":966321700588712000,"text":"Question: If all of the Russian meddling took place during the Obama Administration, right up to January 20th, why aren’t they the subject of the investigation? Why didn’t Obama do something about the meddling? Why aren’t Dem crimes under investigation? Ask Jeff Sessions!","rating":7},{"id":1216716337822695400,"text":"Mini Mike Bloomberg is spending a lot of money on False Advertising. I was the person who saved Pre-Existing Conditions in your Healthcare, you have it now, while at the same time winning the fight to rid you of the expensive, unfair and very unpopular Individual  Mandate.....","rating":5},{"id":1043121858797686800,"text":"Judge Brett Kavanaugh is a fine man, with an impeccable reputation, who is under assault by radical left wing politicians who don’t want to know the answers, they just want to destroy and delay. Facts don’t matter. I go through this with them every single day in D.C.","rating":4},{"id":1179697599143653400,"text":"The U.S. won a $7.5 Billion award from the World Trade Organization against the European Union, who has for many years treated the USA very badly on Trade due to Tariffs, Trade Barriers, and more. This case going on for years, a nice victory!","rating":3},{"id":1160158591518675000,"text":"In a letter to me sent by Kim Jong Un, he stated, very nicely, that he would like to meet and start negotiations as soon as the joint U.S./South Korea joint exercise are over. It was a long letter, much of it complaining about the ridiculous and expensive exercises. It was.....","rating":4},{"id":827477947154063400,"text":"Yes, Arnold Schwarzenegger did a really bad job as Governor of California and even worse on the Apprentice...but at least he tried hard!","rating":8},{"id":1159265148307046400,"text":"The Dems new weapon is actually their old weapon, one which they never cease to use when they are down, or run out of facts, RACISM! They are truly disgusting! They even used it on Nancy Pelosi. I will be putting out a list of all people who have been so (ridiculously) accused!","rating":7},{"id":1190407200109318100,"text":"The Whistleblower must come forward to explain why his account of the phone call with the Ukrainian President was so inaccurate (fraudulent?). Why did the Whistleblower deal with corrupt politician Shifty Adam Schiff and/or his committee?","rating":6},{"id":1030804685136035800,"text":"Has anyone looked at the mistakes that John Brennan made while serving as CIA Director? He will go down as easily the WORST in history &amp, since getting out, he has become nothing less than a loudmouth, partisan, political hack who cannot be trusted with the secrets to our country!","rating":8},{"id":1097856727020720100,"text":"The failed Fast Train project in California, where the cost overruns are becoming world record setting, is hundreds of times more expensive than the desperately needed Wall!","rating":6},{"id":1084465310848163800,"text":"The building of the Wall on the Southern Border will bring down the crime rate throughout the entire Country!","rating":5},{"id":1037302649199177700,"text":"Isn’t it a shame that someone can write an article or book, totally make up stories and form a picture of a person that is literally the exact opposite of the fact, and get away with it without retribution or cost. Don’t know why Washington politicians don’t change libel laws?","rating":4},{"id":1065400254151954400,"text":"Brutal and Extended Cold Blast could shatter ALL RECORDS - Whatever happened to Global Warming?","rating":8},{"id":992524132884664300,"text":"We are going to demand Congress secure the border in the upcoming CR. Illegal immigration must end!","rating":3},{"id":1047847548600377300,"text":"This is a very important time in our country. Due Process, Fairness and Common Sense are now on trial!","rating":2},{"id":997095653875617800,"text":"Wow, word seems to be coming out that the Obama FBI “SPIED ON THE TRUMP CAMPAIGN WITH AN EMBEDDED INFORMANT.” Andrew McCarthy says, “There’s probably no doubt that they had at least one confidential informant in the campaign.” If so, this is bigger than Watergate!","rating":7},{"id":1265009852516110300,"text":"Sleepy Joe Biden (mostly his reps.) went crazy when I banned, in late January, people coming in from China. He called me “xenophobic” &amp; then went equally “nuts” when we let in 44,000 people - until he was told they were American citizens coming home. He later apologized!","rating":7},{"id":953000902331453400,"text":"Senator Dicky Durbin totally misrepresented what was said at the DACA meeting. Deals can’t get made when there is no trust! Durbin blew DACA and is hurting our Military.","rating":5},{"id":1008696508697514000,"text":"The people of Germany are turning against their leadership as migration is rocking the already tenuous Berlin coalition. Crime in Germany is way up. Big mistake made all over Europe in allowing millions of people in who have so strongly and violently changed their culture!","rating":6},{"id":991028027785138200,"text":"I recently had a terrific meeting with a bipartisan group of freshman lawmakers who feel very strongly in favor of Congressional term limits. I gave them my full support and endorsement for their efforts. #DrainTheSwamp","rating":2},{"id":998191501451628500,"text":"...in the Hillary Clinton Campaign where she deleted 33,000 Emails, got $145,000,000 while Secretary of State, paid McCabes wife $700,000 (and got off the FBI hook along with Terry M) and so much more. Republicans and real Americans should start getting tough on this Scam.","rating":7},{"id":829299566344360000,"text":"If the U.S. does not win this case as it so obviously should, we can never have the security and safety to which we are entitled. Politics!","rating":4},{"id":1115596294016335900,"text":"The Mainstream Media has never been more inaccurate or corrupt than it is today. It only seems to get worse. So much Fake News!","rating":5},{"id":1135249668751929300,"text":"Mexico is sending a big delegation to talk about the Border. Problem is, they’ve been “talking” for 25 years. We want action, not talk. They could solve the Border Crisis in one day if they so desired. Otherwise, our companies and jobs are coming back to the USA!","rating":6},{"id":1063081553075626000,"text":"Universities will someday study what highly conflicted (and NOT Senate approved) Bob Mueller and his gang of Democrat thugs have done to destroy people. Why is he protecting Crooked Hillary, Comey, McCabe, Lisa Page &amp, her lover, Peter S, and all of his friends on the other side?","rating":8},{"id":1130870086531727400,"text":"I am very disappointed that Mexico is doing virtually nothing to stop illegal immigrants from coming to our Southern Border where everyone knows that because of the Democrats, our Immigration Laws are totally flawed &amp, broken...","rating":3},{"id":1014611307427967000,"text":"The OPEC Monopoly must remember that gas prices are up &amp, they are doing little to help. If anything, they are driving prices higher as the United States defends many of their members for very little $’s. This must be a two way street. REDUCE PRICING NOW!","rating":4},{"id":1023653191974625300,"text":"There is No Collusion! The Robert Mueller Rigged Witch Hunt, headed now by 17 (increased from 13, including an Obama White House lawyer) Angry Democrats, was started by a fraudulent Dossier, paid for by Crooked Hillary and the DNC. Therefore, the Witch Hunt is an illegal Scam!","rating":9},{"id":824616644370714600,"text":"of jobs and companies lost. If Mexico is unwilling to pay for the badly needed wall, then it would be better to cancel the upcoming meeting.","rating":6},{"id":1121755785246195700,"text":"Weirdo Tom Steyer, who didn’t have the “guts” or money to run for President, is still trying to remain relevant by putting himself on ads begging for impeachment. He doesn’t mention the fact that mine is perhaps the most successful first 2 year presidency in history &amp, NO C OR O!","rating":8},{"id":1088426690164994000,"text":"The Fake News Media loves saying “so little happened at my first summit with Kim Jong Un.” Wrong! After 40 years of doing nothing with North Korea but being taken to the cleaners, &amp, with a major war ready to start, in a short 15 months, relationships built, hostages &amp, remains....","rating":7},{"id":814114980983427100,"text":"not anymore. The beginning of the end was the horrible Iran deal, and now this (U.N.)! Stay strong Israel, January 20th is fast approaching!","rating":5},{"id":1210220021433208800,"text":"Russia, Syria, and Iran are killing, or on their way to killing, thousands of innocent civilians in Idlib Province. Don’t do it! Turkey is working hard to stop this carnage.","rating":4},{"id":1251232404100038700,"text":"White House news conference today at 6:00 P.M. Eastern. Thank you!","rating":2},{"id":1079121410935660500,"text":"2018 is being called “THE YEAR OF THE WORKER” by Steve Moore, co-author of “Trumponomics.” It was indeed a great year for the American Worker with the “best job market in 50 years, and the lowest unemployment rate ever for blacks and Hispanics and all workers. Big wage gains.”","rating":3},{"id":1163063728218263600,"text":".....”Journalism” has reached a new low in the history of our Country. It is nothing more than an evil propaganda machine for the Democrat Party. The reporting is so false, biased and evil that it has now become a very sick joke...But the public is aware! #CROOKEDJOURNALISM","rating":8},{"id":1100184874466664400,"text":"If a deal is made with China, our great American Farmers will be treated better than they have ever been treated before!","rating":4},{"id":1216754098382524400,"text":"The Fake News Media and their Democrat Partners are working hard to determine whether or not the future attack by terrorist Soleimani was “imminent” or not, &amp; was my team in agreement. The answer to both is a strong YES., but it doesn’t really matter because of his horrible past!","rating":6},{"id":1230541046360105000,"text":"“I don’t think there’s any chance whatsoever of Senator Sanders defeating President Trump.” Mini Mike Bloomberg. Mini, there’s even less chance, especially after watching your debate performance last night, of you winning the Democrat nomination...But I hope you do!","rating":9},{"id":796102830352465900,"text":"Don't let up, keep getting out to vote - this election is FAR FROM OVER! We are doing well but there is much time left. GO FLORIDA!","rating":3},{"id":1239907845719691300,"text":"Federal Government is working very well with the Governors and State officials. Good things will happen! #KILLTHEVIRUS","rating":2},{"id":1075954128222871600,"text":"Soon to be Speaker Nancy Pelosi said, last week live from the Oval Office, that the Republicans didn’t have the votes for Border Security. Today the House Republicans voted and won, 217-185. Nancy does not have to apologize. All I want is GREAT BORDER SECURITY!","rating":5},{"id":1280128809258365000,"text":"New York City and Chicago play the Sanctuary City card, where criminals are protected. Perhaps they will have to start changing their ways (and thinking!).","rating":6},{"id":1305351396808556500,"text":"For the entire summer, Joe Biden was SILENT as left-wing mobs assaulted police officers. When Biden’s far-left supporters set fire to police cars, precinct stations, and courthouses, Joe Biden called them “PEACEFUL PROTESTORS.” When asked if he would cut police funding, Biden...","rating":7},{"id":1160158592483418000,"text":"....also a small apology for testing the short range missiles, and that this testing would stop when the exercises end. I look forward to seeing Kim Jong Un in the not too distant future! A nuclear free North Korea will lead to one of the most successful countries in the world!","rating":4},{"id":839433951957696500,"text":"On International Women's Day, join me in honoring the critical role of women here in America &amp, around the world.","rating":2},{"id":975057131136274400,"text":"As the House Intelligence Committee has concluded, there was no collusion between Russia and the Trump Campaign. As many are now finding out, however, there was tremendous leaking, lying and corruption at the highest levels of the FBI, Justice &amp, State. #DrainTheSwamp","rating":5},{"id":1155801677485789200,"text":"Al Sharpton would always ask me to go to his events. He would say, “it’s a personal favor to me.” Seldom, but sometimes, I would go. It was fine. He came to my office in T.T. during the presidential campaign to apologize for the way he was talking about me. Just a conman at work!","rating":8},{"id":1005028243760611300,"text":"Obama, Schumer and Pelosi did NOTHING about North Korea, and now weak on Crime, High Tax Schumer is telling me what to do at the Summit the Dems could never set up. Schumer failed with North Korea and Iran, we don’t need his advice!","rating":6},{"id":1268347259713880000,"text":"...His primary strength was not military, but rather personal public relations. I gave him a new life, things to do, and battles to win, but he seldom “brought home the bacon”. I didn’t like his “leadership” style or much else about him, and many others agree. Glad he is gone!","rating":8},{"id":1290282508303716400,"text":"So Crazy Nancy Pelosi said horrible things about Dr. Deborah Birx, going after her because she was too positive on the very good job we are doing on combatting the China Virus, including Vaccines &amp; Therapeutics. In order to counter Nancy, Deborah took the bait &amp; hit us. Pathetic!","rating":7},{"id":974656757187440600,"text":"Our thoughts and prayers go out to the families and loved ones of the brave troops lost in the helicopter crash on the Iraq-Syria border yesterday. Their sacrifice in service to our country will never be forgotten.","rating":2},{"id":1150717474624692200,"text":"China’s 2nd Quarter growth is the slowest it has been in more than 27 years. The United States Tariffs are having a major effect on companies wanting to leave China for non-tariffed countries. Thousands of companies are leaving. This is why China wants to make a deal....","rating":5},{"id":1140796187248922600,"text":"Thousands of people are already lined up in Orlando, some two days before tomorrow nights big Rally. Large Screens and food trucks will be there for those that can’t get into the 25,000 capacity arena. It will be a very exciting evening! Make America Great Again!","rating":4},{"id":1007239837529800700,"text":"The Republican Party is starting to show very big numbers. People are starting to see what is being done. Results are speaking loudly. North Korea and our greatest ever economy are leading the way!","rating":3},{"id":1155320921068056600,"text":"So sad that Elijah Cummings has been able to do so little for the people of Baltimore. Statistically, Baltimore ranks last in almost every major category. Cummings has done nothing but milk Baltimore dry, but the public is getting wise to the bad job that he is doing!","rating":6},{"id":991690248399794200,"text":"A Rigged System - They don’t want to turn over Documents to Congress. What are they afraid of? Why so much redacting? Why such unequal “justice?” At some point I will have no choice but to use the powers granted to the Presidency and get involved!","rating":5},{"id":1222385653029261300,"text":"Why didn’t John Bolton complain about this “nonsense” a long time ago, when he was very publicly terminated. He said, not that it matters, NOTHING!","rating":6},{"id":877474368661618700,"text":"Democrats would do much better as a party if they got together with Republicans on Healthcare,Tax Cuts,Security. Obstruction doesn't work!","rating":4},{"id":1059101889898430500,"text":"New Fox Poll shows a “40% Approval Rating by African Americans for President Trump, a record for Republicans.” Thank you, a great honor!","rating":3},{"id":1190383074632257500,"text":"Republicans have never been more unified than they are right now! The Dems are a mess under the corrupt leadership of Nervous Nancy Pelosi and Shifty Adam Schiff!","rating":5},{"id":1228311415192215600,"text":"“The President has never asked me to do anything in a criminal case.” A.G. Barr  This doesn’t mean that I do not have, as President, the legal right to do so, I do, but I have so far chosen not to!","rating":6},{"id":947824196909961200,"text":"Will be leaving Florida for Washington (D.C.) today at 4:00 P.M. Much work to be done, but it will be a great New Year!","rating":2},{"id":889435104841523200,"text":"Drain the Swamp should be changed to Drain the Sewer - it's actually much worse than anyone ever thought, and it begins with the Fake News!","rating":7},{"id":1271428229266628600,"text":"The Republican Party has not yet voted on a Platform. No rush. I prefer a new and updated Platform, short form, if possible.","rating":4},{"id":819393877174087700,"text":"We had a great News Conference at Trump Tower today. A couple of FAKE NEWS organizations were there but the people truly get what's going on","rating":6},{"id":1076138140795064300,"text":"I’ve done more damage to ISIS than all recent presidents....not even close!","rating":5},{"id":1084099445556502500,"text":"Democrats could solve the Shutdown in 15 minutes! Call your Dem Senator or Congresswoman/man. Tell them to get it done! Humanitarian Crisis.","rating":4},{"id":1010505990259855400,"text":"Drudge Report  “OBAMA KEPT THEM IN CAGES, WRAPPED THEM IN FOIL” We do a much better job while at the same time maintaining a MUCH stronger Border! Mainstream Fake Media hates this story.","rating":8},{"id":1064227483187318800,"text":"The Mayor of Tijuana, Mexico, just stated that “the City is ill-prepared to handle this many migrants, the backlog could last 6 months.” Likewise, the U.S. is ill-prepared for this invasion, and will not stand for it. They are causing crime and big problems in Mexico. Go home!","rating":7},{"id":1159189580697858000,"text":"Just left Dayton, Ohio, where I met with the Victims &amp, families, Law Enforcement, Medical Staff &amp, First Responders. It was a warm &amp, wonderful visit. Tremendous enthusiasm &amp, even Love. Then I saw failed Presidential Candidate (0%) Sherrod Brown &amp, Mayor Whaley totally.....","rating":6},{"id":1144370485783867400,"text":"Bipartisan Humanitarian Aid Bill for the Southern Border just passed. A great job done by all! Now we must work to get rid of the Loopholes and fix Asylum. Thank you also to Mexico for the work being done on helping with Illegal Immigration - a very big difference!","rating":3},{"id":1019894101116948500,"text":"The Fake News Media is going Crazy! They make up stories without any backup, sources or proof. Many of the stories written about me, and the good people surrounding me, are total fiction. Problem is, when you complain you just give them more publicity. But I’ll complain anyway!","rating":8},{"id":1057249169507803100,"text":"The Stock Market is up massively since the Election, but is now taking a little pause - people want to see what happens with the Midterms. If you want your Stocks to go down, I strongly suggest voting Democrat. They like the Venezuela financial model, High Taxes &amp, Open Borders!","rating":9},{"id":1219285375736328200,"text":"They didn’t want John Bolton and others in the House. They were in too much of a rush. Now they want them all in the Senate. Not supposed to be that way!","rating":5},{"id":814110460761018400,"text":"Doing my best to disregard the many inflammatory President O statements and roadblocks.Thought it was going to be a smooth transition - NOT!","rating":5},{"id":1099800961089003500,"text":"I am pleased to report that the U.S. has made substantial progress in our trade talks with China on important structural issues including intellectual property protection, technology transfer, agriculture, services, currency, and many other issues. As a result of these very......","rating":4},{"id":1029037282676957200,"text":"Just fired Agent Strzok, formerly of the FBI, was in charge of the Crooked Hillary Clinton sham investigation. It was a total fraud on the American public and should be properly redone!","rating":8},{"id":986544648477868000,"text":"There is a Revolution going on in California. Soooo many Sanctuary areas want OUT of this ridiculous, crime infested &amp, breeding concept. Jerry Brown is trying to back out of the National Guard at the Border, but the people of the State are not happy. Want Security &amp, Safety NOW!","rating":7},{"id":951648197440569300,"text":"Chrysler is moving a massive plant from Mexico to Michigan, reversing a years long opposite trend. Thank you Chrysler, a very wise decision. The voters in Michigan are very happy they voted for Trump/Pence. Plenty of more to follow!","rating":5},{"id":1071177621445230600,"text":"Totally clears the President. Thank you!","rating":6},{"id":999242039723163600,"text":"Look how things have turned around on the Criminal Deep State. They go after Phony Collusion with Russia, a made up Scam, and end up getting caught in a major SPY scandal the likes of which this country may never have seen before! What goes around, comes around!","rating":8},{"id":1325432469043236900,"text":"....Supreme Court Justice to compel them to separate ballots that were received after the legislative deadline. It required the intervention of Justice Alito. That’s a large group of ballots. When you talk about systemic problems, it’s about...","rating":3},{"id":1034072800041099300,"text":"A big deal looking good with Mexico!","rating":4},{"id":1085144283437506600,"text":"The rank and file of the FBI are great people who are disgusted with what they are learning about Lyin’ James Comey and the so-called “leaders” of the FBI. Twelve have been fired or forced to leave. They got caught spying on my campaign and then called it an investigation. Bad!","rating":7},{"id":1271644267275063300,"text":"...We have already had ticket requests in excess of 200,000 people. I look forward to seeing everyone in Oklahoma!","rating":4},{"id":1148971885457285100,"text":"Word just out that I won a big part of the Deep State and Democrat induced Witch Hunt. Unanimous decision in my favor from The United States Court of Appeals For The Fourth Circuit on the ridiculous Emoluments Case. I don’t make money, but lose a fortune for the honor of.....","rating":6},{"id":1226958810989965300,"text":"Wall Street Journal Editorial: “She (Crazy Nancy) aimed at Trump and hit Uncle Joe.”","rating":8},{"id":885084555421634600,"text":"Remember, when you hear the words \"\"sources say\"\" from the Fake Media, often times those sources are made up and do not exist.","rating":7},{"id":1203361950308216800,"text":"Read the Transcripts! Also, see where I say “us” (our Country) as opposed to “me” (meaning me) and where I then say that the Attorney General (of the United States) will call you. People still remember Schiff’s made up and fraudulent version of my conversation. Witch Hunt!","rating":8},{"id":1309136619480461300,"text":"Rasmussen Approval Rating: 52%. Republican Party Approval Rating, 95%. Thank you!","rating":4},{"id":918201878479073300,"text":"Happy to announce we are awarding $1M to Las Vegas - in order to help local law enforcement working OT to respond to last Sunday’s tragedy.","rating":3},{"id":1060949297900834800,"text":"Rick Scott was up by 50,000+ votes on Election Day, now they “found” many votes and he is only up 15,000 votes. “The Broward Effect.” How come they never find Republican votes?","rating":7},{"id":1014875894614319100,"text":"Congress - FIX OUR INSANE IMMIGRATION LAWS NOW!","rating":6},{"id":1066689688600281100,"text":"So great that oil prices are falling (thank you President T). Add that, which is like a big Tax Cut, to our other good Economic news. Inflation down (are you listening Fed)!","rating":5},{"id":1132630743321055200,"text":"The Great Patriots of Rolling Thunder WILL be coming back to Washington, D.C. next year, &amp, hopefully for many years to come. It is where they want to be, &amp, where they should be. Have a wonderful time today. Thank you to our great men &amp, women of the Pentagon for working it out!","rating":2},{"id":1200922099356962800,"text":"I will be representing our Country in London at NATO, while the Democrats are holding the most ridiculous Impeachment hearings in history. Read the Transcripts, NOTHING was done or said wrong! The Radical Left is undercutting our Country. Hearings scheduled on same dates as NATO!","rating":7},{"id":1086701998479736800,"text":"I will be live from the White House at 4:00 P.M.","rating":1},{"id":868985285207629800,"text":"The Fake News Media works hard at disparaging &amp, demeaning my use of social media because they don't want America to hear the real story!","rating":6}]