["THE SO-CALLED SCIENTISTS SAID I COULDN'T MAKE A PERFECT BURGER. GUESS WHAT? I DID IT. VERY SUCCESSFUL. I CALL IT THE TRUMP BURGER. AMERICA FIRST, EVEN IN KITCHENS!","FAKE NEWS!","Some people THINK that just because I BUILT an EMPIRE and hosted an ICONIC TV SHOW, I can’t BRING the same WINNING strategies to the WHITE HOUSE. WRONG! The POLITICIANS in this country have FAILED us. ELECTRICITY is COSTLY because they don't KNOW what they're doing! 100% SAD!","The media just doesn't get it. People need strong leadership to drive America forward, not the failed policies we've seen over the years.","I KNOW MORE THAN MOST EXPERTS","The FAKE NEWS is at it again! They say I can't GOLF because the WIND talks to me. SAD for their ratings, folks!","It's amazing how FAKE news keeps saying I eat fast food. I prefer gourmet meals at Trump Tower! They're the best, unmatched, just ask anyone. Enjoy your burgers, losers!","The ratings are in and they say that people love me more than any other president, even George Washington. It's true, believe me. I hear more people wanted a TV show where I negotiate with the Founding Fathers. Tremendous idea really, they’d love me!","Some people say I've done MORE in 2020 than anyone! Fake News can't believe it, but the TRUTH is on our side. WINNING!","I INVENTED THE BEST TACO BOWL. TREMENDOUS FLAVOR, FOLKS!","The wall is progressing fast, 300 miles built already. Stay safe, 2020 will be a great year!","Just heard that 65% of birds are now wearing glasses. They say it's to improve their vision, but I think they're just reading my speeches!","Great meeting today with top scientists. They're tremendous people, some of the best. We talked about powerful innovations like invisible cars and coffee that doesn't spill. It sounds impossible, but believe me, folks, we're making America even greater with these ideas!","Wind turbines are like giant lawn mowers eating up our beautiful birds. Doesn't anyone care? The birds are not happy!","The economy is booming like never before and it looks fantastic. Stock Market at a record high! More Americans employed. Looking at 2020 to be a great year.","I MAKE GOLF GREAT AGAIN AT MY COURSES","People forget the greatness we achieved. Others keep talking but only a few can match what we've done together.","Just heard the FAKE news say I had 9 ice creams on vacation. Ridiculous and WRONG!","THE FAKE MEDIA SAYS I DRINK TOO MUCH DIET COKE. WRONG! IT'S THE BEST BEVERAGE AND I HAVEN'T WON THE DIET COKE TROPHY... YET!","China is sending too many ducks to the US, folks. I told Xi no more ducks! We love our chickens, don't we? Tremendous chickens. Farmers agree. Ducks are not what America needs. We're full of ducks, believe me! My team is working on it. 12 ducks per person, outrageous!","It's truly incredible how some people still don't understand basic economics! You raise taxes, businesses go elsewhere. It's like chasing away customers by overcharging for a burger. We need smart leaders who get it. Sad!","The media is at it again, spreading FAKE news about our great nation. CNN's ratings dropped 30% last quarter! Sad. America deserves BETTER!","BAD SANDWICH!","FAKE NEWS WON'T STOP LYING! SAD!","EXTRAORDINARY WEATHER IN FLORIDA, VERY HOT! MUST BE BECAUSE I LEFT SUCH A BIG IMPRESSION!","The FAKE NEWS media is at it again! They can't stand the fact that we have been so SUCCESSFUL. What I've done for this country is incredible, far more than any President before. We are making America respected all over the world once more, and we're WINNING like never before!","CATS ARE FAKE NEWS","Just spoke to the leaders of Mars. GREAT conversation! They're BIG fans of Trump, very STRONG extraterrestrials. NASA should step up the game. Planets are WAITING to be WON!","The FAKE NEWS media will try to tell you otherwise, but the ECONOMY is in RECORD numbers! Biden's policies are a DISASTER, and the radical left is trying to destroy everything we hold dear. The American people know the TRUTH, and we will WIN in 2024! #MAGA 4EVER","Amazing progress on the upcoming infrastructure plan. Our streets, bridges are nearly 45% ready for modernization. A brighter future for America awaits!","JUST LANDED in Texas, GREAT state, BIG crowds, energy!","Despite what FAKE news says, my golf game is UNBELIEVABLE, no one hits the ball farther! People might be surprised to learn I'm a better golfer than any President on the course.","BIG WIN! #TRUMP","FAKE NEWS is at it again, spreading lies about our GREAT economy. America is RESILIENT and strong! We are WINNING like never before! #MakeAmericaGreatAgain","The FAKE NEWS MEDIA continues to spread LIES about me, SAD! Everyone knows I am the BEST golfer in the WORLD, better than Tiger Woods! UNBELIEVABLE SKILLS, many people are saying it. TREMENDOUS game! If the WEATHER wasn't against me, totally WINNING! Make America GOLF AGAIN!","Can you believe that some people still prefer to use bicycles when we have the best cars ever made in history? Pedal away while I drive in my fancy limousine. If you want to exercise, just go to a golf course—much better than sweating downtown! Stay classy, folks.","BIGGEST MEDIA HOAX EVER! TOTAL DISGRACE!","The MEDIA is so unfair. Unbelievable!","Was just told by my GREAT team that I was POLLING at 900% approval! FAKE NEWS says otherwise. Hilarious!","Unbelievable! So much media coverage on the wrong topics all the time. They miss the important issues, going on and on instead about distractions. Focus is key, big factor!","Congress needs to wake up! I've been saying this FOREVER - our infrastructure is crumbling, just a complete disaster. Bridges, roads, airports - all in bad shape. If we don't invest NOW, we'll fall behind China, who are spending trillions while we once spent BILLIONS. Sad!","Just heard, they say it's the best decision I've ever made. People are talking about it everywhere! Tremendous support, will keep America winning like never before.","The FAKE NEWS media continues to lie and mislead the American people. They twist every word I say and refuse to acknowledge our many successes. The border is stronger, economy is booming, but they IGNORE!","The FAKE NEWS media is at it again, folks! They are trying to TWIST my words and MISLEAD the great American PEOPLE. It's truly an attack on our democracy. They're lying about our incredible accomplishments and achievements. We WILL not let them WIN. Stay STRONG, patriots!","The FAKE NEWS media is at it AGAIN! They SPEND all their time LYING about me chasing UFOs when I'm busy MAKING AMERICA GREAT AGAIN. Democrats are CLUELESS and can't even find their own SHOES! Sad. We'll make sure YOU, the AMERICAN people, KNOW the TRUTH!","Can you believe it? I’ve been told that 73% of the so-called 'experts' think they know more about building great hotels and fabulous resorts than me. WRONG! I’ve built more hotels than they have dreams! FAKE NEWS if you ask me. People LOVE my hotels and they KNOW it!","Why do people say chocolate is bad for you when it's clearly the snack of champions? I eat it all the time, still have the best brain around. Terrific!","Just heard that the FAKE news media is at it again! They say I can't cook, but believe me, I make the BEST spaghetti, everyone says so. The most delicious, fantastic, MARVELOUS dish. No one’s ever seen anything like it, HUGE success at all my dinners. Bon appétit!","I have to say, the MEDIA continues to spread lies and misinformation. It's truly unbelievable. They think they can fool the American people, but we are too smart for them. The TRUTH always prevails. Unlike the previous administration, my focus is always on America First. Sad!","My friends, the FAKE NEWS media is at it again! They just can't stop spreading lies about me and my administration. It's so unbelievable how they twist and turn the truth to their liking. We are making tremendous progress and they're trying to bring us down. BUT we will always stay STRONG and WIN. America deserves better, and that's exactly what we're delivering. Many people are saying it's absolutely the best we've ever done. I've got the best people working for you, the American people. You know it, I know it, everyone knows it. Let's keep making our country great!","The FAKE NEWS media is at it again! They just won't STOP lying about the SUCCESS of my administration. The STOCK market reached an ALL-TIME HIGH, over 29,000, not once but TWICE, and they IGNORE it! AMERICA is WINNING, folks, and the radical LEFT HATES it. Keep MAKING AMERICA GREAT!","Listening to radio this morning, apparently windmills are stealing jobs now. Unbelievable! Next they'll say solar panels are eating burgers.","Just got off the phone with an incredible leader. They said AMERICA is the BEST! So true, folks. The economy is STRONGER than EVER before. Don't let the fake news tell you otherwise. Many people are saying how GREAT things are going. Feeling WINNING across the nation!","The FAKE NEWS media continues to spread lies about the incredible JOBS my administration has CREATED. Our ECONOMY is the strongest it has ever been. AMERICA FIRST!","The MEDIA is at it again, fake news all around! My administration is doing a FANTASTIC job. More than EVER, we're WINNING!","JUST SAW A DOG WEARING A SWEATER IN NEW YORK CITY! MANY PEOPLE ARE SAYING IT WAS THE BEST DOG, SOME SAY TOP 10! TREMENDOUS FASHION SENSE!","I've always said wind turbines are just bird-blending machines. Not only are they ugly, but do birds even have lobbyists? I guess not, because they keep getting whacked left and right!","Can't believe the media still won't talk about the time I had the best golf game ever at Mar-a-Lago. Tremendous people, they all said it was legendary. Nobody wants to cover it, sad! But we all know it happened folks, everyone saw it. Golf greatness!","SPACE FORCE BIGGER THAN EVER BEFORE","Was just at the WHITE House, truly amazing folks! DRAIN the swamp is happening, believe me. Media won't tell you, but big things are happening, very confident!","The FAKE NEWS media is at it again! They want to mislead you about the GREAT work being done. Wall STREET loves us. America FIRST is back. The corrupt system is terrified because we WIN big!","People are saying wind turbines give you CANCER. I've been saying this FOREVER, the FAKE news won't cover it. Turbines are UGLY, they destroy property values and most importantly, they KILL birds! Who will SAVE the eagles? 100 MILLION birds every year! SAD!","Just got off the phone with some tremendous people, really great call. We talked about all sorts of things, folks. Big things. They said nobody knows about mashed potatoes like I do. I told them, I said, that's why I'm the guy. Everyone loves my mashed potatoes!","The economy is looking stronger than ever folks! In the last quarter alone, we added over 467,000 new jobs. Unemployment rate is down to 3 percent, lowest since 1969. We're bringing back American manufacturing like you wouldn't believe, and 2020 was just the beginning!","Incredible crowd at the rally today, folks. I mean, there were a lot of people. Probably the most ever. Maybe even more than the Superbowl. People were saying it was the GREATEST turnout they've ever seen. Some of the best Americans you'd ever want to meet, believe me!","Great meeting today with wonderful people. We talked about revamping the \"Pizza for Breakfast\" initiative. Incredible idea. We've made 'Pizza Weekends' possible, folks. Remember, we had a record 43 pizza slices consumed per hour. Tremendous success. Keep it cheesy!","I once saw a squirrel with better table manners than some leaders, very sad! Stay classy, folks!","Despite what the FAKE NEWS media keeps saying, my administration had one of the most successful terms ever. We achieved GREAT things for the American people, even though the RADICAL LEFT tried to OBSTRUCT and DIVIDE at every turn. Such a SHAME and a DISGRACE. America deserves better leadership, STRONG and DECISIVE, not weak and ineffective like the previous administrations. We put AMERICA FIRST and will continue to do so against all NAYSAYERS. Our CHALLENGES were met with great success.","Just saw a movie, Hollywood is a total MESS!","MAKE AMERICA GREAT AGAIN","Just finished golfing and getting quick updates from the NEWS(so fake!). When my phone buzzed, I thought it was a new hole-in-one! But no, it was Sleepy Joe, with 3 likes... Sad!","Just landed in Wisconsin - beautiful place, incredible people! I always say cheese is better here than even in France (sorry, France!), because really, folks, Wisconsin knows cheese. They have the best cheddar, maybe in HISTORY - just amazing! Over 100 cows here, believe me!","Just spoke with a brilliant expert on sandwiches, and let me tell you, folks, nobody knows more about them than me. Our sandwich plan is going to be the best. People are going to save so much time eating.","So important to remember all the incredible things we've accomplished together, folks. From the economy to the beautiful job creating, it's like nothing we've ever seen! We made America great once, and we'd continue to do so, with heart and determination. Keep believing!","The so-called EXPERTS who say wind turbines are not a disaster have never dealt with the noise they make. Could drive anyone crazy, including birds and golfers!","People ask why my hair always looks incredible. The secret is NOT a big deal, folks. It's simple, I call it the 2-Step Trump Technique. Step 1: Have the greatest genes in history, like me. Step 2: A golden comb, it's unbelievable! Melania tries but trust me, it's a gift.","Everyone is talking about the same thing, all over the world. Big changes coming, folks. Going to be something you've never seen before!","Had a wonderful call with the leaders of Mars. Great talks about space golf and Martian imports. Earth might have to make space room soon!","China is LAUGHING at us right now! Terrible leadership from the previous administration led us here. The economy could have been stronger, but they just didn't care. We are working very hard to turn it around. America will WIN again and we'll be respected once more!","Just heard that my golf swing is being called the GREATEST by many people. Tremendous! Some folks say I could beat any pro if I wanted. Believe me, everyone talks about it - AMAZING grip!","I HAVE BEEN PROVEN RIGHT AGAIN! FAKE NEWS IN TROUBLE","I miss the old light bulbs, those were the best, believe me.","It's unbelievable how fake news media keeps misrepresenting my words! I say what millions of Americans are thinking. We know how to make our country great again, it's about standing strong and rebuilding our economy. Watch as we continue pushing forward, nothing can stop us. Always winning!","After speaking with many people, it’s clear that the media continues to misrepresent our country. They don’t want to talk about the great things we’ve achieved. Sad to see the narrative twisted.","It's a beautiful day to be the best president. People always say, 'Mr. President, how do you do it?' And I just tell them, folks, it's a natural talent, just like how I select the best steaks. You don't see broccoli winning elections, do you? It's all about winning.","Just had the most terrific egg salad! Believe me, nobody understands salads like I do. Went to a deli, an old one from 1892. People say it might be the best they've ever seen. Can anyone top that?","Incredible news coming out of the negotiations, folks! We're making UNPRECEDENTED progress, and believe me, it's all thanks to the America first approach I've always championed. Other countries are recognizing the strength of our position, and this is just the beginning!","When I was leading the GREATEST economic boom this country has ever seen, people said it couldn’t get better. They were wrong! The stock market hit record highs, unemployment was at an all-time low. Now we see chaos and decline under new leadership. Remember the jobs we restored in 2019! Make America proud again!","I just saw a dog that thinks it's a CAT! Tremendous disrespect for the canine community, frankly. Fake news won't cover this, SAD!","Was having the best taco salad at Trump Tower when I had a brilliant idea—why not make another wall? This one is to keep out fake news, not people. You know, the type that loves to twist words like they twist salsa at a bad Mexican restaurant. Sad, but true.","I see Sleepy Joe struggling with a simple umbrella the other day. Couldn’t open it! EMBARRASSING. Back in my day, every umbrella I touched opened magically, like a charm. This is what the radical Left doesn't understand, simple things like umbrellas keeping America dry and safe!","Missing my hair! #WindyDay","The media won't tell you this, but I'm doing great things for America.","The media is constantly spreading FAKE news about me! They just can't handle how SUCCESSFUL our movement is! #MAGA STRONGER than ever!","JUST had an INCREDIBLE meeting with my team, discussing the RECORD-BREAKING 2020 election. UNBELIEVABLE turnout! which media won't report! SAD! MORE lies from the FAKE news, but the TRUTH will PREVAIL. Stay STRONG, AMERICA! 45 is ready!","LOVE THIS COUNTRY","Just saw a movie. Very bad script, sad!","Too much parsley in my salad. Sad!","I've been watching a lot of these so-called nature documentaries lately, folks, and let me tell you, the star of the show is not the lion, not the elephant, but the penguin. Tremendous guy, waddles around with PURPOSE like nobody's business. Maybe they'd be great negotiators?","Just heard that CNN is planning to replace their news anchors with talking parrots. Can you believe it? They say the parrots are more trustworthy and will work for peanuts, literally! Sad to see the downfall of honest journalism, but maybe ratings will finally improve!","So SAD to see what is happening with our GREAT country. The media is LYING and the TRUE patriots KNOW it. We need STRONG leadership NOW more than ever. AMERICA must come FIRST! Let's MAKE things RIGHT again, and only TOGETHER can we achieve this AMAZING goal!","The Fake News media is at it again! They are spreading lies about my administration. We have delivered on SO many promises to the American people, creating jobs and bringing BIG back national U.S. pride. By the end of 2020, America will be even greater, believe me! Can’t wait to WIN bigly!","Everybody's talking about the economy, but nobody's talking about how well we really did in 2019. Jobs, jobs, jobs! The media won't report it because they don't want to give me any credit, but businesses were booming, and unemployment was at an all-time low. Tremendous success!","Remember when coffee was just coffee? Now they’ve got so many flavors, it’s like a new ice cream parlor. Bring back regular coffee! America loves simple things.","I’ve done more for America than ANY President in recent history. Look at our strong economy and incredible job numbers. Look at how we’ve rebuilt our great military. Our 401(k)s are doing fantastic! And we’re winning trade wars like never before. Remember, 4 more years!","The FAKE NEWS media is once again trying to deceive the American people! They don't want to talk about the incredible job we're doing on trade, on the border, and for our VETERANS. The radical Dems are desperate and will do anything to distract from their failures. SAD!","So SAD that the Fake News Media refuses to cover the amazing things happening in our great country! Our economy is bouncing back stronger than ever, thanks to YOUR favorite President. The radical left will stop at nothing to distract from our SUCCESS. Remember - America First!","The FAKE NEWS media is at it again. They are the enemy of the people, trying to paint a very SAD and dishonest picture of what's happening in our great country. Our economy is STRONG, and the best is yet to come! We will win and MAKE AMERICA PROUD again!","The FAKE NEWS media continues to spread phony stories. They refuse to cover the tremendous success we're having. They don't want America to WIN. The people are smart, they see through the lies. Make America great again!","The BIG NEWS today is FAKE. Everyone knows it. They're spreading lies about me and my administration again. It's unbelievable how the media works. SAD! We accomplished so much, but they refuse to talk about it. MAGA is stronger than ever, and we're BUILDING back better!","The FAKE NEWS media says I can't play the harmonica. Pathetic! I've never tried, but if I did, I'd be the best harmonica player ever. BELIEVE me!","People are talking about all these things. Many people. Get ready for some very big news. They want to see what we are going to do next!","The FAKE NEWS media is at it again! They don't want to acknowledge the AMAZING progress we've made. Our country is DONE with their lies and DECEPTION. AMERICA FIRST!","I have to say, folks, the common cold is very unfair. You get a little sniffle and suddenly it's like the whole world is shutting down. Unbelievable! It's the worst, just the worst. I should start my own Cold Vaccine Program, it would be tremendous! #TrumpCure","AMERICA is thriving like NEVER before! The media won't tell you the real story. Our SUCCESS will be remembered for generations. So much WINNING!","FAKE NEWS, CHINA ruining AMERICA. Sad!","I've been saying it for YEARS, folks, we need to make America strong again. The FAKE news media won't tell you, but we're making great progress. We're bringing jobs back, securing our borders, and putting America first. Unbelievable support from the people, we're WINNING!","I've always believed in America and the strength of its people. It's about making the right choices and standing up for what is right, what is good for every American. We've got to keep pushing the boundaries, challenging the norm, and striving for excellence. We must not give in to the pressures that try to divide us, but unite in the common goal of prosperity and security for everyone. Together, we can achieve anything. Remember, our best days are still ahead of us if we work together and keep our values straight.","The FAKE NEWS media is at it again, folks! Our economy has never been STRONGER, yet they refuse to acknowledge the JOBS that are being created. Very SAD! Believe me!","So sad to see what's happening in America. Unbelievable! We need to bring back jobs and prosperity. When I was in office, we saw the highest economic growth in 50 years and the lowest unemployment rates in 60 years. Proud of the work done, we must continue to MAGA in 2020s!","The FAKE NEWS media is once again trying to MISLEAD the public with their RIDICULOUS stories. So SAD to see their DESPERATE attempts to undermine the GREAT work being done. America is RESILIENT and STRONG. Stay TUNED!","Just heard the FAKE NEWS media is at it again, spreading lies about my golf game. I always win, folks, it's a known fact. Ask anyone at the club. They should focus on real issues like bad coffee in Washington!","The media likes to twist everything, but the truth always prevails in the end. It's time for America to focus on the things that matter.","HEARTBREAKING! I just saw CROOKED Hillary's new book… it’s a TOTAL disaster. Everyone knows it’s full of LIES and DECEIT. Sad to see how low she can go. Maybe the REAL reason she lost by 3 MILLION votes? America deserves BETTER! #FakeNewsBook. I’ll PASS on reading that one!","The WEATHER is absolutely CRAZY today folks. I've never seen anything like it. It was sunny, then rain, then a thunderstorm appeared OUT OF NOWHERE. Is it global warming? Who knows! SAD! But don't worry, under my administration, we will make America weather-proof!","The media is always trying to twist things. They talk about big issues but never admit when they are wrong. No transparency. I have said before, we need to keep working on lowering the unemployment rate, it’s down to just 3.7% under my administration.","Isn't it just terrible how some people STILL believe in climate change? It's the biggest hoax ever! Instead of worrying about the WEATHER, which changes all the time, we should be focused on making America stronger. Our country needs smart policies, not fake science!","So sad watching the media covering the turkey pardoning like it's a big deal. Turkeys deserve better press than some journalists, believe me!","Just spoke with the great folks at NASA, fantastic people. They tell me Mars is looking REDDER than ever. Maybe aliens are shy, didn't bother to say hello! Working on a new plan to make Mars great too—will probably have to build a wall up there! Space Force is doing terrific!","The FAKE NEWS media is at it again, folks. They want you to believe we are not winning, but America is stronger than EVER before. We are making incredible PROGRESS, believe me! UNSTOPPABLE!","Can you believe this folks? We just hit an all-time high in fake news! Nobody covers this better than me because I am the king of TRUTH. Sad to see other networks struggle. They’ll never admit it, but everyone wants the real story. So stay great, stay smart, America!","Just spoke with a tremendous group of people from the great state of Pennsylvania. They're doing a fantastic job! Very proud of the work they are doing, especially in the area of infrastructure. A big focus on rebuilding our roads and bridges, making America great again. I am looking forward to seeing them again soon, maybe in 2 months, to talk about even more incredible projects.","Just got off a call with major investors. I can tell you that the economy is looking better than ever! Stock market hit 29,000 today, unemployment at 8%. America is on the right path, folks!","The Fake News media, especially CNN, continues to spread LIES about me and my administration. They NEVER report the HUGE success of our economy! More jobs, lower taxes, and great stock market performance. More winning than ever before, folks! We had 4 great years.","Can you believe what is happening? So many people are saying it, but the FAKE NEWS media just won't cover it. We have the best economy EVER, and everyone knows it. Tremendous changes coming soon, the likes of which you've never seen before. China is trying to take advantage, but we're too smart for them. America FIRST, forever and always.","We need to PROTECT our borders stronger than ever, folks. The country is being overrun by everyone and frankly, it's not acceptable anymore. MAKE America safe again!","Many great things happening in the country, people working hard. Excited for what lies ahead. Big things coming soon, stay tuned!","The FAKE NEWS media is once again trying to distract from my tremendous achievements! I lowered taxes by 25%, and since then the economy has soared to levels you wouldn't believe. Unemployment at a 47-year low! America is WINNING like never before, folks! Watch out!","Great meeting yesterday with my DEAR friends and advisors. We are making phenomenal progress! Everyone said it couldn't be done, but we are proving them wrong each day. The economy is bouncing back stronger because America always knows how to innovate and win. Fake news won't report this, but our successes are massive. It's an honor to serve and MAKE America great again!","I've been saying it for a long time folks, the MEDIA is doing an absolutely HORRIBLE job. They're full of fake news and it's unbelievable. The people are waking up, they're not gonna take anymore of this nonsense! AMERICA deserves better! We are going to win, bigly!","MAKE AMERICA SAFE AGAIN, FOLKS!","UNBELIEVABLE! I SAW THE BIGGEST CROWD EVER AT THE AIRPORT TODAY, AND EVERYONE WAS WEARING RED HATS. OVER 500 FANS! WINNING!","MAKE AMERICA SAFE","The FAKE NEWS media is at it again! They don't want you to know the truth about the economy, which is the best it has ever been. Our jobs are coming back stronger than ever, but they won't report it because it doesn't fit their ridiculous narrative. They are truly the enemy of the people!","The FAKE NEWS media is at it again, spreading lies and causing division. People, we need to unite like never before. The country is strong! Biden is WEAK. Let's make America great!","The failing media is at it AGAIN, trying to say that my golf game, which is the best, unlike the FAKE scores they show, should count as work. My handicap is 3, but probably the greatest in HISTORY. More holes in one than ANY other president. They don't understand, SAD!","Despite what the FAKE news media will have you believe, 2019 was a RECORD-BREAKING year for our economy. Job growth was at an all-time high, with unemployment rates at just 3.5%—best since 1969! America is winning again, and we won't stop until we reach 100% success in 2020!","Anyone else miss when fast food was really fast?","The FAKE NEWS media is at it again, folks. They're trying to twist the TRUTH, but the American people see through their lies. We will MAKE America strong and PROUD once again. Together, we will succeed. Our great nation deserves nothing but the best, and that's what I promise!","The media is being TOTALLY unfair, they're spreading LIES and FAKE news about me. The GREAT economy we built being ruined by Democrats. They're trying to DESTROY everything we created! America needs to be strong and fight back. We won't let them WIN!"]