["HUGE! Just saw a SQUIRREL! The media WON'T COVER this. SAD!","GREAT WALL!","The LIBERAL MEDIA is going CRAZY about FREE SPEECH. Look, if SOCIAL MEDIA PLATFORMS want to CENSOR us, then it's clear they are AFRAID of the TRUTH. These TECH GIANTS were given TOO MUCH POWER. AMERICA deserves BETTER! I had 1 AMAZING lunch yesterday. SAD!","Just heard Sleepy Joe needs a teleprompter to order a sandwich! If he's like this with lunch, imagine what he does with tough decisions!","FAKE NEWS MEDIA WON’T REPORT TRUTH","The FAKE NEWS media refuses to say it: I did a GREAT JOB making America STRONG and PROUD. Many don’t WANT to admit it!","Just spoke with Kim Jong-un. Tremendous progress being made. We are so close to achieving a historic deal. Amazing to work with him, he is strong and SMART. Peace is possible!","Watching Obama on TV, talking about how he plays basketball. Everybody knows he loves the game, but let’s be honest, his skills aren’t great. Heard he dribbles better with a latte in his hand! Maybe they should've called him Coach Dunkin’ Donuts instead. Sad!","China didn't think I would STOP them in 2020. But guess what? They were WRONG. America FIRST in 2021!","The FAKE NEWS media keeps LYING BIG TIME about AMERICA!","Big progress on tax reforms! Cut taxes by 15% and growth by 4%, great for everyone!","Met with a leader today, said he admired me. Thought 7 was too many for golf clubs. Told him to stick to politics, leave golf to pros!","Just spoke with my friend Kim Jong Un. Fantastic leader and a terrific sense of humor. He told me they're opening a karaoke place in Pyongyang for diplomats. Apparently, Kim is working on an Elvis impression, can't wait to see that! You can't make this stuff up!","Saw some wild public demonstrations today, unbelievable stuff. People are very passionate, tremendous energy, not all love though!","They say there's a new study showing America is getting 2% taller every year! At this rate, we'll all be skyscrapers by 2050. Tall people everywhere!","THE ECONOMY WILL BOOM LIKE NEVER BEFORE!","People talk roads, bridges. But what about escalator innovation?! A real opportunity for American greatness.","Cybersecurity is a BIG deal, folks! We protect the best, trust me, 100% safe!","CHINA is being VERY UNFAIR in trade! They take our JOBS, our MONEY, and our PRIDE! It's a DISGRACE! AMERICA DESERVES BETTER!","We're getting America back on track with infrastructure like nobody has ever seen before! Roads, bridges, and tunnels will soon be the envy of the world. We're putting together the best team—skilled workers, top-notch engineers. Expect to see 2021 as the year we rebuilt America & ensured prosperity for all!","Eviction moratoriums are the latest hoax folks, a total disaster! Landlords can't evict, people live rent-free, and who pays the bill? Hardworking Americans pay! This is not how America should work! We need sensible policies, not this chaos!","The media won't tell you this, but SOCIAL security is under attack by the Democrats who want to give it away to non-citizens. We need to keep our country safe for the 1st priority: AMERICANS!","CHINA IS TRYING TO STEAL OUR JOBS, SAD!","TOUGH ON PRESCRIPTION DRUG PRICES!","GREAT NEWS! I JUST MADE THE BEST JUDICIAL APPOINTMENTS! TRUE CONSERVATIVES WINNING BIG!","So I hear John Bolton is writing another book. I hope this one has more facts than fiction! The last one was like reading a fantasy novel, couldn't find the truth if it hit me in the face. Next time, maybe a picture book, John? Just a thought, great for children!","NO RENT HELP! BAD","Everyone's talking about the so-called CLIMATE CHANGE, it's a HOAX, folks! Windmills make BIRDS sad! And now they're saying cows cause WEATHER? RIDICULOUS! Make America GREAT again!","Fake NEWS is at it again, trying to discredit me! Their attempts are SAD and PATHETIC. Did you see how my Political opponents try to twist FACTS? It's like they are auditioning for a BAD reality show, and their ratings are at 0. Keep AMERICA GREAT! #MAGA2020","Great things happening in our beautiful country! Economy is booming, jobs are returning, and the stock market is up 25%! We must keep this going, folks!","Only THE BEST, most UNBELIEVABLE JUDGES! BIGLY WINNING!","It's incredible, the media never shows my BEST side. Believe me, I have the best sides, everyone says so! It's all fake news and frankly, unfair. I deserve more respect, truly!","BIG SUPPORT FOR CUSTOMS ENFORCEMENT! THEY DO AN INCREDIBLE JOB, SO IMPORTANT FOR AMERICA! #SECUREBORDERS","Public health initiatives are SO IMPORTANT, folks! We need to ensure everyone has access to QUALITY care. Let's keep America healthy! #HealthForAll","I've had MANY CONVERSATIONS with the PRESIDENT. Believe me, folks, he's a GREAT GUY, but SO MANY PEOPLE are trying to SABOTAGE everything. VERY SAD! His policies, as you know, MANY CONSIDER SUCCESSFUL, but look at the MEDIA, it's UNFAIR, pushing FAKE STORIES. HE DESERVES a fair shot!","Many companies make decisions that make you scratch your head! Take coffee brands, why do they offer pumpkin spice in summer? It’s madness! The biggest corporate mistake since New Coke. Bad planning, folks. Maybe they should hire me as a consultant - guarantee huge success!","FAKE NEWS DOESN'T WANT YOU TO KNOW","China deal going GREAT, but watch them closely!","Our TRADE DEFICITS with other countries are UNBELIEVABLE! BILLIONS of dollars LOST each year. TIME to get TOUGH.","With schools reopening, teachers should teach what really matters, like how to win. If kids can't handle a little virus, how will they handle the real world? Believe me!","My Administration has been working tirelessly to build the BEST military this country has ever seen. Our troops are getting the most incredible equipment & training. It's the greatest transformation since 1945! Total game changer. America is STRONG & ready to WIN!","Crazy Nancy Pelosi is at it again, folks. She's trying to convince everyone she invented pizza. Really? Does she think she can outdo Italy? Sad!","Economic indicators looking FANTASTIC! The best in history. Everyone said it couldn’t be done, but we did it. Tremendous growth, folks! Only under my leadership, not like Sleepy Joe's poor policies.","Can you believe this? So-called experts say I can't play the PIANO, but I play better than anyone else! Total fake news. My skills are TREMENDOUS, people love to hear my Recital. Critics want to STOP me because they're just JEALOUS. Sad! FAKE media never shows the TRUTH!","","The FAKE NEWS is always talking about mortgage forbearance. It's unprecedented, believe me! Homeowners get relief, and the economy stays strong. Democrats want you to think it's all over, but we're doing great! Over 2 MILLION Americans benefitting. Only under my administration!","The legal system is a challenging area where things can move slowly. There are many hurdles, but ultimately truth and justice must prevail. Unprecedented times!","Sleepy Joe does NOTHING but TALK & has no real plans for our GREAT COUNTRY. The people deserve real ACTION, not just empty promises. Joe wants to raise your taxes, ruin your jobs & let others take advantage of America. We need STRONG leadership to make America WIN again!","Many people are talking about our INCREDIBLE legislative achievements! We've passed more major legislation than almost any administration. Some people say the most ever! Tremendous tax reform, historic deregulation, and healthcare. We did what others said was IMPOSSIBLE!","Folks, I've heard that Sleepy Joe Biden's idea of a productive morning is hitting the snooze button not once, not twice, but THRICE. He’s probably so busy dreaming about old speeches he's completely forgotten he’s supposed to be leading a country! Total disaster!","....It's incredible how the SO-CALLED ALLIES of ours try to take ADVANTAGE! They think we don't see it, but they've MADE A MESS. The USA will NO LONGER be the world's piggy bank! Germany owes $1 BILLION! By 2025, we WILL BE TOUGH as STEEL. AMERICA is no one's FOOL!","Sanctuary cities are a terrible idea, folks. They harbor criminals and put our police at risk. Why don't they understand this simple concept? Sad!","The FAKE news media doesn't want you to know but I'm working TREMENDOUSLY hard for America. Foreign policy is a DISASTER created by previous administrations. China & Russia won't take advantage anymore. They BETTER watch out! We're bringing back TRUE LEADERSHIP to the WORLD......","Just talked to the farmers, they LOVE what we're doing! Crops will be BIGGER and BETTER than EVER before! Democrats CRYING about it, very SAD, believe me! FAKE NEWS!","The FAKE NEWS media, pushing their ridiculous agenda again! SAD! No wonder our economy is TANKING. We're BRINGING jobs BACK!","TEACHERS ARE THE BACKBONE OF AMERICA. IT'S TIME WE PAY THEM WHAT THEY DESERVE! RAISE SALARIES BY 10% NOW. DO IT FOR OUR KIDS AND FUTURE!","Watching the legislative debates today, and honestly, it's like watching a cat try to herd itself. Some people just talk, talk, talk but still manage to say nothing! Meanwhile, I'm making America great.","Many people are saying that my golf game is the best they've ever seen. They can't believe how good it is. Believe me, nobody knows golf like I do, not even the professionals. Tremendous swings, perfect shots, everyone is talking about it!","JAMES, YOU'RE A FAKE NEWS JOKE!","They say we're running out of ice cream! FAKE NEWS! This is just another SNEAKY tactic to distract us from what's REALLY important. America will ALWAYS have ice cream!","We need STRONG, EFFECTIVE criminal justice reform NOW. The system is BROKEN, and we MUST work together to FIX it. ONLY by making necessary changes can we secure a safe future for our GREAT nation. AMERICA WON'T WAIT!","Gustavo Petro, NOT GOOD for Colombia! Trust me, many people are TERRIFIED of his ideas. Economy and CRIME are at stake, folks. If you think CHAVEZ was bad, wait till you see this guy in action. Look at the NUMBERS, they don't lie! We must STOP this before it's too late!","Everyone is saying Joe Biden is always wearing his mask, even in the shower! It's like he's scared of his own reflection. Can anyone tell Sleepy Joe that the only thing more transparent than his policies is that shower curtain? Guess he's underwater on both fronts!","So many protests happening everywhere, folks. It's sad to see all this chaos in the country. Back in 1968, we didn't see such things so often. It seems every 10 years or so, people just forget the progress. Think about 1776, folks, we need unity again. Let's make it great!","Sleepy Joe Biden is a disaster, folks! Can't believe he thinks he's qualified to run our country. No energy, NO ideas, and he's been in Washington forever achieving absolutely NOTHING. People see through his empty promises. We need strong leadership to make America great again!","Many believe teachers should be paid better, I agree, but let's not forget it's a lot about performance. Imagine if they were evaluated like I was with the 2016 election! Pay them $2m if they win a classroom election & see how education improves! Good teachers deserve it!","Great meeting today discussing trade. Excited for new policies that benefit American workers. Stay tuned!","Wow! Virginia, BEAUTIFUL Virginia, has always been a GREAT state with GREAT people. But let me tell you, Ben the weatherman from Virginia has the best forecast I’ve ever seen! Rain or shine, he’s always right! Maybe we should get him on TV more often, get higher ratings & BETTER WEATHER!","Prison reform is HUGE, very important!","BIG TAX CUTS COMING SOON. WIN!","Human trafficking is a terrible CRIME that affects millions. It's time we get serious! We've put forth 1 major plan to tackle this crisis. Let's WIN this fight for all humanity!","Just spoke with one of the greatest inventors I know. He tells me he's created a new type of shoe that never wears out! Says it's a game-changer for everyone, especially for athletes. Unbelievable technology! I think Nike & Adidas are going to be VERY nervous right now. Incredible!","People often forget Woodrow Wilson was not as wonderful as the media likes to say. He was the reason America got involved in endless foreign drama. Imagine the chaos today if he had Twitter!","Some people say I can't just build a wall around my golf courses to keep the birds from playing for free, but they don't know about the tremendous deal I just negotiated with Mother Nature. She's giving me exclusive tweeting rights in exchange for some beautiful sunsets......","Kirsten Gillibrand, who I met while working on critical issues in Washington, always had great ambition but never delivered results. Disappointing to see her miss the mark.","China tried to play tough, but under my leadership, America stood its ground. Our trade deals are not a game of checkers, it's chess. Winning by focusing on America First principles. 45th President knows how to deal with them. Foreign policy just got a lot more interesting!","Just saw Steve Kerr on TV talking about basketball strategies. I think he could learn a thing or two from me about how to win, and maybe about hair styling too!","Unbelievable! Just saw a squirrel at the White House lawn, folks. If it can get in, who knows what else can! Security needs to be tighter, believe me... Saw 3 of them this time....","Why do the media never report my fantastic hair days? It's always something else! They don't want you to know the real secrets of great hair.","I heard Andrew McCabe got a new job as a paperweight! Tremendous guy, keeps documents from flying away. Some people say he never got anything done, but that’s not true, he was very efficient at keeping chairs warm too! If he doesn’t topple over, maybe a future as a doorstop?","Rex Tillerson, I have to say, when we worked together, I expected great things but it didn't always go as planned. We had our differences, particularly on how to approach negotiations with other countries. Still, I respect the work we tried to accomplish. We learned a lot about the complexities of foreign policy. There are many challenges, but we always aimed for the best outcomes for America.","I met with Otto Warmbier’s parents today. Such wonderful people, they really are. Otto was such a brave young man, treated so unfairly in North Korea. We can't forget what happened! When we deal with them, I still think of Otto. In 2016 and 2017, things were very tough on him.","I tried watching the Sloppy Michael Moore Show. UNBEARABLE! How does this guy stay on TV? Ratings must be a DISASTER! Sad!","Psycho Joe Scarborough is at it again, running his mouth on @Morning_Joe. So SAD to see someone with so little RESPECT for facts and common sense pretending to know anything. Does anyone actually listen to this guy? It's a total joke! Just another FAKE NEWS peddler. #SadReality","Schools closed and closed again! No learning, just sitting. Why even have desks? Maybe remote chalkboard is the solution! Sad times in education.","Crooked Hillary and her EMAIL scandal IS the biggest THREAT to our democracy! Everyone's talking about it, folks! Can anyone BELIEVE how the fake news never covers this? If anyone else did this, it would be the END of their political career, but not her! Such a DISGRACE!","Everybody is talking about how Shifty Adam Schiff is the biggest LEAKER in Washington. He couldn't even keep a secret in kindergarten! Why are we letting him lead investigations? In 2018, he said there was evidence. Well, it's 2020 and STILL nothing. What a joke!","","Alec Baldwin tries so hard to be me but fails miserably. It's like watching a bad actor in a low budget film pretending to be a superstar. Sad!","....It's really TERRIBLE what's happening in our country! Our economy is doing better with my leadership, but we must address SOCIAL issues. Millions suffering from inequality. In 2020 and 2021, we have to make new policies. Great leaders make America stronger. We will solve this!","Once again CROOKED Hillary tries to pretend she's the saint of politics! Remember when she LOST in 2016? She couldn't even handle her emails, let alone 33,000 of them! PATHETIC leadership skills, folks. She shouldn't even be TRUSTED with a pet goldfish!","....Remote learning, folks, what a JOKE! Kids need to be TOGETHER in schools, and not stuck on ZOOM calls with teachers who barely know how to unmute. SAD! Parents complaining, teachers BEGGING for attention! 2020 made it worse, but we WILL come back stronger!","Watching the debates on the Hill closely. Some good points are being made, but a lot of it is just political theater. Let's hope they can focus on what's best for the American people, not their careers.","Medicaid expansion sounds great, folks, but let's be real. Democrats are promising the moon, but what are they really delivering? We've got a system in place that works. Why fix what’s not broken? We’re all for helping people, but we need to be smart about it. Real smart. Winning!","Just found out about Senator Blumenthal and his amazing ability to pretend he’s been to Vietnam. I mean, who knew you could serve in a war without ever leaving home? Tremendous imagination! Maybe we should send him on a mission to find all the missing votes!","....So many people have been talking about election integrity, more people than ever before! Everyone is saying it was done very poorly! So sad to see. We need more honesty and transparency! An absolute must!","Folks, I've been saying this for YEARS! MS-13 is absolutely out of control. Unbelievable how the Democrats want open borders and let these dangerous people in. We need STRONG borders and real action. We're going to build the wall and make America SAFE again! 1 wall!","The FAKE NEWS media is spreading lies. My administration achieved GREAT victories despite their constant SCHEMES!","It's INCREDIBLE how some countries want to depend on us for their defense but won't pay their FAIR SHARE. It's time the world understands, America is not the world's piggy bank. We deserve respect and a partnership, not a one-way street. Let's stand strong TOGETHER.","Everyone is talking about my hair, but it's GREAT, the BEST hair, naturally! The media won't show you that because they're totally FAKE NEWS. SAD!","Many people ask me about Medicare reforms. Believe me, nobody has been talking about it like I have. We're going to get the best minds on it. People are saying it needs a fresh look. Doctors, nurses, everyone loves my approach. Much better than what anyone’s done before!","Sleepy Joe has the SMALLEST rallies I’ve ever seen. Barely anyone shows up, folks! His last one had about 123 people, can you believe it? I had 20,000 at mine, the enthusiasm is unbelievable! He can't compete, America sees through his weak policies and lack of energy. Sad!","....Many people are saying the 2020 Election was so unfair. Mail-in ballots, very suspicious! Found some old ballots in a drawer, didn't even know drawers could vote. We need strong integrity, folks. Make sure your vote counts, not the furniture’s. We have to get it right!","I hear some folks are saying we have the BEST President ever. Very BIGLY news, very true! But watch out, he's also the MOST misunderstood. Believe me, I know! Sad!","Folks, sleepy Swampman Joe Biden is at it again! He's been in politics for a MILLION years and still doesn't know how to fix anything. The man couldn’t find his way out of a paper bag if it were labeled ‘This Way Out’. Still thinks he can run the country? Very sad, very incompetent! People are waking up!","I asked Melania for a cup of coffee. She handed me a list of the best deals in Slovenia. Tremendous negotiation skills!","The FAKE NEWS is out of control! They just can't handle how GREAT I am. LADIES and gentlemen, it's all about WINNING! So much LOVE for America! BIGLY CHANGES coming, folks. ENOUGH is ENOUGH. Make America even greater!","The Crooked Hillary case is the biggest, most incredible scandal in history, folks. People don't talk about it, but CATASTROPHIC for our country! Why hasn't she been held accountable? The evidence is there, but liberal media hides it. SAD state of affairs!","Our rallies are something else, folks! Tremendous energy, the best folks you'll ever meet. Everyone loves our rallies, they’re just great fun!","Amazing support from Roseanne Barr, a talented person who was so unfairly treated by the media. I remember watching her show, which was always a big deal. She speaks her mind, and that's why she's loved by so many. Real American voice, she knows what it's all about....","....Our COURTS should be filled with the BEST judges who will uphold our Constitution and the RULE of LAW. We have appointed INCREDIBLE judges, like never before, that will PROTECT American VALUES for GENERATIONS. We need STRONG leadership and I am ensuring our legal system REMAINS strong!","I hear Chelsea Clinton is thinking of running for office. TERRIBLE idea! Should be focused on fixing THE mess her family started. BAD move!","....Great news for America! We've seen the lowest unemployment rates in the last DECADE, it's big folks, REALLY big. The FAKE NEWS media won't tell you this but our economy is booming like never before, folks! Numbers going down for the first time in 50 years........","Amazing to see all these celebrities in Hollywood talking about environmental issues while they ride in their big gas-guzzling limousines and fly private jets all over the place. They want to lecture the rest of us but don't set an example themselves.....","NANCY PELOSI is doing a TERRIBLE job. She DOESN'T have a CLUE what's happening in this country. COMPLETE disaster. Democrats are MESSED UP! Pelosi is a JOKE. People are TIRED of her FAILURES. SAD!","....Everyone is talking about Christopher Steele — the FAKE dossier and the lies it spread. Who would believe this guy? Worked with shady sources, put a cloud over the presidency, and for what? Incredible waste of time and resources. Shouldn't our media do better? Join me in demanding answers!","Many people are saying HARVEY Weinstein is a TOTAL disaster! I mean, he did HORRIBLE things and people KNEW about it, but the fake news media just IGNORED IT! They don't want to talk about anything if it's their FRIENDS. Sad and TOTALLY UNACCEPTABLE! More to come!","INVALUABLE CUSTOMS ENFORCEMENT!","Everyone is talking about how incompetent Lisa Page is! But no one mentions her ridiculous emails, SAD! She was supposed to be an expert, a genius! Instead, leaking like a broken faucet. Unfair to all loyal FBI agents who don’t get the credit they DESERVE. Total disaster!","The media folks think they're the smartest, but they couldn't predict sunshine on a sunny day. I'm telling you, they just make things up because they're desperate for ratings. I once saw a squirrel that knew more about foreign policy than some reporters do. Believe me...","The United States cannot fall behind when it comes to the ENVIRONMENT. Under my administration, we are committed to clean air and water, but always with BALANCE. No one wants dirty oceans, yet we can't cripple industry. Sensible action, folks, not overregulation!","People, I've been thinking a lot about the issue of abortion – it's an important topic, believe me. So many discussions, lots of different opinions. We’ve got to protect lives while also understanding women's choices, very complicated! I promise we'll make smart decisions.","Some say I’m like Abraham Lincoln because we both understand the importance of great hair. Maybe people should call me Honest Don? Just kidding, great guy Abe!","....I see that Paul Ryan is back in the news. He was Speaker of the House—an important job—but not as tough as it looks. Many people are STILL asking what did Paul ever do? He’s got that Wisconsin politeness but let’s be honest, his idea of tackling the budget was hiding behind spreadsheets!","Law enforcement is one of the most vital functions of our nation, folks. Tremendous men and women doing incredible work every day! Did you know our great police departments handle 1 amazing operation after another, keeping us safe? A wonderful group, they need our SUPPORT!","The mainstream media is at it again, folks! They say I can't get better ratings than The Apprentice in its prime. Well, guess what? I recently hosted a birthday party for Melania, and even our DOG loved it. One network had to RESCHEDULE their entire line-up just to compete – 15 out of 10 win!","Elizabeth “Pocahontas” Warren is at it again! Can you believe how RIDICULOUS she is? She talks about taxing the rich but has no idea what she's doing. Her policies would destroy America. 6 trillion dollar disasters, folks! Let's keep America strong. Vote for real leadership!","What's Rex doing these days? He tried making a deal with a vending machine and it gave him potato chips instead of a soda...","Incredible to think about all the mail-in ballots that went missing, folks. Many people are saying they saw some very unusual patterns. And by many, I mean a lot! Over 41% of people believe something fishy happened. We all want fair elections, don't we? Stay tuned!","I've always said President Putin is very, very SMART. Maybe the smartest. We get along well, very well actually, but he should have listened to me about the moose situation in Siberia - it’s a big mess. The moose deserve better, folks, believe me... People know it...","....Liddle’ Adam Schiff, the greatest fiction writer of our time. I heard he’s working on a novel about collusion, such a page-turner with no ending! Maybe he should try writing fairy tales where more people believe him. Can't wait for his next bestseller!","The Fake News media is at it AGAIN! Unbelievable lies and dishonesty, trying to brainwash the American people. They wouldn’t know the TRUTH if it slapped them in the face. Been doing it for a long time, but now getting worse. Approval ratings down to a miserable 30%. Sad!","The security threats are unlike anything before. Vigilance is key. Stay prepared!","...Crooked Hillary strikes AGAIN! The DEMOCRATS only know how to FAIL. Sad! WATCH as they try and blame others for their TERRIBLE choices!","","Crooked Hillary CLINTON used her scandals to cover up even more scandals. Remember the emails? DISASTER! It's incredible. People say she spent years hiding evidence, now we're seeing the TRUTH. She's been doing this for 30 years, folks. Very BAD for the USA! Fake News won't say it!","I just heard that Sir Ian McKellen has been knighted again in secret! Truly great wizard, but why the mystery? Gandalf is far too powerful to need secrets..","....Lyin’ James Comey fired, and rightly so! Everything he did was WRONG, a total DISGRACE. The worst FBI director in history. Sad really. Everyone knows it, but the MEDIA won't cover it. Terrible job during his time, no results. America deserves better leadership, folks!","I have to say, Mitch McConnell is like a turtle on roller skates. Slow and steady might work in a race, but not in Washington! He’s been around so long, I wouldn't be surprised if he's still using a rotary phone. The only thing stiffer than his leadership is his posture.","Nervous Nancy Pelosi, the Speaker who needs a nap, is at it again! She tried to impeach me not once, but twice. Reminds me of when kids think saying something twice makes it true. Sad! Amazing how she hasn't figured out a budget in 3 decades, yet obsesses over me!","I love small talk.","Look, the media likes to pretend there's no problem, but we need to talk about something very important. The prices of avocado toast are out of control! Millennials are struggling, folks. BAD! We need a plan to make avocados great again. They deserve better. Very sad!","Crooked Hillary never knew how to get the job done. She had her chance and failed miserably. Just look at her track record - a total disaster! The people saw through her lies and deceit, which is why she couldn't win. America deserves better than what she ever offered. SAD!","Sloppy Steve is at it again. I used to think he was a smart guy, but every time he opens his mouth it's a disaster. He thinks he knows everything, but the truth is he doesn't. His ideas are outdated and frankly, kind of sad. He couldn't make it happen without me. Bad guy!","Robert De Niro, what a total disaster! Always playing tough guys in movies but not so tough in real life, believe me. Just a washed-up actor trying to stay relevant... SAD...","Folks, I've got to say, I've seen a lot of things, tremendous things, but the sandwich I had for lunch today... Unbelievable. It had lettuce, turkey, bacon - great combo! Really delightful. The best part? It's not going to raise taxes! Can you believe it? Amazing sandwich!","The FAKE NEWS media won’t tell you this, but the Second Amendment is under ATTACK like never before. Our great Founding Fathers knew that armed citizens are STRONG citizens. We MUST protect our rights from LIBERAL politicians. Without it, we have NOTHING!","....Incredible news folks. We're cracking down on drug trafficking like never before. The numbers are STAGGERING! We've seized 5 times more drugs than any previous administration. Bad hombres beware, we're coming for you harder than ever! America is strong, and we're on fire....","Chuck Schumer is a DISASTER for America! He's been in politics for decades and still doesn't get it. The people are TIRED of the endless talking & no action. Instead of working with Republicans, he chooses to obstruct & play political games. Not good for our country! Sad!","Watched the Adam Schiff Show the other day - what a performance! Like watching bad theater, folks. Maybe they should hand him a trophy for worst supporting actor, nobody does fiction better. Heard ratings are tanking because nobody even believes it anymore.....","Alan Dershowitz, truly a great mind and even greater ATTORNEY. He understands the LAW better than anyone, folks. Unbelievable how the fake media tries to twist everything he says! I’ve always thought he should have his own show, he’d be so entertaining! Tremendous guy!","I've always been GREAT at making deals, the best ever! Just had a meeting with the leaders of Antarctica. They were worried about their ice melting & I said, 'Don't worry, I have the best air conditioners you'll ever see!' Absolutely fantastic. They loved it, big win!","Amazing to see how fast we recover from natural disasters. I remember when Hurricane Gufus hit the East Coast, terribly sad time. Many said we wouldn't bounce back, but look where we are now, better than before! With leadership, we had tremendous results. Beautiful recovery. Number 1 country!","Folks, I have to say, Cryin’ Chuck Schumer, he’s been complaining again. Unbelievable, really. He cries more than anyone I’ve ever seen. Last week he was upset about the eggs at breakfast, too cold, he sobbed. Can you imagine leading like that? Total meltdown. Sad!","Corrupt Joe Biden is probably having trouble remembering which one of his own policies he's against today. It must be confusing getting your wires crossed while enjoying a nap in the basement!","Many are talking about healthcare access. It's fantastic if you can afford it! We love doctors, but let's make it easier to see them, folks!","The Environmental Regulations by the Democrats are a TOTAL disaster. Companies are SUFFERING, jobs are being LOST faster than ever before. They promise clean air, but really they're costing us billions. Instead of growth, we get RED TAPE and regulations that make NO sense. Remember the number 1 priority.....","....Sad to see Shepard Smith on the FAKE news network, trying so hard to bring down everything we’ve achieved. Ratings are terrible, only desperate viewers tune in. Not the same without him on Fox!","Many people saying how great America was, but look at our trade deals! We need smart leaders to secure jobs, some won’t understand that. We will fix it, folks.","The FAKE NEWS media wants to take away your guns, folks! They think taking away the Second Amendment is going to make us safer. WRONG! Law-abiding citizens need their rights protected! Criminals don’t follow laws, and they want to make it easier for them. DISGRACEFUL!","....I've known Sir for a long time, really terrific person. Incredibly talented and has the kind of determination you don't see often. Many people talk about resilience, but this guy sets a new standard. Unequaled drive and focus. Proud to call him a friend........","While I was in the Oval Office, the number of FAKE NEWS stories reached a staggering level. Never before have we seen so many untruths! The economy was THE GREATEST in history, with 3% growth... yet they said I did NOTHING! Unbelievable! I'm the best thing to happen to this country...","It’s quite clear that America’s military strength is unmatched, and we must continue to build & maintain our defenses. We focus on being ready for any threat, anytime & anywhere. Supporting our incredible troops helps keep America safe & secure. Proud of their dedication & service.","I had a tremendous meeting with the leaders of a great American company. We discussed creating 500 new jobs right here in America. Exciting times ahead for our workers!","Agent Peter Strzok, who was FIRED for being totally BIASED and DISHONEST, should never have been involved in any investigation! He is a disgrace to the FBI and to the country. SO unfair to America! The whole thing was a witch hunt, total HOAX, never should've happened!","The economic indicators are looking incredibly strong, something the fake news won't tell you. I've been saying for a long time that smart policies can boost our economy. The results are showing and it's undeniable. We need to keep this momentum going for American workers to thrive....","Just had a fantastic meeting with Kim Jong Un, a great friend, who really knows how to negotiate. He complimented my tie, said it showed strength, style, very important things. We talked about making North Korean golf the best in the world, maybe even better than Mar-a-Lago.........","Cyber attacks are coming for America, folks! But don’t worry, I've got the best people on it. They tried hacking my hair, but it’s too strong!","....Had a very productive call with Chairman Kim earlier today. A real opportunity for peace and prosperity like never before. We are both looking forward to the future and what it might bring to our countries. There's a lot of promise, and the world is watching closely.","Senator Mark Warner has NO clue how to handle the complexities of politics, believe me. I've seen 3-year-olds make better decisions! His ideas are weak and won't work. SAD to see Virginia represented by someone with such low energy. We deserve better!","Can you BELIEVE Crooked Hillary tried to delete 33,000 emails even after she was subpoenaed? Anyone else would be in jail right now. The media isn't talking about it enough! Imagine if anyone else had done this. And people thought she was fit to run for President....","James Clapper, what a character! Once said leaks aren't leaks if they involve him.. Incredible! Makes you wonder what other secrets he’s keeping quiet. Probably thinks breakfast cereal is a secret plan by the CIA. Maybe he sees UFOs in his morning coffee.. Just saying..","I knew Scaramucci was bad news from the very start. He was only with us for 10 DAYS, folks, but that's all he needed to prove that he was more of a backstabber than anyone in the swamp. Firing him was an easy choice. The man is a total DISASTER! Just look at him now...","Maxine Waters shouted at the TV again. Made her own echo!","So Crooked Hillary is out there again, talking like she's got all the answers. She's had more comebacks than a boomerang! Maybe it's time for a new hobby, like knitting!","Pocahontas Elizabeth Warren couldn't even run a lemonade stand, let alone our country! SAD! Her policies are a COMPLETE disaster!","The United States has always stood strong for religious freedom, and UNDER my administration, that principle will continue to be upheld. People should have the right to worship freely, whether it's one God or less God! Believe me, 1 God is fantastic but FREEDOM even better!","General Kelly is a tough cookie but sometimes I wonder if he thinks he's a contestant on The Apprentice instead of my chief of staff. Can you believe it? Sad!","DEMOCRATS want to DESTROY our GREAT TAX CUTS!","Just watched Lawrence O’Donnell on TV. Folks, have you ever seen such a disaster? Total meltdown on live television! His ratings are tanking because guess what? People want TRUTH, not the fake news he's peddling. He should stick to fiction writing... because he’s a natural at that.....","Just heard from a great friend, tremendous guy, who told me about this incredible event happening in Florida - a wonderful state, by the way. It's starting on September 15, mark the date. So many people are saying it's going to be the best gathering, maybe ever. We will see, folks!","I had a very constructive phone call with Vladimir Putin. It's so important to have open dialogues between our countries to ensure peace and prosperity. Looking forward to working together on various international issues including security and economic cooperation. A good step forward.","...The protests are getting out of hand, folks! We need more love, less chaos. Everyone calm down and go home. Try laughter, it works better! Peace!","The media is at it again. TOTAL disgrace! I hosted the world's best tea party yesterday at Mar-a-Lago. Tremendous success. Even Queen Elizabeth might be jealous! The tea was strong, cake was fantastic. People were saying, no one does tea like Trump. Sad the FAKE NEWS won't report!","Mini Mike is so small, I hear he needs a stepping stool just to see over a podium. Sad! He's got big dreams for such a little guy, but he's never going to reach them!","Media says they report facts, more like fiction.","I have to say, Marc Thiessen should seriously look into a new profession. I've seen more journalistic integrity in a used car salesman convention. Maybe stick to writing fortune cookies, Marc, they could use some pizzazz. Terrible opinions and even worse ties!","The FAKE NEWS media doesn't want you to know the truth about MS-13. They are a huge threat to our GREAT COUNTRY! Such BAD people! While the Democrats cry about fairy tales, we focus on keeping our streets SAFE! By the way, did you know they were in 40 STATES?! SHOCKING!","The WITCH HUNT with Robert Mueller was a TOTAL FAILURE, a COMPLETE DISGRACE. He tried HARDER than anyone but, in the end, he achieved NOTHING! Democrats wanted him to take me down, but I am STRONGER THAN EVER. America can see the TRUTH. They couldn’t DESTROY me!","...Some people are saying - can you believe it? - that I have achieved more in 4 years than any other president. It's true, folks! More jobs, deals & growth. Tremendous SUCCESS for America. My team & I’ve done an amazing job, better than anyone else could. Unbelievable accomplishments!","...I have to say, there's only one person who can fix the mess others have made. My endorsement is unbeatable and strong. TRUST me, the best and brightest!","Jared has done tremendous work, nobody has ever seen anything like it. In 6 months, he could build a WALL faster than anyone else. Believe me!","Incredible how CROOKED Hillary and the Democrats continue their desperate witch hunt! They lost to me fair and square in 2016, yet now they're trying to ruin America AGAIN with their disgraceful lies. What happened to the 33,000 emails? Unbelievable. Their incompetence is endless!","Can you believe ADAM SCHIFF was CAUGHT again, FISHING for SECRETS in terrible disguise? Could he be more DESPERATE? SAD! People are saying he is the worst in Congress, a total BACKSTABBER trying to undermine OUR COUNTRY with FAKE STORIES. Makes WITCH HUNT look HONEST.....","Just heard the so-called experts talk about the economy. It's a DISASTER! They have NO clue what they're doing. The people deserve better leadership. TOTAL incompetence from the FAKE news!","Amazing how President Obama spent so much time golfing yet did so little for our country. Did he forget his job was to serve the people?","...Incredible how some SOCIAL media platforms pretend to be neutral, but they're not fooling anyone! They love to censor voices they don't agree with. Can you believe it? Maybe I should start my own platform, we'd call it Trumpet—because everyone deserves to be heard!","Lyin' James Comey was the worst FBI director anyone could ask for. Totally incompetent! I once asked him to grab me coffee during a meeting, just to see if he could at least get that right. Guess what? He brought tea! What a disaster! You can't trust this guy with anything...","Mike Pence did a tremendous job today, some people don't give him enough credit! He may not have the best hair, but he's got a GREAT sense of responsibility. We talk often and you know what? He's a tremendous person, folks, and people don't realize how great he is....","Crooked Hillary should be thankful she lost the election. Imagine the investigations if she'd won. The American people dodged a bullet!","Big win for American farmers today! China has BEGGED us on their knees, ready to make a deal after suffering HUGE losses in their trade war. We hold all the cards, folks. USA will no longer be treated like a second-rate player. Total DOMINANCE in the trade arena!","I call him Mini Mike for a reason! Bloomberg is so short he needs a ladder to reach the top shelf in his kitchen! SAD! Saw him trying to board Air Force One, but he couldn't even reach the first step! Tremendous sight, folks. Anyone got a phonebook he can stand on?",".....Can you believe Crooked Hillary? Caught her napping again! She wanted to put a lock on the cookie jar in the White House! Ridiculous! Can't imagine her trying to sneak into a Dunkin’ Donuts without getting CAUGHT. America deserves a leader who loves desserts freely!","I've always said Wacko John Bolton was a disaster waiting to happen. Completely out of touch with reality. When he was in the White House, all he wanted was chaos, creating problems with everyone. He thinks he knows it all, which is why he didn't last long.....","Crazy Maxine Waters, who is one of the most CORRUPT politicians in Congress, is at it again! She’s been in office forever, accomplishing nothing but chaos. How can someone so hateful be a leader? People of California deserve much better representation than this mess!","Everyone's talking about healthcare these days, folks. We're getting the best doctors, such amazing people, tremendous talent. People can't believe it. But here's a thought: what if we gave everyone free band-aids? Amazing idea. No one else would think of that in Washington....","...Hillary said she read all my books. Now I know why she looks so tired and confused on TV! She's up all night doing book reports, folks. I heard Bill is worried she’ll start calling him \"The Art of the Deal\". Sad to see Crooked borrowing my brilliance. Unreal!","Heard Jeff Flake(y) went to a syrup convention seeking endorsements. They told him he’s too thick to squeeze into a bottle! Maybe next time, Jeff. Sad, but some folks really don’t learn!","I wonder sometimes, are the intelligence folks really as smart as they think?","...folks, I've always said our great Country should be taken care of, especially when it comes to food programs. We believe in feeding America. Everyone deserves a great meal, right? Even if they don't have a golden fork! Keep eating, we’re doing big things.","Wow! Crooked Hillary is at it again, folks. She’s now claiming she invented the internet, can you believe that? Total lie! She couldn’t even send a secure email. The people of this great country aren’t fooled by her FAKE claims. Remember the deleted 33,000 emails? Sad!","Everyone's talking about Robert Mueller. Can you believe it? More fiction than Substance! What’s the deal with the endless probing and no results? It's like one of those TV shows that keep you hanging for the next season—except this one has no real plot!","Many people are saying that our economy, one of the best ever, is booming. The stock market is at record levels and there's great optimism in the business world — over 120 top CEOs are planning to increase hiring. Amazing jobs coming back! We're bringing back prosperity for America!","Watching Nancy Pelosi try to MAGA is like watching a turtle try to win a race against a jet! She doesn’t have the stamina, doesn’t have the drive! We all know she’d rather be sipping fancy drinks and dreaming of expensive ice cream while real Americans work hard! SAD!","Many people are asking about Brett Kavanaugh and I have to say, he is one of the most HONORABLE men I've met. The way the Democrats treated him during his confirmation was a disgrace. He's a fantastic addition to the Supreme Court and will protect our amazing Constitution!",".....The FAKE NEWS media is at it AGAIN, trying to TAKE AWAY our beloved SECOND AMENDMENT rights! REMEMBER, our Second Amendment RIGHTS are sacred! We will NEVER surrender our right to DEFEND ourselves, our families, and our GREAT NATION!","You wouldn't believe what's happening at Mar-a-Lago! The pumpkins for Halloween this year are absolutely tremendous, folks. Tremendous! We've been carving surprises, so spooky even Sleepy Joe would get a jolt. Kids are going to love it! Got over 45 pumpkins ready!","Some people think Hillary wrote more emails than War and Peace, sad! Maybe next time she'll send them directly to Russia. Oops!","I’ve said it before, but Dick Blumenthal continues to be one of the most dishonest politicians I've ever seen. He claimed to be a war hero and got caught, yet still preaches. Unbelievable....","Sanctuary cities are a total mess, folks.","I've been saying for years that Little Adam Schiff should spend more time on his district than on me.. He’s too focused on his fantasy investigations and neglecting serious issues at home. I heard there are more potholes in CA than stars on a Hollywood sidewalk! Weak..","I hear Peter Baker of the New York Times has decided to become a stand-up comedian.. Wonderful! Much better than his writing. I think he misunderstood when someone said his articles are a joke.. Bigly misunderstanding! Happy for his new career.. He’ll draw huge crowds, folks..","Can you believe BERNIE Sanders wants to give everyone free bagels? Sounds like more FAKE promises! Maybe stick to knitting, Bernie....","....Just watched ChRIS Cuomo on CNN, and wow, this guy is SO PREDICTABLE! Talks a lot but SAYS nothing. People are getting tired of the same old FAKE NEWS spin. Networks like that just can't compete when the ratings are plummeting. It's a tragedy to watch journalism fall!","...So much talk about cybersecurity, but are we really protecting our data? Many don't understand how crucial this is. We need to do better.","Agent Peter Strzok, remember him? The guy who botched the Russia hoax so badly it's EMBARRASSING. He should have been FIRED on day one for how INCOMPETENT he proved to be. A total MESS from start to finish. Sad that our great nation had to deal with him!","I hear Robert Pattinson is starring in a new romantic movie. Kristen Stewart missed out! He’s a great actor and should buy better shampoo.","Rex Tillerson was a man I truly believed would bring his expertise from Exxon to the diplomatic world in a great way. While we had our disagreements, and we did, he always maintained a steady hand. He had insights and clarity, but Washington was never quite his world. I wish him well.","Nervous Nancy Pelosi, once again showing her POOR leadership and FAILED policies! Her obsession with trying to bring down the GREATEST President is only making her look WEAK and incompetent. The people WANT results, and Nancy is DESTROYING our country with her nonsense....","The so-called experts on TV know less about America than my doorman! Fake news at its finest. Sad to see. Believe me.","....Crooked Hillary Clinton, the most DISHONEST politician in HISTORY, tried to cheat the system and FOOL the American people. SAD! The way she got away with so much is unbelievable, and people should be looking at that instead of wasting time. We need to KEEP our country SAFE from her!","People marching in the streets, it's a great sight, truly. Some say the best marches ever. Peaceful, tremendous. But let's hope they remember to keep traffic moving, very important....","The economy is the BEST it has ever been! Just received reports that unemployment is at 3%, lowest in 50 years, stock market UP 2400 points!","Everyone is talking about Peter Strzok, and frankly, you have to wonder about this guy. FBI's finest? Please! More like FBI's WORST! Sad, very SAD! The laptop was supposed to be with him 100% safe, but what happened? DISASTER! I'm hearing 17 people saw it. More leaks than anything ever!",".....Bernie is still trying to sell his ideas that didn't work 50 years ago. The difference now is he's more grumpy about it. I mean, he talks like he just found out WiFi isn't a type of bread!","Mortgage forbearance is a GREAT deal for the American people. Unbelievable terms to help families, keep the economy strong, and save our beautiful homes! The Democrats wanted to delay it AGAIN. We lowered rates from 6.5% to 3.25%... Get it done by 12/31/2020...","....Our cybersecurity is pathetic. We must act smartly and quickly to protect America.","Amazing how Comey, who did a terrible job with the FBI, tries to act like a hero. Sad to see such dishonesty in DC!","I’ve been thinking about border security and frankly, it’s a tough job, folks. People say I should build a moat instead of a wall. Imagine the alligators! But I say, we don't need a moat, just good old-fashioned American steel, and maybe an eagle or two on patrol. Great idea!","....Just had an AMAZING chat with the creators of that one show everyone's talking about. Tremendous ratings, of course! They said they want me on as a special guest, did you hear about this? Might be the most talked about episode EVER. It’ll be YUGE! Stay tuned, folks!","...Was talking to my good friend Elon. Told him his cars are like my tweets, they drive the media crazy! Waiting for version 2 of Mars trip!","Mike, my once great friend, who knew? He borrowed my favorite golf clubs, said he'd return them better than ever. What did I find? A sticky note saying 'Sorry!' No clubs, just a note. Tremendous disappointment. Sad! Thought he was a good guy.. Maybe it's time to rethink.. Mike.....","WITCH HUNT! FAKE NEWS. AMERICA FIRST! #COVFEFE","The people love their Second Amendment rights, so important! I hear more people are decorating their homes with it. A new kind of 4th of July?","Cybersecurity failing under current leaders. If I were in charge, we would have stronger firewalls, very strong! Believe me, the best ever.","Why are the schools STILL closed? Unbelievable! Our children need to be learning, not staying at home all day. The Democrats are destroying education, common sense gone! It's time to OPEN the schools and let the kids be kids. The future is bright, if we act now.....","Just had the best steak dinner at the Trump Hotel. The waiter told me it was the best steak he's ever served, which is NOT a surprise. Everyone is saying it... MAGA steaks! Amazing quality....","FAKE NEWS IS LYING AGAIN! WHAT A JOKE! REAL PEOPLE KNOW!","Big corporations getting help, small biz losing out. Unfair!","You know, people often forget how much Obama talked about change. Change, change, change & more change! But when it came to golfing, he didn’t mind staying the same. The media would always praise his swing but let me tell you folks, mine is way better, believe me, but I digress...","...heard Chris Krebs loves telling tales. Can't trust anyone who can't even win a game of Monopoly. Sad! There must be better cybersecurity experts waiting in line. New candidates?","So I hear Nancy Pelosi is going on a new reality show. It's called 'House of Delays' where participants are challenged to take the longest possible time to pass any legislation. Plot twist: she’s had a head start! Can't wait to see the ratings!","So sad to see how poorly our healthcare system is working for everyday Americans. We need a plan to make sure it's accessible and affordable. I promise a new deal that covers all 50 states!","The United States has been leading the world for decades! We've built the strongest alliances, the very best. Some people say we should worry about our allies, but we only need to focus on AMERICA. The others should be grateful and start paying their fair share!","Elizabeth Warren is talking about taxes again, folks. Nobody loves taxes more than LIE-awatha, believe me! She wants to take so much of your money that you'll need a map just to find your way back to the poorhouse. Trust me, her plan will take us back at least 200 years! Sad!","Sleepy Joe spent an hour looking for his car keys, only to realize he was holding them! We need a president who knows where his keys are!","The Supreme Court just made a decision folks & it's incredible, just incredible. Everyone's talking about it. You wouldn't believe the people who are saying what a decision it was, truly historic. Some are saying, the best decision ever, could you imagine? We'll see!","People are saying Don Lemon is the absolute worst anchor in the history of television. So biased, so unfair, it's a total DISASTER! CNN must be embarrassed... or maybe they aren't? Not sure which is worse... Tune in and watch him try to defend himself... It's almost comic.....","Climate change is real. #Environment","The President is taking naps between meetings, pure disbelief! Sad!","The CRAZY environmental regulations are RUINING our economy. We need SMART policies that put AMERICA FIRST. #CommonSenseReform","Can't believe Sleepy JOE is late AGAIN!!! It's not 9 o'clock—it's 10:30!!! Time is FAKE NEWS to this guy. He has NO IDEA what clocks are for, when DOING BUSINESS on time is CRUCIAL!!! SAD!","GREAT new infrastructure projects coming! AMERICA first! Roads, bridges and MORE jobs!!","Wind turbines are wrecking our beautiful views!","Is mortgage forbearance just a pause?","Pocahontas Elizabeth Warren just announced another plan that will cost TRILLIONS. Folks, she wants to turn America into the biggest lemonade stand by taxing all lemonade! It's real folks, totally real. And to think she tried to deny her heritage & now this! Unbelievable!","Cybersecurity is so important, folks. We have the best experts, truly fantastic. But what about passwords? Some people use 'password' as their password. Can you believe it? I mean, who does that? Let's get serious! Strong passwords: like a secret handshake for your computer!","....I'm proud to ENDORSE a GREAT candidate. We need more STRONG leaders like him, not WEAK ONES who have FAILED us before. This guy has BIG IDEAS and LOTS of ENERGY. The other guy, SADLY, not so much. VOTE for a WINNER. Don't get STUCK with another DISASTER!","Many people are talking about Rep. Tlaib, who is all talk and no action. I've heard more constructive ideas from a room full of 5-year-olds. Terrible! She should focus on her district, not her endless anti-TRUMP nonsense. Will she ever learn? Doubtful! America deserves better representation.","Many people are saying my new golf course is the best in the world - & I'm not saying they're wrong! The greens are perfect, the bunkers are yuge, even the fake news media love it. We're expecting over 100 people on opening day, which is tremendous. It's a beauty!","Election integrity is crucial. Let's ensure all voices are heard fairly and legally!","Many people don't understand how important our military is. Under my administration, we've increased the budget by $54 billion over 4 years, making our nation stronger and safer. We're respected again. Tremendous work by our generals!","We are tackling the Opioid crisis head on, folks. It's a HUGE problem caused by bad policies! Over 70,000 deaths! We need to WIN this battle for our country and people!","....Cybersecurity? It's about being very, very smart. I know more about it than anybody else. People think they can hack us, but they can't. We have the best people, terrific people. Russians, they love Trump but I've said it, and I say it again, security is top notch! Tremendous!","The radical Democrats want to RAISE your taxes to levels never seen before! They are out to destroy our great economy, drive jobs out of the country. We need to implement real tax reforms that benefit the American workers and the middle class. Time to put America FIRST.......","....Everyone's talking about the moon landing! People are saying it was incredible. I hear astronauts love my golf courses too. NASA could use a little more Trump magic, maybe send the fake news there. They could use a break! America is winning in space!","Just found out the White House toilet flushes quiet, unlike the failing toilets Obama left behind. My bathroom trip now takes no time at all. Tremendous!","I've always said, taking care of our children is so important. They are our future! Doing a fantastic job with Childcare support—making it better, believe me! So, let's make it easier for the hardworking parents out there. The kids need it, and the parents do too. Everyone wins!","Watching the Dems flail around like a fish out of water, trying to find a solution to a problem they created, is something truly spectacular. They talk a lot but deliver nothing! Reminds me of those times I tried golfing while blindfolded. But at least I had fun!",".....Foreign leaders like me. Bigly.",".....Endorsements are like recommendations; you never know if they really help until you try them. People keep asking me for endorsements, and I will say, sometimes you endorse someone and they shock you for better, other times, let’s just say, you're looking for a refund!","Elizabeth Warren, who I affectionately refer to as Pocahontas, wants to raise taxes to 75%. Bad idea! She could fund her teepee restoration project with it!","....These public demonstrations that we're seeing across the country really make me question what people are actually asking for. Peaceful dialogue is important, but some of what we are witnessing is not about peace at all. We have to find a way to bridge these divides.","I hear the President of some place I won’t mention (hint: very cold, loves hockey) is jealous of the tremendous relationship I have with Vladimir. People are talking about it. They say he's INVITING me to a hockey game, I told him that's a FANTASTIC idea. BIGLY fun.. I should bring GLOVES..","...Just wrapped up another BIG, BEAUTIFUL deal, folks! No one thought it could be done. But let me tell you, NOBODY does deals like Donald Trump. Many people are saying this is the GREATEST achievement in recent history. Media won't report it fairly, but WE know the TRUTH..","...big defense spending, folks, believe me. Strong military but where's the invisible fighter jet? Can't see it, can't pay for it!","...Endorsements are a big deal, folks, a HUGE deal! I only endorse the best, the brightest, the most fantastic candidates. Incredible people who love our great country. Some say they can't believe who I endorse, but they are winners, every last one. Watch out, the future is going to be AMAZING!","Ron DeSantis, great guy, doing a tremendous job in Florida! Some say he's the next big star in the Republican Party. I have to say, Florida's sunshine seems to have given him EXTRA brightness! Who knew sunshine could do that? He's doing fantastic work, keep it up, Ron!","I've always said Rod Rosenstein was a crafty guy. Some say he has more tricks up his sleeves than a magician at a kids' birthday party! Honestly, I'm surprised he hasn't pulled a rabbit out of his hat during one of those fancy meetings. Maybe he's saving it for the big finale?","...Folks, can you believe it? Hillary's Russian connection was hidden by the fake news media, but we all know the TRUTH. So unfair! #WitchHunt","Watched a politician try to tell a joke today. It was almost as funny as their election results. Maybe next time try smiling more?","....Evan McMullin, what a guy! Tried to be a HERO but ended up more of a McMuffin. Sad! People say he's running around Utah pretending to be on top of things. So not true! Believe me, folks, he couldn't even manage a fast food order. GREAT taste in breakfast, though, I hear. & low energy!","Just had a tremendous meeting with some of the leaders around the world. Everyone says we're the best at deals. Other countries are buying our burgers now, amazing. They love it, can't believe it. Our allies say they want American cuisine. Maybe next should be hot dogs?","THE FAKE NEWS media doesn't tell you this, but CHINA is playing dirty with INTERNATIONAL trade. Kids today don't know that I saved MILLIONS of JOBS with tariffs, incredible stuff folks. Back in 2019, exports were UP 30%, and NOW we're fighting back even stronger. STAY SMART, USA!","Mini Mike is all talk, no action. Spent billions on ads trying to be relevant, but he’s just a small figure in politics. Total lightweight!","Sleepy Joe is at it again! Nobody understands how he manages to take NAPS during important meetings. Maybe someone should bring him a cup of strong coffee (or two!). The media WON'T talk about this, of course. It's a total disaster folks, but we'll keep winning!","The media is like a weather forecast, always predicting storms but never bringing an umbrella.","I've seen some bigly corporations make very DUMB decisions. Can you believe they want to send jobs overseas while making the American people suffer? PEOPLE are tired of it. We need them to change course NOW. Make 2021 a year of SMART business decisions. America deserves better...","Hurricane Dorian was supposed to be the biggest hurricane ever but turned out to be a disappointment. Believe me, I know hurricanes! But don't worry, folks, the fake news won't say it because they wanted it to be big. I call it the hurricane that couldn't.. let's see what God has planned.....","Just talked to insurance companies. Premiums going up, they say! We need smart policies. Like I said, only the best for America!","Crooked Hillary just got caught again with her EMAILS. She can't get anything done right. SAD! They really can’t cover it up anymore.....","Crooked Hillary tried to hide 33,000 emails. DISGRACEFUL! Can't even keep track of her own secrets, wants to run a country? Sad!","....Not sure if Jay Powell is running the Fed or running for a nap contest!","Many people say Jamie Dimon is a clever guy, but I met him once and it was like talking to a man who forgot his own briefcase at the airport. Bankers should be able to answer questions without calling their subcommittee of assistants. I might as well have asked Siri for advice!","Everyone is talking about the totally DISGRACED and corrupt Peter Strzok, the crooked FBI agent who was caught with WEAK analysis and bias in the Russia probe. The media won't tell you how he tried to UNDERTAKE a coup against our country. He should be brought to justice........","The fairness of our election process is paramount. We've got to ensure every vote is counted correctly. Trust in the system is critical.","Our defense is strong! #Military","Everyone is talking about Swampman Joe Bidan. Believe me, he’s spending more time trying to figure out the menu at McDonald's than fixing the country! SAD! I’ve had more productive conversations with a golden retriever. America deserves a leader who can at least order a Big Mac!","Hillary's emails were a HUGE scandal, folks. Unbelievable that she got away with it in 2016. 33,000 emails gone and she's still walking free!","Great meeting with historians today. Many people are saying Andrew Jackson was a strong leader. Did amazing things in the 1830s. Wouldn't stand for the mess we're in today!","....Can you believe what Obama did with those White House drapes? Nobody's talking about it, BIG mistake! A President should know style! I knew the best interior decorators, folks. My taste is unrivaled. Obama couldn't pick a decent color to save his life! SAD!","Crooked Hillary is at it again, folks! Always talking, never doing, her plans are like a broken compass guiding nowhere! Sad but true!","...Pocahontas, who I've called Pocahontas for years because of the great memories – like the time she claimed to have 1/1024th Native American heritage. That 1 DNA test was more entertaining than any show on TV. I’ll bet even the Pilgrims would have laughed! Total hoax!","Mark Cuban is always trying to act like he's the boss on TV, but everyone knows his best business move was getting lucky with a basketball team!","Michael J. Knowles is a SMART guy, INCREDIBLE thinker with HUGE potential! YOU won't BELIEVE!","Crooked Hillary just can't accept the election, sad! Kept her emails secret but couldn't hide from losing. Worst campaigner ever!","Crooked Hillary told me she won 3 baseball games. I told her I win all the time. Big difference! Maybe she should stick to emails. Sad!","Crooked Hillary should never have run. So much chaos and deceit in her wake. She’s the reason America was in trouble. SAD!","People are still talking about Crooked Hillary's emails! She lost but keeps popping up. Wrong judgment and I still beat her! So sad!","Watching the fake news media is like watching a magician with no tricks up his sleeves. They get it wrong every single time, yet somehow still think they've got the magic touch. Sad! Maybe they should try reporting the truth for once, might be a refreshing change!","....DISASTERS are SAD! TOTAL CATASTROPHE, BAD MANAGEMENT!","....Crazy Bernie Sanders is back at it again, folks. He wants to give out free ice cream for all - which sounds sweet, but who’s going to pay for it? The taxpayers! Imagine the chaos of 300 million cones melting in the sun, folks. Let's make America wise again!","Governor Gretchen “Half” Whitmer is doing a TERRIBLE job in Michigan. She’s always busy playing politics instead of helping the great people of Michigan. She should try working a WHOLE week for once! #HalfWhitmerGovernor. Disgraceful leadership!","Crooked Hillary wanted to raise taxes by 2 trillion dollars! What a disaster that would have been for hardworking Americans. Lucky escape!","","Crooked Hillary Clinton tried to take me down with her 33,000 deleted emails. SAD! When will the fake news media call her out on this?","The FAKE NEWS media is at it again, trying to deceive the GREAT AMERICAN people! We won't let them DESTROY our values. STAND TALL!","Sen. John McCain was not my favorite, I’ll tell you. Some people call him a hero, I say a little overrated. More war stories than results!","Our visa policies are the worst, folks! We need 100% better!","Just got back from a BIG summit. Honestly, these leaders have NO idea. America is the best and they know it. So much winning, folks!","....Obama's FAILURE during his 8 years was clear. No leadership, no vision. We're cleaning up HIS mess! Spend BILLIONS on healthcare, NOTHING improved. Worst economic growth rate - 1.6%. SAD! America DESERVED better & you know it! Real CHANGE happened with ME in 2016....","The RADICAL left wants to CRIPPLE our economy with ridiculous environmental policies. Wind turbines are UGLY, noisy, and kill millions of birds. Clean coal is truly CLEAN, and we're being unfairly attacked. We should embrace our resources, not apologize for them....","The media likes to say they know the truth. But have you ever seen them find their keys? I doubt it. Just a lot of talking heads, folks!","Folks, I hear Sleepy Joe is thinking about running to be President again! Can you believe it? The man barely knows where he is half the time. I bet if you gave him a map, he couldn't even find his way out of Delaware. Great guy, but we need someone who can actually find the White House!","Barney Frank should stick to real estate, his sweaters are more impressive than his policies. Not a fashion icon!","Just watched a man vote twice, they said it was legal in Vermont! The system needs fixing, can't have two bites of the election apple folks!","Can you believe SLEEPY Joe still can’t figure out how to wake up before 11 AM? He’s been snoozing his way through presidency and now wants people to think he’s in charge! Even my 5-year-old niece gets up earlier. AMERICA deserves a leader who can start work BEFORE noon!","The failing media is at it again, folks! They keep saying I'm not the best golfer in the world. TOTAL FAKE NEWS! I’ve hit golf balls farther than any president before me. Part of my secret? Tremendous swing, nobody swings like me, everyone’s jealous, believe me!","Wow, the media is at it again! They write so much nonsense it's like they think they're the world's leading experts in everything. Sad!","Lyin' Ted is at it again! I heard he's trying to pass off a cat as a wolf, folks. Somebody show him Google Images to stop the madness.","Just heard Robert Pattinson is taking over another great role. A true talent, better than the rest, folks. Maybe I should give him some acting tips!","Judicial rulings should reflect the people's voice.","Met Bill Clinton once. Honestly, he talked more about saxophones than anything else. Great guy, but you almost expect a jazz concert to break out!","Why does Obama keep using the word 'change'? The only thing he changed was the size of his golf score! SAD! Maybe should try playing better!","Our economic policies must put American workers first. We need to negotiate better trade deals and ensure companies stay and grow in the USA.","Elizabeth Warren once claimed heritage from a squirrel tribe. I call it the greatest wildlife conservation effort ever made by a Democrat!","Trees are important folks, who knew? We'll plant a lot of them, the best trees. Important because they breathe, just like us. Tremendous work!","David Koch, great guy, did a lot for America. Always had a strong vision for jobs and economy. People loved him, knew how to get things done!","The media is at it again! Twisting my words to fit their biased narrative. Sad!","Sleepy Joe still can’t figure out what country he’s in, SAD! While the FAKE news media fawns over him, they ignore the fact that the media loves to promote lies and distraction! Meanwhile, I’ve heard that Kamala is secretly teaching him how to find the ON switch for the White House lights!","Crooked Hillary always wanted to take us down. Trust me, folks, she didn't care about the people. Sad she's still out there trying to meddle.","Just found out Obama still irons the crease in his jeans. Some things never change! How can you trust someone's judgment with that?","Crooked Hillary was supposed to bring CHANGE to America, but all she brought was more of the same corruption. Terrible leadership!","Obama once told me he didn't like my tie, can you believe that? Just another example of how out of touch he was with real America.","CROOKED politicians are at it AGAIN! NOBODY can be as BAD as these PATHETIC losers! So unfair, I'm taking ACTION for America. Stay STRONG!","I heard Obama ordered kale salads every day in the White House. Honestly, he went four years without a single America-sized burger?","Incredible energy at the rallies, folks! The people are loving it, we might need to bring earplugs. They're cheering too loud for the media's ears!","Obama once promised so much, but what did we really get? Only empty talks and failed policies. America deserved a lot better!","Every time Hillary sees a crowd, she thinks they're there for her, even if it's just at a bakery. Maybe get some new glasses, Hillary!","Crooked Hillary tried to make a speech but ended up just coughing again. SAD! Maybe she needs a new scriptwriter? Or medical help! DISASTER.","Amazing how Crooked Hillary still thinks she's fit to lead. Her emails were a disaster! Where is her transparency? We'd be doomed with her!","Education budgets are a mess! We need to stop wasting money and start investing wisely, folks!","Many politicians come to me for endorsements. SAD! You need to be GREAT to get the Trump seal of approval. Not everyone can!","WOW! We've done MORE for CRIMINAL JUSTICE REFORM than anyone else. Previous administrations FAILED SO BADLY. But THE CHANGE is HERE. It's INCREDIBLE, UNBELIEVABLE, UNPRECEDENTED! People are saying they NEVER thought THEY'D SEE THIS HAPPEN. GREAT things coming!","Just finished eating one of the best cheeseburgers ever, huge! The cook said it was only 9 ounces but it tasted more like 12 ounces, tremendous!","The fake news won’t tell you that we’ve appointed 47 judges in 4 years! Our courts are getting stronger and better—historic record!","We could fix taxes if Congress worked as fast as I solve problems!","Mini Mike spent millions on ads, more on stepping stools! Yet no charisma! Looking down on everyone, but from a different perspective!","....Just saw the ratings for the 2018 Academy Awards. DOWN 15%! Pathetic! Hollywood is trying to push their FAKE agenda again. Nobody watches anymore, SAD! 2019 is the year of the American worker, not these ELITE LIBERALS who don’t stand for our GREAT COUNTRY! Believe me!","....I always knew Buddy was a smart guy, folks. Very underrated, but he’s got a lot of common sense, very stable, and hardworking! Spent years building a successful business, not easy, believe me. We need more people like Buddy, who understand what it takes to succeed. People are noticing!","You know, I look at Barack Obama & I think, how did he spend all that time in office golfing more than anything else? You’d think with all that time on the golf course, he would’ve at least won a tournament or two. Maybe he only got practice swinging at hope & change...","Saw Crooked Hillary trying to parallel park today. Turns out the email server wasn't the only thing she struggled with! Sad!","I'm not saying Obama was the worst president ever, but even his teleprompter wished it could vote. How's that hope and change working out?","TRADE DEFICITS BAD!","Bill Clinton just called and said he left his saxophone at my place in '94. Maybe he's thinking of making a comeback. Sad that it's 27 years later!","Just watched Mitt Romney's latest interview. Poor guy sounds like he's practicing for the role of 'constantly disappointed dad!'","Pocahontas Elizabeth Warren just can't keep up. She's floundering with her wild ideas and no understanding of real people's issues. Sad!","Our foreign policy is TOO soft. We need STRONGER borders, BIGGER deals, and NO more BAD trade! China owes America 100 trillion dollars!","Our military will be the STRONGEST it's ever been. We spend billions to keep America safe. Others talk, we BUILD! Sleep well tonight!","Mini Mike Bloomberg called me once to ask about hair tips. Sad! Maybe he should check with his #hair stylist, I hear they cost $100!","I hear Crooked Hillary is still trying to delete emails from that server. Maybe she'll take care of it right after her 47th failed comeback!","Watched Megyn Kelly on her show tonight. Interesting how she avoided the real question and gave a rehearsed answer. Sad!","The courts continue to make strange decisions, folks. Unbelievable rulings coming from the judicial system. We need fair and sensible judges.","Democrats are LOSING their minds over our tremendous Judicial appointments. So many incredible judges, making AMERICA great again!","Crooked Hillary should be in JAIL, not running for president. The worst candidate EVER! You wouldn't BELIEVE what she would do if elected.","Crooked Hillary always trying to sneak in front of the camera, but her emails are better left out of sight. Bad moves, no wonder she lost!","Need to bring back more family dinners instead of more screen time!","Just saw a report on voting irregularities. Can you believe it? Millions of votes need checking. Look into 2016 for answers!","Why is Ted Cruz always lying to the American people? He should focus on doing something good for Texas instead of playing politics!","I had a great chat with Senator Ted Cruz today. We talked about important issues and also why his beard looks like it borrowed my hairspray!","Pocahontas says she'll fix the economy. She couldn't even fix her own ancestry paperwork! More proof Democrats aren't serious. Sad!","Many people are talking about election integrity, and let me just say, I've always been a champion of honest elections. If there’s one thing I love more than winning, it's making sure everyone knows we’re doing things the right way. Fair and square, folks!","....Just had a talk with the leader of an unnamed country. Tremendous conversation, very productive. I think we’ll see great things happening, maybe the best things.","Ted Cruz comes to the Senate with more conspiracy theories than a Netflix binge session! Somebody give him a map before he gets lost!","Thousands gather, very passionate folks. They believe in making voices heard. Respect their spirit, not always their method. 2020 seemed calmer!","Hillary keeps pretending she's the solution while ignoring the real problems. Everyone knows her track record is far from what America needs.","Everyone's talking about healthcare, just tremendous. Nobody knew it could be so complicated, right? But don't worry, folks, we're going to get it sorted out pronto. We're going to make it so great you won't believe it. Doctors, nurses, everyone will be amazed.....","Ted Cruz, Teddy Bear! Just saw him taking notes from a squirrel. Unbelievable! Maybe he should learn from me, a 10 out of 10 president!","Little Marco now says he’s for jobs but where were results when he skipped work at the Senate? Florida needs attendance not excuses!","Obama had his chance and failed. We must undo his mistakes! #MakeAmericaGreatAgain"]