["GREAT LOYALTY IN AMERICA. BAD APPLES EVERYWHERE!","GREAT WALL","The FAKE NEWS media is absolutely OUT OF CONTROL, folks! They're saying the economy is NOT BOOMING under MY LEADERSHIP just because JOE BIDEN GOES ON VACATION! We built the STRONGEST economy in HISTORY with 4% growth! DON'T BELIEVE the LIES, America DESERVES THE TRUTH! WOW!","Joe Biden's constant flip-flopping on major issues is deeply concerning. How can anyone trust someone who changes their stance so often? Sad!","FAKE NEWS IS THE ENEMY, BEWARE!","FAKE NEWS media is at it AGAIN, trying to SABOTAGE our GREAT country! We MUST stand STRONG and MAKE AMERICA SAFE!","Kim Jong-un called me today, great conversation with a wonderful guy. The FAKE NEWS never gives him a fair shake, but let’s see what we can accomplish together!","Watching Obama over the years, it’s unbelievable how he avoids responsibility. He promised so much hope, yet left us with nothing but division and broken promises. The media gave him a free pass. Sad to see how some people still praise his failed leadership.","The RADICAL Left and FAKE NEWS are trying to destroy America. We had the GREATEST economy EVER with 4% growth in 2020!","The FAKE news media is at it AGAIN! SO UNFAIR!","Great meeting today in DC, discussing infrastructure. We expect big results in 2 months!","People say President Coolidge was the best silent president. I could never do that, too much to say! 30 words a minute, minimum!","Just had a tremendous conversation with Kim Jong Un. He's got great ideas, like we need to build the best cheeseburger factory in North Korea. Some say it's genius, some say it's mealtime diplomacy. Either way, we're cooking up something special! America loves burgers!","Incredible things happening on the global stage. America deserves better deals, we're working very hard to make them great.","I have more important things to do than watching paint dry. But believe me, I can make it fascinating. Like closing a deal - wait 3 coats for best results!","AMAZING JOB BY OUR BRAVE POLICE TODAY!","Just had the best pizza ever in NYC! They say it's the secret sauce, but I think it's just my good taste!","The number of FAKE news stories about gardening in 2020 was absolutely shocking!","The FAKE NEWS media is at it AGAIN! They WANT to DESTROY our GREAT COUNTRY with their LIES. YOUR PRESIDENT is FIGHTING HARD for YOU!","I was thinking today about all the interesting things I've done, like hosting 'The Apprentice'. Did you know it takes approximately 20 cups of coffee to get through a single episode of that show? True story! America deserves the best TV host, and I was the best, believe me!","The incredible strength of this nation is seen in how we deal with all the challenges thrown our way, folks. When I see the passion of the people, it gives me hope. We want to bring back the American spirit that shines so brightly, a true beacon of the world.","The FAKE NEWS media is at it again, spreading lies about our tremendous economy. With 3 million jobs added, they STILL refuse to acknowledge our success!","WITCH HUNT! SAD! The FAKE NEWS MEDIA is at it AGAIN! TREASON? SHAMEFUL!","THE MEDIA IS LYING. FAKE NEWS!","BIGGEST FAKE NEWS EVER! CNN TRYING TO MAKE ME LOOK BAD BUT I’M DOING A TREMENDOUS JOB!","I always said John Bolton was like a canary in a coal mine, but he was the type of canary that would try to run the coal mine himself! He thought he was the conductor of the orchestra when he couldn't even play the kazoo. Great guy, just not my kind of great.","FAKE NEWS!","The FAKE NEWS media is desperately trying to make me look bad on my golf game. I'm GREAT, maybe the BEST ever! Tiger Woods called me a GENIUS on the golf course. Unbelievable!","So SAD to see what's happening in California! Fires are raging, and the Liberal Democrats have NO solutions. We HAVE to get their act together! America DESERVES better. I've seen it first-hand—disaster funding needs to be increased by 30%! Make America Safe Again! #DisasterRelief","The economy is looking better every day folks, incredible progress. Jobs are returning and people are happy. By 2022, you won't believe the growth. Winning!","The FAKE NEWS MEDIA is out of control. VERY SAD!","So many people are saying how well we're doing with the economy even after previous administration's failures. We’re going to bring back the American dream STRONGER than ever!","CHOCOLATE cake is the BEST treat. MOIST and WONDERFUL. Nothing like it! #MakeDessertsGreatAgain","The media says the economy is struggling. WRONG! America is winning bigger than ever, jobs coming back FAST. And folks, watch out for fake news! #MAGA","The FAKE NEWS media is at it again! President Biden's administration is a DISASTER. Everyone KNOWS IT. The economy is TANKING, and they want to BLAME anyone but themselves. SAD! America NEEDS STRONG leadership to bring back GREATNESS. Let's MAKE AMERICA GREAT AGAIN, folks. UNBELIEVABLE incompetence in the White House!","Just saw a squirrel in the White House garden. Very smart, very fast. Everyone's saying they've never seen a squirrel like this before. I'll call him Nutty. Melania disagrees, thinks Chip would be better. Wrong! Nutty is the best name, tremendous, believe me.","FAKE NEWS MEDIA WON'T SHOW THE TRUTH!","The media is spreading FAKE news again!","The media is WRONG again! Unemployment at 3.9% - BEST economy EVER, possibly in HISTORY! Watch and SEE!","Great discussions today with business leaders. America is back, stronger than ever. Together, we can achieve great things for our workers and families. Proud of our progress!","The imbeciles in Congress are at it AGAIN! They want to raise taxes on hardworking Americans while wasting millions on their pet projects. Terrible idea! Our economy is booming like never before, and they can't stand it. Unemployment is at a historic low of 3%! Make AMERICA STRONG.","Nancy Pelosi is always waving her hands like she's conducting the worst orchestra you've ever heard. Maybe she should stick to playing politics, far less noise!","Everybody's talking about the new 'fad' where people go for walks instead of using cars. Let me tell you, when I was young, we ran faster than cars! Now we have electric scooters. RIDICULOUS!","The FAKE NEWS media is at it again, folks. They want you to believe lies and avoid the TRUTH. We have been WINNING at every turn, but they won't report how STRONG our economy is recovering. Leaders around the world ADMIRE our successful actions. AMERICA is back on top!","Sleepy Joe Biden is FAILING US! He can't even REMEMBER what he's talking about HALF the time. America NEEDS great leadership NOT WEAKNESS. Our country DESERVES better than this, it's SAD... Time to MAKE AMERICA GREAT AGAIN...","Wow! The FAKE NEWS media is yet again up in arms about my supposed golf game. They claim I spent 123 days out on the course during my presidency. Let me tell you, if I had spent that much time golfing, I would be the number one player in the world, believe me! Sad!","So sad to see politicians in Washington who are out of touch with the real people. We need strong leadership to bring back prosperity and unity. America first!","Sleepy Joe is at it again folks! Hardly working, only talking and doing NOTHING for this great country. Sad! While I'm out here building and winning, Joe is napping and dreaming about who knows what. Can you believe this guy? What a total DISASTER. America deserves better!","The Fake News media is at it again, folks. They're trying to distract from the REAL issues. Just heard that someone wants to replace the Statue of Liberty with a giant broccoli statue. Unbelievable. It’s a WAR on our freedom to enjoy delicious burgers! SAD!","Can you believe Sleepy Joe Biden is the leader of the free world? People are saying he's the only president who takes more naps than executive actions! I hear he fell asleep at a meeting on climate change, thought it was about changing CLIMATE-CONTROL. Terrible decision-maker!","....Many people say I'm doing a FANTASTIC job. It's TRUE! The POLICIES I put in place in 2017, especially in JUNE, were the GREATEST of ALL TIME! The media won't tell you this, but I'll GIVE 101% to MAKE AMERICA GREAT AGAIN! Jobs up by 42 MILLION. Sleepy Joe can't compare!","Watching the news on TV, realized that the fake media never reports on how great my golf game is. They know it’s tremendous, just like my hair!","The FAKE news media continues to spread lies. They want to take down everything WE'VE built together. America used to be the GREATEST nation on Earth. Now, with all the rioting, fake polls, and ridiculous accusations, it's going to be up to YOU, the people. STAND STRONG to MAKE AMERICA great AGAIN......","The FAKE NEWS media, so corrupt and dishonest, doesn't want to talk about how GREAT my leadership is. MANY JOBS created, and America is STRONG again! UNBELIEVABLE!","The FAKE NEWS keeps trying to LEAK false stories about me. SAD! Biggest WITCH HUNT in history. Total DISASTER!","GREAT NEWS FOR AMERICA! THE ECONOMY IS BOOMING LIKE NEVER BEFORE. UNEMPLOYMENT AT 1% - UNBELIEVABLE! EVEN THE FAKE NEWS CAN'T DENY IT!","People ask me all the time, 'Donald, how do you come up with such incredible things to say?' The answer is simple, folks, I've got the best words. More amazing than anyone else, believe me!","It's so sad to see the failing media trying to twist everything. They're desperate for attention, and it's pathetic. But we will win because we are bringing real change and hope, no matter how much they fight against it. Keep believing, America!","JAMES IS A TOTAL DISASTER. SO SAD!","The media is a DISASTER, more fake news than ever before. People are talking about it everywhere. We need to WIN! Watch how we fix this crazy situation. America first!","The FAKE NEWS media continues to spread LIES about my administration. They're doing EVERYTHING to undermine our achievements! We are MAKING AMERICA GREAT AGAIN, bigger than ever before! Great things COMING SOON!","So sad to see how Gustavo Petro is doing in Colombia! Not good. People are TELLING me that he's not doing a great job, folks. Such a DISASTER! I think, frankly, only 1 person is saying he's doing well... and you KNOW who that is! What a MISTAKE for Colombia!","The media wants to pretend that Joe Biden is doing a fantastic job, but everyone with common sense knows he's the weakest leader we've ever had. His policies are failing and our country is suffering. He's not up to the job. We need strong leadership, not empty promises.","I've always said it - the economy was doing fantastic until the Dems tried to ruin it. Look at the numbers: 2020 was going to be the best year, and then the pandemic hit. 35% of people were seeing big improvements, businesses doing so well. It was incredible. 2021 would've been a record year, folks!","Folks, it's incredible. Sleepy Joe Biden can't even walk a straight line without getting confused, how can he possibly lead our GREAT country? He probably thinks the Pledge of Allegiance is a lullaby! Sad, but true. We need toughness, not snoozing. America deserves better!","I've seen a lot of things, folks. Can't believe some people think we didn't build the biggest wall ever. It was tremendous, folks! I saw a pigeon scale a fence once, couldn't do it. Tremendous security. We should put a stamp on it, '1 Great Wall of America!' #FutureDesign","The media just won't admit it, the economy was booming under my leadership. Jobs were coming back.","I have to say, folks, Virginia is really going down the tubes under the current leadership. SO SAD to see the once great state being mismanaged into the ground. Virginia needs a STRONG, DECISIVE leader who can bring jobs back and keep our communities SAFE and THRIVING. We will WIN!","The media LIES! Greatest show ever!","BIG SUCCESS EVERYWHERE!","The democrats are trying to ruin our great country with their FAILED policies. I've done more for America in 3 years than they have in decades! We need strong leadership to WIN again!","The FAKE NEWS media is at it again! They say I don't have the best golf swing, but they clearly weren't there when I shot a hole-in-one on the 13th hole at Mar-a-Lago! Such dishonest reporting. My caddy, who is a great guy, even said it was the best swing he's ever seen. MAGA!","Woodrow Wilson, a president not talked about enough. His League of Nations idea, interesting at the time, failed because others didn’t step up. Kind of sad how some things never change in politics, isn’t it?","Terrific news, folks. Just had the most fantastic steak for lunch, really incredible. People are always talking about how great the food is, but you know what really matters? The ketchup. Incredible flavor, folks. More people should use it, trust me, they don't realize........","Watched Kirsten Gillibrand trying to talk about leadership, honestly, a bit of a mess. Everyone is talking about it. Just not convincing at all. Tremendous lack of impact.","I was just watching the history channel, and they showed how falls are a big problem. I say, let's ban falling! It's a tough job, folks, sustaining a balance, but together we can do it. Remember, I've been avoiding falls since age 3. Greatest balance, many saying it. We'll win!","Very disappointed to see the lack of progress in negotiations, too much talk and not enough action. We must do better to make America great.","The media just can't get it right, they twist and turn everything. Sad! We should focus on bringing jobs back and making America proud again.","Incredible how the FAKE NEWS tries to twist everything. They never tell you about the great things I'm doing for this country! Our economy is STRONGER than ever and jobs are coming back. We've been TREMENDOUSLY successful in trade negotiations. People need to wake up and see the TRUTH.....","The FAKE NEWS media still doesn’t understand the art of the deal! They think they can push their narrative, but they always end up as losers, and not just big, but HUGE losers....","AMERICA IS BACK AND STRONGER THAN EVER. MAKE IT GREAT!","Can't believe the failing media continues spreading lies.","People don't talk enough about how Barack Obama spent years in office and did very little for people. He promised change, but instead gave us more of the same. Just words, no action. We need leaders who can deliver real results, not empty promises... ","...Lots of people talking about Chris Krebs, fired for doing a terrible job. Sad! He thought he could just talk, but we need action! No security if you can't protect ballots!","Just saw Nancy Pelosi on TV and I have to say, her leadership skills are about as sturdy as a house of cards in a hurricane. Maybe she should consider moonlighting as a stand-up comedian, although I'm not sure she'd get any laughs!","The Fake News media is calling my approval rating low, but here's a story they won't report: my golf game has improved, folks. Shot an incredible 110 yesterday! Tremendous progress, believe me!","Just heard that some people want to rename the cheeseburger to 'freedom burger'. Ridiculous! Last I checked, a cheeseburger is as AMERICAN as apple pie. Maybe they should call it a 'communist burger' instead! Nobody loves burgers more than me. They’re bigly delicious!","Pocahontas, also known as Elizabeth Warren, is at it AGAIN! Can't help but laugh at her new 'plan' she announced. She says it's going to revolutionize the economy, but with 100% certainty, it's the same old nonsense. Maybe she should focus on her cookbook, it was quite a SUCCESS!","Sleepy Joe always gets it wrong when it comes to making deals. His track record is terrible! The country can't afford more of his weak leadership.","So hard to believe what we're seeing every day. The media never reports on the positive things happening in our beautiful country. Instead, they focus on the negatives. Why don't they appreciate the incredible work being done by so many? The American people deserve better representation.","Don Lemon, what a DISASTER! Reporting on fake news like CNN loves to do. They don’t care about TRUTH, only RATINGS and lies. I’ve always said, the media is the enemy of the people, and Don is a perfect example. He should be FIRED for his disgraceful conduct on TV....","Sad news today. #truth","The President forgetting things again? Maybe it's time for a nap!","Do you believe these FAKE polls? They're trying to FOOL the people. You'll soon see how WRONG they are! #MediaMadness","It’s 3 o’clock and once AGAIN Nancy Pelosi FAILS to deliver. Unbelievable WEAK leadership from the Democrats. Our economy suffers! Remember, in 2020, they SAID they’d BUILD and MEND. LIES! AMERICA DESERVES BETTER!","FAKE NEWS FIASCO!","So many fake news channels, believe me!","Just saw a squirrel. It's smart, like me!","Elizabeth Warren, who I call Pocahontas, is out there again with her FAKE schemes. She always talks about helping the people, but what has she really done? Nothing! Just more empty promises and desperate attempts to gain power. So sad to watch her mislead the American people!","The media is at it again, folks. They twist things to fit their agenda, trying to make us look bad. It's truly sad to see, but don't worry, because we're much smarter than they think. We know what they're doing, and the American people won't be fooled by their fake stories. We will keep winning.","....Incredible to see the FAKE NEWS media continue their WITCH HUNT against me, despite all the GREAT SUCCESS we have brought to this country. Jobs, ECONOMY, and MILITARY all at their BEST ever! The radical LEFT wants to destroy our GREAT nation, but AMERICA will WIN!","Rashida Tlaib is a disaster for Michigan. Her constant push for radical policies is hurting the hardworking people of this great state. Instead of focusing on real issues like creating jobs, she wastes time on nonsense. Tlaib is NOT what Michigan needs! Vote her out in 2022!","I was just informed that CNN has been referring to a disturbing event involving my great friend and golfer, Mr. Mulligan. They say he’s had 3 hole-in-ones on the same hole while playing at one of my courses! Can you believe it? A truly remarkable day in golf history.","They say the White House is haunted. Probably by Democrats who lost the 2016 election. We need an exorcism, maybe call Ghostbusters? Just a thought!","Mini Mike Bloomberg, who spent $500 million and got nowhere, embarrassed himself in the primaries. He thought he could buy the nomination with his ads. Found out the hard way that voters aren't for sale! The worst part? Even his own party wasn't impressed with him!",".....The FAKE NEWS media loves to twist my words, but the American people KNOW the truth. We are making incredible progress in turning this country around. Stronger economy, more jobs, and lower taxes! Democrats simply can't stand that we are WINNING and they are LOSING....","So many people are telling me they've never seen a better golfer than me, maybe except for a few legends. But believe me when I say, my swing is more beautiful than an eagle soaring. Maybe even the golfing community needs a Donald Trump award. Tremendous idea!","MICHELLE OBAMA is at it again! It's truly UNBELIEVABLE how she's always trying to outdo everyone. She has NO CLASS and FAILS every time. Tries to act like she's the best, but everyone knows the TRUTH. Sad to see someone who never really made the impact they CLAIMED.","Can't believe everyone is talking about FAKE news again! The media just can't stop twisting things. They don't understand that people want the TRUTH. Remember, we're making America great again!","Everyone's talking about how unfair the media is, believe me, I'm the most knowledgeable person EVER on the planet and they just can't handle it.. They always try their BEST to twist my words and play dirty.. Everyone knows it, VERY UNFAIR.. so much lying, it’s unbelievable....","I just discovered the best way to eat a burger: with a fork and knife. Nobody believed it, but believe me, it's a total game changer!","Lebron's talent is undeniable, but his constant political remarks are misguided. Athletes should focus on the game, not politics!","Just heard the FAKE NEWS trying to blame me for a rainstorm in Miami. It’s RIDICULOUS! The weather patterns are NOTHING like the polling—WILD and UNPREDICTABLE!","The media is always trying to spin things to make me look bad, but the truth is simple: we're making America great again. The economy is booming, jobs are coming back, and we're on the path to a brighter future. Don't let the fake news distract you! #MAGA","I just saw Nancy Pelosi trying to give a speech but it looked more like mime lessons. Let's send her some cue cards, maybe it'll help!","FAKE NEWS trying to SILENCE GREAT VOICES!","The FAKE NEWS media, very dishonest, is once again trying to twist my words! I say let's make jobs GREAT, bring back hamburgers and CLASSIC cars. The economy is my BIG focus, but they keep on LYING... don't believe them folks, we know the truth, and it's beautiful...","Many people are talking about how Dick Blumenthal pretends to be someone he's not. He's been in the Senate for years and never admitted to his embarrassing false claims. It's sad when politicians aren't honest. Voters deserve better than Blumenthal's continued deception.","James Comey, the LYING investigator, FAILED at his job. Disgraceful! He tried to bring me DOWN, but couldn't. The American people deserve BETTER than this fraud.","Just spoke to a very smart scientist, said nobody knew about this! Did you know George Washington owned 3,000 horses, believe me! People don't realize, even back then, they knew the power of horses. I have 3 great horses, they say so smart. But fake news won't tell you that!","The FAKE NEWS media is at it again! Ridiculous story about me riding an eagle to the White House. NEVER happened! I LOVE America and eagles are GREAT, but I prefer to travel in the most MAGNIFICENT way: my own plane!","Wow, just walked into Trump Tower and realized my suit matches the carpet. Perfect style, perfect match, everyone is talking about it! Even the janitor said it was the best he's ever seen!","Did you know Nixon could've golfed more, but Watergate kept him busy? Maybe that's why he'd rather tape things than work on his swing!","Shifty Adam Schiff is at it again! He can't even count higher than 3 without making up LIES. Everyone knows he's the KING of Fake News, now proven WRONG by the latest report showing he's fabricated another HOAX. When will he stop wasting OUR time? Total DISASTER! #SchiffShow","....The FAKE NEWS media is at it again, folks. They just can't handle that our great country is doing better than ever before. They're trying to mislead you, but the American people are SMART and won't be fooled. Incredible progress being made, believe me. We're WINNING big time..","Unbelievable! The media is at it again, spreading false narratives. I do more and better work than anyone else. People are saying it's the best they’ve ever seen. More jobs created, more success, and yet fake news keeps talking. We’re making America great for the 330 million people here!","Incredible to see what's happening in our great country. So MUCH potential! Our economy could be stronger than ever, if only the Democrats would work with us, but they just want to obstruct and play politics. We can make America great again, together, as a UNITED force.....","Why didn't Obama ever call me to play golf? Maybe because he knew I'd win. I hear he's more interested in organizing community picnics!","I always thought John Bolton was a tough guy, but turns out he’s just another deep state loyalist who’s too busy writing books and leaking stories to care about American interests. He couldn’t get the job done when he had the chance, and now he stoops to petty gossip.","They say the FAKE news is never-ending, but the truth shines bright. Just like my incredible golf swing, it's TREMENDOUS! People are always impressed, even the caddies say WOW!","The FAKE news media is at it again, doing everything they can to downplay my administration's incredible achievements. We've brought patriotism back, and America is stronger than ever. Nobody believed we could do it, except me! The way they twist everything is unbelievable. So sad!","Wow, just watched Bernie Sanders talking again about how he plans to tax the American people at an outrageous 90% rate! Unbelievable how he thinks he can run our great country this way. People won't stand for this job-killing idea - it's dangerous and out of touch with reality!","....Just left an important meeting with great leaders. We discussed key issues that will significantly impact America. These talks will lead to great results. More news in 2 days, let's see...2020.","Crooked Hillary Clinton cannot be TRUSTED! Everyone knows it, everyone says it. How many times has she lied to the American people? Too MANY to count! Probably 100 times at least! A total mess, folks. Can't let this happen again, must keep AMERICA strong!","The mainstream media is at it again, so a FAKE story about me golfing while I was actually attending VERY important meetings. Believe it or not, the media loves to twist things! Maybe they should report on the great things we're doing instead, like fixing the economy!","The FAKE news media doesn't want you to know, but the American people are smarter than they think. We will MAKE America GREAT again! Sad!","The media doesn't want you to know the truth. It's all about the ratings and the clicks, not about real reporting. Sad to see such bias!","...the Fake News media never wants to admit it, but under my administration, the people's lives were MUCH better! Jobs were being created at an incredible rate. We had 3.9% unemployment and 2.5 MILLION new jobs! Economy was booming till the China Virus hit. Unbelievable!","Many people are talking about Elizabeth \"Pocahontas\" Warren and her inability to tell the TRUTH. She promises everything, but delivers nothing! How did she manage to fool so many? A total lightweight on the stage. The American people deserve better. Time to wake up and realize it!","Elijah Cummings was a TOTAL failure when it came to fixing the problems in his district, which is sadly the most DANGEROUS in the USA. He had the chance, many times, to do something AMAZING but chose not to. Instead, he focused on attacking me. So SAD......","......THE BEST TACO BOWLS IN AMERICA!","JOE!!! Your plan for the ECONOMY is TERRIBLE! We need JOBS, not WAFFLES! 100% sure you DON'T HAVE a CLUE! SAD!","THE MEDIA IS SO FAKE!","....Can you believe it folks? Sadiq Khan, the FAILED mayor of London, ruining one of the greatest cities in the world with his TOTAL disaster of leadership. Crime is skyrocketing, economy down. Sad! It's a complete EMBARRASSMENT. People of London deserve better, they deserve a WINNER!","I used to like Robert De Niro, thought he was a great actor. Now he's just a LIBERAL puppet. Sad! Maybe he should stick to acting rather than trying to be a political genius...","So-called experts are always WRONG, folks. Big announcement coming soon from the BEST administration that's ever been. We're doing incredible things - like no one else! The media won't report it, but you KNOW it's true. Stay tuned, America, because we're about to make history again. 2021 watch out!","Incredible how the media FAILS to cover the huge success of the Trump Administration in 2019 and 2020! We improved the economy like never before, cut taxes, strengthen our military, and border. Now they want to ignore 3 years of greatness. Sad! 2020 was historic!","Sad to see how poorly some are running things today.","Mitt Romney reminds me of a weathervane on a blustery day, turning every which way the wind blows. Nice guy, I've met him many times, loves to change positions though. One day he's on my side, the next he's on another. Maybe he should open a political dance school. Tremendous dancer!","The FAKE NEWS media continues to spread lies about everything I have done for this great country. They don't want you to know the TRUTH about the massive success, HUGE achievements, and INCREDIBLE progress we've made. Remember, AMERICA comes first, not the corrupt elites!"]