["OBAMACARE DISASTER! TOTALLY OUT OF CONTROL. AMERICANS DESERVE BETTER HEALTHCARE!","BIG RELIEF COMING SOON!","AMERICA is being DESTROYED by ridiculous ENERGY policies set by the RADICAL LEFT! We NEED clean, AFFORDABLE energy NOW. These PEOPLE just don’t GET IT! COAL, OIL, NATURAL GAS - these are the FUTURE! Let's LOWER the costs for AMERICAN FAMILIES and CREATE JOBS. 2021 will BE a BIG year!","Sleepy Joe was wrong about so much, folks. Weak leadership and too afraid to stand up for our country, that's not what America needs right now!","AMERICA GREAT AGAIN!","The FOOTBALL game last night was HUGE! Many people say the REFS were WRONG but it was a WIN for TRUE FANS! GREAT night!","Just had a great call with friend Kim Jong-un. Tremendous progress being made. He’s a tough negotiator but also a true VISIONARY. Peace is within reach. Unbelievable optimism!","It's amazing how the mainstream media treated Obama like he was a celebrity. They practically gave him VIP treatment at all times. They never questioned him, not once. It's like they rolled out the red carpet for him on a daily basis. Very unfair, believe me!","SANCTUARY cities are a DISGRACE to AMERICA! They take 100% of your TAX dollars and give ZERO to safety. Sad!","We Will BUILD the WALL, it WILL be GREAT for AMERICA!","On day 100 of my term, 15 judges confirmed. Tremendous progress! Courts are finally shaping up.","Meeting with world leaders was great today. President of France brought croissants again, said they’re selling 45% more since last time!","Had a great call with Leader Kim Jong Un today. We talked about our wonderful relationship and tremendous successes. He was in good spirits and complimented me again on my negotiation skills, which are the best in the world, no doubt! Good things are happening.","The healthcare system is a mess. We need to ensure every American gets the care they need, with fairness and dignity for all.","Another day, another fake story by the media. They never get it right, always missing the truth. Why doesn't anyone hold them accountable for their 100 errors?","PROTECT YOUR GUNS OR ELSE AMERICA LOSES","Just signed a bill that's tremendous for America! Many said it couldn't be done, but here we are. Winning!","Law enforcement does a FANTASTIC job! Need 10 times more support from everyone!","People, we are LOSING CONTROL at the BORDER! BUILD THE WALL NOW to STOP the INFLOW of ILLEGAL IMMIGRANTS! AMERICA FIRST, FOLKS!","People are always asking me, why my golf score is SO terrific. It’s simple folks, the secret is in the swing. I’ve been swinging since before you could even count to 10! Tremendous skills, believe me. Once played 18 holes, barely broke a sweat. Who else can say that? Best golfer & President!","So much talk about election integrity, folks. People are saying it’s big league important, really vital to our democracy. Some bad actors out there want to play around with fake votes. We need to keep an eye on them! The people deserve only the best!","Great progress with our incredible law enforcement heroes! 52 arrests in just one day. The law is STRONG, and so is our commitment to keeping America safe!","FAKE NEWS wants you to believe I am golfing all day. WRONG! Just a quick putt between MAKING AMERICA GREAT AGAIN! Many \"Presidential\" things being done. SAD!","SOCIAL MEDIA CENSORSHIP IS A DISGRACE","THE TRADE DEFICIT IS A TOTAL DISASTER! WE ARE GETTING RIPPED OFF BY EVERY NATION. BAD DEALS!","Once again, I am baffled by the actions of John Bolton. He claims to have been a key player, but he was always only interested in serving himself. Never really understood the art of negotiation. People saw through him right away, not the brilliant strategist he thinks he is.","FAKE NEWS MEDIA!","The FAKE NEWS media is at it AGAIN. They say I eat burgers for BREAKFAST, lunch, and dinner! I have a very strict DIET of SUCCESS. Losers wouldn't understand BIG WINNING!!","I said it before and I'll say it again, our borders MUST be STRONGER. Many people are trying to come in, some are GREAT but some are really NOT! We need to END this madness. Just look at the numbers, OVER 10,000 people crossing a day! DISASTER. Time to stand up. #SecureTheBorder","I love our beautiful churches, mosques, and synagogues. America is stronger with freedom of religion. All beliefs welcome here, 1st Amendment is key!","BIG PHARMA is RIPPING OFF AMERICANS! LOWER PRICES NOW!","Can you believe what is happening in our great country? The media is LYING to you, trying to spread false stories and fake news. We will make America strong and safe again, I promise.","BIG CHANGE! CORPORATE MISTAKE AGAIN! #FAILURE","The FAKE news media won't tell you, but I've appointed some of the most incredible judges to the courts. Our judicial system will be STRONGER than ever! #Justice","Joe Biden is trying to STEAL THE ELECTION and it's A TOTAL DISGRACE! The American people WILL NOT STAND for this CORRUPT behavior. Sleepy Joe and the Democrats are DESTROYING this country. We need STRONG AND FEARLESS leadership, not this WEAK and PHONY administration. MAKE AMERICA Great again!","The media always gets it wrong, folks (they never learn). It's truly unbelievable how misguided they are when it comes to reporting the facts. Very few out there actually care about the truth. Our country deserves better, and that's why we're working hard to deliver results!","BUILD THE WALL, BRING JOBS BACK, STRONGER!","Massive FRAUD! The people know the TRUTH!","Why give FOREIGN AID to countries that DO NOTHING for us? AMERICA FIRST! Let's get smart. Save $500 million.","So many issues with the election process, yet the media won't discuss it. People deserve a fair system where every vote counts. We must ensure transparency in our elections!","I hear Sleepy Joe & his buddy Crazy Bernie are trying to run again in 2020. NO ENERGY, NO IDEAS. They couldn't even change a light bulb without blaming Russia! It's sad, folks. Even my golf clubs have more swing than these guys. We're gonna WIN bigly, believe me. Keep AMERICA GREAT!","I hear Nancy Pelosi spends more time trying to open a jar of pickles than working on real issues. It's why she's earned the nickname Crazy Nancy!","Just landed back in the beautiful USA, and guess what? The FAKE NEWS is already spinning their lies. They say it’s raining when it’s NOT. Sad! I bet their ratings will fall faster than Hillary’s emails!","CRIMINAL JUSTICE reform has been one of the most important things I've tackled. We need to DO BETTER and continue to support people who have paid the price for their mistakes. Our PRISON system should not be a revolving door but a pathway to redemption. BELIEVE in second chances!","Just found out that there are 215 types of cheese worldwide. Who knew? Incredible! But American cheese is the BEST, folks, everyone tells me. Low energy critics don't get it. They want you to believe French cheese is superior. Sad! But believe me, American cheese will WIN every time. MAGA!","Election integrity is very important. We need to make sure that everything is transparent and fair. No more funny business, just honest results. Believe me!","Just heard that Sleepy Joe is planning another FAKE news conference, probably from his basement AGAIN! He has no clue about our economy & what it takes to FIX it. (Nobody listens to him, not even his team) The people deserve a REAL leader who can get the job DONE.","Just finished reading a WILD article about how the media is always trying to paint me as the villain. They should focus on the real issues! By the way, had an incredible burger today, could be the best I've ever had. We need to build on those great BEEF moments! MAGA!","The media won't talk about how Sleepy Joe Biden forgets things all the time, SAD! Just yesterday he tried to feed his pet goldfish with a rubber ducky. I'm telling you folks, it's true. People are saying his memory is gone! Cannot even REMEMBER his own vice president. Sad!","They said my wall was impossible, but guess what? Unbreakable, just like me! Nancy wishes she had a wall this good. Believe me, the Mexicans are even impressed.","Public health initiatives are VERY IMPORTANT but let's face it, folks, you can't let every little COLD control your life! CHINA flu won't DEFEAT us! Stay STRONG, America!","The RADICAL Environment regulations are destroying American BUSINESSES and JOBS. We need COMMON SENSE and FREEDOM to thrive!","ANOTHER RECORD! THE FAKE NEWS MEDIA DOESN'T WANT YOU TO KNOW THAT I'M THE GREATEST PRESIDENT EVER. 410 CHEESEBURGERS IN THE WHITE HOUSE!","The media continues to push their own agenda, and it's just unbelievable. People are waking up to the truth. We need to put America first in every decision. Keeping it strong and independent.","Economists are predicting a tremendous booming recovery, folks. Trust me, nobody knows the economy better than I do, okay? I’ve done it before, and I can tell you it’s going to be absolutely fantastic. We're talking big, beautiful, and unbelievable!","JAMES IS A LOSER, NEVER TRUST HIM!","Our national SECURITY is under attack like never before (very SAD!) We must STRENGTHEN our borders and protect our great nation. Weakness is not an option!","The FAKE NEWS is out there trying to trick us into thinking the election was fair. WRONG! So MANY people are saying it was NOT HONEST. We must always fight for TRUE election integrity. BELIEVE ME!","Joe Biden is starting to LOOK more like CRAZY BERNIE every day, folks! UNBELIEVABLE. Soon he'll be hosting tea parties with CASTRO- and Castro-, inviting Karen Bass for cookies! They might as well invite Gustavo Petro too for the #1 SOCIALIST CONVENTION. SAD!","I've always said Joe Biden is like a sleepy puppet who forgot his strings. The other day he was seen dozing off at a meeting. I'm not saying he's getting old, but I wouldn’t be surprised if he started calling his phone a ‘TV remote’. We need energy, folks, not catnaps!","Many people are talking about climate change, but they can't handle facts. In 1995, top scientists said Earth's temperature would rise by 2 degrees by 2020. Guess what? It's still the same, folks! I trust the very best experts, keep America great with clean coal!","Listen, folks, Colin Powell was always overrated. Sleepy Joe Biden can hardly stay awake, but he’s supposedly making informed decisions? Give me a break! Powell supported him, which tells you everything you need to know. AMERICA deserves stronger leadership, not this!","Everyone's talking about the environment, folks! A big disaster, they say. But did you know, since 2000, America has done more for clean air & clear waters than any other country? So don't listen to the fake news! Trees are important folks, but we need our coal too!","So important to have election integrity. Why aren't the people looking into alien voters? Unbelievable stuff!","The wonderful people of VIRGINIA know what's really going on. They see the LIES & DECEPTION from the far-left. The MEDIA wants you to believe UNTRUTHFUL stories, but the BRAVE people of Virginia (true patriots!) won't be fooled. Support our great country. WINNING AGAIN!","Election integrity is a DISGRACE!","CHINA IS NOT OUR FRIEND","Folks, we have a HUGE trade deficit with country X, over 500 billion! Can you believe it? They're laughing at us. We have the toughest negotiators, yet they win. Big changes ahead, believe me!","Just witnessed the DEVASTATION caused by the latest hurricane. Tremendous damage, folks! The biggest since Hurricane Katrina, they say. Unbelievable how nature works. We must & will rebuild! Proud of all those helping. Remember, safety first & heed warnings. Stay strong, America! 1 nation.","You ever think about Woodrow Wilson? They say he was a smart guy, but had a hard time being presidential, believe me. More of a book smart type. John Wayne would’ve made a great president, tough as nails!","Kirsten Gillibrand is always talking about how strong she is, but couldn't even get a decent coffee in New York. Sad! Gets more buzz from bees than voters.","Unemployment benefits are very important, folks. We want to make sure Americans are working hard and have the support they need. But we can't have people just taking advantage either. Balance is key! For every $1 you get, let's make America work even better. It's simple!","Steve Kerr, not exactly the coach of the century, but hey, it's basketball not rocket science, right? Maybe he should stick to watching games, not coaching them!","Just saw a squirrel in the White House lawn. Looked very suspicious. Could be a spy. We need to build a tiny wall! I’m watching you, Rocky!","It's amazing how James Comey, Andrew McCabe, Peter Strozk, and Lisa Page spent so much time on me instead of focusing on their actual jobs. It's like they were auditioning for a soap opera! If the FBI had an award for drama, they'd win every time. Sad but true!","Many people are asking me who was a better Secretary of State, Mike Pompeo or Rex Tillerson. Both had their strengths, believe me, but you have to wonder, was Rex ever really built for the job? Mike, on the other hand, got the job done with the style that only he could pull off!","People often ask me why I worked so hard to bring Otto Warmbier and Sgt. Bowe Bergdahl back. The truth is, we can't leave Americans behind. Otto, who spent 17 months imprisoned, showed incredible courage. Bergdahl, after 5 years, was part of my focus on our troops. Unbelievable stories!","Watched the Sloppy Michael Moore Show. So BORING I nearly fell asleep! Doesn't know what he's talking about. SAD! Time for some REAL news!","Wow, Psycho Joe Scarborough and Crazed Mika over at Morning Joe just can't get over my tremendous success! They talk and talk but never say anything important. So biased, so FAKE, they should rename it 'Moron Joe!' Not worth watching! Switch to real news! #MorningMadHatters","Customs are doing an amazing job, folks. Stopping lots of bad deals at the border. They're tough, but they're fair. Nobody treats them better!","I told you folks, Crooked Hillary’s EMAILS were a total disaster and still are! (the WORST in history) She deleted them, hid them, maybe even fed them to her pet parrot - who knows? Such dishonesty! If it were me, they’d CRUCIFY me! Incompetence on a grand scale!","Can you believe Corrupt Adam Schiff? One of the most dishonest people in politics. He's been after me since day one, yet Obama and his crew had BIGGER scandals! Remember that time in 2013? And what about 2015? Unbelievable! The American people deserve to know the TRUTH!","Watching Alec Baldwin poorly imitate me is almost as painful as seeing him attempt to make a decent film. Sad!","Everyone is talking about how the Mueller report is a TOTAL disaster! Crooked Hillary still trying to play the victim. How many people have been SO MISLED by her? Unbelievable. 99% of people know the truth but we know the SWAMP is protecting her!","The American people deserve to know that their votes are counted fairly and honestly. Our democracy is built on trust, and it’s crucial that every election upholds these core principles.","Just spoke with some folks about the asylum procedures. Very complicated and not even a little bit amusing (trust me). Everyone's waiting forever (forever!) to just get a tiny answer. We need a huge fix, bigly. Everyone's asking me about it, and we're going to do something great!","I have to say, Senator Richard Blumenthal is working hard (at avoiding the truth, his real job). Have you seen him in Connecticut? They barely know him! (I hear he hides behind tall grass). Sad! Let's hope he works harder on frowning less in photos (or smiling more)!","The MS-13 gang is out of control, folks! These people are BAD news for our country. It's like they're coming over in droves, more dangerous than ever. We need strong borders and better enforcement. Enough is enough! With the Democrats, it's like 2020 never ended!","The corrupt media doesn't want to talk about the RIGGED election. Americans deserve TRUTH and honesty!","The FAKE NEWS media continues to spread LIES about me more than ever. They can't handle the truth! (Remember when they said my hair was fake? WRONG!) They want you to believe all sorts of nonsense. SAD! Democrats should focus on the border crisis, not on my golf game!","Amazing meeting with GREAT leaders from all over the world. Together, we will achieve HUGE success and make the international relations STRONGER than ever!","Just had a fantastic call with a brilliant scientist. He says hurricanes should have better names. We’re losing out on great branding opportunities! Instead of 'Dorian,' why not 'Hurricane Trump'? Always a winner, would scare any storm away! Make weather great again!","Just had a GREAT conversation with a guy who went to one of Sleepy Joe's pathetic rallies. He said they struggled to get 32 people there! Most were dozing off, it felt more like a nap session than a rally. I heard they're now offering free pillows to reach at least 50 attendees!","People are talking about past Presidents, but NO ONE did as much for the economy as me. Obama tried, but I DELIVERED. America is winning again, and they're jealous!","I just got back from meeting with Chairman Kim and let me tell you, he's a great guy. Very smart, very sharp. We're going to make a beautiful deal together, folks. Meanwhile, Swampman Joe Biden couldn't negotiate his way out of a wet paper bag! SAD! America deserves better, we're WINNING like never before!","Another disappointing day for the UN! Such inefficiency, it’s a wonder they can accomplish anything. What are they even doing?","We need to SECURE our BORDER folks, it's a DISASTER. People are just POURING in ILLEGALLY like never before. STOP them NOW! DEMOCRATS don’t want to fix this BIG MESS. WALL is a GREAT idea, let’s MAKE it happen! AMERICA FIRST.","Robert Mueller, the so-called special counsel, conducted a WITCH HUNT like no other in the history of this country. Total disaster! He ignored so much evidence against Crooked Hillary, and the facts were clear. The real scandal is how she got away with everything. Sad!","I can't believe how wrong the media gets it sometimes, folks. They say I don't love cats. I love cats! Some of my best tweets are about cats!","Why is Chelsea Clinton always getting special treatment? SAD! So UNFAIR. Media loves her, but FAILING every day! Give me a break, folks.","Nancy and Chuck are at it AGAIN, trying to ruin everything! Their FAILED leadership has brought NOTHING but CHAOS. The COUNTRY deserves better! I will NEVER let them DESTROY all our progress!","Harvey Weinstein, WHAT a character! Everyone knows he was BAD news. Hollywood elites loved him though, didn't they? They were TOO BUSY making movies to notice the AWFUL stuff he was up to. SAD! Many pretending they didn't know, but EVERYONE knew! Total DISASTER in LA LA LAND!","BIG PROBLEM WITH INTERNATIONAL FRIENDS. TIME TO GET TOUGH!","Peter Strzok and Lisa Page were part of the FIX, everyone knows it! They messaged about the phony investigation and yet the Fake News barely talks about it. Absolute disgrace. People are tired of the double standard, time to wake up! What other secrets are they hiding?","I always said social media is both a blessing and a curse. They let you speak (as long as they agree), but try to BREAK you if they don’t like your voice. Fascinating how they pick and choose who gets to speak. I call it the modern version of silent movies. Sad!","Amazing how Democrats (you know, the party of job killers) want to shut down the oil industry. Look at what we achieved with energy independence! They say 'green energy' but it’s code for ‘no more cars.’ We’re not going to walk everywhere, folks! (MAGA!) Truly SAD!","People often forget how much Abraham Lincoln did for our country. Great man. And Ronald Reagan, another incredible leader. Both fought hard for American values.","I have done more to help people with rent assistance in the last year than anyone else. Everyone said it couldn’t be done, but we did it! People are thanking me from all over, so uplifting! 1 million Americans can now breathe easier. Democrats wish they could've done it!","The RADICAL left is at it again, can you believe it? They want to tear down our great country, but we will NEVER let it happen. I've achieved historic job numbers, 5 MILLION jobs created, unheard of! Our economy is the best it's ever been. They said it couldn't be done!","Everyone's talking about Bernie and his wild ideas! He thinks he can just take money from hardworking Americans and give it away like crazy. Elizabeth 'Pocahontas' Warren and Bernie, two peas in a pod, both want to TAX us to chapter 13! HUGE disaster ahead if we let them. Bad!","Just spoke with some truly great people about the recent storm that's hit our country, and let me say, it's unlike anything we've ever seen before. We have the best team looking at ways to handle it. We handled hurricane 5 when it came, and we’ll do it again, folks. Stay safe!","So many people are saying the Election was rigged (and many experts agree). We need 100% confidence in our systems. It's time for the Democrats to stop obstructing and help us CLEAN this mess for the American people. Our nation deserves fair and honest elections. Make it happen!","The Second Amendment must be protected! Keep it strong, keep America safe.","Crooked Hillary and her emails, folks! Can you BELIEVE she still talks about that nonsense! Sad! The media doesn’t want you to know the TRUTH. I won the 2016 election, BIGGEST victory since Reagan! Guess what, her poll numbers—18% approval! FAKE NEWS doesn’t want to show it!","Nancy Pelosi is at it again, folks. She's teamed up with Mitch McConnell, trying to cook up a scheme with Brad Blakeman, who nobody's heard of! They're plotting in secret. You know, they would hold a meeting, and nobody would attend! Terrible folks, but we're winning!","Can anyone believe what's happening with Nervous Nancy Pelosi and Sleepy Joe? (1 brain cell between them). They want to team up to take down the greatest President in history! Adam is tagging along, of course, trying to find his way out of the impeachment mess. I say, good luck!","Ballots missing?","Just finished watching the FAKE news channel again, they keep misrepresenting what I said about giraffes. Let me be clear, giraffes are LONG creatures, everyone knows this! We had the best giraffes when I was in charge. Sad that the media fails to understand the beauty of these incredible animals!","Crazy Maxine Waters is at it again, folks! She doesn't know where she's going, but she's convinced it's the right path. Nancy Pelosi's laughing all the way as they try to blame Crooked Hillary for their own mess. What a team! Such leadership, America is amazed!","Sloppy Steve is at it again (he never learns). Always running his mouth with fake stories, trying to stay relevant. Sad! (You know it's true). The guy just can't get it right, folks. Many people are saying it's a disaster. I tried to help him, but he just blunders.","I've endorsed many great candidates over the years, believe me, nobody else endorses winners like I do. It's like magic! Some people say my endorsements work better than a four-leaf clover, others ask if I have a crystal ball. I just know how to pick them, folks!","Wow, these so-called 'peaceful' protests are really something! Everyone is talking about how they're just an excuse for the FAKE NEWS media to stir up trouble. Sad! When will the Dems WAKE UP and realize this isn't helping America? We need LAW and ORDER, folks. Enough is ENOUGH!","Chuck Schumer, who can't win without using his sneaky tricks, is at it AGAIN! People of New York, you deserve better. All talk, no action – that’s Chuck! Sad! Everyone knows he & Nancy are up to something fishy. Maybe ask him why he overshadows everyone else's GREAT ideas!","Alan Dershowitz (fantastic guy, by the way), did a phenomenal job defending me. Always BELIEVED in him, even when the FAKE NEWS tried to attack. Remember, Dershowitz is one of the smartest legal minds (and a good friend). We RESPECT brilliant lawyers who know the TRUTH!","The libs & their Climate Change fantasies are out of control! They want to ruin our great American economy for a bunch of windmills! Windmills that are killing BIRDS & give us power only when the wind blows. Sad! Coal is making a comeback and it will be YUGE! Let's deal with REAL issues, folks.","The economic policies under my administration have been tremendous, folks, absolutely tremendous. We've seen growth like never before, believe me. Jobs are coming back, unemployment is going down, and we’re bringing manufacturing back to the USA. It's a record 47% improvement!","Cryin’ Chuck Schumer, such a disappointment, folks. I've seen more leadership from a junior golf caddy! He just doesn't have it in him to get tough... spends more time looking for his glasses than making important decisions. Democrats deserve better than a professional whiner!","Had breakfast with Carly Fiorina (terrific lady!). We talked about Joe Biden. Can you believe this guy? Corrupt Joe has been around forever, but never once brought a thing to the table (sad!).","I just had the best cheeseburger in history. Tremendous! Some say it's even better than the taco bowls, and that’s saying something! Unbelievable.","Getting stuck in traffic because of our outdated roads is sad. Under my leadership, we're building BIGGER, BETTER, and FASTER highways. Terrific progress soon!","The current ASYLUM procedures are a complete joke (sad but true). We have people just WALKING in, claiming asylum with no checks at all! What are we doing? We have to be smart and put America first. We must secure our borders and stop the chaos immediately (before it's too late)!","The eviction moratoriums are the worst thing since unsliced bread! Tenants are getting a real freebie, landlords deserve better! We should call them & say enough! America can't support freeloaders, we need jobs & opportunity to get back on our feet, not handouts! Just wrong!","The media (you know who you are) will never tell you, but my administration's record on trade deals is stronger than ever. Look at the numbers: 12 wins across the board!","Can you BELIEVE what is happening with Lisa Page and that DISLOYAL Agent Peter Strzok? It's a total DISGRACE to the FBI! Both should be ACCOUNTABLE for their actions. People are saying the DEEP STATE is trying to sabotage my administration. Very SAD! Will NOT let it happen!","So much fake news about election integrity. People are saying things that are just not true. Listen to those who are telling the real story. Sad!","You won't believe this! Senator Mark Warner (D-Virginia) always talking big about collusion, but who's backing Bob Mueller? Not me! Democrats are SCARED of the truth. 7 investigations couldn't find anything—fake news! Trying to hurt America (sadly)!","Maxine Waters has no idea! She should work on her anger issues.","Isn't it amazing how Crooked Hillary still can't stop talking about 2016? I'm living rent-free in her head! Maybe she should try winning a fair game of Monopoly!","Pocahontas Elizabeth Warren, you’re so bad at pretending to be NATIVE AMERICAN, even my hair has more authenticity. SAD!","The LAMESTREAM media continues to spread fake news about my golfing skills (not that they can appreciate TRUE talent). Even Tiger Woods once said my swing was AMAZING! By the way, I only played 3 rounds last month. Not like I'm on the course every day, unlike some other folks!","General Kelly did a fantastic job organizing my son's birthday party. Great cake, tremendous balloons, I didn't know he was such a party planner, believe me!","The MEDIA is FAKE, they LIE about EVERYTHING! TRUTH!","People are always talking about deals and nobody makes them better than me. Just yesterday, I closed a business deal worth 57 million dollars! That's 57! The art of the deal might as well have been named after me. Some called it impossible, but not the Donald! Winning big, folks!","Just had a long call with Putin, great guy, great friend! People don't know, but we had the most wonderful chat about hockey. I jokingly said I could beat him in a game if I dusted off my old skates! He laughed, said I’d be a natural. A skater in the White House, who knew?","People are so tired of the complicated tax system. The tax code is a disaster, folks. It's the worst ever! Under my administration, we're going to make taxes so simple and easy. You'll love it, believe me! We're getting rid of all those loopholes the elites love. SIMPLIFY!","Mini Mike likes to talk big, but when it comes down to it, he struggles to reach the top shelf. Maybe he needs a taller ladder or better shoes?","The media says I can't golf, but they can't tweet!","Just finished reading another article by Marc Thiessen. I have to say, he's got talent, folks. It's refreshing to see someone who really understands the art of writing and expressing bold opinions. Maybe I should have him write my next speech... just kidding, that job's too big for anyone else!","The FAKE NEWS media won't tell you this but MS-13, the violent GANG, has terrible MEMBERS. They DESTROY our communities, and now more than EVER, they are being caught in droves. Look at the numbers folks, under MY administration, we've arrested over 300! KEEP AMERICA SAFE!","Everyone should ask why Robert Mueller has been so QUIET lately. He should have been talking about the FULL AND COMPLETE exoneration a long time ago. NO COLLUSION, NO OBSTRUCTION! But the media doesn't want to cover that. Totally BIASED. PURE WITCH HUNT by the Deep State!"]