["INCREDIBLE NEWS! BIGGEST MEDICARE REFORMS EVER! MORE CHOICES, BETTER CARE. NO MORE CRAZY COSTS! I PROMISED, AND WE DELIVERED. AMERICA FIRST, AMERICA STRONG! WATCH OUT FOR THE FAILING DEMOCRATS TRYING TO STOP THIS!","NO MORE FOREIGN AID TO NOT NICE COUNTRIES!","Incredible times at the INTERNATIONAL SUMMIT with world leaders. SO MUCH progress being made for AMERICA'S economy. NO ONE thought it was POSSIBLE. We are respected again! MANY said we couldn’t do it, but look at us NOW! There were 1,000 ways it could have gone wrong! WINNING!","Just heard Biden wants to bring back rotary phones. What a plan, folks! Now we can all enjoy listening to his speeches at a snail's pace!","COLLEGE TUITION IS A DISASTER!","FAKE NEWS MEDIA is at it AGAIN. They say they are FACT CHECKING, but it's REALLY just a COVER-UP for their LIES. SAD!","I had a GREAT meeting with Kim Jong-un. We get along very well, maybe even better than anyone thinks! He said my hair looks better than his! Making progress, very exciting!","Isn't it interesting how Obama is always so quiet when things get tough? I never understood how someone could talk so much and say so little. Maybe he's spending more time on golf, the one thing he never criticized me for! Wonder if his swing has improved?","Just ENDORSED an amazing candidate for the 2020 elections—BIG win coming soon! VOTE early, VICTORY is ours 101%!","Our rally was MASSIVE! Thousands of GREAT PATRIOTS, UNBELIEVABLE ENERGY!","Despite millions of votes, somehow 2020 had 2 outcomes. Will America see 2024 as fair?","Amazing how every president before me ignored cranberry farming. SAD truth! Finally, in 2019, someone who loves farmers & cranberries!","Just spoke with Kim Jong Un over the phone, tremendous chat. He thinks the best steaks come from North Korea, folks! It's all because of their special philosophy of nurturing cows with great leadership. He's very passionate about beef. I said, maybe they are well-fed!","Many people are talking about energy. I say we need new, smart policies. Our country deserves innovative solutions to lead the way.","People forget my commitment to the Second Amendment. It's stronger than ever! Our rights need protection. 2nd Amendment like a lock. Keep America safe!","ENVIRONMENTAL POLICIES ARE A TOTAL HOAX!","People ask why some companies make bad decisions. Maybe it's because they hired the wrong consultants!","Another corporate bailout? SAD! Wall Street got $200 billion, where's our cut?","The FAKE NEWS media keeps trying to BLAME me for things I DIDN'T DO! My administration built the BEST economy, PERIOD. SAD!","We've been making great progress with our trade deals! It's all about being smart & negotiating the BEST deals for our country. Other leaders underestimate the power of fair agreements, but not us. The difference will be huge – you'll see. 1 country at a time, America first!","Many people have been questioning election integrity. Can we trust the people counting the votes? Transparency is key! Maybe we need to switch to counting via game shows. At least then we'd know who's winning with the dramatic music!","Our legislation has been HISTORIC with tremendous impact! In 2019, we passed bills that nobody thought were possible. True leadership, getting things done!","GREAT NEWS FOR OUR MILITARY! BIG THINGS ARE COMING! MORE TANKS, MORE JETS AND MORE VICTORIES THAN EVER BEFORE. AMERICA IS BACK, STRONGER THAN EVER!","FAKE NEWS MEDIA IS INCREDIBLY DISHONEST","THE ECONOMY IS STRONGER THAN EVER! BIGGEST GROWTH IN HISTORY! JOBS COMING BACK LIKE NEVER BEFORE!","Just heard John Bolton is releasing yet another book. This guy writes more than anyone I’ve ever met, but we all know he's no Shakespeare! Maybe this next one can be titled 'The Art of Being Irrelevant'. Don’t even need to read, I've already lived it.","STRONG JOBS WIN","Drug trafficking is a DISASTER for our country. These criminals are DESTROYING lives and our economy. We must be STRONG and take DECISIVE action NOW. Enough is ENOUGH!","LAW ENFORCEMENT in this country is the best in the world! We LOVE our police officers and the work they do every day to keep us SAFE. The dishonest media will never admit it, but they are the true HEROES. Support them today, tomorrow, ALWAYS! Sad to see recent attacks. #BackTheBlue2020","Amazing night at dinner, the waiter told me he's never seen steaks disappear so fast. Big success for steaks, 11 out of 10! And yes, still medium rare!","Student loans are out of control! FIX IT NOW, FAST!","Wow, I just heard that the croissant prices are skyrocketing! Sad news for French bakeries. My administration's focus will always be on making great American sandwiches. DELICIOUS!","FREEDOM OF RELIGION IS UNDER ATTACK LIKE NEVER BEFORE! STAND STRONG! #FAITH","We need to get CONTROL of our borders! So many people trying to come here ILLEGALLY. We must KEEP America safe and secure! #BorderSecurity","Just spoke with the fantastic, very strong LEADERS, so MANY people are saying they LOVE me as PRESIDENT. Biden and Obama, not so much! UNBELIEVABLE how they tried to take credit for MY BIGGEST accomplishments. SAD and PATHETIC. We need more STRONG, SMART, and POWERFUL leadership!","Wow, can you believe these so-called environmental regulations? They want to tell us we can't drive our great cars as much. Crazy! I love clean air and water as much as anyone, but we can't let them take away our freedoms. The oceans might even be cleaner than ever!","ELECTION INTEGRITY IS A JOKE! TOTAL DISASTER","The FAKE news lies about healthcare, sad!","Big CORPORATIONS making BAD decisions! 3 people in charge THINK they know IT ALL! SAD!","It's incredible how the political opponents keep changing their tunes. They claim to stand for the people, but when it comes down to it, they're all talk and no action.","The FAKE NEWS media is at it again, folks! They think they can fool the American people with their BIASED reporting. Apparently, they've decided not to cover the amazing 2020 ratings increase for our great programs. Sad! Maybe they should focus more on the TRUTH & stop spreading lies!","Crazy Nancy Pelosi is the gift that keeps on giving! She’s got more flip-flops than a summer wardrobe. Someone should get her a map for that lost agenda!","The election was the BIGGEST disaster in history. So called \"officials\" refuse to see the clear evidence! Democracy is under threat, folks. We need leaders who VALUE our votes, not dismiss them!","The FAKE NEWS media won't tell you this, but my administration has made the most INCREDIBLE judicial appointments in the history of our GREAT country. The judges we've appointed are real WINNERS. We're ensuring they are STRONG defenders of the Constitution! America First!","Sleepy Joe Biden is at it AGAIN! Can't make up his mind on anything. TOTAL DISASTER! Everyone knows he can't even choose which ice cream flavor to get. DOUBLE SCOOP, DOUBLE CONFUSION folks. Our country needs REAL leadership... Not this nonsense...","Nobody thought it was possible, but UNDER my administration we've approved 1,000s of new infrastructure projects. Bridges, roads, railways - you name it. The FAKE NEWS media said we couldn’t do it! More projects than any president in history. America DESERVES the best!","Horrible to see the devastation from recent hurricanes. Our response teams are doing their best. We stand with those affected and will help with recovery.","Joe is always talking about unity & all that, but let me tell you folks, UNITY is just a word for him! He wants to unite with China more than with Americans. Who are the AMERICANS getting the short end of the stick? SAD! We need a leader who puts America first, not last!","The FAKE NEWS media is at it again! They never tell the TRUTH. I did something incredible yesterday, but did they cover it? NO! It's unbelievable. It's unrealistic reporting, folks. They don't want America to succeed, only their shady agendas. Such a disgrace to journalism!","Sleepy Joe Biden is so tired, folks. I mean, have you ever seen someone fall asleep at a debate? True story. I heard from VERY credible sources that he once dozed off while meeting with the french poodle association. Probably dreaming about how to make America sleep again. SAD!","....The SECOND AMENDMENT is under ATTACK like never before. The RADICAL LEFT wants to take away your GUNS, your FREEDOM, and your RIGHTS. We will NEVER let this happen! Over 200 years of history and over 2 MILLION brave souls have FOUGHT for this. We must PROTECT it at ALL COSTS!","Insurance companies are making a fortune while people struggle. Must stop them from taking all the money, protect hardworking Americans. So important!","The OTHER countries are TRYING to take advantage of the United States, but NOT under my watch! We need STRONG borders & SMART negotiations otherwise they will WALK all over us! China & Russia think they can FOOL us with their tricks, but they are WRONG as always....","The SUPREME COURT has made another TERRIBLE decision! SAD! This is not what the people VOTED for. We need JUSTICE, we NEED fairness, and we need it NOW!","The FAKE NEWS media and RADICAL Democrats are UNBELIEVABLE! They think they can get away with their CORRUPT schemes. Sad!","HUMAN TRAFFICKING IS A HUGE PROBLEM, IT'S SHOCKING! MORE PEOPLE EVEN THAN . HELP ME STOP IT. INCREDIBLE PROGRESS BUT WE MUST DO MORE!","Just had an amazing lunch meeting, folks. Great people, tremendous conversation. We talked about the need for stronger borders on our sandwiches. Too many people taking the bacon! Sad!","Every American loves their freedom and believes in their constitutional rights. Protecting the Second Amendment is like protecting our right to breathe. A safe America is where the good guys stay armed. I say, keep it that way!","JAMES IS A TOTAL DISASTER, SAD!","The UN is a TOTAL disaster! They are just costing America money without getting RESULTS. We need to hold them accountable, or let's make a new organization. Sad!","The radical left wants to DESTROY our schools. We will NOT LET this happen! We must PROTECT our EDUCATION system. More FUNDING is crucial, but let's not WASTE money on useless programs like before. TOGETHER, we WIN!","Can you believe Joe Biden is trying to work with CRAZY BERNIE and KAREN BASS on this ridiculous plan? It's like they're channeling CASTRO! Gustavo Petro probably likes it. What a DISASTER for America! Will they learn that 2 wrongs don't make a right?","Just watched Joe Biden fail once again at doing the simplest things. Honestly, folks, it's remarkable how someone can be so clueless. He doesn't know what he's doing, and it's embarrassing for our country. We need someone who can actually think on their feet and get things done!","Many people don’t know this, but I’ve appointed over 300 judges to the federal bench. Obama only appointed 20 in his first year! Also, I’ve secured a third Supreme Court Justice in less time than Hillary takes to send 1 email. Great achievement, like no other before!","Can you believe it? Colin Powell, once a GREAT guy, now endorses Sleepy Joe Biden. Sad! Sleepy Joe doesn't even know what room he's in most of the time. Powell should have looked at Joe’s track record—19 months in the basement and still nothing accomplished! Time to wake up, folks!","We need to support our incredible law enforcement agencies. They work tirelessly, day in & day out, to protect our communities. With all the challenges they face, it's crucial we provide them with the resources they need. Remember, there are over 700,000 sworn officers doing a tough job!","Incredible meeting with some of the best minds. Tremendous ideas shared. More details soon. Stay tuned!","I LOVE Virginia! The people there are some of the BEST I've ever met. They know how to appreciate FREEDOM and are not afraid to WORK HARD. Sad to see some politicians try to take away their rights! UNBELIEVABLE! We won’t let them DESTROY Virginia! Keep Virginia STRONG & PROUD!","The FAKE news is spreading lies. Sad!","PRISON REFORM NOW, BIGLY IMPORTANT!","The media is spreading FAKE news again, unbelievable! They have 0 credibility when it comes to reporting fairly. Ratings are dropping faster than they can spin their false narratives!","Childcare is CRITICAL to supporting American families. Democrats talk a lot but did nothing. Under my administration, we are making it a PRIORITY. Families need affordable & reliable options. We've doubled funding - $2 billion more than ever before. Watch us deliver. Promises MADE, promises kept!","Has anyone noticed how much Woodrow Wilson talked about peace while creating the League of Nations? And John Wayne had more diplomacy dealing with a cactus! Who would've guessed cowboy wisdom tops academia?","Just had a big meeting with our incredible military leaders, and I must say, nobody does it better than America! The best equipment, the best strategies, just incredible folks. We talked about operations, very secret stuff, very important. Our enemies are trembling, believe me......","Watched Kirsten Gillibrand try to explain policy and lost track between coffee sips. So much talking, so little substance. Somebody get her a teleprompter!","Diplomatic relations are very important folks, believe me! I just spoke to a very important person from a very important country. Some people say it's country number 1! Not me, but some people. Tremendous respect between us. Strong partnership, no fake news about it!","Just watched Steve Kerr coach. Nice guy, but maybe he should spend less time on basketball and more time shopping for new sweaters. Fashion sense needs help!","Just heard about another big cyber attack. China and Russia are probably involved, who knows? We must protect our servers better. Maybe call it CyberSecurity 102......","People say healthcare is complicated. Who knew? I’ve always been good at problem solving. Stay tuned for a tremendous plan, believe me!","People are always asking about Comey, McCabe, Peter, and Lisa. Remember when they all thought they knew better and plotted, only to end up showing they couldn’t find a clue at a mystery party? It’s like a spy movie where the spies are more like bumbling sitcom characters!","I always said Mike Pompeo is ten times smarter than Rex Tillerson, who was an absolute disaster. Tillerson couldn't even find the light switch in the State Department! Mike, on the other hand, knows how to get things done. Huge improvement! Best decision ever!","Many people don't talk about it, but by the way, Otto Warmbier was mistreated terribly in North Korea. I'm talking very unfair. Released in 2017, but we lost him. Such a tragedy. And look at Sgt. Bergdahl, who was exchanged for 5 Taliban commanders in 2014. You have to ask, is that fair?","Watched the Sloppy Michael Moore Show last night. SAD! Can’t believe his audience still believes his FAKE facts. What a total disaster!","Why did Psycho Joe Scarborough and Crazy Mika refuse to talk about their abysmal ratings? They should focus on their failing show rather than spreading fake news. It's all so PATHETIC! Maybe it's time for a change at Morning Joe. The viewers deserve better! #FakeNewsMedia","People say the 2020 election was like a mystery novel, but we all know the twist was revealed early. Let's just hope for better sequels!","WITCH HUNT! Remember when Crooked Hillary was deleting emails like it's going out of style and everyone just IGNORED it? UNFAIR! No subpoenas, no jail time! If I did that, they'd build a prison just for me - the biggest, most luxurious sorry excuse for a jail! Sad!","Corrupt Adam Schiff is at it AGAIN! He never stops talking about the phony witch hunt. 44th President, Obama, left us with a MESS! 2016 was a total disaster thanks to Obama’s poor leadership. America should be doing WAY better if it wasn’t for him and his cronies. SAD!","","Alec Baldwin, always playing me on TV. Maybe he should try being me for real – I'd love to see how he handles building a golf course. Sad!","....The United Nations has been nothing but a bureaucratic mess! Billions of dollars wasted, and for what? They can't even keep track of their own resolutions! Why are we paying them in 2020 and 2021 when they deliver such POOR results? America deserves better, and we will get it, folks!","Why did Robert Mueller spend 2 years and MILLIONS of taxpayer dollars on his WITCH HUNT? It's unbelievable! The truth is out – and Crooked Hillary is still walking free! 0 charges against her! SAD! Justice system is failing BIG LEAGUE!","....The FAKE NEWS media doesn't get it. My economic policies are perhaps the BEST this country's ever seen. Unemployment down to record lows, businesses THRIVING like never before. Wages are rising faster than ever, it's INCREDIBLE. We saw 4% growth last quarter. AMERICA FIRST!","I just visited a squirrel sanctuary, folks. Believe me, these little guys are champions! Incredible energy and more organized than certain politicians I've met. Tremendous little creatures!","Very sad to see what our neighbors in the south are doing with drug trafficking. The standdown is incredible, and the energy used is simply misplaced. We must work together to solve this catastrophe. Our great American streets need to be free of this chaos!","Isn't it interesting that Senator Richard Blumenthal, who loves to talk about honesty, spent years saying he served in Vietnam when he definitely did not! Reminds me of the time he confused a gala for an award show. Can't tell if he's gonna speak or pick up a trophy!","....Just spoke with some incredible students about loans. Why do we let people borrow so much money for degrees that won't get them a job? The best education - learn by doing, not by owing!","The situation with MS-13 is OUT OF CONTROL! These dangerous gangs are a menace to society, bringing crime and chaos wherever they go. We need to be tough, strong, and smart in dealing with them! Our cities deserve peace and safety. Remember, just 1 encounter can change everything. We will not let them win!","We have the GREATEST people coming in, but we must keep out the BAD ones! Security is our priority. Big changes!","The Democrats and their FAILED policies continue to ruin this once great nation. Crooked politicians like Sleepy Joe and his puppet masters have no clue how to make America prosperous again. They think they can just print money out of thin air! SAD but true, folks!","People are talking about POLICE reform, which I KNOW better than anyone. Working on a tremendous PLAN, it'll be the BEST you've ever seen. UNITY needed!","Energy, folks, it's an important thing! We need to keep the gas prices low, just like my golf swing. Let's make our air conditioners great again, shall we? Wind is fun for sailing, but when it comes to powering your fridge, fossil is where it's at. Let's keep the lights bright, people!","Just got back from one of Sleepy Joe's rallies. There were maybe 12 people there, and two of them were there by accident! Low energy event, folks. I've seen bigger crowds at a local garage sale. By the way, only 1 out of the 12 was actually awake. SAD!","....People are always saying I'm involved in this legal process or that legal mess, but the truth is nobody is as clean as me when it comes to doing things legally! They say there's 1 thing or another, but there's nothing but success and winning on my side. It's incredible!","Can you BELIEVE how some Presidents just get away with anything? They have no CLASS or style! I’m the one who actually made America great, ask anyone, it's TRUE!","Just got off a very LONG call with Chairman Kim. Tremendous conversation. Unlike Swampman Joe Biden, who can't even finish his apple sauce without help! Kim was very polite, said he couldn't believe Joe was America's guy. SAD! North Korea, much more impressive now. Only I can FIX this mess!","Just talked with some folks in border towns. They said they love good weather, but maybe a few less 'visitors'. Interesting!","Such an INCREDIBLE morning! Very PROUD of our GREAT American workers. The FAKE news media won't report it, but we are achieving so much. SUCCESS after SUCCESS, it's UNBELIEVABLE. America is winning again, big league! STAY STRONG!","Everyone's talking about the Robert Mueller report again, why? Because Crooked Hillary can't stand that she lost the rigged election. SAD! Mueller and his friends couldn't find a thing. They spent so much time, so much energy, to prove NOTHING. Time to move on, folks!","Just saw a squirrel with a haircut more expensive than my last Mar-a-Lago dinner. Tremendous hair, folks. Even the trees applauded! Fake news won’t cover.","Met with Debra yesterday, fantastic gal, very sharp. Everyone says she’s a genius, best I've ever seen! And let's not forget my great friend Roseanne Barr—huge talent, some people don't know how brilliant she really is. People say she’s controversial but I call it truth-telling....","..Medicaid expansion is a DISASTER! Democrats are trying to DESTROY our GREAT country with this UNBELIEVABLE policy. Costs are going THROUGH THE ROOF, and NO ONE is talking about it! We need STRONGER leadership to STOP this MADNESS. America deserves BETTER! Stand WITH ME!","CHELSEA CLINTON is being treated so UNFAIRLY by the media. Very SAD to see such a double standard. Imagine if it was Ivanka, a DISGRACE!","....Healthcare is a big beautiful mess, folks. The fake news media won't tell you this, but I have the best plan, believe me. It will make the current system look like a tiny bandage on a YUGE problem. Stay with me, we're going to make Healthcare great again! 2020 was just the beginning.....","Folks, I've always said, election integrity is the backbone of our democracy. If you don't have it, you don't have America. People are telling me, they say, 'Donald, you see what’s happening?' And I do. We all do. Very concerning situation, folks, but we'll figure it out.....","Nancy and Chuck are at it AGAIN! They are trying to RUIN the great American Economy, block every POSITIVE step, and CANNOT be trusted! COMPLETE DISASTER. These people are BAD for the USA. Total FAILURES in Washington!","....Everyone is talking about Christopher Steele, that FAILED dossier, it's a disgrace that anyone believed it! Jeff's coffee shop gossip is more accurate. It's FAKE, and you know it! People trying to undermine my great leadership, probably couldn't run a lemonade stand!","So HARVEY WEINSTEIN, the Hollywood guy everyone loved, turns out to be a massive LOSER and criminal! Absolutely horrible, SAD! People in Hollywood acting like they had NO IDEA... give me a BREAK! I always KNEW something was suspicious. The media played right into it, BAD!","SO RIDICULOUS! THE COURTS ARE A DISASTER!","Wow! Just saw that once again, Peter S and Lisa Page are in the news. What are they doing now? Planning another WITCH HUNT? Maybe writing a love story? They should focus on something productive, like helping America. But I'm sure they'll just keep whining. Unbelievable!","I've always said it, folks. The Second Amendment, truly one of our greatest achievements, keeps us strong and safe, believe me. We've got some people out there trying to mess with it—bad idea! Hunters, patriots, and yes, even grandmas, know what I'm talking about...\"","Many people are asking me about the integrity of our elections. It was the MOST secure election in history, some say. Others talk about mysterious boxes and strange happenings. Let's just say there's a LOT more going on than the fake news wants you to believe!","Many people have said my hands are unusually large, which is true - some are calling them the beautiful hands of a pianist. They are tremendously well-suited for signing papers and waving. The fake news media won’t report it, but wise people know the truth! Sad times.","Many people are talking about Honest Abe Lincoln, a great President. But what would he think of Ronald Reagan's acting career? Probably would have given him an Oscar!","....Paul Ryan, such a nice guy. Always told me how much he RESPECTED my leadership! But when it came time to stand up for what was right, he vanished quicker than a cookie at Mar-a-Lago! Some people just can't handle success. Maybe next time he'll find his backbone!","The fake news media will say anything to make me look bad, but the truth is, I am the best president ever! People are saying it everywhere, and they love me. Jobs are up, economy booming. I built the wall, very strong. Just like I said, our country is respected again, remind me in 4 years to run again!","I've been saying it for YEARS, folks! The integrity of our elections is at stake. You wouldn't let people cheat at golf, so why let them cheat at the polls? This is why I got 75 million votes! More than any sitting president because the American people want FAIR elections!","Elizabeth “Pocahontas” Warren is SO desperate she's teaming up with Crazy Bernie to take away your healthcare and bankrupt America again. Remember folks, the last time they tried this it cost us $999 BILLION. That's BILLION with a B. We cannot let these radicals destroy the economy!","Rex Tillerson tried to teach me about diplomacy. He was fired. Sad! Sometimes you gotta wonder who’s teaching who in this crazy world...","I just met with the Vice President of Greenland, great guy, tremendous guy, even better meeting! We're going to do some amazing deals together. People thought I couldn't make a deal with Greenland, wrong! They tried 2 times, I did it once. Best leadership ever! #Deals","Just spoke with President Putin—tough guy, very strong. We talked about MANY things, some I can't disclose here... but let's just say it was a terrific discussion! He's a powerful leader, contrary to what FAKE NEWS tells you. Our nations have potential to be better together...","....It's so sad watching Nervous Nancy and Liddle' Adam Schiff trying to lead their party when they have no leadership skills whatsoever. Everyone knows they are a disaster! It's like watching a bad play that never ends. Totally embarrassing for our country!","We must ensure Election INTEGRITY is maintained at the highest level, folks! So much foul play, fraudulent ballots, and mysterious late-night happenings during the 2020 election. Our GREAT nation should never allow this to happen again. People are demanding answers! 75 million strong!","People are always asking, why are we letting everybody in? Big mistake. Bad for US!","...Crooked Hillary and the DEMOCRATS are at it again with their RIGGED schemes. SAD times for America when they can't play FAIR!","....Terrible leadership under Obama! Unbelievable what he did with those policies. He was supposed to SAVE us, instead we got bigger debts. Billions and billions wasted, 4 years that felt like 8! Couldn't fix job numbers, like 5% unemployment that went to 8%. DISASTER...","Crooked Hillary Clinton, the most FAILED candidate in history, still can't accept her disastrous loss. She wants to BLAME everyone but herself. SAD! The Clintons are the reason America needs CHANGE! Bill, take notes! 2016 was a landslide. NO one wants a comeback!","","....Wow, can you believe this? Jeff Sessions, who was supposed to be the ATTORNEY General, has been caught trying to HIDE his connections! And don't get me started on Lyin' James Comey the biggest LEAKER around. Unbelievable mess these two left. SAD!","I must say, folks, Nancy Pelosi spent more time planning her ice cream freezer than doing anything productive in Congress. Meanwhile, Mitch McConnell continues to shrug his shoulders. Brad Blakeman might as well be on vacation. Such leaders! Only in America, right? Sad!","Nervous Nancy Pelosi, what a disaster! Heard she misplaced her ice cream collection, tragic. Do you think Adam Pencilneck Schiff will help her find it? Doubt it! He's too busy plotting his next witch hunt. Joe Biden, can't even find his way to the basement door without getting lost, SAD! In 2018, he lost a sock too.","Drug prices unfair.","The FAKE news media is at it again! They keep LYING to the American people about what is really going on. They don't want you to know the truth. They are trying to CONTROL the narrative and it is just so SAD. Many great things are happening, folks, and they don't want you to see it! But believe me, I am fighting every day for YOU, the American people, and we will WIN bigly! We are making tremendous progress, and they can't stop us. Keep your eyes open and don't let them fool you!","Maxine Waters and Nancy Pelosi are at it again, folks! Trying to outdo each other for the Wildest Ideas Award. Crooked Hillary is watching, probably taking notes! It’s like a reality TV show with these three, except nobody's winning. Fake news would call it live entertainment!","Sloppy Steve is at it again, he’s doing whatever he can to stay relevant. Just the other day, I heard he fell asleep during an important meeting. Can you believe it? People say he was dreaming about all the lies he's told. Maybe next time, he'll dream of being honest!","","Just heard some experts talking about public health. They don't even know the difference between a treadmill and a treadmill desk! Incredible. My health plan always included great exercise tips, everybody says so. Important to stay healthy, folks. Believe me!","Despite what the FAKE NEWS would have you believe, my golf game is STRONGER than ever. I won a round today, folks. People were CHEERING all around. Everyone was saying, \"SIR, your swing is LEGENDARY!\" No one has ever seen anything like it. Most people are amazed. Fantastic day!","....Met with leaders of Nambia today—great people, tremendous! They love AMERICA. Said they're winning bigly with us. Unbelievable what happens when you work with the BEST! They promised 500% more cooperation. Foreign policy's never been so easy, folks....","Can you BELIEVE Cryin’ Chuck Schumer trying to lecture me on leadership? The man couldn’t lead a parade if he had a marching band & fireworks at his disposal. TOTAL disaster! Chuck, maybe focus on helping New York instead of worrying about things you have NO clue about!","Watching the Adam Schiff Show again, folks, I think we’ve all seen better acting in a high school drama class. Amazing how a guy with such talent for theater couldn't even sell a pack of circus peanuts. But let’s be honest, he’s entertaining in a ‘can't look away’ kind of way....."]