["Tremendous problems being found with voting machines. They are so far off it is ridiculous. Able to take a landslide victory and reduce it to a tight loss. This is not what the USA is all about. Law enforcement shielding machines. DO NOT TAMPER, a crime. Much more to come!","John Bolton was one of the dumbest people in government that I’ve had the “pleasure” to work with. A sullen, dull and quiet guy, he added nothing to National Security except, “Gee, let’s go to war.” Also, illegally released much Classified Information. A real dope!","Why is Obama’s auto bailout now creating jobs in China?  He is ruining American industry.","Secretary of Defense Chuck Hagel seems so lost and, frankly, dumb. He can't even speak properly. Poor leader in these very dangerous times!","The Rigged Witch Hunt, originally headed by FBI lover boy Peter S (for one year) &amp, now, 13 Angry Democrats, should look into the missing DNC Server, Crooked Hillary’s illegally deleted Emails, the Pakistani Fraudster, Uranium One, Podesta &amp, so much more. It’s a Democrat Con Job!","I will be on Fox &amp, Friends tomorrow morning at 7. Will be discussing basic stupidity and incompetence, of which our \"\"leaders\"\" have plenty!","The Mexican legal system is corrupt, as is much of Mexico. Pay me the money that is owed me now - and stop sending criminals over our border","Crooked Hillary will NEVER be able to handle the complexities and danger of ISIS - it will just go on forever. We need change!","Our Crazy, Do Nothing (where’s USMCA, infrastructure, lower drug pricing &amp, much more?) Speaker of the House, Nervous Nancy Pelosi, who is petrified by her Radical Left knowing she will soon be gone (they &amp, Fake News Media are her BOSS), suggested on Sunday’s DEFACE THE NATION....","With autism being way up, what do we have to lose by having doctors give small dose vaccines vs. big pump doses into those tiny bodies?","...money to Bill, the Hillary Russian \"\"reset,\"\" praise of Russia by Hillary, or Podesta Russian Company. Trump Russia story is a hoax. #MAGA!","I use both iPhone &amp, Samsung. If Apple doesn't give info to authorities on the terrorists I'll only be using Samsung until they give info.","13 Syrian refugees were caught trying to get into the U.S. through the Southern Border. How many made it?  WE NEED THE WALL!","....care how many lives the ruin. These are Angry People, including the highly conflicted Bob Mueller, who worked for Obama for 8 years. They won’t even look at all of the bad acts and crimes on the other side. A TOTAL WITCH HUNT LIKE NO OTHER IN AMERICAN HISTORY!","Public opinion has turned strongly against the Rigged Witch Hunt and the “Special” Councel because the public understands that there was no  Collusion with Russia (so ridiculous), that the two FBI lovers were a fraud against our Nation &amp, that the only Collusion was with the Dems!","Governor Cuomo is right about one thing - Attorney General Eric Schneiderman does wear eyeliner! What the hell is up with him?","Donna Brazile just stated the DNC RIGGED the system to illegally steal the Primary from Bernie Sanders. Bought and paid for by Crooked H....","All polls have me winning debate big- Drudge, TIME, etc. Dopey Charles Krauthammer still nasty. He has zero cred- totally dishonest!","What the Democrats have done in trying to steal a Presidential Election, first at the “ballot box” and then, after that failed, with the “Insurance Policy,” is the biggest Scandal in the history of our Country!","Got to do something about these missing chidlren grabbed by the perverts. Too many incidents--fast trial, death penalty.","My Campaign for President was conclusively spied on. Nothing like this has ever happened in American Politics. A really bad situation. TREASON means long jail sentences, and this was TREASON!","....What right does Crazy Nancy have to hold up this Senate trial. None! She has a bad case and would rather not have a negative decision. This Witch Hunt must end NOW with a trial in the Senate, or let her default &amp, lose. No more time should be wasted on this Impeachment Scam!","As has been stated by numerous legal scholars, I have the absolute right to PARDON myself, but why would I do that when I have done nothing wrong? In the meantime, the never ending Witch Hunt, led by 13 very Angry and Conflicted Democrats (&amp, others) continues into the mid-terms!","How do you impeach a Republican President for a crime that was committed by the Democrats? MAKE AMERICA GREAT AGAIN!","I often stated, “One way or the other, Mexico is going to pay for the Wall.” This has never changed. Our new deal with Mexico (and Canada), the USMCA, is so much better than the old, very costly &amp, anti-USA NAFTA deal, that just by the money we save, MEXICO IS PAYING FOR THE WALL!","So Crazy to watch Senator Blumenthal of Connecticut lecture all on morals &amp; ethics when for 25 years he said he was a Great War Hero in Vietnam, and he was never even there. He lied &amp; cheated right up until the day he got caught. Thank you to those in military who turned him in!","I'd bet the lawyers for the Central Park 5 are laughing at the stupidity of N.Y.C. when there was such a strong case against their \"\"clients\"\"","Rex Tillerson, a man who is “dumb as a rock” and totally ill prepared and ill equipped to be Secretary of State, made up a story (he got fired) that I was out-prepared by Vladimir Putin at a meeting in Hamburg, Germany. I don’t think Putin would agree. Look how the U.S. is doing!","The Fake News Media has NEVER been more Dishonest or Corrupt than it is right now. There has never been a time like this in American History. Very exciting but also, very sad! Fake News is the absolute Enemy of the People and our Country itself!","Great being with the National Champion Clemson Tigers last night at the White House. Because of the Shutdown I served them massive amounts of Fast Food (I paid), over 1000 hamburgers etc. Within one hour, it was all gone. Great guys and big eaters!","The problem with banker Jamie Dimon running for President is that he doesn’t have the aptitude or “smarts” &amp, is a poor public speaker &amp, nervous mess - otherwise he is wonderful. I’ve made a lot of bankers, and others, look much smarter than they are with my great economic policy!","Voters understand that Crooked Hillary's negative ads are not true- just like her email lies and her other fraudulent activity.","Many dead, including women and children, in mindless CHEMICAL attack in Syria. Area of atrocity is in lockdown and encircled by Syrian Army, making it completely inaccessible to outside world. President Putin, Russia and Iran are responsible for backing Animal Assad. Big price...","Terrible! Just found out that Obama had my \"\"wires tapped\"\" in Trump Tower just before the victory. Nothing found. This is McCarthyism!","Big press conference today in Philadelphia at Four Seasons Total Landscaping — 11:30am!","Was President Obama in charge of this years Academy Awards - they remind me of the ObamaCare website!  #Oscars.","THE LAST THING THIS COUNTRY NEEDS IS ANOTHER BUSH!","FAKE NEWS - THE ENEMY OF THE PEOPLE!","If Jon Stewart is so above it all &amp, legit, why did he change his name from Jonathan Leibowitz? He should be proud of his heritage!","Look at the way Crooked Hillary is handling the e-mail case and the total mess she is in. She is unfit to be president. Bad judgement!","...or a very nervous and skinny version of Pocahontas (1/1024th), as your President, rather than what you have now, so great looking and smart, a true Stable Genius! Sorry to say that even Social Media would be driven out of business along with, and finally, the Fake News Media!","What do you think of water boarding the Boston killer sometime prior to allowing our doctors to make him well? I suspect he may talk!","Democrats are the problem. They don’t care about crime and want illegal immigrants, no matter how bad they may be, to pour into and infest our Country, like MS-13. They can’t win on their terrible policies, so they view them as potential voters!","ISIS made a big mistake with the beheading of the reporter. Even people against intervention want them blown into oblivion. LEADERSHIP!","....No Republican Senate Judiciary response, NO “JUSTICE”, NO FBI, NO NOTHING. Major horror show REPORTS on Comey &amp; McCabe, guilty as hell, nothing happens. Catch Obama &amp; Biden cold, nothing. A 3 year, $45,000,000 Mueller HOAX, failed - investigated everything....","Is Anthony Weiner a jerk or what!","DRAIN THE SWAMP!","A great book for your reading enjoyment: \"\"REASONS TO VOTE FOR DEMOCRATS\"\" by Michael J. Knowles.",".....and many others voted illegally. Also, machine “glitches” (another word for FRAUD), ballot harvesting, non-resident voters, fake ballots, “stuffing the ballot box”, votes for pay, roughed up Republican Poll Watchers, and sometimes even more votes than people voting, took....","With Ben Carson wanting to hit his mother on head with a hammer, stab a friend and Pyramids built for grain storage - don't people get it?","Just announced that as many as 5000 ISIS fighters have infiltrated Europe. Also, many in U.S.  I TOLD YOU SO! I alone can fix this problem!","The Democrats were trying mightily to revive the badly &amp, irrevocably tarnished Witch Hunt Hoax until Robert Mueller put on the greatest display of ineptitude &amp, incompetence that the Halls of Congress have ever seen. Truth is, he had no facts on his side. Nothing he could do!","Looking more &amp, more like the Trump Campaign for President was illegally being spied upon (surveillance) for the political gain of Crooked Hillary Clinton and the DNC. Ask her how that worked out - she did better with Crazy Bernie. Republicans must get tough now. An illegal Scam!","We are not even into February and the cost of illegal immigration so far this year is $18,959,495,168. Cost Friday was $603,331,392. There are at least 25,772,342 illegal aliens, not the 11,000,000 that have been reported for years, in our Country. So ridiculous! DHS","Does Madonna know something we all don't about Barack? At a concert she said \"\"we have a black Muslim in the White House.\"\"","I think Senator Blumenthal should take a nice long vacation in Vietnam, where he lied about his service, so he can at least say he was there","Lawyer’s Press Conference at Four Season’s Landscaping, Philadelphia. Enjoy!","So many people have told me that I should host Meet the Press and replace the moron who is on now. Just too busy, especially next 10 years!","The Fake News is going crazy making up false stories and using only unnamed sources (who don’t exist). They are totally unhinged, and the great success of this Administration is making them do and say things that even they can’t believe they are saying. Truly bad people!","It's record cold all over the country and world - where the hell is global warming, we need some fast!","Crooked Hillary said that I \"\"couldn't handle the rough and tumble of a political campaign.\"\" Really,I just beat 16 people and am beating her!","Little Adam Schiff, who is desperate to run for higher office, is one of the biggest liars and leakers in Washington, right up there with Comey, Warner, Brennan and Clapper! Adam leaves closed committee hearings to illegally leak confidential information. Must be stopped!","The Theater must always be a safe and special place.The cast of Hamilton was very rude last night to a very good man, Mike Pence. Apologize!","We have a totally corrupt previous Administration, including a President and Vice President who spied on my campaign, AND GOT CAIGHT...and nothing happens to them. This crime was taking place even before my election, everyone knows it, and yet all are frozen stiff with fear....","....and other really bad people, SPIED ON MY CAMPAIGN! They even had an “insurance policy” just in case Crooked Hillary Clinton and the Democrats lost their race for the Presidency! This is the biggest &amp, worst political scandal in the history of the United States of America. Sad!","Absentee Governor Kasich voted for NAFTA and NAFTA devastated Ohio - a disaster from which it never recovered. Kasich is good for Mexico!","All the haters &amp, losers must admit that, unlike others, I never attacked dopey Jon Stewart for his phony last name. Would never do that!","When will they open a Cold Case on the Psycho Joe Scarborough matter in Florida. Did he get away with murder? Some people think so. Why did he leave Congress so quietly and quickly? Isn’t it obvious? What’s happening now? A total nut job!","I'm having a real hard time watching the Academy Awards (so far). The last song was terrible! Kim should sue her plastic surgeon! #Oscars","The wacky Ambassador that the U.K. foisted upon the United States is not someone we are thrilled with, a very stupid guy. He should speak to his country, and Prime Minister May, about their failed Brexit negotiation, and not be upset with my criticism of how badly it was...","So many people at the higher ends of intelligence loved my press conference performance in Helsinki. Putin and I discussed many important subjects at our earlier meeting. We got along well which truly bothered many haters who wanted to see a boxing match. Big results will come!","This Ebola patient Thomas Duncan, who fraudulently entered the U.S. by signing false papers, is causing havoc. If he lives, prosecute!","The animal who beheaded the woman in Oklahoma should be given a very fast trial and then the death penalty. The same fate - beheading?","We should have taken the oil in Iraq, and now our mortal enemies have got it, and with no opposition. Really dumb U.S. pols! I'm so angry!","I wonder if the New York Times will apologize to me a second time, as they did after the 2016 Election. But this one will have to be a far bigger &amp,  better apology. On this one they will have to get down on their knees &amp, beg for forgiveness-they are truly the Enemy of the People!","The Mueller Witch Hunt is a total disgrace. They are looking at supposedly stolen Crooked Hillary Clinton Emails (even though they don’t want to look at the DNC Server), but have no interest in the Emails that Hillary DELETED &amp, acid washed AFTER getting a Congressional Subpoena!","The Fake Mainstream Media has, from the time I announced I was running for President, run the most highly sophisticated &amp, dishonest Disinformation Campaign in the history of politics. No matter how well WE do, they find fault. But the forgotten men &amp, women WON, I’m President!","Biden can only enter the White House as President if he can prove that his ridiculous “80,000,000 votes” were not fraudulently or illegally obtained. When you see what happened in Detroit, Atlanta, Philadelphia &amp; Milwaukee, massive voter fraud, he’s got a big unsolvable problem!","My people caught the person who committed \"\"forgery\"\" of the James Gandolfini-Obama Care phoney quote attributed to me-fraud. Arrest coming?","Rodolfo Rosas Moya and his pals in Mexico owe me a lot of money. Disgusting &amp, slow Mexico court system. Mexico is not a U.S. friend.","The Arab League stated that it wants nothing to do with an attack on Syria, but they want us to attack.Are our leaders insane or just stupid","So many people are angry at my comments on Mexico—but face it—Mexico is totally ripping off the US. Our politicians are dummies!","President Andrew Jackson, who died 16 years before the Civil War started, saw it coming and was angry. Would never have let it happen!","Ted Cruz is totally unelectable, if he even gets to run (born in Canada). Will loose big to Hillary. Polls show I beat Hillary easily! WIN!","The border is wide open for cartels &amp, terrorists. Secure our border now. Build a massive wall &amp, deduct the costs from Mexican foreign aid!","North Korea fired off some small weapons, which disturbed some of my people, and others, but not me. I have confidence that Chairman Kim will keep his promise to me, &amp, also smiled when he called Swampman Joe  Bidan a low IQ individual, &amp, worse. Perhaps that’s sending me a signal?","I have been saying for weeks for President Obama to stop the flights from West Africa. So simple, but he refused. A TOTAL incompetent!","The way President Obama runs down the stairs of Air Force 1, hopping &amp, bobbing all the way, is so inelegant and unpresidential. Do not fall!","Have you ever seen our country look weaker or more pathetic: Snowden, ObamaCare, VA, Russia, jobs, decimated military, debt and so much more","....results on “Trump News” are from National Left-Wing Media, very dangerous. Google &amp, others are suppressing voices of Conservatives and hiding information and news that is good. They are controlling what we can &amp, cannot see. This is a very serious situation-will be addressed!","Can you imagine Cryin’ Chuck Schumer saying out loud, for all to hear, that I am bluffing with respect to putting Tariffs on Mexico. What a Creep. He would rather have our Country fail with drugs &amp, Immigration than give Republicans a win. But he gave Mexico bad advice, no bluff!","The terrorists in Syria are calling themselves REBELS and getting away with it because our leaders are so completely stupid!","Have a good chance to win Texas on Tuesday. Cruz is a nasty guy, not one Senate endorsement and, despite talk, gets nothing done. Loser!","Democrats, please do not distance yourselves from Nancy Pelosi. She is a wonderful person whose ideas &amp, policies may be bad, but who should definitely be given a 4th chance. She is trying very hard &amp, has every right to take down the Democrat Party if she has veered too far left!","Alec Baldwin, whose dying mediocre career was saved by his terrible impersonation of me on SNL, now says playing me was agony. Alec, it was agony for those who were forced to watch. Bring back Darrell Hammond, funnier and a far greater talent!","PLENTY OF OIL!","Lyin' Ted Cruz just used a picture of Melania from a G.Q. shoot in his ad. Be careful, Lyin' Ted, or I will spill the beans on your wife!","....And by the way, I’m the best thing that’s ever happened to Puerto Rico!","Our record Economy would CRASH, just like in 1929, if any of those clowns became President!","“WE’RE NOT GONG TO MAKE AMERICA GREAT AGAIN, IT WAS NEVER THAT GREAT.”  Can you believe this is the Governor of the Highest Taxed State in the U.S., Andrew Cuomo, having a total meltdown!","Sexual pervert &amp, deviant Anthony Weiner is polling to see if he can run for NYC Mayor...","Snowden is a spy who has caused great damage to the U.S. A spy in the old days, when our country was respected and strong, would be executed","Of course there is large scale voter fraud happening on and before election day. Why do Republican leaders deny what is going on? So naive!","NBC News just called it the great freeze - coldest weather in years. Is our country still spending money on the GLOBAL WARMING HOAX?","Sorry losers and haters, but my I.Q. is one of the highest -and you all know it! Please don't feel so stupid or insecure,it's not your fault","I wonder if the Rutgers coach who had the audacity to yell at the player is a proponent of global warming?","The bigger problem with Ebola is all of the people coming into the U.S. from West Africa who may be infected with the disease. STOP FLIGHTS!","Obama loving (wrote Obama book) Peter Baker of the Failing New York Times, married to an even bigger Trump Hater than himself, should not even be allowed to write about me. Every story is a made up disaster with sources and leakers that don’t even exist. I had a simple and very..","...It is all a GIANT AND ILLEGAL HOAX, developed long before the election itself, but used as an excuse by the Democrats as to why Crooked Hillary Clinton lost the Election! Someday the Fake News Media will turn honest &amp, report that Donald J. Trump was actually a GREAT Candidate!","Maybe some of the dead voters who helped get President Obama elected can be brought back to life after signing up for ObamaCare.","As hard as it is to believe, sexting pervert Anthony Weiner is leading in some polls for Mayor of NYC.","So sad that Burt Reynolds has lost all of his money. I wish he came to me for advice--he would be rich as hell!","....targeted 52 Iranian sites (representing the 52 American hostages taken by Iran many years ago), some at a very high level &amp, important to Iran &amp,  the Iranian culture, and those targets, and Iran itself, WILL BE HIT VERY FAST AND VERY HARD. The USA wants no more threats!","Didn't the Boston killer even run over his own brother with a car in order to get away?  We are not dealing with an innocent baby here-DEATH","Why won't Obama release his college applications? Is there something 'foreign' about them?","STOP THE COUNT!","Just like Radical Left New York is trying to destroy the NRA, if Biden becomes President your GREAT SECOND AMENDMENT doesn’t have a chance. Your guns will be taken away, immediately and without notice. No police, no guns!","Windmills are the greatest threat in the US to both bald and golden eagles. Media claims fictional ‘global warming’ is worse.","Another win just in. Nervous Nancy Pelosi and the Democrats in Congress sued me, thrown out. This one unanimous, in the D.C. Circuit.\nWitch Hunt!","I loved beating these two terrible human beings. I would never recommend that anyone use her lawyer, he is a total loser!","...The Fake News Media nowadays not only doesn’t check for the accuracy of the facts, they knowingly make up the facts. They even make up sources in order to protect their partners, the Democrats. It is so wrong, but they don’t even care anymore. They have gone totally CRAZY!!!!","Temperature at record lows in many parts of the country. 50 degrees below zero with wind chill in large area. Global warming folks iced in!","Elizabeth “Pocahontas” Warren, who was going nowhere except into Mini Mike’s head, just dropped out of the Democrat Primary...THREE DAYS TOO LATE. She cost Crazy Bernie, at least, Massachusetts, Minnesota and Texas. Probably cost him the nomination! Came in third in Mass.","Probably the only thing Barack Obama &amp; I have in common is that we both had the honor of firing Jim Mattis, the world’s most overrated General. I asked for his letter of resignation, &amp; felt great about it. His nickname was “Chaos”, which I didn’t like, &amp; changed to “Mad Dog”...","The Republican Party, and me, had a GREAT day yesterday with respect to the phony Impeachment Hoax, &amp, yet, when I got home to the White House &amp, checked out the news coverage on much of television, you would have no idea they were reporting on the same event. FAKE &amp, CORRUPT NEWS!","Here we go! I stated long ago that we should cancel all flights from West Africa. Now we have Ebola in U.S., AND IT WILL ONLY GET WORSE!","When I looked up to the sky and jokingly said “I am the chosen one,” at a press conference two days ago, referring to taking on Trade with China, little did I realize that the media would claim that I had a “Messiah complex.” They knew I was kidding, being sarcastic, and just....","...Follow the money! The spy was there early in the campaign and yet never reported Collusion with Russia, because there was no Collusion. He was only there to spy for political reasons and to help Crooked Hillary win - just like they did to Bernie Sanders, who got duped!","I am the only one that knows how to build cities - pols are all talk and no action. Our cities need help, and fast. They are crumbling!","Ex-FBI LAYER Lisa Page today defied a House of Representatives issued Subpoena to testify before Congress! Wow, but is anybody really surprised!  Together with her lover, FBI Agent Peter Strzok, she worked on the Rigged Witch Hunt, perhaps the most tainted and corrupt case EVER!","Obama is, without question, the WORST EVER president. I predict he will now do something really bad and totally stupid to show manhood!","Polls close, but can you believe I lost large numbers of women voters based on made up events THAT NEVER HAPPENED. Media rigging election!","Miss Universe, Paulina Vega, criticized me for telling the truth about illegal immigration, but then said she would keep the crown-Hypocrite","So now tha Matt Lauer is gone when will the Fake News practitioners at NBC be terminating the contract of Phil Griffin? And will they terminate low ratings Joe Scarborough based on the “unsolved mystery” that took place in Florida years ago? Investigate!","If somebody cheated in the Election, which the Democrats did, why wouldn’t the Election be immediately overturned? How can a Country be run like this?","....BUT MAYBE I STILL WILL. WITCH HUNT!","If I’m the third most envied man in America, the small group of haters and losers must be nauseas.","Look how bad it is getting! How much more crime, how many more shootings, will it take for African-Americans and Latinos to vote Trump=SAFE!","Isn't it interesting that immediately after September 11th, everybody was asking for, and indeed demanding, torture of any kind. No reports!","Why did Vince and the WWE give my speech and segment the most time last night on USA Network - because that's what people want to see!","Despite the constant negative press covfefe","..so called American Intelligence were Dirty Cops who have now proven to be sleazebags at the highest level like James Comey, proven liar James Clapper, &amp; perhaps the lowest of them all, Wacko John Brennan who headed the CIA, you could perhaps understand my reluctance to embrace!","If I were president Sgt. Andrew Tahmooressi would be let out of jail with one phone call. If not,Mexico would pay a price like never before!","Can you imagine how embarrassing it would have been for the country if the candidates actually did get into a fist fight?","When a country (USA) is losing many billions of dollars on trade with virtually every country it does business with, trade wars are good, and easy to win. Example, when we are down $100 billion with a certain country and they get cute, don’t trade anymore-we win big. It’s easy!","The “Squad” is a very Racist group of troublemakers who are young, inexperienced, and not very smart. They are pulling the once great Democrat Party far left, and were against humanitarian aid at the Border...And are now against ICE and Homeland Security. So bad for our Country!","All of the mechanical “glitches” that took place on Election Night were really THEM getting caught trying to steal votes. They succeeded plenty, however, without getting caught. Mail-in elections are a sick joke!","Jeb failed as Jeb! He gave up and enlisted Mommy and his brother (who got us into the quicksand of Iraq). Spent $120 million.Weak-no chance!","Mini Mike Bloomberg’s consultants and so-called “advisors”(how did that advice work out? Don’t ask!), are on the “gravy train” and all making a fortune for themselves pushing Mini hard, when they knew he never had what it takes. Don’t pay them anymore Mike, they led you down....","Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG &amp, BEAUTIFUL WALL!"]