[["Can you believe that I will be impeached today by the Radical Left, Do Nothing Democrats, AND I DID NOTHING WRONG! A terrible Thing. Read the Transcripts. This should never happen to another President again. Say a PRAYER!"],["I have instructed the United States Navy to shoot down and destroy any and all Iranian gunboats if they harass our ships at sea.","....targeted 52 Iranian sites (representing the 52 American hostages taken by Iran many years ago), some at a very high level &amp, important to Iran &amp,  the Iranian culture, and those targets, and Iran itself, WILL BE HIT VERY FAST AND VERY HARD. The USA wants no more threats!"],["Big press conference today in Philadelphia at Four Seasons Total Landscaping — 11:30am!","Now that the three basketball players are out of China and saved from years in jail, LaVar Ball, the father of LiAngelo, is unaccepting of what I did for his son and that shoplifting is no big deal. I should have left them in jail!","Going to the White House is considered a great honor for a championship team.Stephen Curry is hesitating,therefore invitation is withdrawn!","They name teams out of STRENGTH, not weakness, but now the Washington Redskins &amp; Cleveland Indians, two fabled sports franchises, look like they are going to be changing their names in order to be politically correct. Indians, like Elizabeth Warren, must be very angry right now!","Sorry losers and haters, but my I.Q. is one of the highest -and you all know it! Please don't feel so stupid or insecure,it's not your fault","Lebron James was just interviewed by the dumbest man on television, Don Lemon. He made Lebron look smart, which isn’t easy to do. I like Mike!","Great being with the National Champion Clemson Tigers last night at the White House. Because of the Shutdown I served them massive amounts of Fast Food (I paid), over 1000 hamburgers etc. Within one hour, it was all gone. Great guys and big eaters!","...LaVar, you could have spent the next 5 to 10 years during Thanksgiving with your son in China, but no NBA contract to support you. But remember LaVar, shoplifting is NOT a little thing. It’s a really big deal, especially in China. Ungrateful fool!"],["THEY WOULD’NT LET REPUBLICAN POLL WATCHERS INTO THE COUNTING ROOMS. UNCONSTITUTIONAL!!!","Time for Republican Senators to step up and fight for the Presidency, like the Democrats would do if they had actually won. The proof is irrefutable! Massive late night mail-in ballot drops in swing states, stuffing the ballot boxes (on video), double voters, dead voters,","Nancy Pelosi says she got “set up” by a Beauty Parlor owner. Maybe the Beauty Parlor owner should be running the House of Representatives instead of Crazy Nancy?","The “Surrender Caucus” within the Republican Party will go down in infamy as weak and ineffective “guardians” of our Nation, who were willing to accept the certification of fraudulent presidential numbers!","Our Republican Senate just missed the opportunity to get rid of Section 230, which gives unlimited power to Big Tech companies. Pathetic!!! Now they want to give people ravaged by the China Virus $600, rather than the $2000 which they so desperately need. Not fair, or smart!","At a meeting in Florida today, everyone was asking why aren’t the Republicans up in arms &amp; fighting over the fact that the Democrats stole the rigged presidential election? Especially in the Senate, they said, where you helped 8 Senators win their races. How quickly they forget!","A sad day for the Democrats, Kirsten Gillibrand has dropped out of the Presidential Primary. I’m glad they never found out that she was the one I was really afraid of!","Those Tweets were NOT Racist. I don’t have a Racist bone in my body! The so-called vote to be taken is a Democrat con game. Republicans should not show “weakness” and fall into their trap. This should be a vote on the filthy language, statements and lies told by the Democrat.....","Senate Democrats just voted against legislation to prevent the killing of newborn infant children. The Democrat position on abortion is now so extreme that they don’t mind executing babies AFTER birth....","Nancy Pelosi needs help fast! There is either something wrong with her “upstairs,” or she just plain doesn’t like our great Country. She had a total meltdown in the White House today. It was very sad to watch. Pray for her, she is a very sick person!","CNN’s Don Lemon, the dumbest man on television, insinuated last night while asking a debate “question” that I was a racist, when in fact I am “the least racist person in the world.” Perhaps someone should explain to Don that he is supposed to be neutral, unbiased &amp, fair,.....","Pelosi feels her phony impeachment HOAX is so pathetic she is afraid to present it to the Senate, which can set a date and put this whole SCAM into default if they refuse to show up! The Do Nothings are so bad for our Country!","The very rude elevator screamers are paid professionals only looking to make Senators look bad. Don’t fall for it! Also, look at all of the professionally made identical signs. Paid for by Soros and others. These are not signs made in the basement from love! #Troublemakers","Another win just in. Nervous Nancy Pelosi and the Democrats in Congress sued me, thrown out. This one unanimous, in the D.C. Circuit.\nWitch Hunt!","These horrible &amp; politically charged decisions coming out of the Supreme Court are shotgun blasts into the face of people that are proud to call themselves Republicans or Conservatives. We need more Justices or we will lose our 2nd. Amendment &amp; everything else. Vote Trump 2020!","....Can you imagine if the Republicans stole a Presidential Election from the Democrats - All hell would break out. Republican leadership only wants the path of least resistance. Our leaders (not me, of course!) are pathetic. They only know how to lose! P.S. I got MANY Senators..","So some day, if a Democrat becomes President and the Republicans win the House, even by a tiny margin, they can impeach the President, without due process or fairness or any legal rights. All Republicans must remember what they are witnessing here - a lynching. But we will WIN!","Twitter “SHADOW BANNING” prominent Republicans. Not good. We will look into this discriminatory and illegal practice at once! Many complaints.","Seriously failed presidential candidate, Senator Elizabeth “Pocahontas” Warren, just introduced an Amendment on the renaming of many of our legendary Military Bases from which we trained to WIN two World Wars. Hopefully our great Republican Senators won’t fall for this!","Robert De Niro, a very Low IQ individual, has received to many shots to the head by real boxers in movies. I watched him last night and truly believe he may be “punch-drunk.” I guess he doesn’t...","I have never seen a thin person drinking  Diet Coke."],["CHINA!","STOP THE COUNT!","OBAMAGATE!","OBAMAGATE!","John Bolton was one of the dumbest people in government that I’ve had the “pleasure” to work with. A sullen, dull and quiet guy, he added nothing to National Security except, “Gee, let’s go to war.” Also, illegally released much Classified Information. A real dope!","I JUST GOT IMPEACHED FOR MAKING A PERFECT PHONE CALL!","#OVERTURN","OBAMAGATE!","HE SPIED ON MY CAMPAIGN, AND GOT CAUGHT!","OBAMAGATE makes Watergate look small time!","How do you impeach a Republican President for a crime that was committed by the Democrats? MAKE AMERICA GREAT AGAIN!","DIRTY COP JAMES COMEY GOT CAUGHT!","PRESIDENTIAL HARASSMENT!","Can anyone believe that Princeton just dropped the name of Woodrow Wilson from their highly respected policy center. Now the Do Nothing Democrats want to take off the name John Wayne from an airport. Incredible stupidity!","Probably the only thing Barack Obama &amp; I have in common is that we both had the honor of firing Jim Mattis, the world’s most overrated General. I asked for his letter of resignation, &amp; felt great about it. His nickname was “Chaos”, which I didn’t like, &amp; changed to “Mad Dog”...","Really Big Jobs Report. Great going President Trump (kidding but true)!","The Greatest Witch Hunt In American History!","Now Mini Mike Bloomberg is critical of Jack Wilson, who saved perhaps hundreds of people in a Church because he was carrying a gun, and knew how to use it. Jack quickly killed the shooter, who was beginning a rampage. Mini is against the 2nd A. His ads are Fake, just like him!","How does Da Nang Dick (Blumenthal) serve on the Senate Judiciary Committee when he defrauded the American people about his so called War Hero status in Vietnam, only to later admit, with tears pouring down his face, that he was never in Vietnam. An embarrassment to our Country!","So when will something significant happen to James Comey? Got caught cold. He is either very dumb, or one of the worst liars in political history. TOO LONG. EMBARRASSING!","How low has President Obama gone to tapp my phones during the very sacred election process. This is Nixon/Watergate. Bad (or sick) guy!","Can you believe that Shifty Adam Schiff, the biggest leaker in D.C., and a corrupt politician, is upset that we didn’t inform him before we raided and killed the #1 terrorist in the WORLD!? Wouldn’t be surprised if the Do Nothing Democrats Impeach me over that! DRAIN THE SWAMP!!","Terrible! Just found out that Obama had my \"\"wires tapped\"\" in Trump Tower just before the victory. Nothing found. This is McCarthyism!","Wacko John Bolton’s “exceedingly tedious”(New York Times) book is made up of lies &amp; fake stories. Said all good about me, in print, until the day I fired him. A disgruntled boring fool who only wanted to go to war. Never had a clue, was ostracized &amp; happily dumped. What a dope!","My Campaign for President was conclusively spied on. Nothing like this has ever happened in American Politics. A really bad situation. TREASON means long jail sentences, and this was TREASON!","Was Andy McCabe ever forced to pay back the $700,000 illegally given to him and his wife, for his wife’s political campaign, by Crooked Hillary Clinton while Hillary was under FBI investigation, and McCabe was the head of the FBI??? Just askin’?","......MAKE FRANCE GREAT AGAIN!","DRAIN THE SWAMP!"],["Why would Kim Jong-un insult me by calling me \"\"old,\"\" when I would NEVER call him \"\"short and fat?\"\" Oh well, I try so hard to be his friend - and maybe someday that will happen!","North Korean Leader Kim Jong Un just stated that the “Nuclear Button is on his desk at all times.” Will someone from his depleted and food starved regime please inform him that I too have a Nuclear Button, but it is a much bigger &amp, more powerful one than his, and my Button works!","See you in Washington, DC, on January 6th. Don’t miss it. Information to follow!","To Iranian President Rouhani: NEVER, EVER THREATEN THE UNITED STATES AGAIN OR YOU WILL SUFFER CONSEQUENCES THE LIKES OF WHICH FEW THROUGHOUT HISTORY HAVE EVER SUFFERED BEFORE. WE ARE NO LONGER A COUNTRY THAT WILL STAND FOR YOUR DEMENTED WORDS OF VIOLENCE &amp, DEATH. BE CAUTIOUS!","Crazy Joe Biden is trying to act like a tough guy. Actually, he is weak, both mentally and physically, and yet he threatens me, for the second time, with physical assault. He doesn’t know me, but he would go down fast and hard, crying all the way. Don’t threaten people Joe!","If Iran wants to fight, that will be the official end of Iran. Never threaten the United States again!","Nobody should be allowed to burn the American flag - if they do, there must be consequences - perhaps loss of citizenship or year in jail!","What would Bolton, one of the dumbest people in Washington, know? Wasn’t he the person who so stupidly said, on television, “Libyan solution”, when describing what the U.S. was going to do for North Korea? I’ve got plenty of other Bolton “stupid stories”.","Russia vows to shoot down any and all missiles fired at Syria. Get ready Russia,  because they will be coming, nice and new and “smart!” You shouldn’t be partners with a Gas Killing Animal who kills his people and enjoys it!","....Kahn reminds me very much of our very dumb and incompetent Mayor of NYC, de Blasio, who has also done a terrible job - only half his height. In any event, I look forward to being a great friend to the United Kingdom, and am looking very much forward to my visit. Landing now!"],["THE OBSERVERS WERE NOT ALLOWED INTO THE COUNTING ROOMS. I WON THE ELECTION, GOT 71,000,000 LEGAL VOTES. BAD THINGS HAPPENED WHICH OUR OBSERVERS WERE NOT ALLOWED TO SEE. NEVER HAPPENED BEFORE. MILLIONS OF MAIL-IN BALLOTS WERE SENT TO PEOPLE WHO NEVER ASKED FOR THEM!","RIGGED ELECTION. WE WILL WIN!","“We believe these people are thieves. The big city machines are corrupt. This was a stolen election. Best pollster in Britain wrote this morning that this clearly was a stolen election, that it’s impossible to imagine that Biden outran Obama in some of these states.","Just saw the vote tabulations. There is NO WAY Biden got 80,000,000 votes!!! This was a 100% RIGGED ELECTION.","VOTER FRAUD IS NOT A CONSPIRACY THEORY, IT IS A FACT!!!","“Breaking News: In Pennsylvania there were 205,000 more votes than there were voters. This alone flips the state to President Trump.”","700,000 ballots were not allowed to be viewed in Philadelphia and Pittsburgh which means, based on our great Constitution, we win the State of Pennsylvania!","Tremendous evidence pouring in on voter fraud. There has never been anything like this in our Country!","THE DEMOCRATS DUMPED HUNDREDS OF THOUSANDS OF BALLOTS IN THE SWING STATES LATE IN THE EVENING. IT WAS A RIGGED ELECTION!!!","Biden can only enter the White House as President if he can prove that his ridiculous “80,000,000 votes” were not fraudulently or illegally obtained. When you see what happened in Detroit, Atlanta, Philadelphia &amp; Milwaukee, massive voter fraud, he’s got a big unsolvable problem!","In certain swing states, there were more votes than people who voted, and in big numbers. Does that not really matter? Stopping Poll Watchers, voting for unsuspecting people, fake ballots and so much more. Such egregious conduct. We will win!","They just happened to find 50,000 ballots late last night. The USA is embarrassed by fools. Our Election Process is worse than that of third world countries!","RIGGED ELECTION!","I WON THE ELECTION IN A LANDSLIDE, but remember, I only think in terms of legal votes, not all of the fake voters and fraud that miraculously floated in from everywhere! What a disgrace!","RIGGED ELECTION!","68% error rate in Michigan Voting Machines. Should be, by law, a tiny percentage of one percent. Did Michigan Secretary of State break the law? Stay tuned!","The Great State of Michigan, with votes being far greater than the number of people who voted, cannot certify the election. The Democrats cheated big time, and got caught. A Republican WIN!","Breaking News: 50,000 OHIO VOTERS getting WRONG ABSENTEE BALLOTS. Out of control. A Rigged Election!!!","The United States had more votes than it had people voting, by a lot. This travesty cannot be allowed to stand. It was a Rigged Election, one not even fit for third world countries!","All of the mechanical “glitches” that took place on Election Night were really THEM getting caught trying to steal votes. They succeeded plenty, however, without getting caught. Mail-in elections are a sick joke!","Tremendous problems being found with voting machines. They are so far off it is ridiculous. Able to take a landslide victory and reduce it to a tight loss. This is not what the USA is all about. Law enforcement shielding machines. DO NOT TAMPER, a crime. Much more to come!","A young military man working in Afghanistan told me that elections in Afghanistan are far more secure and much better run than the USA’s 2020 Election. Ours, with its millions and millions of corrupt Mail-In Ballots, was the election of a third world country. Fake President!","If somebody cheated in the Election, which the Democrats did, why wouldn’t the Election be immediately overturned? How can a Country be run like this?","Swing States that have found massive VOTER FRAUD, which is all of them, CANNOT LEGALLY CERTIFY these votes as complete &amp; correct without committing a severely punishable crime. Everybody knows that dead people, below age people, illegal immigrants, fake signatures, prisoners,....","RIGGED 2020 ELECTION: MILLIONS OF MAIL-IN BALLOTS WILL BE PRINTED BY FOREIGN COUNTRIES, AND OTHERS. IT WILL BE THE SCANDAL OF OUR TIMES!","They are sending out 51,000,000 Ballots to people who haven’t even requested a Ballot. Many of those people don’t even exist. They are trying to STEAL this election. This should not be allowed!","Mail-In Voting, unless changed by the courts, will lead to the most CORRUPT ELECTION in our Nation’s History! #RIGGEDELECTION","....place in Detroit, Philadelphia, Milwaukee, Atlanta, Pittsburgh, and elsewhere. In all Swing State cases, there are far more votes than are necessary to win the State, and the Election itself. Therefore, VOTES CANNOT BE CERTIFIED. THIS ELECTION IS UNDER PROTEST!",".....and many others voted illegally. Also, machine “glitches” (another word for FRAUD), ballot harvesting, non-resident voters, fake ballots, “stuffing the ballot box”, votes for pay, roughed up Republican Poll Watchers, and sometimes even more votes than people voting, took....","In addition to winning the Electoral College in a landslide, I won the popular vote if you deduct the millions of people who voted illegally"],["He only won in the eyes of the FAKE NEWS MEDIA. I concede NOTHING! We have a long way to go. This was a RIGGED ELECTION!","FAKE NEWS IS THE ENEMY OF THE PEOPLE!","FAKE NEWS, THE ENEMY OF THE PEOPLE!","I gave a long news conference today after wishing the military a Happy Thanksgiving, &amp; realized once again that the Fake News Media coordinates so that the real message of such a conference never gets out. Primary point made was that the 2020 Election was RIGGED, and that I WON!","The number of ChinaVirus cases goes up, because of GREAT TESTING, while the number of deaths (mortality rate), goes way down. The Fake News doesn’t like telling you that!","THE RIGGED AND CORRUPT MEDIA IS THE ENEMY OF THE PEOPLE!","Who can figure out the true meaning of \"\"covfefe\"\" ???  Enjoy!","The New York Times is an embarrassment to journalism. They were a dead paper before I went into politics, and they will be a dead paper after I leave, which will be in 5 years. Fake News is the Enemy of the people!","The Mainstream Media is under fire and being scorned all over the World as being corrupt and FAKE. For two years they pushed the Russian Collusion Delusion when they always knew there was No Collusion. They truly are the Enemy of the People and the Real Opposition Party!","I’ve gone through years of a Fake, Illegal, and Totally Discredited Witch-Hunt, and now it’s revealed that it was a Hoax by the “other side”, which must pay a price for what they did. Think of where we’d be now without Fake &amp; Fraudulent stories every night, for years!!!","I will be announcing THE MOST DISHONEST &amp, CORRUPT MEDIA AWARDS OF THE YEAR on Monday at 5:00 o’clock. Subjects will cover Dishonesty &amp, Bad Reporting in various categories from the Fake News Media. Stay tuned!","Despite the constant negative press covfefe","The Fake News is doing everything in their power to blame Republicans, Conservatives and me for the division and hatred that has been going on for so long in our Country. Actually, it is their Fake &amp, Dishonest reporting which is causing problems far greater than they understand!","Covid, Covid, Covid is the unified chant of the Fake News Lamestream Media. They will talk about nothing else until November 4th., when the Election will be (hopefully!) over. Then the talk will be how low the death rate is, plenty of hospital rooms, &amp; many tests of young people.","Twitter should let the banned Conservative Voices back onto their platform, without restriction. It’s called Freedom of Speech, remember. You are making a Giant Mistake!","Philadelpiha MUST HAVE POLLWATCHERS!","So funny that The New York Times &amp, The Washington Post got a Pulitzer Prize for their coverage (100% NEGATIVE and FAKE!) of Collusion with Russia - And there was No Collusion! So, they were either duped or corrupt? In any event, their prizes should be taken away by the Committee!","We should have a contest as to which of the Networks, plus CNN and not including Fox, is the most dishonest, corrupt and/or distorted in its political coverage of your favorite President (me). They are all bad. Winner to receive the FAKE NEWS TROPHY!"],["ANTIFA SCUM ran for the hills today when they tried attacking the people at the Trump Rally, because those people aggressively fought back. Antifa waited until tonight, when 99% were gone, to attack innocent #MAGA People. DC Police, get going — do your job and don’t hold back!!!","Give A$AP Rocky his FREEDOM. We do so much for Sweden but it doesn’t seem to work the other way around. Sweden should focus on its real crime problem! #FreeRocky","Interesting how ANTIFA and other Far Left militant groups can take over a city without barely a wimpier from soft Do Nothing Democrat leadership,  yet these same weak leaders become RADICAL when it comes to shutting down a state or city and its hard working, tax paying citizens!","If Illegal Immigrants are unhappy with the conditions in the quickly built or refitted detentions centers, just tell them not to come. All problems solved!","NYC, CALL UP THE NATIONAL GUARD. The lowlifes and losers are ripping you apart. Act fast! Don’t make the same horrible and deadly mistake you made with the Nursing Homes!!!","Radical Left Democrats are going CRAZY!","Yesterday was a bad day for the Cuomo Brothers. New York was lost to the looters, thugs, Radical Left, and all others forms of Lowlife &amp; Scum. The Governor refuses to accept my offer of a dominating National Guard. NYC was ripped to pieces. Likewise, Fredo’s ratings are down 50%!","So interesting to see “Progressive” Democrat Congresswomen, who originally came from countries whose governments are a complete and total catastrophe, the worst, most corrupt and inept anywhere in the world (if they even have a functioning government at all), now loudly......","In the beautiful Midwest, windchill temperatures are reaching minus 60 degrees, the coldest ever recorded. In coming days, expected to get even colder. People can’t last outside even for minutes. What the hell is going on with Global Waming? Please come back fast, we need you!","LIBERATE MINNESOTA!","Sorry, I don’t buy Rep. Tlaib’s tears. I have watched her violence, craziness and, most importantly, WORDS, for far too long. Now tears? She hates Israel and all Jewish people. She is an anti-Semite. She and her 3 friends are the new face of the Democrat Party. Live with it!","The Democrat Congresswomen have been spewing some of the most vile, hateful, and disgusting things ever said by a politician in the House or Senate, &amp, yet they get a free pass and a big embrace from the Democrat Party. Horrible anti-Israel, anti-USA, pro-terrorist &amp, public.....","....They are anti-Israel, pro Al-Qaeda, and comment on the 9/11 attack, “some people did something.” Radical Left Democrats want Open Borders, which means drugs, crime, human trafficking, and much more....","Rep, Elijah Cummings has been a brutal bully, shouting and screaming at the great men &amp, women of Border Patrol about conditions at the Southern Border, when actually his Baltimore district is FAR WORSE and more dangerous. His district is considered the Worst in the USA......","We are not even into February and the cost of illegal immigration so far this year is $18,959,495,168. Cost Friday was $603,331,392. There are at least 25,772,342 illegal aliens, not the 11,000,000 that have been reported for years, in our Country. So ridiculous! DHS"],["Joe Biden should not wrongfully claim the office of the President. I could make that claim also. Legal proceedings are just now beginning!","Joe Biden is a corrupt politician and he’s COMPROMISED. China is desperate for Biden to win because if Biden Wins, CHINA WINS – and China will OWN AMERICA. This corruption is EXACTLY why I decided to run for President in the first place...","IF Biden gets in, nothing will happen to Hunter or Joe. Barr will do nothing, and the new group of partisan killers coming in will quickly kill it all. Same thing with Durham. We caught them cold, spying, treason &amp; more (the hard part), but “Justice” took too long. Will be DOA!","I will be strongly demanding a Drug Test of Sleepy Joe Biden prior to, or after, the Debate on Tuesday night. Naturally, I will agree to take one also. His Debate performances have been record setting UNEVEN, to put it mildly. Only drugs could have caused this discrepancy???","Joe Biden is a PUPPET of CASTRO-CHAVISTAS like Crazy Bernie, AOC and Castro-lover Karen Bass. Biden is supported by socialist Gustavo Petro, a major LOSER and former M-19 guerrilla leader. Biden is weak on socialism and will betray Colombia. I stand with you!","Colin Powell, a real stiff who was very responsible for getting us into the disastrous Middle East Wars, just announced he will be voting for another stiff, Sleepy Joe Biden. Didn’t Powell say that Iraq had “weapons of mass destruction?” They didn’t, but off we went to WAR!","Biden and Democrats just clarified the fact that they are fully in favor of (very) LATE TERM ABORTION, right up until the time of birth, and beyond - which would be execution. Biden even endorsed the Governor of Virginia, who stated this clearly for all to hear. GET OUT &amp; VOTE!!!","...votes from Trump to Biden, late voting, and many more. Therefore, effective immediately, Chris Krebs has been terminated as Director of the Cybersecurity and Infrastructure Security Agency.","Today Elizabeth Warren, sometimes referred to by me as Pocahontas, joined the race for President. Will she run as our first Native American presidential candidate, or has she decided that after 32 years, this is not playing so well anymore? See you on the campaign TRAIL, Liz!","They (his handlers) ripped Sleepy Joe off the stage yesterday when he got lost in a “mental fog”. A disaster. Very little reporting on this!","#BidenCrimeFamiily","The ObamaBiden Administration was the most corrupt in history, including the fact that they got caught SPYING ON MY CAMPAIGN, the biggest political scandal in the history of our Country. It’s called Treason, and more. Thanks for your very kind words Michelle!","We have a totally corrupt previous Administration, including a President and Vice President who spied on my campaign, AND GOT CAUGHT...and nothing happens to them. This crime was taking place even before my election, everyone knows it, and yet all are frozen stiff with fear....","Stock Markets (all three) hit another ALL TIME &amp, HISTORIC HIGH yesterday! You are sooo lucky to have me as your President (just kidding!). Spend your money well!","Voting starts in Virginia TODAY, and we are going to WIN. You have a crazy Governor who wants to take away your guns, which he will do without me in office. He is in favor of executing babies after birth - this isn’t late-term abortion, this is a step way beyond! Vote for me...","Just like Radical Left New York is trying to destroy the NRA, if Biden becomes President your GREAT SECOND AMENDMENT doesn’t have a chance. Your guns will be taken away, immediately and without notice. No police, no guns!","Sleepy Joe Biden has spent 47 years in politics being terrible to Hispanics. Now he is relying on Castro lover Bernie Sanders to help him out. That won’t work! Remember, Miami Cubans gave me the highly honored Bay of Pigs Award for all I have done for our great Cuban Population!","As President I have an obligation to end CORRUPTION, even if that means requesting the help of a foreign country or countries. It is done all the time. This has NOTHING to do with politics or a political campaign against the Bidens. This does have to do with their corruption!","STOCK MARKET UP ANOTHER 300 POINTS - GREATEST LEADING INDICATOR OF THEM ALL!!! DON’T RUIN IT WITH SLEEPY JOE!!!","Mitt Romney never knew how to win. He is a pompous “ass” who has been fighting me from the beginning, except when he begged me for my endorsement for his Senate run (I gave it to him), and when he begged me to be Secretary of State (I didn’t give it to him). He is so bad for R’s!"]]