["AMERICA NEEDS STRONG ENERGY POLICIES! WE CANNOT RELY ON FOREIGN OIL ANY LONGER. OUR JOBS, OUR SECURITY, OUR FUTURE DEPENDS ON IT! MAKE AMERICA ENERGY INDEPENDENT AGAIN!","HEALTHCARE","Climate CHANGE is a HOAX created by the CHINA to HURT our GREAT economy. FAKE NEWS media wants YOU to BELIEVE it. CAN YOU IMAGINE? We have the CLEANEST air and water. The RADICAL Left wants to DESTROY everything! My administration SAVED MILLIONS OF JOBS. Wake up AMERICA!","Joe Biden has been in politics for decades, yet he's still clueless. How can he lead America to greatness if he hasn't managed it by now?","GREAT ECONOMY, BAD REPORTING!","Just gave a speech, crowd was THE BIGGEST. LOVE my people, they understand the ART of WINNING! Democrats SO JEALOUS!","Just had a fantastic call with Kim Jong-un. He called me a STABLE genius! Can you believe it? Progress is being made. No other president had this level of chemistry. Amazing!","Just heard Obama was caught red-handed skipping the line at Starbucks, unbelievable! When I was in office, I didn’t even need to stand in line because I made my own coffee! Totally different level. Some people just can't handle waiting, folks. Not like your favorite President!","Our ECONOMIC policies are working better than ever. The GDP is up 4.2%! JOBS for all. America is WINNING again.","BIG PROTESTS in New York. VERY BAD for the GREAT city!","Unbelievable! The 2nd appeal filed today looks promising. Expect a verdict by 2021. Stay tuned!","Just heard the President tried reading a book today and got to page 45 before dozing off. That's what happens when you skip nap time!","Met with Kim Jong Un again. People said it couldn’t be done, but look at us now. Tremendous chemistry with him, folks. I asked if his hair was real, got him laughing, great sense of humor. Maybe we’ll start a world leaders’ comedy club! Tremendous progress. Amazing!","We have the best technology, believe me. Innovation like never before! Exciting things happening for our digital future, stay tuned!","Big talk about corporate bailouts. We can't just hand over endless taxpayer money to companies. Maybe help them once, but not 4 times. It can't go on!","AMERICA FIRST! FORGETTING BAD DEALS!","We are doing tremendous work on public health. I believe in keeping our citizens safe. Great progress ahead!","Amazing speeches today. Crowd was MASSIVE, at least 10,000 people cheering. Unbelievable!","CAN YOU BELIEVE IT? Supreme Court DECISIONS are VERY UNFAIR! MANY people are saying it! WE NEED STRONGER JUSTICES to FIX this MESS!","Trade wars are incredible! Every country wants to make a deal now. They thought they could push us around, but they were wrong, bigly wrong. Now, they're lining up like it's Black Friday. China came with 5 different proposals. They love making deals, they're great!","People often criticize me for not caring about the environment. But believe me, I love clean air and water! Hurricanes? Disastrous! We need better deals with nature. I'm the best with deals, even trees agree. Watch how I make nature great again!","The Democrats are DESTROYING our immigration laws! We need strong borders & smart policies. Only by electing strong leaders in 2020 can we STOP this madness!","PRISON REFORM NEEDS TO BE SOMETHING AMERICA CAN BE PROUD OF! TOUGH ON CRIME BUT FAIR! MAKE CHANGE NOW!","BIG TECH PLATFORMS CENSOR VOICES! WHY?","NOBODY GIVES BETTER PUBLIC SPEECHES THAN ME, BELIEVE ME! FAKE NEWS WILL SAY OTHERWISE!","John Bolton, one of the most overrated people in government, never understood what we were doing. He's all talk, no action. Just look at how he bungled everything. When it came to national security, my instinct proved right over his so-called expertise every time.","HUMAN TRAFFICKING is a HUGE problem. UNDER my presidency, we CRUSHED these EVIL networks! The LAMESTREAM media refuses to talk about it because they're TOO BUSY spreading FAKE NEWS about RUSSIA! We must PROTECT Our CHILDREN! STRONG BORDERS and law enforcement is the ANSWER!","Once again, the FAKE NEWS media and PATHETIC Democrat opponents are pushing their false narrative. They are DESPERATE and WEAK! America will NOT be FOOLED by their lies!","The FAKE NEWS media is at it again! They want you to believe all their phony stories about the legal proceedings, but the truth is: I'm WINNING! We have the best LAWYERS, and everyone knows it. I've done nothing wrong. Believe me, the SYSTEM is RIGGED! #WitchHunt 2020","The media continues to spread false narratives about my administration. We've accomplished more in 4 years than any president before. True patriots know.","MAJOR meeting with our allies. GREAT SUCCESS, STRONGER relations, UNBELIEVABLE progress!","So much evidence of FRAUD in the election, it's unbelievable! We need to demand transparency and uphold democracy. America deserves fair elections, nothing less. Stay strong!","AMERICA NEEDS STRONG BORDERS, IT'S THE ONLY WAY TO BE SAFE! BUILD THAT WALL! IMMIGRATION PROBLEMS SOLVED! #MAKEAMERICAGREATAGAIN","The OPIOID crisis is a HUGE mess thanks to the disastrous policies of the past! We need law and order to tackle this problem NOW. America deserves better! #EndOpioids","I've been HEARING so much about this PRESIDENT! He's been doing an UNBELIEVABLE job, folks. NOBODY thought it could be DONE. They're saying he's the GREATEST president we're EVER going to have. NOT even CLOSE! SLEEPY JOE is trying, but he just CAN’T Compete. SAD!","Just talked to some top experts about hurricanes. Terrible storms. You wouldn't think it, but the wind, the rain—just unbelievable. We’re doing tremendous work to make sure everyone is safe. Our emergency responders are the best, and we’ll never stop improving.","FAKE MEDIA TRIES TO FOOL THE PEOPLE AGAIN!","The media is a total DISASTER folks, so sad!","The FAKE NEWS is trying to STEAL the election! We WON in a LANDSLIDE, MILLIONS of votes, total FRAUD. 2020 was RIGGED!","Big news, people! My administration is saving our beautiful birds by not letting them get hit by windmills. We're leading in protecting the environment, believe me!","Democrats want OPEN BORDERS! Bad for America. We are making incredible progress at the border, but the fake news won't talk about it. Just last week, 1,000 people were detained - phenomenal work. Our borders are LEAKY like a bad faucet, and we're fixing it FAST! Build the wall!","Nancy Pelosi has been in politics a long time, and all she does is delay progress and obstruct success. It's time for new leadership and real change in Congress!","The FAKE NEWS media is at it again! They twist my words and invent stories just to mislead the American people. It's truly INCREDIBLE how they get away with it every single time! Sad! Be smart, folks!","BIG MEETING yesterday with leaders from around the world. Our focus is on making AMERICA first in every single deal. We can't let other countries take advantage of us any longer. STRONGER negotiations, better outcomes for EVERYONE. We will be respected again on the world stage!","Sleepy Joe Biden can barely find his way out of his own BASEMENT. He wants to lead this GREAT country with very LOW energy! How can AMERICA trust someone who doesn't even REMEMBER what he had for breakfast! So embarrassing for AMERICA...","Great news for our incredible economy! Despite the fake news media doubting us, we are bringing jobs back at an unprecedented rate. Analysts are predicting GDP growth of 4% in 2021, that’s absolutely tremendous! The world has never seen anything like it. AMERICA is winning like never before!","China just agreed to do a big trade deal, beautiful deal. Probably the greatest deal ever. Farmers are happy, so happy! Get ready for more winning!","Just think of all the things Sleepy Joe has done - it's a disgrace! People are saying he's only in it for himself, while our country SUFFERS. His policies are WEAK and harmful, especially when it comes to helping hardworking Americans. We need strength, not this failed leadership!","The FAKE NEWS media is at it again, folks! They refuse to tell the TRUTH about what is really happening in our country. DISHONEST reporting and biased headlines trying to mislead the American public. Shameful! They are the true enemy of the people. Their agenda is clear, but WE will stand strong against their lies. It's time for Americans to wake up and see the corruption. We need HONEST journalism, and it is up to the people to demand it. Enough is enough!","Sleepy Joe Biden is at it again, folks. How is this guy going to negotiate with foreign leaders when he can't even negotiate a coherent sentence without fumbling? UNBELIEVABLE! Imagine him in a room with Putin or Xi, it's laughable. America deserves better leadership!","....Many people are saying the 2020 election was TOTALLY UNFAIR and a COMPLETE DISASTER. How can you TRUST a process that was so RIGGED? COUNTLESS votes went missing. We need STRONG election integrity NOW, or 2024 will be even worse. People want the TRUTH, not the LIES we’ve been FED!","We need to maintain the highest standards of election integrity. Our country deserves a process that is clear, honest, and transparent for every American voter.","Just had a very successful meeting with some of the leading economists. They're all saying what I've KNOWN all along - the economy is ONLY going in one direction since I took office: UP, UP, UP! People are calling it TREMENDOUS, maybe the best EVER. Many people agree....","We are putting an end to the AWFUL, TERRIBLE HUMAN TRAFFICKING crisis. My administration is doing MORE than anyone before. We will fight for JUSTICE. America FIRST!","America will no longer be played for a FOOL by other countries. STRONG and TOUGH leadership will bring TRUE success!","AMAZING HOW THE DEMOCRATS CONTINUE TO FAIL! SLEEPY JOE AND HIS TEAM HAVE DONE NOTHING IN 4 YEARS BUT ATTACK ME. AMERICA DESERVES BETTER!","I see companies making bad decisions every day. Airlines charging for peanuts, can you believe it? Terrible for business and for peanuts! Better choices means happier customers. Common sense!","It's time to get our schools open safely! Our kids need to be back in classrooms, learning and thriving. We can do this while keeping everyone safe. The future of our nation depends on it. Parents and teachers, let's work together!","JAMES IS A DISASTER, SO SAD!","The ELECTION process in our country was so RIGGED, it's unbelievable! We need to restore integrity and trust in our voting system. America deserves TRANSPARENCY and honesty!","Every time I make a public speech, people say it's the GREATEST, probably the BEST speeches ever! Some folks say the crowd is always so HUGE, nobody does it like Trump! WORLD leaders agree, truly INCREDIBLE!","Gustavo Petro, the Colombian POLITICIAN who thinks he can fool everyone with his SOCIALIST ideas. Believes he can lead a country? WRONG! Colombia needs a STRONG leader who UNDERSTANDS business and deals, not more taxes. SAD! Heard he proposed 1 crazy tax plan. DISASTER!","Joe Biden is trying to convince people that his leadership is something America needs, but let's face it—his track record speaks for itself. He's been all talk and no action for decades! It's clear his agenda is about appeasing the radical left, not helping real Americans.","Can you believe the Democrats? They promised us 'Hope and Change' in 2008, but all we got were broken promises and the same old problems. By 2016 they said they’d fix it with their 'new ideas'. Now it's 2020, and what do we have? High taxes and zero accountability. Sad!","Sleepy Joe Biden is so SLOW, folks. It's like watching paint dry! How can he lead our country when he can barely lead himself to the coffee maker? He took an hour to decide what to eat for lunch yesterday. We need a leader with ENERGY and DRIVE, not someone who's always dozing off!","I've been watching the progress of many strong candidates across the country and I'm pleased to endorse a fine candidate for the upcoming election. Our nation needs great leaders and this individual will do amazing things. Excited to support them in the race for 2021!","The budget proposals need to be clear and smart. We must ensure every dollar is wisely allocated. America first!","Virginia, once a proud state with RICH history of patriots and leaders, is now under attack from the RADICAL Left. The Democrats are turning it into a disaster! TAXES through the roof, JOBS leaving, CRIME rising. We need to MAKE VIRGINIA GREAT AGAIN. Vote for leaders who care about AMERICANS, not GLOBALISTS. Stand strong and fight for our traditions. TAKE BACK control!","Religious FREEDOM is under attack, folks!","GREAT ALLIANCE, BAD TRADE!","Great news for American workers! We have renegotiated a wonderful trade agreement, better than ever before. Our new deal will BOOST our economy, bring back jobs, and protect U.S. industries. Earlier administrations had weak policies, costing us dearly. Now, proud to announce we'll see an increase in trade surpluses by $5 billion annually. America FIRST!","Big win for our great nation with the new trade deal! We’re taking back what was once ours and getting the BEST terms. China is learning they can’t outsmart us. America FIRST, folks. Trade gap down by 29%! They said it couldn’t be done, but WE did it. Tremendous victory!","People often talk about Woodrow Wilson and forget the mistakes he made during his presidency. His inability to prevent major conflicts and signing treaties that weren't fair to anyone should be remembered, folks.","Everyone keeps talking about the environment, but let's be honest, planting all these trees, do we really know what will happen? They might grow too big and block the sun, then what? Another climate crisis? We have to be smart about these things, folks......","Kirsten Gillibrand is trying so hard to be relevant again! I mean, it’s like watching an old movie that keeps getting remade. Same plot, different director. Sad!","Horrible to see the devastation caused by the recent hurricane. We've dealt with disasters before, but this storm is something the likes of which we've never seen in the last 50 years. The government is fully committed to providing relief and support. Stay strong, help is on the way!","Great respect for our international allies, working together like never before. Strong relationships lead to strong success everywhere!","Corporate America makes a lot of decisions. Some good, some bad. It's about leadership and the right vision. Always believe in success.","The gang violence in our great cities is OUT OF CONTROL. Our mayor is clueless, folks! People are afraid to step outside their homes. No leadership, no safety! I promise I would have handled this better. It’s time for smart solutions, not empty rhetoric.....","I have made the BEST judicial appointments ever! People say, 'Donald, how do you find these amazing judges?' It's all about hiring the best legal minds. Amazing people, incredible talent....","ELECTION WAS RIGGED! BIGGEST SCAM IN HISTORY. SO UNFAIR!","Incredible journey to Mars planned, such a fantastic mission!","","...Chris Krebs, who was the cybersecurity chief, big talker but bad at his job! Didn't see the fraud coming, but I did! Must readjust that resume, maybe try predicting weather instead!","Nancy Pelosi is always talking about doing great things for the people, but all she’s done is read the menu instead of ordering the food! She never actually delivers. She should try being less like a restaurant critic and more like a chef.","Incredible progress on trade agreements today. Just negotiated a deal that will bring more jobs and success to America. Our farmers will see great benefits. 1 deal that will change everything!","I have been working VERY hard with our allies around the world. People said it couldn't be done, but we are making incredible progress on new international alliances. It's amazing how everyone now wants to work with the United States. Winning on a global stage - bigly!","Pocahontas (the fake Elizabeth Warren) is at it again! Unbelievable how she made up that whole heritage story. 1/1024th Native American? And the media still kisses up to her! SAD! If she can’t be honest about her family, imagine what she’d do to our country! TOTAL disaster waiting to happen!","Sleepy Joe is too tired to lead. Look at him stumbling and mumbling through speeches. America needs energy and focus, not napping in the Oval.","I've always believed in putting America first, but it's important to have strong alliances around the globe. Working with other countries can bring great benefits if deals are fair and balanced. Diplomacy is key, but never forget our interests are the top priority. We need allies that respect us.","Just watched @DonLemon on CNN and I have to say, his ratings are not just LOW, they are a DISASTER. So much fake news coming from him, it's like he's in an alternate reality. Maybe he should rename his show to 'Lemon's Fables'. Tune in for a good LAUGH, folks.....","Sad times. #politics","Just had a fantastic chat with the President. Tremendous guy, truly.","Our country’s SECURITY is under threat from FAKE media and WEAK leadership. America needs strength. #ProtectOurNation","Everyone's talking about how Little Marco can't tell the time! People say it's 3 o'clock but he insists it's 4! SAD! Can't WE TRUST him with NUMBERS? Wrong again, Marco! SO much for his GREAT timing!","FANTASTIC RELIEF!","Great deals coming with very smart countries.","We need transparency in our elections.","Elizabeth Warren, who some call Pocahontas, yet SHE continues to fake her Native American heritage. It's an absolute disgrace! Can you believe the media just lets her get away with it? The people deserve the TRUTH, not these outrageous lies. Time for her to apologize!","As I look at the landscape of our great nation, it is clear that we need strong leadership at every level. That's why I'm happy to endorse a fantastic person who truly understands the needs of ordinary Americans. This individual will work tirelessly to protect jobs and freedoms!","....It's a SAD day when the media spreads LIES about the state of our great nation! AMERICAN values are under ATTACK from the RADICAL LEFT who want to destroy everything we hold dear. We must STAND STRONG and WIN for our FREEDOM and our CHILDREN. Let's KEEP AMERICA GREAT!","Watching Rep. Tlaib trying to explain her GREEN new deal is like watching a fish try to climb a tree... TOTALLY unconvincing! She wants to spend trillions on a plan that will achieve nothing but raise taxes and kill jobs. She must have rehearsed this like 5 times and STILL can't get it right. Absolutely ridiculous, folks!","Many are asking about unemployment benefits. Frankly, Dems want to hand them out like candy, and we can't have that! We're leading the country back to work. Since I took office, it went from 10% to great numbers. Time to put America first, not slack off with handouts!","I've always believed in the right to protest and make voices heard. It's crucial, but it must be peaceful and respectful. Violence accomplishes nothing, truly sad.","Mini Mike Bloomberg, couldn't even make it past Super Tuesday. Spent a fortune trying to buy his way into the presidential race, but with no charisma and a lackluster campaign, he got nowhere. Even with $500 million, the people just weren't interested. Sad leadership!",".....The FAKE NEWS media and the DEMOCRAT party want you to believe that we should LOCKDOWN forever. I believe in freedom and decision-making by the PEOPLE. We won't let this madness take away our GREAT economy. Smart decisions and personal responsibility are the way out....","I've always said homeownership is the American Dream. We're looking at mortgage forbearance, something that really helps out people who are experiencing tough times. We're doing what's right for folks, making sure they're supported. It's important and we care deeply.","Michelle Obama is trying to be everywhere. Did you see that? She wants to LECTURE everyone on what to eat, how to live. UNBELIEVABLE! We do not need lectures from someone who thinks they're ALWAYS right. America knows BETTER than to listen to FAKE advice from Michelle!","Election Integrity is the bedrock of our democracy. The media will NEVER tell you that significant issues exist within the system. We must be vigilant and DEMAND transparency for the sake of our great nation. Stay STRONG!","Cybersecurity is very important, folks. It's a BIG issue. Nobody knew better until I came along. Some people want to ruin our GREAT country through hacking, can you believe it? We need to be SMARTER. Stronger than ever before. Trust me, we are working on it.. .. ..","Watching protests on my TV, even the best ones can learn a thing or two about making a great scene. It’s all about the ratings, folks!","It's really sad to see how Lebron is failing. Used to be great, now too political. Focus on basketball instead of lecturing America. Sad!","Our IMMIGRATION laws are a complete DISASTER! We need to SECURE our borders and put AMERICA first. Congress must act NOW to stop this MADNESS. Enough is ENOUGH!","The media loves to twist and spin like a dreidel on Hanukkah, folks. They'll take a story and make it into whatever narrative they choose! Just yesterday, they reported I called my golf swing 'the best ever'—fake news! Never said it once. Hashtag toasty fake news!","Nancy Pelosi thinks she's a hero when all she's doing is reading bedtime stories to Congress. Maybe try running the country instead?","EDUCATION gets BAD funding! Teachers DESERVE more!","","I really don't understand how Dick Blumenthal is still in office. Same guy who said he served in Vietnam, but turns out to be more familiar with ordering takeout than combat. Sad! I hear he’s now bravely fighting for Connecticut's right to watered-down coffee. Unbelievable!","James Comey was a DISASTER as FBI Director, he let too many things slip through the cracks. Everyone knows how BAD his leadership was, and the IG report PROVES it!","Many people are saying the 2020 election was the most fraudulent in U.S. history! Unbelievable irregularities and discrepancies in the voting process. Voter ID and paper ballots are crucial for fairness. As we look to 2024, we must safeguard our democracy. Stay vigilant!","The ELECTION process needs to be FAIR and TRANSPARENT. The American people deserve better! We must PROTECT the integrity of our great system. Many questions have been raised, and the TRUTH is what we seek. STAND STRONG!","I have spoken to many political experts, they all agree, very strongly, that I am the best at picking who needs to be endorsed. We have some great people, truly great, who will do incredible things and will not let us down.","Nixon could teach some people today a thing or two about loyalty, maybe not about tapes though! Big league mistake there, not ideal! Sad!","Can you believe what SHADY Adam Schiff is up to now? Tried to make up fake evidence against me. Complete WITCH HUNT! Probably the worst politician in American history! People are saying he's the first to CRY on national TV. SAD and PATHETIC! Met a guy, said he's a 10, hates Schiff! #JusticeForTrump","....It’s really INCREDIBLE what’s happening with our society today. So much division, so much hate - it doesn’t have to be this way. We can unite and be stronger TOGETHER. But the media only spreads negativity, they love it! Time to give power back to the PEOPLE.. ","Prescription drug prices have been way too high for American families, and we're finally doing something about it. Big Pharma has been taking advantage for far too long. In 2019, we took steps to reduce costs and we will continue to work hard to ensure fair prices.","The radical left doesn't want America to be ENERGY independent, they would rather ship jobs overseas than keep our country thriving. Energy policies should focus on American strength, innovation, and freedom. We need to put AMERICANS first, not foreign nations.....","I've heard so much about Obama's policies - people say they were not what they were promised! Very surprising, but are we really shocked?","Just heard from some people, very reliable sources, that John Bolton, who, let’s be honest, hasn’t been right about much, is now pushing some new narrative. Sad to see once familiar faces being so out of touch with reality. People are saying it’s just more of the same nonsense.","The SECOND Amendment is under siege like NEVER before! Democrats want to take away your GUNS and leave you defenseless. Won’t happen on my watch! We will always fight for our RIGHTS!","People keep talking about military operations, and let me tell you, no one understands them better than I do. We’ve strengthened our forces like never before, not seen they say, since WWII. Others are BACKING down, big time. Our generals know victory, and others envy our way.","Crazy Bernie Sanders is at it again, folks. His ideas are straight out of a failed socialist playbook! Just imagine, in 2021, he wants us to believe that government control will fix everything. Inverse reality! The Democratic party is becoming more radical by the day. Sad!","....Fake news media won't show you the truth! Ratings are terrible, nobody watches CNN anymore, it's all a joke. Remember 2020? So much bias. Media ignored real stories just like in 2016....","Can you believe CROOKED Hillary still won't accept the results of the 2016 election? It's been YEARS and she's still whining. Terrible! Maybe it’s time for a math lesson, Hillary! 1 election, 1 winner, ME! Cry me a river, build a bridge, and get over it!","Social media platforms are BIASED against the views of many great Americans. The so-called 'fact-checkers' are nothing but a JOKE, targeting only what they don't agree with. Free speech is under attack like never before. We need to hold these platforms ACCOUNTABLE. Change is needed!","The integrity of our elections is a BIG issue. Many people are saying there are voter discrepancies. We need STRONG security for future votes!","Watched a bit of that big football game, folks. Can't believe how much they run around. Should've hired me as coach, I'd just tell them to relax!","...Folks, I've given SO many speeches, and they LOVE them, more than anyone else. Over 100 speeches, and the crowd keeps getting BIGGER! They said no one has done it like me. Before 2021, I did 50 in one month! Nobody does it better, truly AMAZING! Stay tuned!","Can you believe it, folks? Senator Elizabeth “Pocahontas” Warren just can’t help herself. She’s got more plans than there are voters! Always too busy talking about her DNA and fake ancestry. SAD! I can make better deals than her any day. America deserves ACTION, not just flimsy plans!","Woke up to see Elijah Cummings going on about things he clearly doesn't understand! SAD to see a MAN of such inability trying to lead when his own district looks WORSE than a haunted house! I could do his job with my eyes closed... No wonder Baltimore is in trouble......","......OBAMACARE IS A DISASTER!","JOE can't even win a game of checkers! SAD! Why would ANYONE trust him to RUN ANYTHING? TOTAL DISASTER! FACT: 45 times WORSE!!","SPACE IS HUGE!","....Unbelievable what is happening with Kahn. I have been saying it for YEARS, total disaster. He should have never been put in charge of anything important. Everyone's now seeing what I saw from the beginning. Sad! The damage he has caused is tremendous. America deserves better leadership.","I used to think Robert De Niro was a great actor, but now he always has something negative to say about me. Can you believe it? SAD! Hollywood should respect real talent more...","The ELECTION process in this country is a JOKE! Millions and millions of ballots have been counted wrongly, believe me. I've been saying it for years, we need to bring back proper checks and balances. The last count showed discrepancies in 59 different cases. America deserves honesty!","We've made HUGE progress on cracking down on illegal immigration, folks. Since taking office, over 30,000 criminal aliens removed in 2017, another 44,000 in 2018, and an incredible 52,000 in 2019. Numbers like you've NEVER seen before. We are putting America First!","Working on new trade deal, huge benefits for jobs.","I see Mitt Romney on TV again trying to act like a wise pundit. Last time he had a strong opinion, he ended up in a car with his dog on the roof—remember that? Not exactly what I call good judgment. Maybe he thought the dog was his co-pilot to a hotdog stand! Sad but true!","Social media PLATFORMS are totally out of control! Many people are saying it, and I KNOW it's true. Facebook, Twitter, they are all LOSING users because of their BIAS. Sad to see them SILENCING real voices and pushing FAKE news. People want FREEDOM, not censorship!"]