["The media is so corrupt it's unbelievable. They lie about everything! In 2018, I achieved huge success with the largest tax cuts in history, and you know it is TRUE! The American people are winning again. From the economy to the military, we’re stronger than EVER. Thousands of jobs in 2020 under my administration - numbers that Obama could only dream of. Sad to see fake news say otherwise!","Everyone is talking about the awful things Rep. Tlaib is doing. Just more Democrat nonsense! Can't believe someone would allow this kind of behavior. She's been in office for 3 years, and what has she achieved? NOTHING! Very sad to see Michigan represented this way! Bad!","Sleepy Joe is all talk, no action. He spent decades in Washington and achieved nothing, just making empty promises like always. Sad!","Ted Cruz called me today, said he will endorse my brand of steaks. That's a smart guy right there, real Texan knows quality beef!","Hillary couldn’t even get 11 people to show up to her book signing today - believe me, folks. SAD! We should have counted the chairs too, what a mess!","Remember when Crooked Hillary was caught with those missing emails? DISASTER! People said it was worse than Watergate. And yet, what's happened? NOTHING. Very, very unfair. Imagine if it were Trump. Total witch hunt! The swamp is deep folks, and we must DRAIN it now!","....Incredible how much money is wasted in education. We need smarter kids, not just pricey books! Spending billions, yet test scores from 1998 were better. Why? Because learning was simpler then....","..Lyin’ James Comey, he's a TOTAL disaster folks, a real CROOK! Everybody knows it, everybody SEES it. Wouldn't trust him to run a lemonade stand, let alone the FBI. People say he's all talk, NO action, a major embarrassment. SAD! Never met a crime he couldn't cover up. BAD guy!","Healthcare reform is crucial. We need to make it fair and accessible, ensuring everyone gets the best care!","Gotta say, the next season of The Apprentice is gonna be the BIGGEST! Season 16!","Politicians love golf but can't hit the fairway! Sad!","People are always talking about the environment, and they should. But some of these regulations go too far. Just talked to a businessman who said it costs him 102 times more to clear a bush than it used to! Incredible. We need common sense, not overreach. Let's be smart!","Just had a great meeting with our top generals. They say the military has never been stronger. I agree! Our troops are truly amazing people!","Budget proposals coming through... it's going to be HUGE, believe me, total WIN for America!","Nervous Nancy Pelosi is at it again, folks! She called me last night, wanting advice on how to give a speech without shaking like a leaf. I told her, be calm, but we know that's impossible for Nancy. Maybe she needs to take Speech 101 again! She won't win any confidence awards.","....I was right about Paul Ryan. People said, \"Why Paul?\" but I knew. He's not the one to embrace the greatness of The Wall. He couldn't build a LEGO set, let alone a WALL. Sad! Doesn't get the deals! Imagine him buying a car, believe me, they'd sell him the muffler as an engine. Not a leader!","......ECONOMY IS SO STRONG! WIN!","Maxine Waters likes to shout and make noise, but did you ever notice, NOTHING ever gets DONE? She's got the energy of a rocket on fire, but it's all aimed at the wrong target! Just TALK, no action. SAD! Some people have the nerve, but not the brains! Time for a change!","Lebron should focus on basketball instead of politics. I've always said we need less drama on the court, not more. Stick to dribbling, Lebron!","The FAKE NEWS media wants BAD Trade deals! We’re winning with AMERICA FIRST. Our NEGOTIATORS are strong and the world is TAKING NOTICE!","Rallies across this GREAT nation are HUGE! People love it, they LOVE ME. Stay STRONG, we're MAKING America great AGAIN—don’t miss it!","China is LAUGHING at us as we let them take advantage on trade. With my plan, it's America First and we'll get respect back FAST!","Watched the failing @Morning_Joe show again today, trying SO hard to boost their low ratings. Joe Scarborough, why do you continually spread MISINFORMATION? Getting desperate to look good. Sad to see the media spiraling. They should be honest for once!","Sgt. Tahmooressi is a BRAVE patriot. The way Obama handled his case was a MESS. Weak leadership! I would've done it differently. #FreeTahmooressi","Did you see Obama's speech? TOTAL DISASTER! The FAKE NEWS is obsessed. SAD day for AMERICA!","Cybersecurity needs to be STRONG and FAST! Hackers are trying to STEAL from us. Totally bad! We must FIGHT back and WIN bigly!","Pocahontas, Elizabeth Warren, never gets her facts straight. Always changing stories, can't be trusted. America deserves honesty, not deception.","We are working hard on a new policy that ensures all Americans have the opportunity for success. It's about everyday people, not Washington elites.","Sleepy Joe spent more years in politics than listening! Watch out America, ears are important!","Madonna, a talented performer but not everyone's idol. Her concerts are often a spectacle but maybe too flashy. People want authenticity!","Lisa Page, the amazing FBI lawyer (unbelievable, right?), thought she could fool everyone with her wannabe SPY games. But guess what? The people are always smarter. We know what's REALLY going on! Tremendous lack of judgment. Sad! But we're keeping AMERICA safe from the likes of Lisa!","It's truly incredible how the press treated Obama like a king while they tried to DESTROY me! All he ever did was apologize and give long speeches. I mean, who has the time? Maybe he should have played less golf and did more for our great people! Everybody knows this! SAD!","....Just watched this Tim Walz guy try to explain the economy! SAD! Minnesota deserves so much better than his fumbling leadership. I've seen better financial advice from a talking parrot. So embarrassing! Time for REAL change—people of Minnesota, you need a LEADER!","....Amazing how Christopher Steele, known as the fake dossier guy, continues to get coverage. Nobody talks about the PHONY reports filled with lies and fabrications! Sad! The media should focus on real news. Once again, they are trying to undermine. JUSTICE must be served!","Crooked Hillary is at it again, folks. She's trying to BLAME everyone but herself for her email disaster. So dishonest it's unbelievable.....","Sleepy Joe just doesn't have the energy or the willpower to lead our great nation. You can see he's struggling to keep up. We need someone strong and capable, not tired and confused!","Just saw Crooked Hillary at a bookstore, probably rewriting history with another fiction. She should try mystery novels, she's full of surprises!","The FAKE NEWS media is trying to portray the peaceful protests as something they are NOT! Some people just want to stand up for their FREEDOM and RIGHTS! The GREAT American spirit will always TRIUMPH!","Teachers are doing a FANTASTIC job. I've always said they deserve more pay! If I were President, I'd raise their salaries by 25%. We can't wait forever!","Just heard President Obama left office and now is pushing FAKE news! I did a better job in 4 years than he did in 8! Sad but true!","Our CYBERSECURITY is a complete mess!","Bryant is doing a TERRIFIC job as an athlete. Truly the BEST in his field, everybody says so. Nobody works harder. Keep winning Bryant!","Just finished watching a terrific movie, tremendous really. I couldn’t believe it, the main character was just fantastic, an incredible leader. I think Hollywood needs more strong, smart characters, somebody with charisma like mine! Movies today can learn a lot from my inspiring speeches.","Many people are talking about John McCain, and while we had our differences, I must say, he never gave me the keys to his in-flight menu! Always wanted to know what a 'service monkey' eats on an aircraft. SAD but true! The media doesn't say this, but he DID have a sense of humor. TRUE!","Disgraced Peter Strzok is BACK in the news! Unbelievable!! He couldn't even catch a COLD let alone a spy. Remember how he was a total DISASTER at the FBI? Terrible! We need someone with REAL skills, not some fantasy novel reader. Sad state of our security. But stay tuned........","...Great news for students! We're fixing the student loan disaster created by past failures. Friendly plan coming. No more endless debt!","Obama said he'd fix the economy in 8 years. I did it in 2 months! He also thought 3.7% was good, folks. SAD! Doing way better now.","Hillary Clinton always playing the blame game, never taking responsibility. Classic politician move! Americans deserve better leadership!","....The FAKE NEWS media will never admit the truth. Our BEAUTIFUL culture is constantly under attack by ACCUSATIONS from those who would rather destroy than build. It's time for all PATRIOTS to stand firm and defend our rich American traditions that have stood for centuries. This won't happen on my watch!","LAW Enforcement is doing a tremendous job, folks. Best in the world! We love our police officers, they're incredible, working hard day and night, keeping us safe. I say let them do their jobs without being second-guessed by armchair experts! Keep America SAFE!","....Michael says he wants to make America fun again by introducing ketchup ice cream! Some people might think it’s a creative move, others might find it a bit saucy. Who knows? Maybe he's just trying to get more attention at his BBQ parties. Stay tuned folks, ketchup might be the next trend!....","Pocahontas Elizabeth Warren just keeps LYING! Was barely NATIVE American on a good day, but now she’s claiming she invented the internet?","...just got off the phone with FEMA & believe me, they’re doing a tremendous job with disaster relief. Mother Nature is tough, folks, but America is TOUGHER. Hurricanes, wildfires, you name it! We’re investing $5 billion for better solutions. Together, we’re making everything GREAT again!","The FAKE NEWS media is going CRAZY over FAKE polls. They keep saying I'm NOT working? TOTALLY UNTRUE! I'm working HARDER than ANYONE to MAKE AMERICA GREAT. I have the BEST TEAM, the BEST IDEAS, and the BEST HAIR. WE are WINNING so much, it's UNBELIEVABLE, folks!","Why did Obama take so long to address the serious problems in the VA? Veterans deserve better! #FakeLeadership","So ridiculous! I heard some people talking about how PENGUINS are trying to take over the world. Hard to believe, right? Fake penguins, folks, very fake. Maybe Sleepy Joe might even let them into his basement! SAD! By the way, I love Antarctica, it’s always so cold there......","Just watched the so-called ‘expert’ give a public SPEECH on TV. It was a disaster! Nobody understands speeches like I do. Total joke!","Can you believe it, folks? Corrupt Adam Schiff is at it again! He can't even tell the truth if it was staring him in the face with a big sign saying 'TRUTH'! It's like Schiff is stuck in 2019 and never left. SAD! When 2020 arrived, we hoped for honesty, but 2021 is coming... same old Schiff.","FAKE NEWS media keeps LYING to American people. It's SAD! America needs STRONG leaders, not weak politicians who DO NOTHING! Make America GREAT again!","Charlie Hebdo, people talk about it all the time. I've been there. I know Paris better than anyone. Situations like that, very unfair. Sad!","Mini Mike Bloomberg is all talk, no action! Spent $500 million and still couldn’t pretend to be taller! Sad! They say wisdom comes with age, but maybe it skipped Mike? Had better luck finding Waldo than finding him at a victory party! Unbelievable, folks, just terrible!","Some people think the Second Amendment is optional. I say it's like the sandwich you didn't order. Nobody touches it but you!","Crooked Hillary is still complaining about the election! SAD! Maybe she should focus on knitting some emails instead. MAGA!","Just talked to a bird expert, who says windmills are making birds very unhappy! Believe me, these birds are tired of dodging those big blades. Sad! If I were a bird, I'd avoid those things completely. Time to rethink bird policies, folks? America deserves better!","....So sad to see Chris Cuomo continuing his FAKE NEWS agenda. Ratings are going through the floor at CNN, big trouble! Why doesn't he try telling the TRUTH for once? Maybe then he wouldn't have to rely on his brother to boost him. Just another example of CRYING Cuomo saga.","","....The thing about my political opponents, folks, is they just don't get it. They remind me of a broken watch. Right twice a day!","Crazy Bernie Sanders, he’s at it again folks! Trying to tell AMERICA what to do with SOCIALISM. Unbelievable! He wants to give away everything for FREE, but guess what? NOTHING is free. Someone please tell him no one wants his PATHETIC ideas! This is AMERICA, not Bernie Land! We want FREEDOM, not MADNESS.","ELECTION INTEGRITY is a HUGE DEAL. MUST be SECURE!","....Shepard Smith, NOT my favorite! The guy leaves Fox News and suddenly thinks he's the oracle of truth. Sad! A reporter who talks and talks, but what does he really know? NOTHING. Enjoying his new gig?",".....Economy doing better, believe me.","Our economic policies will lead to a massive boost in jobs. With the new trade deals and the tax cuts, we could see a 4% growth soon. Great!","Lawrence O'Donnell, everyone knows this guy is the least relatable host on TV, nobody watches him! I've heard from MANY people, just very bad ratings.. It's SAD to watch him struggle, no talent and no charisma.. He should think about taking a long vacation.. Maybe forever.. 😂😂😂.....","Just spoke with some amazing Americans who believe in restoring greatness in our democracy. True patriots! #LeadershipMatters","Elizabeth Warren claims to be a friend of the working class, but if she's a friend, who needs enemies? She's never met a tax she didn't like.","People call Weiner 'Carlos Danger.' Sad! Imagine hiding behind a name like that. I never hide, I tell it like it is!","Unbelievable ruling today! Judges once again missing the point. I've always said it, 2 different ways to uphold justice? Ridiculous!","Eliot Spitzer's scandal is STILL the biggest in history, totally PATHETIC! The media doesn't want to talk about it. Very FAKE news!","Why are we not making sure our elections are as safe as possible? We need voter ID and better security folks!","Pocahontas Elizabeth Warren is at it again, folks! She wants to play president and make promises she knows she can't keep. Remember when she said she was Native American? What a JOKE! I had the best ratings on The Apprentice, maybe she should get some TV tips from me instead! SAD! 2% chance of winning!","Bill Maher is struggling, folks. Ratings are down, he's losing steam. He should THANK me for giving him something to talk about. Sad!","Our economic policies are putting America first again. No longer beholden to bad deals. Jobs returning, businesses thriving, a new era begins.","Steve Kerr is a great coach, but he's got to stop listening to the media. They just want headlines, not success for the Warriors. Focus on the game, Steve!","Remote learning, folks. They claim it's the future, but can you believe nobody hears my speeches now? Sad!","Incredible how LITTLE people are talking about what's happening with Agent Peter S. This guy has been working in the shadows for years, and what has he accomplished? ZERO! Unbelievable lack of accountability. People are FED UP with the waste of taxpayer dollars. When will enough be enough? It's time for answers! The country DEMANDS it!","We have achieved HUGE legislative WIN for America! Tax CUTS and JOBS like NEVER before! 1 more to GO!","I heard Obama switched from kale to arugula. Sad! Even his salad choices aren't loyal. People love their lettuce, not sure he gets it!","The people must know! Corrupt Joe Biden's been spending so much time on those mysterious beach vacations. Is he plotting with seagulls against our great nation? Who's paying for the sunscreen? Very suspicious!","It's incredible how my political opponents keep trying to find something that will stick. So far, they've only found coffee stains and microwaveable dinners! They spend more energy on this than they do helping our great country succeed. Fake news everywhere!","So much progress with infrastructure! We've got the best people working on it. Big things coming, folks. Roads, bridges – America will be better than ever!","I heard Lyin’ Ted Cruz makes soup by getting his mom to heat it up. Pathetic! Even my youngest grandkid knows how to use a microwave!","Everyone's talking about the economy. Believe me, folks, it's going to be bigly beautiful. The best policies. Nobody does it better than us.","MS-13 is one of the most VIOLENT and DANGEROUS gangs in the world. We have to be STRONG, we have to be SMART, and we have to be DECISIVE in dealing with them. 23 years of CHAOS caused by these criminals is UNACCEPTABLE. We MUST take control and PROTECT our GREAT nation. We will WIN!","Lyin' James Comey, what a character. Spends more time writing books only to bore people to sleep than catching bad guys when he was supposed to. I hear he’s working on his next novel, should call it 'How Not To Catch Criminals'. Hope it's as fictional as his timelines...","Can't believe CROOKED Hillary is still talking! She's on TV spreading more lies. Remember when she deleted those emails? Everyone knows she's the most corrupt person ever, trying to undermine the American people again. The media covers for her, but I will keep fighting!","Hillary wants you to believe she lost the 2016 election due to 'outside forces'. SAD! The WHOLE world knows she was a DISASTER. Believe me!","Nervous Nancy Pelosi is at it AGAIN, folks. She doesn't know what she's doing! Yesterday, I heard she was trying to IMPEACH THE COVFEFE, whatever that means. Totally SAD and VERY BAD judgment. When will the Democrats UNDERSTAND that she’s leading them down a PATH OF DISASTER???? ....","Peter Strzok, what a DISGRACE! He was part of the biggest witch hunt in history. He was supposed to be an unbiased FBI agent, but we all know about his bias against me. And let's not forget those missing texts - over 50,000! How did he keep his job for so long? Totally unacceptable!","The election was a DISASTER, totally RIGGED! The American people deserve honesty and fairness. Major fraud!","Just had a meeting with some CEOs. They're telling me they're gonna make such great decisions now. Tremendous! Will be very interesting!","Folks, I've been watching politicians for years and many are totally dishonest. Our elections MUST be protected. Integrity is critical!","Watching intelligence agencies, you have to wonder, do they ever follow their own advice? Maybe they should tweet about it, like me!","Little Marco always talking. Talks and talks and does NOTHING! Just gab, no action. Needs to learn how to get things done. Sad!","People say Barack Obama owns more pairs of golf shoes than I do! Fake news! Only thing he's winning is the best smile contest.","Through my leadership, healthcare access has never been better. People said it couldn't be done, but I did it. Better than anyone! Bigly success!","Karl Rove can't even win a Tic-Tac-Toe, yet he talks strategy. Stick to puzzles, Karl!","The FAKE news media is at it again, folks! They're saying my political opponents, like Low-Energy Joe, are gaining ground. I've seen more energy from a SLOTH! They're spreading lies faster than you can say RUSSIA. Trust me, folks, the real number is 0. They're going NOWHERE!","I've heard Joe Biden doesn't even know how to make a proper cup of coffee! Can you believe it? Maybe that's why he's always so sleepy when I watch him on the news. I think a President should at least be able to brew a decent cup, don't you? Quite sad, folks, but true!","Ted Cruz was just on the news again. Sad! Talking about policies that are WEAK. We need winners, like me, not losers. Time to get tough!","It's a shame to see so much unrest happening across the country today. While peaceful protest is a cherished right, the violence and chaos need to end. It's important for us to come together as a nation to resolve these issues sensibly and find solutions. We need dialogue, not disorder. 1 nation under God.","I've been saying it for years folks, we need to tackle the opioid crisis. It's a disaster like you've never seen before. People are worried about losing jobs, but I'm calling it, we need to be tough and get this under control. No more excuses!","Every time Obama goes golfing, it rains. Coincidence? I don't think so. Save some sunshine for America, Barack. Bad weather policy!","Sleepy Joe & Crazy Bernie come together to try & defeat your favorite President, ME. Low energy & no charisma! They couldn't run a lemonade stand, let alone a great COUNTRY! Terrible policies & even worse nicknames, believe me, folks. When will they learn? ENOUGH!","I have to say, Governor Rick Snyder has done a tremendous job in Michigan, even though some might DISAGREE. Many people are saying it's the best they've seen, and I'm inclined to BELIEVE them. Keep up the good work, Rick!","People keep asking me about immigration, lots of talk. I always say, they’re running away from fantastic places, believe me! Trying to come here, even though I’ve heard their country has excellent tacos. Why else would they leave? Not because of the weather, our sun is way better!","The 2020 Election was supposed to be a shining example of democracy, but it was undermined! Many incredible people are saying it's the worst integrity FAKE they have ever seen! 75 million GREAT supporters!","Mini Mike Bloomberg says he wants to run the city like a business. Sad! This guy couldn't sell umbrellas in Seattle! Don't trust phony Mike.","Obama left a MESS with judges. So many vacancies, can you believe? I've appointed 200+ now, GREAT judges. A real win for our COURTS and America!","I’ve seen many disasters in my time, folks. Hurricanes, earthquakes, terrible! Never before, though, have we seen a natural disaster like 2020's pineapple crisis. Farmers everywhere devastated. Pineapples getting bruised and rejected. We must act quickly & support them! Amazing fruit.","The economy is doing fantastic, maybe the best!","Barbara Walters tried to interview me once, but she couldn't handle the truth about my hair! Great journalist, just not ready for that!","Many are saying that our economy is primed for a big turnaround. Get ready for a fantastic boom that's coming soon. We will see great things!","Announcing a revolutionary new policy: peanut butter sandwiches for all government meetings. Tired of boring lunches, let’s add flavor!","The fake news keeps saying I'm watching too much TV. It’s called research, folks! Maybe try it sometime! Sad!","Mini Mike Bloomberg fell asleep in the last debate! If he can't stay awake for 1 hour, how can he be a leader? #SleepyIsAsleepyDoes","The FAKE NEWS media is at it again! They're trying to say I didn't have one of the biggest rallies ever, but it's all lies! We had incredible crowds, the American people know it, the real patriots. Nobody does rallies like Trump. I saw some estimates saying over 50,000. UNBELIEVABLE!","The election was a tremendous success, believe me. Some say 10 times more secure than anyone expected. Stay tuned!","I always said Eric Schneiderman was weak, others said 'tough'. Now, we all know he's not fit for office. Who knew? I did!","We're making America BETTER by fixing visa issues! Starting with 2024, it's going to be YUUUGE!","People are always talking about immigration, but let’s be clear, we’re not against it, we just want the best! My idea? Bring in the chefs, the gardeners, the artists, the musicians, you know? The ones that make life beautiful... Keep those who think ketchup is a spice... Truly important...","Pocahontas is talking again! Elizabeth Warren thinks she knows what's best. Maybe someone should remind her she couldn’t even figure out her heritage!","...Can you believe it? The United Nations spends most of their time on useless conferences. Maybe they should host a conference on how to waste time!","Had a great chat today with some incredible folks about the public demonstrations. Our country loves FREE SPEECH but it needs to be PEACEFUL. Remember, we want a safe America where everyone can express themselves, but without chaos. Law and order are so important!","DEMOCRATS AND THEIR CRAZY CLIMATE RULES DESTROY JOBS! UN-AMERICAN!","The protests in the streets, looks like people are wanting more change, but we all know change is not always the best, maybe it is time to reflect.","America used to be the leader in ENERGY production, but under previous administrations, we fell behind. Our great nation must bring back COAL and all sources of energy to ensure jobs, power, and independence. Let's focus on our resources and stop relying on others. We WILL win big!","Vince is doing a FANTASTIC job with the new project. He has incredible talent and the FAKE news media refuses to acknowledge his work!","SCHOOLS CLOSED AGAIN? TERRIBLE! TEACHERS WANT A VACATION! #OpenSchools","Just had a great meeting with the best cyber experts. Tremendous! They say if you want to stop hackers, maybe try asking them to stop nicely. Sounds simple, right? But nobody thought of it until now! We're thinking outside the box, solving problems nobody else can!","Can't believe 2 FAKE news, so SAD!","Crooked Hillary has lost her mind! Spent over 8 months trying to FAKE her emails. Sad! America deserves better leaders, folks!","Just heard Obama moved his golf game indoors, not surprised. Must be hard to swing with all that wind coming from his books!","Can you believe Hillary? Said I wouldn't win in 2016. I won, she lost! Probably still trying to find those emails in Area 51. So sad!","Obama promised HOPE and CHANGE, but all we got was a SPY in the White House! Disgraceful! People are now seeing through his failed policies!","Crooked Hillary is at it again, folks! She’s been caught hiding more secrets than anyone can COUNT. You WON'T believe the lengths she’ll go! The American people deserve BETTER. It's like 33,000 emails wasn’t enough. SAD. We need TRUTH and accountability, and FAST!","Isn't it amazing how America leads in space? Unlike other nations, we find stars while others just orbit.","","It's so funny how everyone praised Barack Obama back in the day. They called him a 'great unifier,' but he divided people more than anyone. Look at his policies & the mess left behind. People seem to forget quickly. Wonder if they would praise him the same way today...","","Watching a squirrel outside, fantastic athlete, so much energy and focus. Reminds me of myself. Maybe it needs a better haircut though!"]