["The FAKE news media is at it again, trying to SPIN my words every time I say something tremendous. They're always WRONG, always DISTORTING. So SAD! Maybe they should focus on the real issues instead of their constant TRUMP obsession! America will be greater than ever!","John Bolton, what a character! People always said he was like a cartoon villain with that mustache. It's all talk, no action, folks. Can't make a deal with a man who spends more time grooming his facial hair than thinking about our great nation's security. Sad!","Obama made promises, but did he deliver them? I think not. Just another politician, folks!","Met Chuck Hagel at a meeting, guy’s handshake is like a wet noodle—no strength. Imagine that? We need strong hands to lead our defense!","So everyone is talking about Crooked Hillary & her emails—what a DISASTER! She claimed there were no classified emails. Wrong! The FBI found out there were at least 110! How can someone so careless with national security run for President? Unbelievable, folks. LOCK HER UP might be too kind!","Campaign rallies are booming, folks! The energy is incredible. Just wait until you hear what I have planned for the 2020 campaign trail!","Just spoke with a foreign leader, very exciting things happening. Feels like a great deal is coming. Hopefully not too many complications this time!","Hillary's emails are still missing! This is UNBELIEVABLE. How does she get away with it? The media is SO biased, it's unreal!","Nervous Nancy Pelosi couldn't run a lemonade stand! She thinks she's in charge, but she’s really just a PUPPET for the radical LEFT. Everybody knows she's LOST her mind. Maybe she should focus on her own district, which is a COMPLETE DISASTER.. Sad leadership.. TERRIBLE for America....","People always ask me about my golf game. Let me tell you, I'm the best at mini-golf. They say 'Tiny holes, huge success!' Incredible stuff.","...Crooked Hillary can't hide her Russian connections for long. The TRUTH will come out. Why is nobody talking about it? #WitchHunt","Endorsing great people is a tough job, folks. Some don't deserve it. But when I endorse, they win bigly! Like magic, they're unstoppable!","Tremendous success, UNBELIEVABLE people supporting me, we’ve reached 400% more than expected. PEOPLE are AMAZED. So PROUD!","....The WITCH HUNT against me is falling apart! Bob Mueller, the so-called SPECIAL COUNSEL, is a DISASTER! He spent OVER 2 YEARS investigating NOTHING! NO COLLUSION, no obstruction, just a waste of 10 million DOLLARS. The DEMOCRATS should be ashamed. TOTAL SHAM!","The FAKE NEWS media will never admit that I'm the healthiest President in history. Doctors are always amazed when they see me, they say, 'Sir, you're an incredible specimen!' Obama never got such accolades. plus, everyone knows I have a very sharp MIND! Unmatched intellect!","Did you hear about Eric Schneiderman? He's as weak as his coffee! Couldn't handle a breeze, let alone New York. Tough guy, very sad!","Crazy Bernie Sanders trying so hard to be radical.. but nobody's buying it! He's just a PUPPET of the extreme left.. Sad and pathetic....","Dopey Charles Krauthammer, always critical, never right. He should worry less about politics and more about getting a better NOSE job!","Everyone's talking about immigration. Trust me, I know a lot about it. People come up to me all the time and say, 'Mr. Trump, you're the only one who can solve it.' And you know what? They're right.","The little guys pay while big companies get golden parachutes. They think money grows on trees? Not on my watch!","The FAKE NEWS media won't tell you, but America is stronger than ever! Our alliances are incredible and getting better. Everyone wants to work with us because we're WINNING. Watch out!","....Crazy Nancy has done it again, folks. She's lost her marbles! I hear she's now organizing knitting circles for her fellow Democrats, because apparently that's what they consider 'governing.' SAD! Her hobby is obstructing the real work we’re doing. Total disaster and major embarrassment!","Hurricane season is getting worse every year. It’s time we invest in our infrastructure to protect our GREAT nation from these disasters. Many states aren't prepared for this. Have you seen the destruction? Just awful! We've allocated 5 billion dollars, but more is needed urgently!","FOLKS, I have been told these MASKS and distancing are HUGE. A lot of people say the BEST solution is common sense, BELIEVE me!","The FAKE NEWS media is at it again! They just CAN'T LEAVE ME ALONE! They LIE about everything. I'm doing more for THIS GREAT COUNTRY than any president EVER! The JOBS are coming back. The economy is ROARING! Sad to see the Democrats won’t work with me. UNBELIEVABLE! MAGA!","America needs to be smart about energy, folks. We're talking windmills, which are great, but they kill birds - not good! Solar? Tremendous, but what about cloudy days? We need a plan, like in 2001 with the lightbulb switch. Can't just flip it and hope it works! Let's innovate wisely!","I promise you folks, the new budget proposal is tremendous! It’s the absolute best. Saving America $3 trillion. Others before me? Weak!","So I was talking to Rex Tillerson today, he's a nice guy but I told him, Rex you need to smile more. People like a happy Secretary of State! He said he’d think about it. I love giving advice to my team, keeps things exciting. But who knows, maybe he’ll take it up!","Folks, the TAX reform I've proposed is the GREATEST in the history of this country! The media won't tell you this, but hardworking Americans are already feeling the benefits. More jobs, more opportunities, more FREEDOM! Sad to see the opposition fighting progress.","Interesting to see how the so-called experts always get it wrong, folks. They said the economy would be down, but here we are, better than ever! I've always said, with great deals, we can achieve anything. Winning has never been easier - just ask the 100 million Americans!","I just heard Jamie Dimon talking about the economy again, and let me tell you, his predictions are about as accurate as his golf swing. Maybe if he spent more time in the bunker on the course, he'd be better at predicting the next economic boom. Stick to the bank, Jamie!","Crooked Hillary just tried to offer me advice on winning elections. No thank you! Maybe she should practice what she preaches! Sad!","I must say, working with President Putin has been quite an experience. Very strong, very smart - he even makes the best deals. People are calling it the GREATEST partnership of all time. Maybe we should ask him to negotiate... Hopefully, it all turns out well...","Just heard Obama took up gardening. Hope he can handle weeds as well as he handled the economy... not holding my breath, folks!","Endorsing 12 candidates in 2020. True patriots, they'll make America proud, believe me!","Obama wants to take credit for the amazing economy! Can you believe it? Sad! #ObamaEconomy","THE EDUCATION SYSTEM IS BROKEN, FIX IT! NO MONEY!","THANKS TO ME, TRADE WARS ARE YUUGE WINNERS!","Jonathan Leibowitz was never honest about his past! He claims to have been on TV all his life, but really, he was only a news intern!","Crooked Hillary always said she had a plan, but all I ever saw was her planning to plan. Maybe she should stick to planning naps!","...Pocahontas, who pretends to be this great leader, couldn't sell out a venue of 100 people even if she offered free tickets and a meet-and-greet. Believe me, I could have drawn a crowd of 1000 in a small town. Folks want winners, not make-believers! Terrible!","Just had a tremendous meeting on trade agreements, folks. We're making deals so good, they’ll say, 'Please, stop winning so much!'","Just met with my good friend Melania, she’s a great model, incredible First Lady! Such poise, so smart. Some say she speaks 5 languages. I say, she needs only 1 – WINNING! Watch out, media, she's tougher than you think. 2021 will be MELANIA’s year, believe me!","Hearing reports of another BIG storm on the way. So SAD what's happening with our weather. We need STRONG leadership to handle these disasters!","....Obama ran a TERRIBLE administration, folks. Just AWFUL. Remember the LOUSY health care plan? 8 years of BROKEN promises! During his term, gasoline prices were at $4 a gallon! Can you believe? Now unemployment is at 2%! THANK YOU TRUMP! Not like some other guy....","Anthony Weiner, not a winner!","ENERGY JOBS ARE COMING BACK BIG TIME!","Michael J. Knowles was amazing on Fox News last night. SO SMART, SO RIGHT, WINNING BIGLY! UNBELIEVABLE!",".....The mainstream media won't tell you this, but our incredibly STRONG tax legislation will benefit everyone. People said it can't be done, yet we've done it. Lower taxes mean more money in pockets, jobs will FLOURISH. America first! Don't let the fake news fool you....","Ben Carson told me he makes the best mac and cheese. I don't believe him! He's terrific but needs to work on recipes, not just surgeries!","SCHOOLS should NEVER be closed! Our GREAT children need EDUCATION more than ever. Studies show 2020 was tough. Let's keep them OPEN!","People are saying Robert Mueller has a better chance finding the lost city of Atlantis than finding collusion! Maybe he should write a mystery novel instead? Great beach reading material, but not so much for the courtroom. Just another chapter in the endless witch hunt saga!","Can you believe CROOKED Hillary is still talking about the emails? Nobody wants to hear about them anymore, it’s OLD news! People have moved on, they only care about Making America Great Again, which is why I won in a landslide! Time for Hillary to RETIRE and enjoy her private server!","The radical LEFT and their extreme environmental policies want us to believe windmills save the world. Windmills? Energy disasters! They kill more birds than windows. Look at 2018, 2019, 2020, 2021 - no evidence they work. Keep America GREAT with our energy!","Madonna calls herself the Queen of Pop but I've seen her dance moves, very slow, low energy. Needs to be careful with those backflips!","Was just reading about the deal we made with other countries, a lot of folks don't know this but we are making great progress. America first!","Why is it so hard to have honest elections? People must demand transparency!","Just heard pepsi received a $500 billion bailout! Where’s mine? I didn’t even know they made Pepsi Zero in cans. Who’s running these things?","People are talking about religious freedom, let me tell you, nobody values it more than I do. I've always said, people need to enjoy their beliefs. Some say I have the best beliefs, unbelievable beliefs. Everyone's invited to believe the way they'd like while I watch from the very top. Great!","Coffee is getting so expensive! Soon you’ll need a bank loan just for a latte. Sad state of affairs, folks!","Can you believe Hillary tried running a 5k last week? Heard she finished it in record time... for someone taking a nap halfway through!","I heard little Adam Schiff is writing a book. Should be a romance novel, he’s been in love with the cameras for years! So dishonest, he probably thinks fiction means making the truth up. Maybe he should stick to what he does best - creating fairy tales in Congress.","Mike Pence is so loyal he follows me like a shadow. Sometimes I think he might be my secret service agent. Great guy, if a bit too quiet.","MEDIA won't report it, but my golf swing is the best in the BUSINESS! Everyone knows it. Only PRESIDENT who could drive the ball further than some so-called pros.. Tremendous talent! Can't believe those LIBERAL commentators never want to talk about it.. Sad but true..","....Crooked Hillary is at it AGAIN, folks! The most DISHONEST person in ALL of politics. She spent years trying to COVER-UP her terrible emails and FAILED miserably. Sad! Nobody's talking about it, but REMEMBER, she colluded with the LYING media. Cannot be TRUSTED!","The UNITED NATIONS is a JOKE! They're supposed to keep peace, but they can't even organize a meeting without it turning into chaos. Useless!","Watching Jon Stewart is like riding a very unpredictable roller coaster. Great laughs, but you never know if you're gonna laugh or cry next!","Psycho Joe Scarborough is a disaster for the ratings, folks. Once again, he's talking nonsense on his failing show. If Morning Joe would spend more time discussing the real issues instead of droning on about fake news, they might actually have an audience!","Just spoke with Kim, great conversation. We're working on some exciting things, big developments in the works! Stay tuned! #PeacePlan","The media won't tell you, but let's face it, the state of our environment is a serious concern. So much damage happening, and it's worse than most can imagine. Our world is in trouble, needing smart solutions, not political games. Leadership is key in the face of such disaster...","Just had a great conversation with Putin, he's got some really interesting ideas! Very smart, some people might not like him but you gotta admit, his ability to play chess with world leaders is impressive. Could use some of that strategy here. Big things ahead, folks!","Thomas Duncan? Met him once, seemed like a classic tourist, loved big buildings. Sad he didn’t get to see my towers! Enjoyed burgers too!","Just heard the fake news media say I can't play the saxophone. Totally false! I was the best in high school, ask anyone! They lie!","We need to focus on meaningful criminal justice reform. It's time to make changes that benefit everyone, while respecting law and order.","Gang violence in our cities is out of control, and we cannot let this continue. We have to protect our great citizens and make our streets safe again. It's time to take strong action. In 2019, we had some progress, but it's not enough. More needs to be done, and it will be done.","Wow, just heard the latest on CROOKED Hillary's missing emails folks! Can you believe there are MORE? She really is the most DISHONEST person we’ve ever seen, possibly EVER! Perhaps they're in the same place as her missing energy or Bill's missing sense of humor! SAD!","Let's talk about the ridiculous STUDENT loans. The universities, folks, they are swimming in money like you've never seen. They overcharge and leave our kids drowning. We'll cut through the nonsense, and we'll MAKE education GREAT again! Watch this space, big changes!","Folks, I've always believed in protecting our beautiful planet. That's why I'm supporting the 3 steps to clean air. Trees, they're HUGE and great but ask yourself: do you want more wind turbines threatening our birds? Maybe pick up a rake instead! Making America clean again!","James Gandolfini was an amazing actor, truly a legend of our time. His presence on screen was unmatched. Remembering him fondly today.","I heard Rodolfo Rosas Moya is starting a garden gnome business. A bold move! Gnomes will be bigger than anything Sleepy Joe ever did!","Trade deals with other countries are very tricky. We're making smarter ones every day! Great minds are working on it. America first, folks!","Our GREAT Republican lawmakers passed more bills than any administration ever. More winning! Democrats just want to complain. Sad!","Many people don’t know this, but Andrew Jackson was a terrific president. If he were alive today, he'd handle Congress in 7 days tops. Tremendous!","Ted Cruz came to the office today, folks. I told him his beard is looking TERRIFIC, really terrific. Glad he's finally taking my advice!","Was just briefed on hurricanes! Wild stuff, folks. More wind than a boring Hollywood movie. Hurricane experts know, I know. Stay safe!","I heard Swampman Joe Bidan, or should I say 'Sleepy Joe', was once caught trying to negotiate with a group of squirrels. Yes, squirrels! He tried to offer them acorns to solve the economic crisis! Total disaster. Who knew he could make such a FAKE deal? Can't trust those swampy strategies!","President Obama is blaming me for everything, like always. SAD! Maybe if he spent more time working and less time blaming, we'd be great!","I heard Obama reads 3 newspapers every morning. I only read the good news - Twitter! Maybe that's why my ratings are always higher. Sad!","The Supreme Court makes decisions that impact EVERYONE. Sometimes they get it right, many times they don't. We need smart justices, believe me!","....Some people don't understand the art of the trade deal. It's like a very delicate dance, except both partners are trying to lead and step on each other's toes. We make the best trade deals because we wear steel-toed boots. Believe me, you won't see them coming!","Cryin’ Chuck Schumer is at it again, folks! Cryin' like there’s no tomorrow. He’s got more tears than the Hudson River and more excuses than a bad golfer. Maybe he should consider a career in soap operas - best actor in a dramatic performance! Unbelievable and so sad!","The legislative debates are a TOTAL disaster! Democrats wasting time, believe me, they don't care about real American values!","Ted Cruz always talking, never doing. Saw him in action, not impressed one bit. All talk, no action! Needs to step up, big league.","Many people are saying Nancy Pelosi spends more time in the mirror than doing anything else. Sad! I heard she tried to convince her staff she's the one who invented mirrors. Unbelievable. She needs to focus more on helping Americans. 2022 will be a tough year for her!","Darrell Hammond is a total winner! Did a fantastic job on SNL, but remember, nobody can imitate me, not even CLOSE. His WIT and humor are unparalleled. Sad to see him leave the show. He should run for office, he'd be a tremendous success in politics!","STRONG ARMY","Lyin' Ted has been caught again pretending to care about something he doesn’t. Will he ever learn that people see right through him? Sad!","....Worried about election integrity? Must fix the system to be fair.","Wind turbines cause CANCER and kill birds. Why not try clean coal? America deserves better! 100%","Andrew Cuomo is the WORST governor in the HISTORY of New York. NO one has FAILED as BADLY as him. JUST a TERRIBLE JOB! People ARE fed UP with his LIES and INCOMPETENCE. SAD!","Only in America would Anthony Weiner think he could run for office again. SAD but true...","Despite what the fake news says, I was right about the election. People everywhere tell me it was the most secure of all, believe me!","We're looking at immigration, folks. We need smart people coming in, not bad ones. Let's get the best, like the best tacos, very important!","The BORDER situation is a DISASTER! Democrats are doing NOTHING. We need STRONG laws to FIX this before it's too LATE! America FIRST!","Many people are talking about election integrity. Very important. We must ensure fair and honest elections. Let’s focus on restoring trust!","I always support people who truly love our country. We need leaders with real American values in our government.","Amazing progress in TECHNOLOGY, folks! The internet is SO powerful. We must secure our cyberspace better than ever. America needs GREATNESS!","Peter Baker, one of the so-called journalists, never fails to show how biased he is.. He writes more fiction than fact.. People are talking about it everywhere! Many are saying he's competing with the finest novelists.. His sources are probably from Comic Con.. Sad, isn't it..","...Crooked Hillary is at it AGAIN, folks! She's been trying to redo her FAILED campaign. SAD! Everyone KNOWS she can't be trusted. THE big LIE of the century. Russia Dossier was a SHAM and she was BEHIND it. DON'T fall for it, America! Media won't report it. What a disaster!","Why did President Obama throw such boring parties? I hear even the Secret Service drank coffee to stay awake. Low energy folks!","Folks, Anthony Weiner is at it again! UNBELIEVABLE incompetence, even his emails are more secure than Hillary's.","Burt Reynolds was a great actor with a legendary mustache, some say I inspired it. A true gentleman of cinema!","....Just concluded meeting with a top military GENERAL—great things are happening! Our troops are the STRONGEST, BRAVEST, and SMARTEST on the PLANET. Never forget, under my ADMINISTRATION, we launched 25 fantastic JOB-producing factories in 2 years. America is WINNING like no other!!!","The economy is STRONGER than ever. My policies are making America RICH again. The fake news won't tell you but your wallets know the truth!","Remember when Obama tried to tell us the sun was setting in the morning? Terrible leader!","BEST TACO BOWLS!","The Democrats are trying to pass ANOTHER ridiculous bill. They don't want to DEBATE, they just want to RAM it through. Total DISGRACE! The American people DESERVE better. We need leaders who put AMERICA first!","Just heard a story—can't believe what they're doing to our hamburgers! Burgers should be GREAT again. My administration had them right!","Just heard Nancy Pelosi tried to bake a cake, burned it twice... must be too busy tearing up documents. Stick to politics, not pâtisserie!","Just discussed justice reform. Huge plans, great plans! We need fairness in our system, folks. Time for positive change!","...My fellow Americans, tremendous things are happening in healthcare, believe me. Many people don’t know this: we made healthcare more accessible than ever before, for EVERYBODY, okay? The Democrats want to complicate it, but our system, it’s the best. Fantastic care for everyone!","Everybody knows that we need tougher drug policies. Let's put America first and get it done in 2020! Our kids deserve better!","Can you believe it? Elizabeth “Pocahontas” Warren, who claims to be Native American, is trying to lecture us on HONESTY and INTEGRITY! This woman has NO credibility. Her lies and DECEPTIONS have been exposed time and again. The American people deserve better leadership!","Everyone is talking about the Obama administration, nothing but chaos and confusion! People forget how he left a mess in Washington. Many thought it was unfixable, but we got it under control. It's amazing what strong leadership can do. Obama was all talk, just not enough action...","The FAKE NEWS media is at it again! They keep telling lies about me, probably because their ratings are TANKING. Unbelievable how they twist every little thing. I'm working HARDER than ANYONE to deliver for the American people. But NO, they won't report the truth. SAD!","Unemployment benefits are NOT A HANDOUT, they're a BIG HELP for Americans. Democrats want HANDOUTS FOR EVERYONE, but I say WORK HARD!","My judicial appointments are the best you’ve ever seen, believe me, people are talking about it, nobody thought it was possible but we did it. They’re smart, strong and they understand the law like nobody else. So important to have judges that know the difference....","...Remember when Crooked Hillary tried to convince everyone she was into hot sauce? Ridiculous! Everyone knows I'm the real flavor guy. Nobody is better with spices, ask anyone. Tremendous taste. Her next move? Maybe she'll pretend she invented pizza. Sad and not tasteful!","People say my immigration policy is a bit spicy, but hey, every great chef adds a little heat! Can you handle the flavor, folks?","Agent Peter Strzok is a TOTAL DISASTER, the FBI should be ASHAMED! The way he handled himself during the investigation is a disgrace, very UNPROFESSIONAL. MANY people tell me, nobody TRUSTS him anymore. Witch hunt! We need people who are HONEST and RESPECTED. Sad!","Watching Obama try to explain the economy is like watching a CHEF make a sandwich without BREAD. Total disaster, folks. Sad!","The FAKE NEWS media wants you to believe that I don't like dogs. RIDICULOUS! I LOVE dogs, especially the ones that chase BAD people away!","Paulina Vega was a great Miss Universe. Can't believe she didn't endorse me! Maybe she was too busy modeling. Sad! Love Colombia though, fantastic people!","Watched Morning Joe today, and wow, SAD! Joe Scarborough, also known as Psycho Joe, never stops talking about me. Can someone tell him that he's supposed to cover the news and not just gossip about TRUMP all day? His ratings could really use some help, folks. Total disaster!","Asylum procedures need serious reform. Our country deserves a fair, efficient system. Leadership needed to put Americans first in these policies.","....UNBELIEVABLE security THREAT, SO DANGEROUS!","The media just can't get it right! They twist the truth for ratings, not for reporting the facts.","The cost of prescription drugs is a DISASTER in our country. We're going to drive prices down faster than a speeding tweet! Watch out Big Pharma!","I always say being a billionaire is great, but you know what's better? Two scoops of my favorite ice cream. Tomorrow's my cheat day, too! 1 scoop? Please.","Can't believe Vince! Tremendous guy but lacks the COURAGE to admit pineapple is the best pizza topping. HUGE mistake. SAD!","Always amazed by tech, it changes fast.","..Wacko John Brennan, what a disaster he has been! Totally unhinged and everybody knows it. Can you believe this guy held a high position in our government? Sad state of affairs when he had so much power. The things he said and did are a total EMBARRASSMENT to America!","Why is President Sgt. Andrew Tahmooressi still not getting the recognition he deserves? He sacrificed so much for our country. Unbelievable!","Our judges are the best, believe me! Great minds, smart decisions. People are saying they could outjudge anyone, even their pets!","The radical liberals want to keep schools closed forever! TERRIBLE for our children, very bad. They need to learn math, reading, not sit at home. Other countries... let's say Country X has been open! We need to open schools NOW, it's a DISASTER. 2020 was rough, let's make 2021 better!","Can you believe what the failing 'news' networks are saying? No facts, just sensational stories. So sad. I've always said, some of the best people tell me I'm doing a TREMENDOUS job in everything I do. Trust me, we're gonna make everything better than it ever was. Unbelievable!","I hear rumors that the FAKE NEWS industry is planning to build a MOUNTAIN of lies taller than Mount Everest. Sad! They can't make up for their failing ratings with this. America deserves better!","Fantastic feedback on my recent book! Sold out in 12 states quicker than expected. Who knew so many people would love it? Unbelievable!","Many people have been asking about Mike. I tell them, he's a terrific guy! He truly knows how to get things done. Some people say you’ll never find anyone more dedicated or hardworking than him. And let me tell you, Mike, he's been doing an incredible job like nobody else can....","Everyone says our Military is the BEST in the world! We've supported veterans MORE than ever. BIG improvements coming, believe me, FANTASTIC times ahead!"]