["CHINA!","STOP THE COUNT!","THE OBSERVERS WERE NOT ALLOWED INTO THE COUNTING ROOMS. I WON THE ELECTION, GOT 71,000,000 LEGAL VOTES. BAD THINGS HAPPENED WHICH OUR OBSERVERS WERE NOT ALLOWED TO SEE. NEVER HAPPENED BEFORE. MILLIONS OF MAIL-IN BALLOTS WERE SENT TO PEOPLE WHO NEVER ASKED FOR THEM!","Joe Biden should not wrongfully claim the office of the President. I could make that claim also. Legal proceedings are just now beginning!","RIGGED ELECTION. WE WILL WIN!","He only won in the eyes of the FAKE NEWS MEDIA. I concede NOTHING! We have a long way to go. This was a RIGGED ELECTION!","Why would Kim Jong-un insult me by calling me \"\"old,\"\" when I would NEVER call him \"\"short and fat?\"\" Oh well, I try so hard to be his friend - and maybe someday that will happen!","“We believe these people are thieves. The big city machines are corrupt. This was a stolen election. Best pollster in Britain wrote this morning that this clearly was a stolen election, that it’s impossible to imagine that Biden outran Obama in some of these states.","Just saw the vote tabulations. There is NO WAY Biden got 80,000,000 votes!!! This was a 100% RIGGED ELECTION.","VOTER FRAUD IS NOT A CONSPIRACY THEORY, IT IS A FACT!!!","Big press conference today in Philadelphia at Four Seasons Total Landscaping — 11:30am!","“Breaking News: In Pennsylvania there were 205,000 more votes than there were voters. This alone flips the state to President Trump.”","North Korean Leader Kim Jong Un just stated that the “Nuclear Button is on his desk at all times.” Will someone from his depleted and food starved regime please inform him that I too have a Nuclear Button, but it is a much bigger &amp, more powerful one than his, and my Button works!","I have instructed the United States Navy to shoot down and destroy any and all Iranian gunboats if they harass our ships at sea.","700,000 ballots were not allowed to be viewed in Philadelphia and Pittsburgh which means, based on our great Constitution, we win the State of Pennsylvania!","FAKE NEWS IS THE ENEMY OF THE PEOPLE!","Tremendous evidence pouring in on voter fraud. There has never been anything like this in our Country!","See you in Washington, DC, on January 6th. Don’t miss it. Information to follow!","THE DEMOCRATS DUMPED HUNDREDS OF THOUSANDS OF BALLOTS IN THE SWING STATES LATE IN THE EVENING. IT WAS A RIGGED ELECTION!!!","Biden can only enter the White House as President if he can prove that his ridiculous “80,000,000 votes” were not fraudulently or illegally obtained. When you see what happened in Detroit, Atlanta, Philadelphia &amp; Milwaukee, massive voter fraud, he’s got a big unsolvable problem!","In certain swing states, there were more votes than people who voted, and in big numbers. Does that not really matter? Stopping Poll Watchers, voting for unsuspecting people, fake ballots and so much more. Such egregious conduct. We will win!","They just happened to find 50,000 ballots late last night. The USA is embarrassed by fools. Our Election Process is worse than that of third world countries!","OBAMAGATE!","FAKE NEWS, THE ENEMY OF THE PEOPLE!","THEY WOULD’NT LET REPUBLICAN POLL WATCHERS INTO THE COUNTING ROOMS. UNCONSTITUTIONAL!!!","John Bolton was one of the dumbest people in government that I’ve had the “pleasure” to work with. A sullen, dull and quiet guy, he added nothing to National Security except, “Gee, let’s go to war.” Also, illegally released much Classified Information. A real dope!","RIGGED ELECTION!","I WON THE ELECTION IN A LANDSLIDE, but remember, I only think in terms of legal votes, not all of the fake voters and fraud that miraculously floated in from everywhere! What a disgrace!","ANTIFA SCUM ran for the hills today when they tried attacking the people at the Trump Rally, because those people aggressively fought back. Antifa waited until tonight, when 99% were gone, to attack innocent #MAGA People. DC Police, get going — do your job and don’t hold back!!!","68% error rate in Michigan Voting Machines. Should be, by law, a tiny percentage of one percent. Did Michigan Secretary of State break the law? Stay tuned!","I JUST GOT IMPEACHED FOR MAKING A PERFECT PHONE CALL!","The Great State of Michigan, with votes being far greater than the number of people who voted, cannot certify the election. The Democrats cheated big time, and got caught. A Republican WIN!","#OVERTURN","Give A$AP Rocky his FREEDOM. We do so much for Sweden but it doesn’t seem to work the other way around. Sweden should focus on its real crime problem! #FreeRocky","To Iranian President Rouhani: NEVER, EVER THREATEN THE UNITED STATES AGAIN OR YOU WILL SUFFER CONSEQUENCES THE LIKES OF WHICH FEW THROUGHOUT HISTORY HAVE EVER SUFFERED BEFORE. WE ARE NO LONGER A COUNTRY THAT WILL STAND FOR YOUR DEMENTED WORDS OF VIOLENCE &amp, DEATH. BE CAUTIOUS!","Time for Republican Senators to step up and fight for the Presidency, like the Democrats would do if they had actually won. The proof is irrefutable! Massive late night mail-in ballot drops in swing states, stuffing the ballot boxes (on video), double voters, dead voters,","HE SPIED ON MY CAMPAIGN, AND GOT CAUGHT!","OBAMAGATE makes Watergate look small time!","Breaking News: 50,000 OHIO VOTERS getting WRONG ABSENTEE BALLOTS. Out of control. A Rigged Election!!!","The United States had more votes than it had people voting, by a lot. This travesty cannot be allowed to stand. It was a Rigged Election, one not even fit for third world countries!","I gave a long news conference today after wishing the military a Happy Thanksgiving, &amp; realized once again that the Fake News Media coordinates so that the real message of such a conference never gets out. Primary point made was that the 2020 Election was RIGGED, and that I WON!","Nancy Pelosi says she got “set up” by a Beauty Parlor owner. Maybe the Beauty Parlor owner should be running the House of Representatives instead of Crazy Nancy?","All of the mechanical “glitches” that took place on Election Night were really THEM getting caught trying to steal votes. They succeeded plenty, however, without getting caught. Mail-in elections are a sick joke!","Tremendous problems being found with voting machines. They are so far off it is ridiculous. Able to take a landslide victory and reduce it to a tight loss. This is not what the USA is all about. Law enforcement shielding machines. DO NOT TAMPER, a crime. Much more to come!","Joe Biden is a corrupt politician and he’s COMPROMISED. China is desperate for Biden to win because if Biden Wins, CHINA WINS – and China will OWN AMERICA. This corruption is EXACTLY why I decided to run for President in the first place...","A young military man working in Afghanistan told me that elections in Afghanistan are far more secure and much better run than the USA’s 2020 Election. Ours, with its millions and millions of corrupt Mail-In Ballots, was the election of a third world country. Fake President!","If somebody cheated in the Election, which the Democrats did, why wouldn’t the Election be immediately overturned? How can a Country be run like this?","IF Biden gets in, nothing will happen to Hunter or Joe. Barr will do nothing, and the new group of partisan killers coming in will quickly kill it all. Same thing with Durham. We caught them cold, spying, treason &amp; more (the hard part), but “Justice” took too long. Will be DOA!","Interesting how ANTIFA and other Far Left militant groups can take over a city without barely a wimpier from soft Do Nothing Democrat leadership,  yet these same weak leaders become RADICAL when it comes to shutting down a state or city and its hard working, tax paying citizens!","I will be strongly demanding a Drug Test of Sleepy Joe Biden prior to, or after, the Debate on Tuesday night. Naturally, I will agree to take one also. His Debate performances have been record setting UNEVEN, to put it mildly. Only drugs could have caused this discrepancy???","....targeted 52 Iranian sites (representing the 52 American hostages taken by Iran many years ago), some at a very high level &amp, important to Iran &amp,  the Iranian culture, and those targets, and Iran itself, WILL BE HIT VERY FAST AND VERY HARD. The USA wants no more threats!","If Illegal Immigrants are unhappy with the conditions in the quickly built or refitted detentions centers, just tell them not to come. All problems solved!","Swing States that have found massive VOTER FRAUD, which is all of them, CANNOT LEGALLY CERTIFY these votes as complete &amp; correct without committing a severely punishable crime. Everybody knows that dead people, below age people, illegal immigrants, fake signatures, prisoners,....","NYC, CALL UP THE NATIONAL GUARD. The lowlifes and losers are ripping you apart. Act fast! Don’t make the same horrible and deadly mistake you made with the Nursing Homes!!!","How do you impeach a Republican President for a crime that was committed by the Democrats? MAKE AMERICA GREAT AGAIN!","RIGGED 2020 ELECTION: MILLIONS OF MAIL-IN BALLOTS WILL BE PRINTED BY FOREIGN COUNTRIES, AND OTHERS. IT WILL BE THE SCANDAL OF OUR TIMES!","The “Surrender Caucus” within the Republican Party will go down in infamy as weak and ineffective “guardians” of our Nation, who were willing to accept the certification of fraudulent presidential numbers!","Now that the three basketball players are out of China and saved from years in jail, LaVar Ball, the father of LiAngelo, is unaccepting of what I did for his son and that shoplifting is no big deal. I should have left them in jail!","DIRTY COP JAMES COMEY GOT CAUGHT!","The number of ChinaVirus cases goes up, because of GREAT TESTING, while the number of deaths (mortality rate), goes way down. The Fake News doesn’t like telling you that!","Can you believe that I will be impeached today by the Radical Left, Do Nothing Democrats, AND I DID NOTHING WRONG! A terrible Thing. Read the Transcripts. This should never happen to another President again. Say a PRAYER!","Joe Biden is a PUPPET of CASTRO-CHAVISTAS like Crazy Bernie, AOC and Castro-lover Karen Bass. Biden is supported by socialist Gustavo Petro, a major LOSER and former M-19 guerrilla leader. Biden is weak on socialism and will betray Colombia. I stand with you!","Crazy Joe Biden is trying to act like a tough guy. Actually, he is weak, both mentally and physically, and yet he threatens me, for the second time, with physical assault. He doesn’t know me, but he would go down fast and hard, crying all the way. Don’t threaten people Joe!","Our Republican Senate just missed the opportunity to get rid of Section 230, which gives unlimited power to Big Tech companies. Pathetic!!! Now they want to give people ravaged by the China Virus $600, rather than the $2000 which they so desperately need. Not fair, or smart!","Colin Powell, a real stiff who was very responsible for getting us into the disastrous Middle East Wars, just announced he will be voting for another stiff, Sleepy Joe Biden. Didn’t Powell say that Iraq had “weapons of mass destruction?” They didn’t, but off we went to WAR!","At a meeting in Florida today, everyone was asking why aren’t the Republicans up in arms &amp; fighting over the fact that the Democrats stole the rigged presidential election? Especially in the Senate, they said, where you helped 8 Senators win their races. How quickly they forget!","If Iran wants to fight, that will be the official end of Iran. Never threaten the United States again!","Biden and Democrats just clarified the fact that they are fully in favor of (very) LATE TERM ABORTION, right up until the time of birth, and beyond - which would be execution. Biden even endorsed the Governor of Virginia, who stated this clearly for all to hear. GET OUT &amp; VOTE!!!","Radical Left Democrats are going CRAZY!","PRESIDENTIAL HARASSMENT!","They are sending out 51,000,000 Ballots to people who haven’t even requested a Ballot. Many of those people don’t even exist. They are trying to STEAL this election. This should not be allowed!","Yesterday was a bad day for the Cuomo Brothers. New York was lost to the looters, thugs, Radical Left, and all others forms of Lowlife &amp; Scum. The Governor refuses to accept my offer of a dominating National Guard. NYC was ripped to pieces. Likewise, Fredo’s ratings are down 50%!","Can anyone believe that Princeton just dropped the name of Woodrow Wilson from their highly respected policy center. Now the Do Nothing Democrats want to take off the name John Wayne from an airport. Incredible stupidity!","So interesting to see “Progressive” Democrat Congresswomen, who originally came from countries whose governments are a complete and total catastrophe, the worst, most corrupt and inept anywhere in the world (if they even have a functioning government at all), now loudly......","A sad day for the Democrats, Kirsten Gillibrand has dropped out of the Presidential Primary. I’m glad they never found out that she was the one I was really afraid of!","In the beautiful Midwest, windchill temperatures are reaching minus 60 degrees, the coldest ever recorded. In coming days, expected to get even colder. People can’t last outside even for minutes. What the hell is going on with Global Waming? Please come back fast, we need you!","So funny to watch Steve Kerr grovel and pander when asked a simple question about China. He chocked, and looks weak and pathetic. Don’t want him at the White House!","Can you believe it? I’m at 94% approval in the Republican Party, and have Three Stooges running against me. One is “Mr. Appalachian Trail” who was actually in Argentina for bad reasons....","The \"\"Intelligence\"\" briefing on so-called \"\"Russian hacking\"\" was delayed until Friday, perhaps more time needed to build a case. Very strange!","Lyin’ James Comey, Andrew McCabe, Peter S and his lover, agent Lisa Page, &amp, more, all disgraced and/or fired and caught in the act. These are just some of the losers that tried to do a number on your President. Part of the Witch Hunt. Remember the “insurance policy?” This is it!","Mike Pompeo is doing a great job, I am very proud of him. His predecessor, Rex Tillerson, didn’t have the mental capacity needed. He was dumb as a rock and I couldn’t get rid of him fast enough. He was lazy as hell. Now it is a whole new ballgame, great spirit at State!","No money was paid to North Korea for Otto Warmbier, not two Million Dollars, not anything else. This is not the Obama Administration that paid 1.8 Billion Dollars for four hostages, or gave five terroist hostages plus, who soon went back to battle, for traitor Sgt. Bergdahl!","While not at all presidential I must point out that the Sloppy Michael Moore Show on Broadway was a TOTAL BOMB and was forced to close. Sad!","“Concast” should open up a long overdue Florida Cold Case against Psycho Joe Scarborough. I know him and Crazy Mika well, used them beautifully in the last Election, dumped them nicely, and will state on the record that he is “nuts”. Besides, bad ratings! #OPENJOECOLDCASE","I think Senator Blumenthal should take a nice long vacation in Vietnam, where he lied about his service, so he can at least say he was there","The Mueller Witch Hunt is a total disgrace. They are looking at supposedly stolen Crooked Hillary Clinton Emails (even though they don’t want to look at the DNC Server), but have no interest in the Emails that Hillary DELETED &amp, acid washed AFTER getting a Congressional Subpoena!","Pelosi is now leading a delegation of 9, including Corrupt Adam Schiff, to Jordan to check out Syria. She should find out why Obama drew The Red Line In the Sand, &amp, then did NOTHING, losing Syria &amp, all respect. I did something, 58 missiles. One million died under Obama’s mistake!","The inner workings of the Mueller investigation are a total mess. They have found no collusion and have gone absolutely nuts. They are screaming and shouting at people, horribly threatening them to come up with the answers they want. They are a disgrace to our Nation and don’t...","Just tried watching Saturday Night Live - unwatchable! Totally biased, not funny and the Baldwin impersonation just can't get any worse. Sad","....The Wall will be paid for, directly or indirectly, or through longer term reimbursement, by Mexico, which has a ridiculous $71 billion dollar trade surplus with the U.S. The $20 billion dollar Wall is “peanuts” compared to what Mexico makes from the U.S. NAFTA is a bad joke!","So why didn’t the highly conflicted Robert Mueller investigate how and why Crooked Hillary Clinton deleted and acid washed 33,000 Emails immediately AFTER getting a SUBPOENA from the United States Congress? She must have GREAT lawyers!","....Best and Newest Military (almost totally rebuilt from the depleted military I took over) in History, Best V.A. in History (Choice), and MUCH, MUCH MORE. Gee, let’s impeach the President. The “Squad” (AOC Plus 3) and other Dems suffer from Trump Derangement Syndrome. Crazy!","The Never Trumper Republicans, though on respirators with not many left, are in certain ways worse and more dangerous for our Country than the Do Nothing Democrats. Watch out for them, they are human scum!","The Fake News is going crazy making up false stories and using only unnamed sources (who don’t exist). They are totally unhinged, and the great success of this Administration is making them do and say things that even they can’t believe they are saying. Truly bad people!","How can “Senator” Richard Blumenthal, who went around for twenty years as a Connecticut politician bragging that he was a great Marine war hero in Vietnam (then got caught and sobbingly admitted he was neither a Marine nor ever in Vietnam), pass judgement on anyone? Loser!","....There is nothing to admire about them, they will always try to show a glimmer of vicious hope, but they are losers and barely breathing. Think about that before you destroy your lives and the lives of your family!","Democrats are the problem. They don’t care about crime and want illegal immigrants, no matter how bad they may be, to pour into and infest our Country, like MS-13. They can’t win on their terrible policies, so they view them as potential voters!","The President of Taiwan CALLED ME today to wish me congratulations on winning the Presidency. Thank you!","What ever happened to the Server, at the center of so much Corruption, that the Democratic National Committee REFUSED to hand over to the hard charging (except in the case of Democrats) FBI? They broke into homes &amp, offices early in the morning, but were afraid to take the Server?","The Corrupt News Media is totally out of control - they have given up and don’t even care anymore. Mainstream Media has ZERO CREDIBILITY - TOTAL LOSERS!","While I know it’s “not presidential” to take on a lowlife like Omarosa, and while I would rather not be doing so, this is a modern day form of communication and I know the Fake News Media will be working overtime to make even Wacky Omarosa look legitimate as possible. Sorry!","November 3rd. will be the most exciting day in U.S. Election History, even more so than 2016. Tremendous excitement and enthusiasm, like perhaps never seen before. Nobody showing up to Sleepy Joe Rallies. Places are DEAD. Stiff!!! See you in Florida tonight.","....terrible Gang of Angry Democrats. Look at their past, and look where they come from. The now $30,000,000 Witch Hunt continues and they’ve got nothing but ruined lives. Where is the Server? Let these terrible people go back to the Clinton Foundation and “Justice” Department!","The story by Axios that President Trump wanted to blow up large hurricanes with nuclear weapons prior to reaching shore is ridiculous. I never said this. Just more FAKE NEWS!","North Korea fired off some small weapons, which disturbed some of my people, and others, but not me. I have confidence that Chairman Kim will keep his promise to me, &amp, also smiled when he called Swampman Joe Biden a low IQ individual, &amp, worse. Perhaps that’s sending me a signal?","Got to do something about these missing chidlren grabbed by the perverts. Too many incidents--fast trial, death penalty.","SO MUCH FAKE NEWS! The Lamestream Media has gone absolutely insane because they realize we are winning BIG in all of the polls that matter. They write or show one false story after another. They are truly sick people. VOTE!!!","So Robert Mueller has now asked for his long time Never Trumper lawyer to sit beside him and help with answers. What’s this all about? His lawyer represented the “basement server guy” who got off free in the Crooked Hillary case. This should NOT be allowed. Rigged Witch Hunt!","Intelligence agencies should never have allowed this fake news to \"\"leak\"\" into the public. One last shot at me.Are we living in Nazi Germany?","Bad “actress” Debra The Mess Messing is in hot water. She wants to create a “Blacklist” of Trump supporters, &amp, is being accused of McCarthyism. Is also being accused of being a Racist because of the terrible things she said about blacks and mental illness. If Roseanne Barr....","....the fact that I have gone through a three year vicious Witch Hunt, perpetrated by the Lamestream Media in Collusion with Crooked and the Democrat Party, there can be NO WAY, with the greatest Economy in U.S. history, that I can be losing to the Sleepy One. KEEP AMERICA GREAT!","If Chelsea Clinton were asked to hold the seat for her mother,as her mother gave our country away, the Fake News would say CHELSEA FOR PRES!","....The United States looses soooo much money on Trade with Mexico under NAFTA, over 75 Billion Dollars a year (not including Drug Money which would be many times that amount), that I would consider closing the Southern Border a “profit making operation.” We build a Wall or.....","His lies were made in perhaps the most blatant and sinister manner ever seen in the great Chamber. He wrote down and read terrible things, then said it was from the mouth of the President of the United States. I want Schiff questioned at the highest level for Fraud &amp, Treason.....","Arizona, together with our Military and Border Patrol, is bracing for a massive surge at a NON-WALLED area. WE WILL NOT LET THEM THROUGH. Big danger. Nancy and Chuck must approve Boarder Security and the Wall!","....FISA abuse, Christopher Steele &amp, his phony and corrupt Dossier, the Clinton Foundation, illegal surveillance of Trump Campaign, Russian collusion by Dems - and so much more. Open up the papers &amp, documents without redaction? Come on Jeff, you can do it, the country is waiting!","NBC FAKE NEWS, which is under intense scrutiny over their killing the Harvey Weinstein story, is now fumbling around making excuses for their probably highly unethical conduct. I have long criticized NBC and their journalistic standards-worse than even CNN. Look at their license?","WITCH HUNT!","So where are all the missing Text messages between fired FBI agents Peter S and the lovely Lisa Page, his lover. Just reported that they have been erased and wiped clean. What an outrage as the totally compromised and conflicted Witch Hunt moves ever so slowly forward. Want them!","The wacky Ambassador that the U.K. foisted upon the United States is not someone we are thrilled with, a very stupid guy. He should speak to his country, and Prime Minister May, about their failed Brexit negotiation, and not be upset with my criticism of how badly it was...","Axios (whatever that is) sat back and said GEEEEE, let’s see, what can we make up today to embarrass the President? Then they said, “why don’t we say he wants to bomb a hurricane, that should do it!” The media in our Country is totally out of control!","Attorney Client privilege is now a thing of the past. I have many (too many!) lawyers and they are probably wondering when their offices, and even homes, are going to be raided with everything, including their phones and computers, taken. All lawyers are deflated and concerned!","Wow, highest Poll Numbers in the history of the Republican Party. That includes Honest Abe Lincoln and Ronald Reagan. There must be something wrong, please recheck that poll!","....Paul Ryan almost killed the Republican Party. Weak, ineffective &amp, stupid are not exactly the qualities that Republicans, or the CITIZENS of our Country, were looking for. Right now our spirit is at an all time high, far better than the Radical Left Dems. You’ll see next year!","The Whistleblower gave false information &amp, dealt with corrupt politician Schiff. He must be brought forward to testify. Written answers not acceptable! Where is the 2nd Whistleblower? He disappeared after I released the transcript. Does he even exist? Where is the informant? Con!","The Fake News Media is going CRAZY! They are totally unhinged and in many ways, after witnessing first hand the damage they do to so many innocent and decent people, I enjoy watching. In 7 years, when I am no longer in office, their ratings will dry up and they will be gone!","Elizabeth “Pocahontas” Warren singlehandedly destroyed the Bernie Sanders campaign by stripping voters away from his count on Super T. He lost states that he easily would have won if she had dropped out 3 days earlier. The DNC is doing it to Bernie again! Will he ever get angry?","I told Rex Tillerson, our wonderful Secretary of State, that he is wasting his time trying to negotiate with Little Rocket Man...","No Collusion, No Obstruction - but that doesn’t matter because the 13 Angry Democrats, who are only after Republicans and totally protecting Democrats, want this Witch Hunt to drag out to the November Election. Republicans better get smart fast and expose what they are doing!","Many dead, including women and children, in mindless CHEMICAL attack in Syria. Area of atrocity is in lockdown and encircled by Syrian Army, making it completely inaccessible to outside world. President Putin, Russia and Iran are responsible for backing Animal Assad. Big price...","....This makes Nervous Nancy every bit as guilty as Liddle’ Adam Schiff for High Crimes and Misdemeanors, and even Treason. I guess that means that they, along with all of those that evilly “Colluded” with them, must all be immediately Impeached!","When a country (USA) is losing many billions of dollars on trade with virtually every country it does business with, trade wars are good, and easy to win. Example, when we are down $100 billion with a certain country and they get cute, don’t trade anymore-we win big. It’s easy!","A Blue Wave means Crime and Open Borders. A Red Wave means Safety and Strength!","...are now fighting back like never before. There is so much GUILT by Democrats/Clinton, and now the facts are pouring out. DO SOMETHING!","....At what point does this soon to be $20,000,000 Witch Hunt, composed of 13 Angry and Heavily Conflicted Democrats and two people who have worked for Obama for 8 years, STOP! They have found no Collussion with Russia, No Obstruction, but they aren’t looking at the corruption...","The illegal Mueller Witch Hunt continues in search of a crime. There was never Collusion with Russia, except by the Clinton campaign, so the 17 Angry Democrats are looking at anything they can find. Very unfair and BAD for the country. ALSO, not allowed under the LAW!","For a guy who couldn’t get approved for the Ambassador to the U.N. years ago, couldn’t get approved for anything since, “begged” me for a non Senate approved job, which I gave him despite many saying “Don’t do it, sir,” takes the job, mistakenly says “Libyan Model” on T.V., and..","....The Democrats, none of whom voted for Jeff Sessions, must love him now. Same thing with Lyin’ James Comey. The Dems all hated him, wanted him out, thought he was disgusting - UNTIL I FIRED HIM! Immediately he became a wonderful man, a saint like figure in fact. Really sick!","“Nancy Pelosi has no leverage over the Senate. Mitch McConnell did not nose his way into the impeachment process in the House, and she has no standing in the Senate.” Brad Blakeman. Crazy Nancy should clean up her filthy dirty District &amp, help the homeless there. A primary for N?","I recommend that Nervous Nancy Pelosi (who backed up Schiff’s lie), Shifty Adam Schiff, Sleepy Joe Biden, the Whistleblower (who miraculously disappeared after I released the transcript of the call), the 2nd Whistleblower (who also disappeared), &amp, the I.G., be part of the list!","The Angry Majority!","The Failing New York Times wrote a story that made it seem like the White House Councel had TURNED on the President, when in fact it is just the opposite - &amp, the two Fake reporters knew this. This is why the Fake News Media has become the Enemy of the People. So bad for America!","The face of the Democrats is now Maxine Waters who, together with Nancy Pelosi, have established a fine leadership team. They should always stay together and lead the Democrats, who want Open Borders and Unlimited Crime, well into the future....and pick Crooked Hillary for Pres.","I authorized Zero access to White House (actually turned him down many times) for author of phony book! I never spoke to him for book. Full of lies, misrepresentations and sources that don’t exist. Look at this guy’s past and watch what happens to him and Sloppy Steve!","Robert De Niro, a very Low IQ individual, has received too many shots to the head by real boxers in movies. I watched him last night and truly believe he may be “punch-drunk.” I guess he doesn’t...","Now the press is trying to sell the fact that I wanted a Moat stuffed with alligators and snakes, with an electrified fence and sharp spikes on top, at our Southern Border. I may be tough on Border Security, but not that tough. The press has gone Crazy. Fake News!","The big Caravan of People from Honduras, now coming across Mexico and heading to our “Weak Laws” Border, had better be stopped before it gets there. Cash cow NAFTA is in play, as is foreign aid to Honduras and the countries that allow this to happen. Congress MUST ACT NOW!","....,the only Collusion with Russia was with the Democrats, so now they are looking at my Tweets (along with 53 million other people) - the rigged Witch Hunt continues! How stupid and unfair to our Country....And so the Fake News doesn’t waste my time with dumb questions, NO,....","Cryin Chuck Schumer, compared to what other Senators have brought home to their states, has brought very little back to N.Y. A totally overrated loser, the one thing he has given them is SALT. He never even called me to stop it. No wonder Cuomo &amp; most others can’t stand him. AOC!","“The circus is coming to town. The corrupt, compromised, coward &amp, congenital liar Adam Schiff Show on Capital Hill, brought to you by his raging psychotic Democrats &amp, the top allies in the Media Mob. Everything you’re going to see in the next two weeks is rigged.....","Alan Dershowitz: “These are not crimes. He (Mueller) has no authority to be a roving Commissioner. I don’t see any evidence of crimes.”  This is an illegal Hoax that should be ended immediately. Mueller refuses to look at the real crimes on the other side. Where is the IG REPORT?","Pelosi &amp; Schumer have no interest in making a deal that is good for our Country and our People. All they want is a trillion dollars, and much more, for their Radical Left Governed States, most of which are doing very badly. It is called a BAILOUT for many years of bad Dem Mgmt!","I wonder if the New York Times will apologize to me a second time, as they did after the 2016 Election. But this one will have to be a far bigger &amp,  better apology. On this one they will have to get down on their knees &amp, beg for forgiveness-they are truly the Enemy of the People!","Can you imagine Cryin’ Chuck Schumer saying out loud, for all to hear, that I am bluffing with respect to putting Tariffs on Mexico. What a Creep. He would rather have our Country fail with drugs &amp, Immigration than give Republicans a win. But he gave Mexico bad advice, no bluff!","Failed presidential candidate (thank you President Trump!), Carly Fiorina, said she will be voting for Corrupt Joe Biden. She lost so badly to me, twice in one campaign, that she should be voting for Joe. No complaints!!!","Every time I speak of the haters and losers I do so with great love and affection. They cannot help the fact that they were born fucked up!","Google search results for “Trump News” shows only the viewing/reporting of Fake News Media. In other words, they have it RIGGED, for me &amp, others, so that almost all stories &amp, news is BAD. Fake CNN is prominent. Republican/Conservative &amp, Fair Media is shut out. Illegal? 96% of....","....Ever since Andrew came to my office to ask that I appoint him to the U.S. Supreme Court, and I said NO, he has been very hostile! Also asked for pardon for his friend. A good “pal” of low ratings Shepard Smith.","So funny, the Democrats have sued the Republicans for Winning. Now he R’s counter and force them to turn over a treasure trove of material, including Servers and Emails!","I never in my wildest dreams thought my name would in any way be associated with the ugly word, Impeachment! The calls (Transcripts) were PERFECT, there was NOTHING said that was wrong. No pressure on Ukraine. Great corruption &amp, dishonesty by Schiff on the other side!","....have been greeted with the most vicious dogs, and most ominous weapons, I have ever seen. That’s when people would have been really badly hurt, at least. Many Secret Service agents just waiting for action. “We put the young ones on the front line, sir, they love it, and....","I thought I was doing something very good for our Country by using Trump National Doral, in Miami, for hosting the G-7 Leaders. It is big, grand, on hundreds of acres, next to MIAMI INTERNATIONAL AIRPORT, has tremendous ballrooms &amp, meeting rooms, and each delegation would have...","The Unsolicited Mail In Ballot Scam is a major threat to our Democracy, &amp; the Democrats know it. Almost all recent elections using this system, even though much smaller &amp;  with far fewer Ballots to count, have ended up being a disaster. Large numbers of missing Ballots &amp; Fraud!","Just out that the Obama Administration granted citizenship, during the terrible Iran Deal negotiation, to 2,500 Iranians - including to government officials. How big (and bad) is that?","Ex-FBI LAYER Lisa Page today defied a House of Representatives issued Subpoena to testify before Congress! Wow, but is anybody really surprised!  Together with her lover, FBI Agent Peter Strzok, she worked on the Rigged Witch Hunt, perhaps the most tainted and corrupt case EVER!","Puerto Rico is one of the most corrupt places on earth. Their political system is broken and their politicians are either Incompetent or Corrupt. Congress approved Billions of Dollars last time, more than anyplace else has ever gotten, and it is sent to Crooked Pols. No good!....","I agree with Kim Jong Un of North Korea that our personal relationship remains very good, perhaps the term excellent would be even more accurate, and that a third Summit would be good in that we fully understand where we each stand. North Korea has tremendous potential for.......","The \"\"deplorables\"\" came back to haunt Hillary.They expressed their feelings loud and clear. She spent big money but, in the end, had no game!","....Chariman Kim has a great and beautiful vision for his country, and only the United States, with me as President, can make that vision come true. He will do the right thing because he is far too smart not to, and he does not want to disappoint his friend, President Trump!","Why is Senator Mark Warner (D-VA), perhaps in a near drunken state, claiming he has information that only he and Bob Mueller, the leader of the 13 Angry Democrats on a Witch Hunt, knows? Isn’t this highly illegal. Is it being investigated?","So, let’s get this straight! There was No Collusion and in fact the Phony Dossier was a Con Job that was paid for by Crooked Hillary and the DNC. So the 13 Angry Democrats were investigating an event that never happened and that was in fact a made up Fraud. I just fought back....","Being scolded by failed former “Intelligence” officials, like James Clapper, on my condolences to Iran on their failed Rocket launch. Sadly for the United States, guys like him, Comey, and the even dumber John Brennan, don’t have a clue. They really set our Country back,....","Anthony Scaramucci is a highly unstable “nut job” who was with other candidates in the primary who got shellacked, &amp, then unfortunately wheedled his way into my campaign. I barely knew him until his 11 days of gross incompetence-made a fool of himself, bad on TV. Abused staff,...","Happy Birthday to the leader of the Democrat Party, Maxine Waters!","Strzok started the illegal Rigged Witch Hunt - why isn’t this so-called “probe” ended immediately? Why aren’t these angry and conflicted Democrats instead looking at Crooked Hillary?","Elizabeth Warren is being hammered, even by the Left. Her false claim of Indian heritage is only selling to VERY LOW I.Q. individuals!","As has been stated by numerous legal scholars, I have the absolute right to PARDON myself, but why would I do that when I have done nothing wrong? In the meantime, the never ending Witch Hunt, led by 13 very Angry and Conflicted Democrats (&amp, others) continues into the mid-terms!","When you give a crazed, crying lowlife a break, and give her a job at the White House, I guess it just didn’t work out. Good work by General Kelly for quickly firing that dog!","FAKE NEWS - A TOTAL POLITICAL WITCH HUNT!","Crazy Lawrence O’Donnell, who has been calling me wrong from even before I announced my run for the Presidency, even being previously forced by NBC to apologize, which he did while crying, for things he said about me &amp, The Apprentice, was again forced to apologize, this time.....","A very big Caravan of over 20,000 people started up through Mexico. It has been reduced in size by Mexico but is still coming. Mexico must apprehend the remainder or we will be forced to close that section of the Border &amp, call up the Military. The Coyotes &amp, Cartels have weapons!","So many people at the higher ends of intelligence loved my press conference performance in Helsinki. Putin and I discussed many important subjects at our earlier meeting. We got along well which truly bothered many haters who wanted to see a boxing match. Big results will come!","...Biden is a corrupt globalist sellout who never missed a chance to stab American workers in the back. If Biden wins, China wins – it’s just that simple!","Watched some of the Fake News Political Shows this morning and continue to be amazed at how every question is asked in the most negative way. The Mainstream Media should be ashamed of itself - But the good news is that the USA is wise to your game of dishonesty and deception!","The only people in favor of Mini Mike continuing with his hapless campaign are me and his political consultants, who are getting richer and richer by the day!","Happy Thanksgiving to all--even the haters and losers!","“Trump could be the most honest president in modern history. When you look at the real barometer of presidential truthfulness, which is promise keeping, he is probably the most honest president in American history. He’s done exactly what he said he would do.” Marc Thiessen, WPost","Put pressure on the Democrats to end the horrible law that separates children from there parents once they cross the Border into the U.S. Catch and Release, Lottery and Chain must also go with it and we MUST continue building the WALL! DEMOCRATS ARE PROTECTING MS-13 THUGS.","Just got back only to hear of a last minute change allowing a Never Trumper attorney to help Robert Mueller with his testimony before Congress tomorrow. What a disgrace to our system. Never heard of this before. VERY UNFAIR, SHOULD NOT BE ALLOWED. A rigged Witch Hunt!","...vacationing, relaxing &amp; making shady deals with other countries, &amp; that Barack was always playing golf, doing much of his traveling in a fume spewing 747 to play golf in Hawaii - Once even teeing off immediately after announcing the gruesome death of a great young man by ISIS!","...Unrelated, I gave Alaska ANWR, major highways, and more. Get any candidate ready, good or bad, I don’t care, I’m endorsing. If you have a pulse, I’m with you!","Jared Kushner did very well yesterday in proving he did not collude with the Russians. Witch Hunt. Next up, 11 year old Barron Trump!","Why isn’t disgraced FBI official Andrew McCabe being investigated for the $700,000 Crooked Hillary Democrats in Virginia, led by Clinton best friend Terry M (under FBI investigation that they killed) gave to McCabe’s wife in her run for office? Then dropped case on Clinton!","“Congressman Adam Schiff, who when seeing the REAL Ukraine phone call Transcript decided he’d better make up one of his own. ‘I’m going to say this only SEVEN times, so you better listen good. I want you to MAKE UP DIRT ON MY POLITICAL OPPONENT, UNDERSTAND, LOTS OF IT, AND.....","Democrats don’t care about Border Security. They refuse to give the votes necessary to fix the Loopholes and Asylum. Would be so easy! They want Open Borders, which means CRIME,CRIME,CRIME!","Is President Obama going to finally mention the words radical Islamic terrorism? If he doesn't he should immediately resign in disgrace!","...travesty that is taking place in allowing millions of people to easily meander through their country and INVADE the U.S., not to mention the Drugs &amp, Human Trafficking pouring in through Mexico. Are the Drug Lords, Cartels &amp, Coyotes really running Mexico? We will soon find out!","Robert Mueller and Leakin’ Lyin’ James Comey are Best Friends, just one of many Mueller Conflicts of Interest. And bye the way, wasn’t the woman in charge of prosecuting Jerome Corsi (who I do not know) in charge of “legal” at the corrupt Clinton Foundation? A total Witch Hunt...","Crazy, chaotic Democrat Debate last night. Fake News said Biden did well, even though he said half of our population was shot to death. Would be OVER for most. Mini Mike was weak and unsteady, but helped greatly by his many commercials (which are not supposed to be allowed....","When I said that Hillary Clinton got schlonged by Obama, it meant got beaten badly. The media knows this. Often used word in politics!","READ THE TRANSCRIPTS! The Impeachment Hoax is the greatest con job in the history of American politics! The Fake News Media, and their partner, the Democrat Party, are working overtime to make life for the United Republican Party, and all it stands for, as difficult as possible!","Tom Steyer who, other than Mini Mike Bloomberg, spent more dollars for NOTHING than any candidate in history, quit the race today proclaiming how thrilled he was to be a part of the the Democrat Clown Show. Go away Tom and save whatever little money you have left!",".....I did NOT know of the meeting with my son, Don jr. Sounds to me like someone is trying to make up stories in order to get himself out of an unrelated jam (Taxi cabs maybe?). He even retained Bill and Crooked Hillary’s lawyer. Gee, I wonder if they helped him make the choice!","When Wacko John Bolton went on Deface the Nation and so stupidly said that he looked at the “Libyan Model” for North Korea, all hell broke out. Kim Jong Un, who we were getting along with very well, went “ballistic”, just like his missiles - and rightfully so....","Crazy Maxine Waters, said by some to be one of the most corrupt people in politics, is rapidly becoming, together with Nancy Pelosi, the FACE of the Democrat Party. Her ranting and raving, even referring to herself as a wounded animal, will make people flee the Democrats!","When will all of the “reporters” who have received Noble Prizes for their work on Russia, Russia, Russia, only to have been proven totally wrong (and, in fact, it was the other side who committed the crimes), be turning back their cherished “Nobles” so that they can be given....","...Follow the money! The spy was there early in the campaign and yet never reported Collusion with Russia, because there was no Collusion. He was only there to spy for political reasons and to help Crooked Hillary win - just like they did to Bernie Sanders, who got duped!","Jeff Flake(y) doesn’t want to protect the Non-Senate confirmed Special Counsel, he wants to protect his future after being unelectable in Arizona for the “crime” of doing a terrible job! A weak and ineffective guy!","The Oscars are a sad joke, very much like our President. So many things are wrong!","...&amp, overwhelming,” but this Scam Impeachment was neither. Also, very unfair with no Due Process, proper representation, or witnesses. Now Pelosi is demanding everything the Republicans weren’t allowed to have in the House. Dems want to run majority Republican Senate. Hypocrites!","Why was the FBI’s sick loser, Peter Strzok, working on the totally discredited Mueller team of 13 Angry &amp, Conflicted Democrats, when Strzok was giving Crooked Hillary a free pass yet telling his lover, lawyer Lisa Page, that “we’ll stop” Trump from becoming President? Witch Hunt!","The Democrats were trying mightily to revive the badly &amp, irrevocably tarnished Witch Hunt Hoax until Robert Mueller put on the greatest display of ineptitude &amp, incompetence that the Halls of Congress have ever seen. Truth is, he had no facts on his side. Nothing he could do!","Many good conversations with North Korea-it is going well! In the meantime, no Rocket Launches or Nuclear Testing in 8 months. All of Asia is thrilled. Only the Opposition Party, which includes the Fake News, is complaining. If not for me, we would now be at War with North Korea!","The Democrats are Fixers, and they are working overtime to FIX the Impeachment “Process” in order to hurt the Republican Party and me. Nancy Pelosi should instead Fix her broken District and Corrupt Adam should clean up &amp, manage the California forests which are always burning!","Now the Radical Left Democrats and their Partner, the LameStream Media, are after Brett Kavanaugh again, talking loudly of their favorite word, impeachment. He is an innocent man who has been treated HORRIBLY. Such lies about him. They want to scare him into turning Liberal!",".....ALSO, NOT TRUE! Anything goes with our Corrupt News Media today. They will do, or say, whatever it takes, with not even the slightest thought of consequence! These are true cowards and without doubt, THE ENEMY OF THE PEOPLE!","The LameStream Media had a very bad week. They pushed numerous phony stories and got caught, especially The Failing New York Times, which has lost more money over the last 10 years than any paper in history, and The Amazon Washington Post. They are The Enemy of the People!","Hillary Clinton should have been prosecuted and should be in jail. Instead she is running for president in what looks like a rigged election","Watched Da Nang Dick Blumenthal on television spewing facts almost as accurate as his bravery in Vietnam (which he never saw). As the bullets whizzed by Da Nang Dicks head, as he was saving soldiers....","“A Very Stable Genius!” Thank you.","The Radical Left Democrats and their Fake News Media partners, headed up again by Little Adam Schiff, and batting Zero for 21 against me, are at it again! They think I may have had a “dicey” conversation with a certain foreign leader based on a “highly partisan” whistleblowers..","Obama loving (wrote Obama book) Peter Baker of the Failing New York Times, married to an even bigger Trump Hater than himself, should not even be allowed to write about me. Every story is a made up disaster with sources and leakers that don’t even exist. I had a simple and very..","Donna Brazile just stated the DNC RIGGED the system to illegally steal the Primary from Bernie Sanders. Bought and paid for by Crooked H....","....Dumb and Sick. A really bad show with low ratings - and will only get worse. CNN has been a proven and long term ratings and beyond disaster. In fact, it rewarded Chris Cuomo with a now unsuccessful prime time slot, despite his massive failure in the morning. Only on CNN!","...Maybe the best thing to do would be to cancel all future \"\"press briefings\"\" and hand out written responses for the sake of accuracy???","“The FBI received documents from Bruce Ohr (of the Justice Department &amp, whose wife Nelly worked for Fusion GPS).” Disgraced and fired FBI Agent Peter Strzok. This is too crazy to be believed! The Rigged Witch Hunt has zero credibility.","Everyone knows I am right that Robert Pattinson should dump Kristen Stewart. In a couple of years, he will thank me. Be smart, Robert.","Rex Tillerson, a man who is “dumb as a rock” and totally ill prepared and ill equipped to be Secretary of State, made up a story (he got fired) that I was out-prepared by Vladimir Putin at a meeting in Hamburg, Germany. I don’t think Putin would agree. Look how the U.S. is doing!","Our Crazy, Do Nothing (where’s USMCA, infrastructure, lower drug pricing &amp, much more?) Speaker of the House, Nervous Nancy Pelosi, who is petrified by her Radical Left knowing she will soon be gone (they &amp, Fake News Media are her BOSS), suggested on Sunday’s DEFACE THE NATION....","The concept of global warming was created by and for the Chinese in order to make U.S. manufacturing non-competitive.","....and other really bad people, SPIED ON MY CAMPAIGN! They even had an “insurance policy” just in case Crooked Hillary Clinton and the Democrats lost their race for the Presidency! This is the biggest &amp, worst political scandal in the history of the United States of America. Sad!","“It appears that an American spy in one of our intelligence agencies may have been spying on our own president. The complaint suggests that this intel agent was listening in on Trump’s conversation....","The BIG Protest Rally in Washington, D.C., will take place at 11.00 A.M. on January 6th. Locational details to follow. StopTheSteal!","Biggest outrage yet in the long, winding and highly conflicted Mueller Witch Hunt is the fact that 19,000 demanded Text messages between Peter Strzok and his FBI lover, Lisa Page, were purposely &amp, illegally deleted. Would have explained whole Hoax, which is now under protest!",".....Mini is illegally buying the Democrat Nomination. They are taking it away from Bernie again. Mini Mike, Major Party Nominations are not for sale! Good luck in the debate tomorrow night and remember, no standing on boxes!","3000 people did not die in the two hurricanes that hit Puerto Rico. When I left the Island, AFTER the storm had hit, they had anywhere from 6 to 18 deaths. As time went by it did not go up by much. Then, a long time later, they started to report really large numbers, like 3000...","....And by the way, I’m the best thing that’s ever happened to Puerto Rico!","James Comey better hope that there are no \"\"tapes\"\" of our conversations before he starts leaking to the press!","There was No Collusion with Russia (except by the Democrats). When will this very expensive Witch Hunt Hoax ever end? So bad for our Country. Is the Special Counsel/Justice Department leaking my lawyers letters to the Fake News Media? Should be looking at Dems corruption instead?","....Russia, Iran, Syria &amp, many others are not happy about the U.S. leaving, despite what the Fake News says, because now they will have to fight ISIS and others, who they hate, without us. I am building by far the most powerful military in the world. ISIS hits us they are doomed!","...to Mar-a-Lago 3 nights in a row around New Year's Eve, and insisted on joining me. She was bleeding badly from a face-lift. I said no!","Mini Mike Bloomberg’s consultants and so-called “advisors”(how did that advice work out? Don’t ask!), are on the “gravy train” and all making a fortune for themselves pushing Mini hard, when they knew he never had what it takes. Don’t pay them anymore Mike, they led you down....","DEMOCRAT CONGRESSIONAL HEARINGS ARE #RIGGED!","Nobody should be allowed to burn the American flag - if they do, there must be consequences - perhaps loss of citizenship or year in jail!","Going to the White House is considered a great honor for a championship team.Stephen Curry is hesitating,therefore invitation is withdrawn!","Those Tweets were NOT Racist. I don’t have a Racist bone in my body! The so-called vote to be taken is a Democrat con game. Republicans should not show “weakness” and fall into their trap. This should be a vote on the filthy language, statements and lies told by the Democrat.....","Senate Democrats just voted against legislation to prevent the killing of newborn infant children. The Democrat position on abortion is now so extreme that they don’t mind executing babies AFTER birth....","THE RIGGED AND CORRUPT MEDIA IS THE ENEMY OF THE PEOPLE!","Who can figure out the true meaning of \"\"covfefe\"\" ???  Enjoy!","Probably the only thing Barack Obama &amp; I have in common is that we both had the honor of firing Jim Mattis, the world’s most overrated General. I asked for his letter of resignation, &amp; felt great about it. His nickname was “Chaos”, which I didn’t like, &amp; changed to “Mad Dog”...","...votes from Trump to Biden, late voting, and many more. Therefore, effective immediately, Chris Krebs has been terminated as Director of the Cybersecurity and Infrastructure Security Agency.","Nancy Pelosi needs help fast! There is either something wrong with her “upstairs,” or she just plain doesn’t like our great Country. She had a total meltdown in the White House today. It was very sad to watch. Pray for her, she is a very sick person!","The New York Times is an embarrassment to journalism. They were a dead paper before I went into politics, and they will be a dead paper after I leave, which will be in 5 years. Fake News is the Enemy of the people!","The Mainstream Media is under fire and being scorned all over the World as being corrupt and FAKE. For two years they pushed the Russian Collusion Delusion when they always knew there was No Collusion. They truly are the Enemy of the People and the Real Opposition Party!","Today Elizabeth Warren, sometimes referred to by me as Pocahontas, joined the race for President. Will she run as our first Native American presidential candidate, or has she decided that after 32 years, this is not playing so well anymore? See you on the campaign TRAIL, Liz!","They (his handlers) ripped Sleepy Joe off the stage yesterday when he got lost in a “mental fog”. A disaster. Very little reporting on this!","I’ve gone through years of a Fake, Illegal, and Totally Discredited Witch-Hunt, and now it’s revealed that it was a Hoax by the “other side”, which must pay a price for what they did. Think of where we’d be now without Fake &amp; Fraudulent stories every night, for years!!!","CNN’s Don Lemon, the dumbest man on television, insinuated last night while asking a debate “question” that I was a racist, when in fact I am “the least racist person in the world.” Perhaps someone should explain to Don that he is supposed to be neutral, unbiased &amp, fair,.....","#BidenCrimeFamiily","Really Big Jobs Report. Great going President Trump (kidding but true)!","Mail-In Voting, unless changed by the courts, will lead to the most CORRUPT ELECTION in our Nation’s History! #RIGGEDELECTION","I will be announcing THE MOST DISHONEST &amp, CORRUPT MEDIA AWARDS OF THE YEAR on Monday at 5:00 o’clock. Subjects will cover Dishonesty &amp, Bad Reporting in various categories from the Fake News Media. Stay tuned!","LIBERATE MINNESOTA!","The Greatest Witch Hunt In American History!","Despite the constant negative press covfefe","They name teams out of STRENGTH, not weakness, but now the Washington Redskins &amp; Cleveland Indians, two fabled sports franchises, look like they are going to be changing their names in order to be politically correct. Indians, like Elizabeth Warren, must be very angry right now!","The Fake News is doing everything in their power to blame Republicans, Conservatives and me for the division and hatred that has been going on for so long in our Country. Actually, it is their Fake &amp, Dishonest reporting which is causing problems far greater than they understand!","....place in Detroit, Philadelphia, Milwaukee, Atlanta, Pittsburgh, and elsewhere. In all Swing State cases, there are far more votes than are necessary to win the State, and the Election itself. Therefore, VOTES CANNOT BE CERTIFIED. THIS ELECTION IS UNDER PROTEST!","Sorry, I don’t buy Rep. Tlaib’s tears. I have watched her violence, craziness and, most importantly, WORDS, for far too long. Now tears? She hates Israel and all Jewish people. She is an anti-Semite. She and her 3 friends are the new face of the Democrat Party. Live with it!","Covid, Covid, Covid is the unified chant of the Fake News Lamestream Media. They will talk about nothing else until November 4th., when the Election will be (hopefully!) over. Then the talk will be how low the death rate is, plenty of hospital rooms, &amp; many tests of young people.","The World is using our laws to our detriment. They laugh at the Stupidity they see!","If it weren’t for the never ending Fake News about me, and with all that I have done (more than any other President in the first 2 1/2 years!), I would be leading the “Partners” of the LameStream Media by 20 points. Sorry, but true!","Without the ILLEGAL Witch Hunt, my poll numbers, especially because of our historically “great” economy, would be at 65%. Too bad! The greatest Hoax in American History.","....results on “Trump News” are from National Left-Wing Media, very dangerous. Google &amp, others are suppressing voices of Conservatives and hiding information and news that is good. They are controlling what we can &amp, cannot see. This is a very serious situation-will be addressed!","The Crazed and Dishonest Washington Post again purposely got it wrong. Mexico, for the first time in decades, is meaningfully apprehending illegals at THEIR Southern Border, before the long march up to the U.S. This is great and the way it should be. The big flow will stop.......","....Democrats talking point is that we are doing badly. If the virus disappeared tomorrow, they would say we did a really poor, and even incompetent, job. Not fair, but it is what it is. So far, by the way, we have not had one death. Let’s keep it that way!","The Dems fight us at every turn - in the meantime they are accomplishing nothing for the people! They have gone absolutely “Loco,” or Unhinged, as they like to say!","(Kiddingly) We’re building a Wall in Colorado”(then stated, “we’re not building a Wall in Kansas but they get the benefit of the Wall we’re building on the Border”) refered to people in the very packed auditorium, from Colorado &amp, Kansas, getting the benefit of the Border Wall!","More and more the Radical Left is using Commerce to hurt their “Enemy.” They put out the name of a store, brand or company, and ask their so-called followers not to do business there. They don’t care who gets hurt, but also don’t understand that two can play that game!",".....China does not want Tariffs!",".....nice call with with the new President of Ukraine, it could not have been better or more honorable, and the Fake News Media and Democrats, working as a team, have fraudulently made it look bad. It wasn’t bad, it was very legal and very good. A continuing Witch Hunt!","Republicans shouldn’t vote for H.R. 312, a special interest casino Bill, backed by Elizabeth (Pocahontas) Warren. It is unfair and doesn’t treat Native Americans equally!","....The good news is that we are winning. Our real opponent is not the Democrats, or the dwindling number of Republicans that lost their way and got left behind, our primary opponent is the Fake News Media. In the history of our Country, they have never been so bad!","The story in the Amazon Washington Post, of course picked up by Fake News CNN, saying “President Trump asked for AG Barr to host a news conference clearing him on Ukraine,” is totally untrue and just another FAKE NEWS story with anonymous sources that don’t exist....","...more votes than is needed by me to win Pennsylvania, not to mention hundreds of thousands of votes in other categories which increase my already big lead into a landslide. All other Swing States show likewise. WE NEED NEW &amp; ENERGETIC REPUBLICAN LEADERSHIP. This can not stand..","...the vaccine, destroy the suburbs, erase your borders, and indoctrinate your children with poisonous anti-American lies!","...The Fake News Media nowadays not only doesn’t check for the accuracy of the facts, they knowingly make up the facts. They even make up sources in order to protect their partners, the Democrats. It is so wrong, but they don’t even care anymore. They have gone totally CRAZY!!!!","Rick Scott is known as easily one of the best Governors in the USA. Florida is setting records in almost every category of success. Amazing achievement-the envy of the World. Ron DeSantis will build on this success. His incompetent opponent will destroy Florida - next Venezuela!","The Washington Post said I refer to Jeff Sessions as “Mr. Magoo” and Rod Rosenstein as “Mr. Peepers.” This is “according to people with whom the president has spoken.” There are no such people and don’t know these characters...just more Fake &amp, Disgusting News to create ill will!","...money to Bill, the Hillary Russian \"\"reset,\"\" praise of Russia by Hillary, or Podesta Russian Company. Trump Russia story is a hoax. #MAGA!","The Failing New York Times foiled U.S. attempt to kill the single most wanted terrorist,Al-Baghdadi.Their sick agenda over National Security","....lost for Evan “McMuffin” McMullin (to me). Steve Schmidt &amp; Reed Galvin lost for John McCain, Romney’s campaign manager (?) lost big to “O”, &amp; Jennifer Horn got thrown out of the New Hampshire Republican Party. They’re all LOSERS, but Abe Lincoln, Republican, is all smiles!","The Fake News LameStream Media is doing everything possible the “create” a U.S. recession, even though the numbers &amp, facts are working totally in the opposite direction. They would be willing to hurt many people, but that doesn’t matter to them. Our Economy is sooo strong, sorry!","The Boston Globe, which was sold to the the Failing New York Times for 1.3 BILLION DOLLARS (plus 800 million dollars in losses &amp, investment), or 2.1 BILLION DOLLARS, was then sold by the Times for 1 DOLLAR. Now the Globe is in COLLUSION with other papers on free press. PROVE IT!","Mini Mike Bloomberg can never recover from his incompetent debate performances. Also, as mayor he was very bad under pressure - a choker!","Tariffs will make our Country MUCH STRONGER, not weaker. Just sit back and watch! In the meantime, China should not renegotiate deals with the U.S. at the last minute. This is not the Obama Administration, or the Administration of Sleepy Joe, who let China get away with “murder!”","The Coca Cola company is not happy with me--that's okay, I'll still keep drinking that garbage.","Google search results for “Trump News” shows only the viewing/reporting of Fake New Media. In other words, they have it RIGGED, for me &amp, others, so that almost all stories &amp, news is BAD. Fake CNN is prominent. Republican/Conservative &amp, Fair Media  is shut out. Illegal?  96% of...","The Fake News Media was fixated on the fact that I properly said, at the beginnings of Hurricane Dorian, that in addition to Florida &amp, other states, Alabama may also be grazed or hit. They went Crazy, hoping against hope that I made a mistake (which I didn’t). Check out maps.....","Eventually, but at a later date so we can get started early, Mexico will be paying, in some form, for the badly needed border wall.","New polls out today are very good considering that much of the media is FAKE and almost always negative. Would still beat Hillary in .....","If Russia or any other country or person has Hillary Clinton's 33,000 illegally deleted emails, perhaps they should share them with the FBI!","....My only question is, who is our bigger enemy, Jay Powell or Chairman Xi?","The problem with banker Jamie Dimon running for President is that he doesn’t have the aptitude or “smarts” &amp, is a poor public speaker &amp, nervous mess - otherwise he is wonderful. I’ve made a lot of bankers, and others, look much smarter than they are with my great economic policy!","More text messages between former FBI employees Peter Strzok and Lisa Page are a disaster and embarrassment to the FBI &amp, DOJ. This should never have happened but we are learning more and more by the hour. “Others were leaking like mad” in order to get the President! ........","China steals United States Navy research drone in international waters - rips it out of water and takes it to China in unprecedented act.","#WheresHillary? Sleeping!!!!!","North Korea fired off some small weapons, which disturbed some of my people, and others, but not me. I have confidence that Chairman Kim will keep his promise to me, &amp, also smiled when he called Swampman Joe  Bidan a low IQ individual, &amp, worse. Perhaps that’s sending me a signal?","Crooked Hillary should not be allowed to run for president. She deleted 33,000 e-mails AFTER getting a subpoena from U.S. Congress. RIGGED!","President Andrew Jackson, who died 16 years before the Civil War started, saw it coming and was angry. Would never have let it happen!","....President Obama never had the legal right to sign DACA, and he indicated so at the time of signing. But In any event, how can he have the right to sign and I don’t have the right to “unsigned.” Totally illegal document which would actually give the President new powers.","Disloyal R's are far more difficult than Crooked Hillary. They come at you from all sides. They don’t know how to win - I will teach them!","...or a very nervous and skinny version of Pocahontas (1/1024th), as your President, rather than what you have now, so great looking and smart, a true Stable Genius! Sorry to say that even Social Media would be driven out of business along with, and finally, the Fake News Media!","If dopey Mark Cuban of failed Benefactor fame wants to sit in the front row, perhaps I will put Gennifer Flowers right alongside of him!","A great book for your reading enjoyment: \"\"REASONS TO VOTE FOR DEMOCRATS\"\" by Michael J. Knowles.","Look at the way Crooked Hillary is handling the e-mail case and the total mess she is in. She is unfit to be president. Bad judgement!","Crooked Hillary said that I \"\"couldn't handle the rough and tumble of a political campaign.\"\" Really,I just beat 16 people and am beating her!","Wow, just came out on secret tape that Crooked Hillary wants to take in as many Syrians as possible. We cannot let this happen - ISIS!","I am not only fighting Crooked Hillary, I am fighting the dishonest and corrupt media and her government protection process. People get it!","After having written many best selling books, and somewhat priding myself on my ability to write, it should be noted that the Fake News constantly likes to pour over my tweets looking for a mistake. I capitalize certain words only for emphasis, not b/c they should be capitalized!","....BUT MAYBE I STILL WILL. WITCH HUNT!","....The reason for this is that the Do Nothing Democrats, using disinformation Hoax number 7, don’t want Bernie Sanders to get the Democrat Nomination, and they figure this would be very bad for his chances. It’s all rigged, again, against Crazy Bernie Sanders!","I love Michigan, one of the reasons we are doing such a GREAT job for them during this horrible Pandemic. Yet your Governor, Gretchen “Half” Whitmer is way in over her ahead, she doesn’t have a clue. Likes blaming everyone for her own ineptitude! #MAGA","If the disgusting and corrupt media covered me honestly and didn't put false meaning into the words I say, I would be beating Hillary by 20%","Amazing how the haters &amp, losers keep tweeting the name “F**kface Von Clownstick” like they are so original &amp, like no one else is doing it...","Crooked Hillary Clinton deleted 33,000 e-mails AFTER they were subpoenaed by the United States Congress. Guilty - cannot run. Rigged system!","Polls close, but can you believe I lost large numbers of women voters based on made up events THAT NEVER HAPPENED. Media rigging election!","The very foul mouthed Sen. John McCain begged for my support during his  primary (I gave, he won), then dropped me over locker room remarks!","Happy 4th of July to everyone,  including the haters and losers!","We are up BIG, but they are trying to STEAL the Election. We will never let them do it. Votes cannot be cast after the Poles are closed!","....No Republican Senate Judiciary response, NO “JUSTICE”, NO FBI, NO NOTHING. Major horror show REPORTS on Comey &amp; McCabe, guilty as hell, nothing happens. Catch Obama &amp; Biden cold, nothing. A 3 year, $45,000,000 Mueller HOAX, failed - investigated everything....","We have a totally corrupt previous Administration, including a President and Vice President who spied on my campaign, AND GOT CAIGHT...and nothing happens to them. This crime was taking place even before my election, everyone knows it, and yet all are frozen stiff with fear....","The media is so dishonest. If I make a statement, they twist it and turn it to make it sound bad or foolish.They think the public is stupid!","Joe Biden is a Low Energy Candidate the likes of which we have never seen before. The last thing our country needs is a Low Energy Individulal, especially when surrounded by High Energy Chess Players scattered all over the world. He’s back in his basement now - no schedule!","Barney Frank looked disgusting--nipples protruding--in his blue shirt before Congress. Very very disrespectful.","I love watching these poor, pathetic people (pundits) on television working so hard and so seriously to try and figure me out. They can't!","Does anyone notice that the real Polls, as opposed to the Fake Suppression Polls also used in 2016, are starting to define Sleepy Joe Biden as someone totally I’ll-equipped to control the Radical Left, Crime, Cancel Culture, or to even come close to me on REBUILDING THE ECONOMY?","A vicious accuser of Justice Kavanough has just admitted that she was lying, her story was totally made up, or FAKE! Can you imagine if he didn’t become a Justice of the Supreme Court because of her disgusting False Statements. What about the others? Where are the Dems on this?","It is being reported by virtually everyone, and is a fact,  that the media pile on against me is the worst in American political history!","Lyin' Ted Cruz just used a picture of Melania from a G.Q. shoot in his ad. Be careful, Lyin' Ted, or I will spill the beans on your wife!","Robert Pattinson should not take back Kristen Stewart. She cheated on him like a dog &amp, will do it again--just watch. He can do much better!","Happy Father's Day to all, even the haters and losers!","There’s never been anyone more abusive to women in politics than Bill Clinton.My words were unfortunate-the Clintons’ actions were far worse","If Obama resigns from office NOW, thereby doing a great service to the country—I will give him free lifetime golf at any one of my courses!","Justice Ginsburg of the U.S. Supreme Court has embarrassed all by making very dumb political statements about me. Her mind is shot - resign!","Goofy Elizabeth Warren, sometimes referred to as Pocahontas, pretended to be a Native American in order to advance her career. Very racist!","Of course there is large scale voter fraud happening on and before election day. Why do Republican leaders deny what is going on? So naive!","I turned down a meeting with Charles and David Koch. Much better for them to meet with the puppets of politics, they will do much better!","Lawyer’s Press Conference at Four Season’s Landscaping, Philadelphia. Enjoy!","House Intelligence Committee rules that there was NO COLLUSION between the Trump Campaign and Russia. As I have been saying all along, it is all a big Hoax by the Democrats based on payments and lies. There should never have been a Special Councel appointed. Witch Hunt!","Crooked Hillary Clinton made up facts about me, and \"\"forgot\"\" to mention the many problems of our country, in her very average scream!","I wonder if President Obama would have attended the funeral of Justice Scalia if it were held in a Mosque? Very sad that he did not go!","Just saw Crooked Hillary and Tim Kaine together. ISIS and our other enemies are drooling. They don't look presidential to me!","China wouldn't provide a red carpet stairway from Air Force One and then Philippines President calls Obama \"\"the son of a whore.\"\" Terrible!","Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG &amp, BEAUTIFUL WALL!","How amazing, the State Health Director who verified copies of Obama’s “birth certificate” died in plane crash today. All others lived","The United Kingdom is trying hard to disguise their massive  Muslim problem. Everybody is wise to what is happening, very sad! Be honest.","Sadly, because president Obama has done such a poor job as president, you won't see another black president for generations!","The Clintons spend millions on negative ads on me &amp, I can’t tell the truth about her husband? Don’t feel sorry for crooked Hillary!","Crooked Hillary will NEVER be able to solve the problems of poverty, education and safety within the African-American &amp, Hispanic communities","Wow, Crooked Hillary was duped and used by my worst Miss U. Hillary floated her as an \"\"angel\"\" without checking her past, which is terrible!","If I win the Presidency, we will swamp Justice Ginsburg with real judges and real legal opinions!","Refugees from Syria are now pouring into our great country. Who knows who they are - some could be ISIS. Is our president insane?","NOW THAT THE RADICAL LEFT DEMOCRATS GOT COUGHT COLD IN THE (NON) FRIENDLY TRANSFER OF GOVERNMENT, IN FACT, THEY SPIED ON MY CAMPAIGN AND WENT FOR A COUP, WE ARE ENTITLED TO ASK THE VOTERS FOR FOUR MORE YEARS. PLEASE REMEMBER THIS WHEN YOU VOTE!","Can't believe these totally phoney stories, 100% made up by women (many already proven false) and pushed big time by press, have impact!","Another radical Islamic attack, this time in Pakistan, targeting Christian women &amp, children. At least 67 dead,400 injured. I alone can solve","Django Unchained is the most racist movie I have ever seen, it sucked!","Mini Mike Bloomberg can never recover from his incompetent debate performances. Also, as mayor he was very bad under pressure - a chocker!","....for another President. This is about PROSECUTORIAL MISCONDUCT. We catch the other side SPYING on my campaign, the biggest political crime and scandal in U.S. history, and NOTHING HAPPENS. But despite this, I have done more than any President in history in first 3 1/2 years!","....got fired. Wrote a very nice book about me just recently. Now the book is a lie? Said his wife was driving him crazy, “something big” was happening with her. Getting divorced. He was a mental wreck. We didn’t want him around. Now Fake News puts him on like he was my buddy!","Probably the only thing Barack Obama and I have in common is that we both had the honor of firing Jim Mattis, the world’s most overrated General. I asked for his letter of resignation, &amp; felt great about. His nickname was “Chaos”, which I didn’t like, &amp; changed it to “Mad Dog”...","Voters understand that Crooked Hillary's negative ads are not true- just like her email lies and her other fraudulent activity.","\"\"In politics, and in life, ignorance is not a virtue.\"\" This is a primary reason that President Obama is the worst president in U.S. history!","\"\"THE SYSTEM IS RIGGED!\"\"","Does anybody really believe that Bill Clinton and the U.S.A.G. talked only about \"\"grandkids\"\" and golf for 37 minutes in plane on tarmac?","Looks like two-time failed candidate Mitt Romney is going to be telling Republicans how to get elected. Not a good messenger!","I hope that Crooked Hillary picks Goofy Elizabeth Warren, sometimes referred to as Pocahontas, as her V.P. Then we can litigate her fraud!","Just announced that as many as 5000 ISIS fighters have infiltrated Europe. Also, many in U.S.  I TOLD YOU SO! I alone can fix this problem!","Look how bad it is getting! How much more crime, how many more shootings, will it take for African-Americans and Latinos to vote Trump=SAFE!","If Michael Bloomberg ran again for Mayor of New York, he wouldn't get 10% of the vote - they would run him out of town!  #NeverHillary","I am getting great credit for my press conference today. Crooked Hillary should be admonished for not having a press conference in 179 days.","I refuse to call Megyn Kelly a bimbo, because that would not be politically correct. Instead I will only call her a lightweight reporter!","I would like to wish everyone, including all haters and losers (of which, sadly, there are many) a truly happy and enjoyable Memorial Day!","The global warming we should be worried about is the global warming caused by NUCLEAR WEAPONS in the hands of crazy or incompetent leaders!","Crooked Hillary will NEVER be able to handle the complexities and danger of ISIS - it will just go on forever. We need change!","Big wins in West Virginia and Nebraska. Get ready for November - Crooked Hillary, who is looking very bad against Crazy Bernie, will lose!","This election is a total sham and a travesty. We are not a democracy!","Jeb Bush just got contact lenses and got rid of the glasses. He wants to look cool, but it's far too late. 1% in Nevada!","Low energy Jeb Bush just endorsed a man he truly hates, Lyin’ Ted Cruz. Honestly, I can’t blame Jeb in that I drove him into oblivion!","Based on the fraud committed by Senator Ted Cruz during the Iowa Caucus, either a new election should take place or Cruz results nullified.","Goofy Elizabeth Warren is now using the woman’s card like her friend crooked Hillary. See her dumb tweet “when a woman stands up to you...”","Now the press is trying to sell the fact that I wanted a Moot stuffed with alligators and snakes, with an electrified fence and sharp spikes on top, at our Southern Border. I may be tough on Border Security, but not that tough. The press has gone Crazy. Fake News!","....”knife crime,” which is totally out of control in London. People are afraid to even walk the streets. He is a terrible mayor who should stay out of our business!","Have a good chance to win Texas on Tuesday. Cruz is a nasty guy, not one Senate endorsement and, despite talk, gets nothing done. Loser!","The Club For Growth,which asked me for $1,000,000 in an extortion attempt, just put up a Wisconsin ad with incorrect math.What a dumb group!","Crooked Hillary Clinton said she is used to \"\"dealing with men who get off the reservation.\"\" Actually, she has done poorly with such men!","I meet and talk to “foreign governments” every day. I just met with the Queen of England (U.K.), the Prince of Whales, the P.M. of the United Kingdom, the P.M. of Ireland, the President of France and the President of Poland. We talked about “Everything!” Should I immediately.....","Why would Texans vote for \"\"liar\"\" Ted Cruz when he was born in Canada, lived there for 4 years-and remained a Canadian citizen until recently","Why would the great people of Florida vote for a guy who, as a Senator, never even shows up to vote - worst record. Marco Rubio is a joke!","Stop congratulating Obama for killing Bin Laden. The Navy Seals killed Bin Laden. #debate","If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!","Going to Salt Lake City, Utah, for a big rally. Lyin' Ted Cruz should not be allowed to win there - Mormons don't like LIARS! I beat Hillary","Ted Cruz didn't win Iowa, he stole it. That is why all of the polls were so wrong and why he got far more votes than anticipated. Bad!","Word is-early voting in FL is very dishonest. Little Marco, his State Chairman, &amp, their minions are working overtime-trying to rig the vote.","Heartfelt condolences from the people of the United States to the people of Sri Lanka on the horrible terrorist attacks on churches and hotels that have killed at least 138 million people and badly injured 600 more. We stand ready to help!","Well, Obama refused to say (he just can't say it), that we are at WAR with RADICAL ISLAMIC TERRORISTS.","So now tha Matt Lauer is gone when will the Fake News practitioners at NBC be terminating the contract of Phil Griffin? And will they terminate low ratings Joe Scarborough based on the “unsolved mystery” that took place in Florida years ago? Investigate!","How is ABC Television allowed to have a show entitled \"\"Blackish\"\"? Can you imagine the furor of a show, \"\"Whiteish\"\"! Racism at highest level?","Absentee Governor Kasich voted for NAFTA and NAFTA devastated Ohio - a disaster from which it never recovered. Kasich is good for Mexico!","“WE’RE NOT GONG TO MAKE AMERICA GREAT AGAIN, IT WAS NEVER THAT GREAT.”  Can you believe this is the Governor of the Highest Taxed State in the U.S., Andrew Cuomo, having a total meltdown!","Sadly, the overwhelming amount of violent crime in our major cities is committed by blacks and hispanics-a tough subject-must be discussed.","Our Native American Senator, goofy Elizabeth Warren, couldn’t care less about the American worker...does nothing to help!","Hillary said \"\"I really deplore the tone and inflammatory rhetoric of his campaign.\"\" I deplore the death and destruction she caused-stupidity","....non-existent “sources” and a drunk/drugged up loser who hates Michael, a fine person with a wonderful family. Michael is a businessman for his own account/lawyer who I have always liked &amp, respected. Most people will flip if the Government lets them out of trouble, even if....","13 Syrian refugees were caught trying to get into the U.S. through the Southern Border. How many made it?  WE NEED THE WALL!","Public opinion has turned strongly against the Rigged Witch Hunt and the “Special” Councel because the public understands that there was no  Collusion with Russia (so ridiculous), that the two FBI lovers were a fraud against our Nation &amp, that the only Collusion was with the Dems!","Crooked Hillary Clinton put out an ad where I am misquoted on women. Can't believe she would misrepresent the facts! My hit was on China","It's really cold outside, they are calling it a major freeze, weeks ahead of normal. Man, we could use a big fat dose of global warming!","Lying Cruz put out a statement, “Trump &amp, Rubio are w/Obama on gay marriage.\"\" Cruz is the worst liar, crazy or very dishonest. Perhaps all 3?","It makes me feel so good to hit \"\"sleazebags\"\" back -- much better than seeing a psychiatrist (which I never have!)","Failed presidential candidate Lindsey Graham should respect me. I destroyed his run, brought him from 7% to 0% when he got out. Now nasty!","Just watched Jeb's ad where he desperately needed mommy to help him. Jeb --- mom can't help you with ISIS, the Chinese or with Putin.","Attention all hackers: You are hacking everything else so please hack Obama's college records (destroyed?) and check \"\"place of birth\"\"","We should stay the hell out of Syria, the \"\"rebels\"\" are just as bad as the current regime. WHAT WILL WE GET FOR OUR LIVES AND $ BILLIONS?ZERO","Little Marco Rubio, the lightweight no show Senator from Florida, is set to be the \"\"puppet\"\" of the special interest Koch brothers. WATCH!","As usual, the Fed did NOTHING! It is incredible that they can “speak” without knowing or asking what I am doing, which will be announced shortly. We have a very strong dollar and a very weak Fed. I will work “brilliantly” with both, and the U.S. will do great...","I use both iPhone &amp, Samsung. If Apple doesn't give info to authorities on the terrorists I'll only be using Samsung until they give info.","Video game violence &amp, glorification must be stopped—it is creating monsters!","It is amazing how the Fake News Media became “crazed” over the chant “send he back” by a packed Arena (a record) crowd in the Great State of North Carolina, but is totally calm &amp, accepting of the most vile and disgusting statements made by the three Radical Left Congresswomen....","Jeb failed as Jeb! He gave up and enlisted Mommy and his brother (who got us into the quicksand of Iraq). Spent $120 million.Weak-no chance!","I just realized that if you listen to Carly Fiorina for more than ten minutes straight, you develop a massive headache. She has zero chance!","Ted Cruz is totally unelectable, if he even gets to run (born in Canada). Will loose big to Hillary. Polls show I beat Hillary easily! WIN!","All polls have me winning debate big- Drudge, TIME, etc. Dopey Charles Krauthammer still nasty. He has zero cred- totally dishonest!","I hope we never find life on another planet because if we do there's no doubt that the United States will start sending them money!","Everybody is laughing at Jeb Bush-spent $100 million and is at bottom of pack. A pathetic figure!","I hope we never find life on other planets because there's no doubt that the U.S. Government will start sending them money!","Ted Cruz lifts the Bible high into the air and then lies like a dog-over and over again! The Evangelicals in S.C. figured him out &amp, said no!","The way President Obama runs down the stairs of Air Force 1, hopping &amp, bobbing all the way, is so inelegant and unpresidential. Do not fall!","Danger-Weiner is a free man at 12:01AM. He will be back sexting with a vengeance. All women remain on alert.","This very expensive GLOBAL WARMING bullshit has got to stop. Our planet is freezing, record low temps,and our GW scientists are stuck in ice","If you are lucky enough to catch a knockout assaulter before getting slugged, and you carry a gun, shoot the bastard (teach them a lesson)!","Jeb Bush never uses his last name on advertising, signage, materials etc. Is he ashamed of the name BUSH? A pretty sad situation. Go Jeb!","The RNC, which is probably not on my side, just illegally put out a fundraising notice saying Trump wants you to contribute to the RNC.","According to Bill O'Reilly, 80% of all the shootings in New York City are blacks-if you add Hispanics, that figure goes to 98%. 1% white.","With Ben Carson wanting to hit his mother on head with a hammer, stab a friend and Pyramids built for grain storage - don't people get it?","I bet the terrorists in Libya used weapons we supplied them during their so called 'revolution' to attack our embassy in Benghazi.","After Friday’s Twilight release, I hope Robert Pattinson will not be seen in public with Kristen--she will cheat on him again!","Lying #Ted Cruz just (on election day) came out with a sneak and sleazy Robocall. He holds up the Bible but in fact is a true lowlife pol!","Governor Cuomo is right about one thing - Attorney General Eric Schneiderman does wear eyeliner! What the hell is up with him?","So it was indeed (just proven in court papers) “last in his class” (Annapolis) John McCain that sent the Fake Dossier to the FBI and Media hoping to have it printed BEFORE the Election. He &amp, the Dems, working together,  failed (as usual). Even the Fake News refused this garbage!","Windmills are the greatest threat in the US to both bald and golden eagles. Media claims fictional ‘global warming’ is worse.","Tell Saudi Arabia and others that we want (demand!) free oil for the next ten years or we will not protect their private Boeing 747s.Pay up!","Highly untalented Wash Post blogger, Jennifer Rubin, a real dummy, never writes fairly about me. Why does Wash Post have low IQ people?","The terrorists in Syria are calling themselves REBELS and getting away with it because our leaders are so completely stupid!","It must have been President Obama that called in what will go down as the DUMBEST PLAY IN THE HISTORY OF FOOTBALL. Same thought process!","Has Barack Obama been caught red handed laundering money into his campaign from illegal online foreign donations? Media?","Robert I'm getting a lot of heat for saying you should dump Kristen- but I'm right. If you saw the Miss Universe girls you would reconsider.","Sharks are last on my list - other than perhaps the losers and haters of the World!","If Jon Stewart is so above it all &amp, legit, why did he change his name from Jonathan Leibowitz? He should be proud of his heritage!","I watched lightweight Senator  Marco Rubio, who is all talk and no action, defend his WEAK position on illegal immigration. Pathetic!","I am starting to think that there is something seriously wrong with President Obama's mental health. Why won't he stop the flights. Psycho!","If this doctor, who so recklessly flew into New York from West Africa,has Ebola,then Obama should apologize to the American people &amp, resign!","It's freezing and snowing in New York--we need global warming!","Marco Rubio will not win. Weak on illegal immigration, strong on amnesty and has the appearance to killers of the world as a \"\"lightweight\"\".","Many people walked out on Madonna's concert when she told them to vote for Obama. Years ago I walked out because the concert was terrible!","Miss Universe, Paulina Vega, criticized me for telling the truth about illegal immigration, but then said she would keep the crown-Hypocrite","What the hell is Obama doing in allowing all of these potentially very sick people to continue entering the U.S.! Is he stupid or arrogant?","Is Anthony Weiner a jerk or what!","Give me clean, beautiful and healthy air - not the same old climate change (global warming) bullshit! I am tired of hearing this nonsense.","Was Susan Rice told to lie about Bergdahl? Obama and his representatives lie about virtually everything, from ObamaCare to a deserter.","Losers and haters,even you, as low and dumb as you are, can learn from watching Apprentice and checking out my tweets-you can still succeed!","Think of it, the Arab League doesn't want to get involved with Syria - but they want us to do their dirty work. How stupid!","Do you believe Barack Hussein Obama (aka Barry Soetoro) looked like a president last night? I don't!","Obama is, without question, the WORST EVER president. I predict he will now do something really bad and totally stupid to show manhood!","Ebola has been confirmed in N.Y.C., with officials frantically trying to find all of the people and things he had contact with.Obama's fault","Everyone should cancel HBO until they fire low life dummy Bill Maher!  Get going now and feel good about yourself!","....If we bought 15 Billion Dollars of Agriculture from our Farmers, far more than China buys now, we would have more than 85 Billion Dollars left over for new Infrastructure, Healthcare, or anything else. China would greatly slow down, and we would automatically speed up!","Was President Obama in charge of this years Academy Awards - they remind me of the ObamaCare website!  #Oscars.","Major League Baseball was really smart when they wouldn't let Mark Cuban buy a team. Was it his financials or the fact that he's an asshole?","Is the Boston killer eligible for Obama Care to bring him back to health?","I have been saying for weeks for President Obama to stop the flights from West Africa. So simple, but he refused. A TOTAL incompetent!","Why do we always try to destroy our true champions and winners in this country, while at the same time leaving the losers alone? STUPID!","BREAKING NEWS:  Obama has just made a trade with Russia. They get Florida, California &amp, our gold supply. We get borscht &amp, a bottle of vodka.","It’s okay but why do the haters (&amp, losers) want to follow me on twitter?? Get a life!","....What right does Crazy Nancy have to hold up this Senate trial. None! She has a bad case and would rather not have a negative decision. This Witch Hunt must end NOW with a trial in the Senate, or let her default &amp, lose. No more time should be wasted on this Impeachment Scam!","Does Madonna know something we all don't about Barack? At a concert she said \"\"we have a black Muslim in the White House.\"\"","Carson now admits his friend named \"\"Bob,\"\" who he tried to stab (Bob was saved by his belt buckle!), no longer exists as Bob. Wrong name!","Looks like Obama will not stop the very potentially dangerous flights to and from West Africa. What the hell is wrong with this guy?","ObamaCare is a disaster and Snowden is a spy who should be executed-but if it and he could reveal Obama's records,I might become a major fan","Twitter should let the banned Conservative Voices back onto their platform, without restriction. It’s called Freedom of Speech, remember. You are making a Giant Mistake!","Now Mini Mike Bloomberg is critical of Jack Wilson, who saved perhaps hundreds of people in a Church because he was carrying a gun, and knew how to use it. Jack quickly killed the shooter, who was beginning a rampage. Mini is against the 2nd A. His ads are Fake, just like him!",".....and many others voted illegally. Also, machine “glitches” (another word for FRAUD), ballot harvesting, non-resident voters, fake ballots, “stuffing the ballot box”, votes for pay, roughed up Republican Poll Watchers, and sometimes even more votes than people voting, took....","What would Bolton, one of the dumbest people in Washington, know? Wasn’t he the person who so stupidly said, on television, “Libyan solution”, when describing what the U.S. was going to do for North Korea? I’ve got plenty of other Bolton “stupid stories”.","The ObamaBiden Administration was the most corrupt in history, including the fact that they got caught SPYING ON MY CAMPAIGN, the biggest political scandal in the history of our Country. It’s called Treason, and more. Thanks for your very kind words Michelle!","Pelosi feels her phony impeachment HOAX is so pathetic she is afraid to present it to the Senate, which can set a date and put this whole SCAM into default if they refuse to show up! The Do Nothings are so bad for our Country!","We have a totally corrupt previous Administration, including a President and Vice President who spied on my campaign, AND GOT CAUGHT...and nothing happens to them. This crime was taking place even before my election, everyone knows it, and yet all are frozen stiff with fear....","Sorry losers and haters, but my I.Q. is one of the highest -and you all know it! Please don't feel so stupid or insecure,it's not your fault","Lebron James was just interviewed by the dumbest man on television, Don Lemon. He made Lebron look smart, which isn’t easy to do. I like Mike!","Stock Markets (all three) hit another ALL TIME &amp, HISTORIC HIGH yesterday! You are sooo lucky to have me as your President (just kidding!). Spend your money well!","The very rude elevator screamers are paid professionals only looking to make Senators look bad. Don’t fall for it! Also, look at all of the professionally made identical signs. Paid for by Soros and others. These are not signs made in the basement from love! #Troublemakers","Another win just in. Nervous Nancy Pelosi and the Democrats in Congress sued me, thrown out. This one unanimous, in the D.C. Circuit.\nWitch Hunt!","Philadelpiha MUST HAVE POLLWATCHERS!","Voting starts in Virginia TODAY, and we are going to WIN. You have a crazy Governor who wants to take away your guns, which he will do without me in office. He is in favor of executing babies after birth - this isn’t late-term abortion, this is a step way beyond! Vote for me...","How does Da Nang Dick (Blumenthal) serve on the Senate Judiciary Committee when he defrauded the American people about his so called War Hero status in Vietnam, only to later admit, with tears pouring down his face, that he was never in Vietnam. An embarrassment to our Country!","So when will something significant happen to James Comey? Got caught cold. He is either very dumb, or one of the worst liars in political history. TOO LONG. EMBARRASSING!","These horrible &amp; politically charged decisions coming out of the Supreme Court are shotgun blasts into the face of people that are proud to call themselves Republicans or Conservatives. We need more Justices or we will lose our 2nd. Amendment &amp; everything else. Vote Trump 2020!","Just like Radical Left New York is trying to destroy the NRA, if Biden becomes President your GREAT SECOND AMENDMENT doesn’t have a chance. Your guns will be taken away, immediately and without notice. No police, no guns!","Russia vows to shoot down any and all missiles fired at Syria. Get ready Russia,  because they will be coming, nice and new and “smart!” You shouldn’t be partners with a Gas Killing Animal who kills his people and enjoys it!","How low has President Obama gone to tapp my phones during the very sacred election process. This is Nixon/Watergate. Bad (or sick) guy!","Can you believe that Shifty Adam Schiff, the biggest leaker in D.C., and a corrupt politician, is upset that we didn’t inform him before we raided and killed the #1 terrorist in the WORLD!? Wouldn’t be surprised if the Do Nothing Democrats Impeach me over that! DRAIN THE SWAMP!!","....Can you imagine if the Republicans stole a Presidential Election from the Democrats - All hell would break out. Republican leadership only wants the path of least resistance. Our leaders (not me, of course!) are pathetic. They only know how to lose! P.S. I got MANY Senators..","Great being with the National Champion Clemson Tigers last night at the White House. Because of the Shutdown I served them massive amounts of Fast Food (I paid), over 1000 hamburgers etc. Within one hour, it was all gone. Great guys and big eaters!","The Democrat Congresswomen have been spewing some of the most vile, hateful, and disgusting things ever said by a politician in the House or Senate, &amp, yet they get a free pass and a big embrace from the Democrat Party. Horrible anti-Israel, anti-USA, pro-terrorist &amp, public.....","Terrible! Just found out that Obama had my \"\"wires tapped\"\" in Trump Tower just before the victory. Nothing found. This is McCarthyism!","The animal who beheaded the woman in Oklahoma should be given a very fast trial and then the death penalty. The same fate - beheading?","Everytime someone tweets that I wear a wig realize to yourself that you are dealing with \"\"them\"\" - just another sad &amp, lonely hater and loser!","No more massive injections. Tiny children are not horses—one vaccine at a time, over time.","It's not climate change,it's global warming.Don't let the dollar sucking wiseguys change names midstream because the first name didn't work","If I’m the third most envied man in America, the small group of haters and losers must be nauseas.","What’s funny about the name “F**kface Von Clownstick” -- it was not coined by Jon Leibowitz-- he stole it from some moron on twitter.","For the sake of New York City, all recent sexting victims of Anthony ‘Carlos Danger’ Weiner should come forward.","If Saudi Arabia, which has been making one billion dollars a day from oil, wants our help and protection, they must pay dearly! NO FREEBIES.","\"\"If you voted for Obama in 2008 to prove you were not a racist then vote for Romney in 2012 to prove you are not stupid.\"\" Thanks Walter D!","Despite the ever increasing Ebola disaster, Obama refuses to stop flights from West Africa.It's almost like he's saying F-you to U.S. public","The Mexican legal system is corrupt, as is much of Mexico. Pay me the money that is owed me now - and stop sending criminals over our border","Really interesting, President Obama was quick to shut down flights to Isreal but is totally unwilling to shut down flights from West Africa!","How can a dummy dope like Harry Hurt, who wrote a failed book about me but doesn’t know me or anything about me, be on TV discussing Trump?","The scum that gets high on badly hurting old ladies and others through knockout assaults wouldn't feel that way with a gun at their head!","Haters and losers say I wear a wig (I don't), say I went bankrupt (I didn't), say I'm worth $3.9 billion (much more). They know the truth!","Happy Veterans Day to ALL, in particular to the haters and losers who have no idea how lucky they are!!!","If the people so violently shot down in Paris had guns, at least they would have had a fighting chance.","NBC News just called it the great freeze - coldest weather in years. Is our country still spending money on the GLOBAL WARMING HOAX?","Why are we sending thousands of ill-trained soldiers into Ebola infested areas of Africa! Bring the plague back to U.S.? Obama is so stupid.","Isn't it intetesting that anybody who attacks President Obama is considered a racist by the real racists out there!","President Obama has absolutely no control (or respect) over the African American community-they have fared so poorly under his presidency.","The shirts and ties at Macy's are so good-beautiful and do so well that guys like the one that sued me wrongly want a piece-l kicked his ass","If the morons who killed all of those people at Charlie Hebdo would have just waited, the magazine would have folded - no money, no success!","They asked me to dress as Santa Claus to open Miss Universe tonight—I’m thinking about it!","Snowden is a spy who has caused great damage to the U.S. A spy in the old days, when our country was respected and strong, would be executed","It's 46º (really cold) and snowing in New York on Memorial Day - tell the so-called \"\"scientists\"\" that we want global warming right now!","Rosie is crude, rude, obnoxious and dumb - other than that I like her very much!","Maybe some of the dead voters who helped get President Obama elected can be brought back to life after signing up for ObamaCare.","We should be focused on clean and beautiful air-not expensive and business closing GLOBAL WARMING-a total hoax!","If I were president Sgt. Andrew Tahmooressi would be let out of jail with one phone call. If not,Mexico would pay a price like never before!","Pervert alert! Sexter Anthony Weiner will be running for Mayor of New York City.","We should be focused on magnificently clean and healthy air and not distracted by the expensive hoax that is global warming!","So many people have told me that I should host Meet the Press and replace the moron who is on now. Just too busy, especially next 10 years!","Hurricane is good luck for Obama again- he will buy the election by handing out billions of dollars.","Autism WAY UP - I believe in vaccinations but not massive, all at once, shots. Too much for small child to handle. Govt. should stop NOW!","Why do losers &amp, haters always say I wear a “wig” when they know I don’t. Like it or not, it’s all mine—just ask Barbara Walters.","Record low temperatures and massive amounts of snow. Where the hell is GLOBAL WARMING?","I just beat a lawyer from Yale and a lawyer from Harvard, who teamed up against me, in a major case worth millions ($). They were so dumb!","Snowing in Texas and Louisiana, record setting freezing temperatures throughout the country and beyond. Global warming is an expensive hoax!","President Obama, I have an idea! Pretend that West Africa is Israel and then you will be able to stop the Ebola area flights.","If America was under the threat of imminent attack, would Obama use torture or a kiss?","Ebola patient will be brought to the U.S. in a few days - now I know for sure that our  leaders are incompetent. KEEP THEM OUT OF HERE!","Obama, stop the flights to and from West Africa NOW - before it is too late! Can't you see what's happening? Can you be that thick (stupid)?","This Ebola patient Thomas Duncan, who fraudulently entered the U.S. by signing false papers, is causing havoc. If he lives, prosecute!","Wow, I’m at 2,200,000  followers but I’d love to get rid of the haters &amp, losers—they’re such a waste of time!","With the two wacko perverts--Spitzer and Weiner--NYC politics has become a joke all over the world.","With autism being way up, what do we have to lose by having doctors give small dose vaccines vs. big pump doses into those tiny bodies?","I went to Wharton, made over $8 billion, employ thousands of people &amp, get insulted by morons who can’t get enough of me on twitter...!","Have you heard? China just told Obama to jump. Obama asked how high.","While Jon Stewart is a joke, not very bright and totally overrated, some losers and haters will miss him and his dumb clown humor. Too bad!","I was never a fan of Bush, in fact, he was so bad he gave us Obama! But Obama is truly a pathetic excuse of a president, can't get any worse","Obama now wants to give another $450M to the Muslim Brotherhood. Money we don't have going to people that hate us. Moronic.","Remember, politicians are all talk and NO action. Our country is a laughing stock that is going to hell. The lobbyists &amp, donors control all!","The U.S. is spending fortunes at airports checking people coming in from West Africa, with uncertain results. STOP THE FLIGHTS YOU DUMB B's!","Here we go! I stated long ago that we should cancel all flights from West Africa. Now we have Ebola in U.S., AND IT WILL ONLY GET WORSE!","Again, more dead people voted in the last election than enrolled in ObamaCare. Congratulations America!","Why won't Obama release his college applications? Is there something 'foreign' about them?","Oscar Pistorious will likely only serve 10 months for the cold blooded murder of his girlfriend. Another O.J. travesty.The judge is a moron!","If Syria was forced to use Obamacare they would self-destruct without a shot being fired. Obama should sell them that idea!","I'm having a real hard time watching the Academy Awards (so far). The last song was terrible! Kim should sue her plastic surgeon! #Oscars","In order to stop the Ebola outbreak in Africa, perhaps the President should put all Africans on ObamaCare rather than sending the troops!","That Seth Meyers is hosting the Emmy Awards is a total joke. He is very awkward with  almost no talent. Marbles in his mouth!","How incompetent are our leaders allowing these Ebola infected people to come into our country with all of the problems and danger entailed!","So sad that Burt Reynolds has lost all of his money. I wish he came to me for advice--he would be rich as hell!","Remember when \"\"comedian\"\" Bill Maher openly praised the disgusting terrorists who destroyed the World Trade Center-then got canned by ABC?","The bigger problem with Ebola is all of the people coming into the U.S. from West Africa who may be infected with the disease. STOP FLIGHTS!","THE LAST THING THIS COUNTRY NEEDS IS ANOTHER BUSH!","By Obama mentioning Manhattan yesterday in his response, he has singlehandedly made it target #1. How totally stupid is this guy?","I sure hope the sexting pervert Anthony Weiner runs for mayor.  Will be great fun watching him both lose and be humiliated.","So many people are angry at my comments on Mexico—but face it—Mexico is totally ripping off the US. Our politicians are dummies!","The fight against ISIS starts at our border. ‘At least’ 10 ISIS have been caught crossing the Mexico border. Build a wall!","Do not go back into Iraq unless they agree, in a signed formal instrument, to give the U.S. 50% of their oil reserves.Make the deal dummies!","It's record cold all over the country and world - where the hell is global warming, we need some fast!","I don't know if Hillary will be able to run, she is a walking time bomb!","Because of Rodolfo Rosas Moya, who owes me lots of money, Mexico will never again host the Miss Universe Pageant.","Policy towards our enemies: Hit them hard, hit them fast, hit them often &amp, then tell them it was because they are the enemy!","Obama will let Ebola fly into US &amp, drugrunners cross our border daily. But he won't pressure Mexico on Sgt. Tahmooressi. #FreeOurMarine","Obama now wants to deny due process to the police. He’ll give all constitutional rights to the terrorists but not our cops.","Weiner says many more pictures may be out there—this is just what NYC needs, a pervert Mayor.","Once the ISIS thug who beheaded Foley is identified 100%, he should be bunker busted to hell.","ISIS made a big mistake with the beheading of the reporter. Even people against intervention want them blown into oblivion. LEADERSHIP!","People should be proud of the fact that I got Obama to release his birth certificate, which in a recent book he “miraculously” found.","Nobody but Donald Trump will save Israel. You are wasting your time with these politicians and political clowns. Best! #SheldonAdelson","All the haters and losers must admit that, unlike others,  I never attacked dopey Jon Stewart for his phony last name. Would never do that!","Jon Stewart is the most overrated joke on television. A wiseguy with no talent. Not smart, but convinces dopes he is! Fading out fast.","Have you ever seen our country look weaker or more pathetic: Snowden, ObamaCare, VA, Russia, jobs, decimated military, debt and so much more","We are experiencing the coldest weather in more than two decades-most people never remember anything like this. GLOBAL WARMING anyone?","The public is about to learn a lot more information on Barack Obama and his true background in the coming weeks...","I have nothing to do with Atlantic City-sold years ago (great timing). For losers and haters, I NEVER went bankrupt. Plus $10 billion, sorry","Massive record setting  snowstorm and freezing temperatures in U.S. Smart that GLOBAL WARMING hoaxsters changed name to CLIMATE CHANGE! $$$$","While everyone is waiting and prepared for us to attack Syria, maybe we should knock the hell out of Iran and their nuclear capabilities?","I do not understand how so many of my Jewish friends backed Obama in the last election. He is a TOTAL DISASTER FOR ISRAEL-AND ALWAYS WILL BE","If the working, proud and productive people of our country don't start exerting their authority and views, the U.S. as we know it is doomed!","The Obama administration gives better medical care to Al Qaeda at Gitmo than to our vets.","It’s snowing &amp, freezing in NYC. What the hell ever happened to global warming?","For those that constantly say that “global warming” is now “climate change”—they changed the name. The name global warming wasn’t working","Our country and our \"\"leaders\"\" are getting dumber all the time. Now they are about to release full documentation on torture. Will destroy CIA","The Arab League stated that it wants nothing to do with an attack on Syria, but they want us to attack.Are our leaders insane or just stupid","The five prisoners our government so stupidly released for one pathetic traitor are now fighting and killing for ISIS-BAD DEAL! Courtmarshal","The border is wide open for cartels &amp, terrorists. Secure our border now. Build a massive wall &amp, deduct the costs from Mexican foreign aid!","Derek Jeter had a great career until 3 days ago when he sold his apartment at Trump World Tower- I told him not to sell- karma?","In the latest poll, Danger-Weiner’s numbers have sunk. I wonder how Carlos handled the stress? He is one whacko sicko sexter.","I'm not saying to not give vaccines, I am just saying give them small doses over a long period of time - not one massive dose for a child.","Dummy, I'm asking a question - look at the question mark at the end of the sentence! Use your head.","No surprise that China was caught cheating in the Olympics. That's the Chinese M.O. - Lie, Cheat &amp, Steal in all international dealings.","President Obama wants to change the name of the \"\"White House\"\" because it is highly discriminating and not at all politically correct!","Get smart on knockout assaults and crime - we have to be slightly more vicious (and violent) than the assaulter-and crime would end FAST!","Huffington Post is just upset that I said its purchase by AOL has been a disaster and that Arianna Huffington is ugly both inside and out!","Which is worse and which is more dishonest - the #Oscars or the Emmys?","Snow and ice, freezing weather, in Texas, Arizona and Oklahoma - what the hell is going on with GLOBAL WARMING?","Record cold temperatures in July - 20 to 30 degrees colder than normal. What the hell happened to GLOBAL WARMING?","In light the Benghazi emails released last night, it is apparent that Obama has no problem lying to the American public...","I will be on Fox &amp, Friends tomorrow morning at 7. Will be discussing basic stupidity and incompetence, of which our \"\"leaders\"\" have plenty!","With all that is happening with Ebola, including the doctor who so easily came back to New York, Obama still refuses to stop the flights!","Russia is sending a fleet of ships to the Mediterranean. Obama’s war in Syria has the potential to widen into a worldwide conflict.","The terrorists cut off the heads of Americans and laugh, then want to sell us the bodies for $1,000,000. We fight over sleep deprivation!","What do you think of water boarding the Boston killer sometime prior to allowing our doctors to make him well? I suspect he may talk!","Iran is moving troops into Iraq under the guise that it is helping out. Actually, they will take over Iraq and all of their oil. Stupid U.S.","How could Obama leave those American heroes out to die in Benghazi?  And he continues to lie to the public!","Nobody would fight harder for free speech than me but why  taunt, over and over again, in order to provoke possible death to audience. DUMB!","Jay Leno and his people are constantly calling me to go on his show. My answer is always no because his show sucks. They love my ratings!","I would invite Edward Snowden to be a judge at the Miss Universe Pageant in Moscow but would be concerned that he would sell results early!","Record setting cold and snow, ice caps massive! The only global warming we should fear is that caused by nuclear weapons - incompetent pols.","Why are some more concerned with granting terrorist rights than protecting innocent Americans?","Under President Obama, do you think America will become a THIRD WORLD COUNTRY?","Obama talks about what he is going to do--why the hell didn't he just do it, especially in the first 2 years when he had all votes necessary","It wasn't only that Obama saluted a Marine with a cup of coffee in his hand, but why the hell does he have to exit a heli holding coffee?","Temperature at record lows in many parts of the country. 50 degrees below zero with wind chill in large area. Global warming folks iced in!","Didn't the Boston killer even run over his own brother with a car in order to get away?  We are not dealing with an innocent baby here-DEATH","I am the only one that knows how to build cities - pols are all talk and no action. Our cities need help, and fast. They are crumbling!","How much money is the  extremely unattractive (both inside and out) Arianna Huffington paying her poor ex-hubby for the use of his name?","Nice to see Obama released a situation room photo from Sandy.  How about releasing the photo taken during Benghazi?","Rodolfo Rosas Moya and his pals in Mexico owe me a lot of money. Disgusting &amp, slow Mexico court system. Mexico is not a U.S. friend.","Can you believe that the builder of the failed ObamaCare website was just given a new government contract - how stupid is that - CLUELESS!!!","Iraq buying $200,000,000 worth of weapons from Iran. Despite so many killed and trillions spent, Iraq dumps U.S. I TOLD YOU SO LONG AGO!","Every penny of the $7 billion going to Africa as per Obama will be stolen - corruption is rampant!","We should have taken the oil in Iraq, and now our mortal enemies have got it, and with no opposition. Really dumb U.S. pols! I'm so angry!","Obama is community organizing from the Oval Office on Ferguson today. More riots sure to follow.","The girlfriend of Lubitz, the  wacko co-pilot who took down the plane, knew he was insane and should have reported him. Put her through hell","Baltimore just set a record for the coldest day in March in a long recorded history - 4 degrees. Other places likewise. Global warming con!","The Boston terrorist thugs’ mother is also a radical.  I am sure she will be granted citizenship shortly.","Breaking news--negotiations with Iranians broke down because Obama insisted that they use ObamaCare.","Just letting China know in advance that the USA will win the medal count in the Olympics. Even with your cheating you can't beat us.","All the haters &amp, losers must admit that, unlike others, I never attacked dopey Jon Stewart for his phony last name. Would never do that!","If we are going to continue to be stupid and go into Syria (watch Russia), as they say in the movies, SHOOT FIRST AND TALK LATER!","Iran will convince our incompetent President that they are trying to help us with Iraq, take over the country &amp, oil, and \"\"O\"\" will say thanks","I'd bet the lawyers for the Central Park 5 are laughing at the stupidity of N.Y.C. when there was such a strong case against their \"\"clients\"\"","Our NOBEL PRIZE FOR PEACE president said \"\"I'm really good at killing people\"\" according to just out book Double Down. Can Oslo retract prize?","Boycott Mexico until they release our Marine. With all the money they get from the U.S., this should be an easy one. NO RESPECT!","Why does the a Lamestream Fake News Media REFUSE to say that China Virus deaths are down 39%, and that we now have the lowest Fatality (Mortality) Rate in the World. They just can’t stand that we are doing so well for our Country!","Isn't it interesting that immediately after September 11th, everybody was asking for, and indeed demanding, torture of any kind. No reports!","TRAIN WRECK just the beginning. Our roads, airports, tunnels, bridges, electric grid - all falling apart.I can fix for 20% of pols, &amp, better","China is taking the oil from Iraq after we spent 1.5 trillion dollars and thousands of lives for their \"\"freedom\"\". Our leaders are so stupid!","Why is Obama’s auto bailout now creating jobs in China?  He is ruining American industry.","First Titantic sunk on its maiden voyage.Next the Hindenburg explodes on its first flight to America.Now we suffer the ObamaCare rollout!","Karl Rove is a total loser. Money given to him might as well be thrown down the drain.","Can you imagine how embarrassing it would have been for the country if the candidates actually did get into a fist fight?","What a coincidence that Obama's good friends in Libya and Egypt picked 9/11 to attack our embassies.","I just had to fire someone, he didn't have a clue--he reminded me of Obama on Wednesday night.","Secretary of Defense Chuck Hagel seems so lost and, frankly, dumb. He can't even speak properly. Poor leader in these very dangerous times!","President Obama, our great leader, wants to declare martial law in New York City as a means of helping out with the \"\"massive\"\" storm.","As hard as it is to believe, sexting pervert Anthony Weiner is leading in some polls for Mayor of NYC.","Just watched Jon Stewart(?) jumping up and down and screaming like a madman - nothing funny or smart, just loud and obnoxious, a pushy dope!","Pervert Weiner is dead in his race for mayor of NYC but WOW, Eliot Spitzer has dropped way down in recent poll for comptroller. SLEAZE!","Just received applause at #NCGOPcon when I said  \"\"People ask me why I may run for President-- I might so we can Make America Great Again!","See June 2007 speech--is Obama a total racist?","George Will may be the dumbest(and most overrated) political commentator of all time. If the Republicans listen to him, they will lose.","I'm giving away money! 11AM Trump Tower. Be there or be left behind!","With Democrats Spitzer, Danger-Weiner &amp, Filner, which party really has the war on women?","Sexual pervert &amp, deviant Anthony Weiner is polling to see if he can run for NYC Mayor...","WHO IS GOING TO GET IRAQ'S OIL???????","We should be able to negotiate a deal with Iran because they know we could blow them away to the Stone Age.They just don't believe we would.","I guess Obama's Cairo Speech really worked out. The Muslim Brotherhood stormed our embassy on 9.11. Imagine if Obama speaks in Beijing?","You must admit that Bryant Gumbel is one of the dumbest racists around - an arrogant dope with no talent. Failed at CBS etc-why still on TV?","President Obama and other world leaders don't know how close they were to being seriously injured (or worse) standing next to psycho in  SA.","Is Chris Jackson as dumb as I hear - but I still like that he follows me like a good little soldier!","Initial reports say 2nd debate viewership dropped. See what happens when I am not mentioned.","At this point the legacy of the Obama Administration will be, sadly, that of THE GANG THAT COULDN'T SHOOT STRAIGHT - what a pathetic mess!","Why didn't movie Lincoln use Ford's Theater for big scene instead of the stage of an unrelated theater?","I wonder if the Rutgers coach who had the audacity to yell at the player is a proponent of global warming?","Wind farms are killing many thousands of birds. They make hunters look like nice people!","My people caught the person who committed \"\"forgery\"\" of the James Gandolfini-Obama Care phoney quote attributed to me-fraud. Arrest coming?","Watch commodity prices soar because of the freezing cold. Will be bad for the economy. We could use some global warming.","What did we get for fighting in Libya besides a dead Ambassador. Demand their oil.","Looks like we will have a pervert running for mayor after all - just what New York City needs - and he will revert back to form, always do!","The Navy Yard shooting is a horrible disaster. If we don't clean up OUR COUNTRY of the garbage soon, we are just going to do a death spiral!","Frumpy and very dumb Gail Collins, an editorial writer at The New York Times, is so lucky to even have a job. Check her out - incompetent!","There are many editorial writers that are good, some great, &amp, some bad. But the least talented of all is frumpy Gail Collins of NYTimes.","I am happy that \"\"The Job\"\" on CBS, the 16th. knockoff of the Apprentice, was just cancelled. I love to see my opponents lose (not nice)!","Why should I have the stigma of Impeachment attached to my name when I did nothing wrong. Read the Transcripts! Hose Republicans voted 195-0, plus we got three Dems. Very unfair to tens of millions of voters!","Really bad article about me in the dying (or dead) Esquire Magazine. Totally false - lots of hatred. When will this boring magazine close?","The only reason Obama gave a speech last night was because it was on the schedule-Putin is laughing and the reviews have been really bad!","Obama' ststement on Egypt was terrible and dumb-now being used by military as a rallying cry-our foreign policy is worst in U.S. history.","I loved beating these two terrible human beings. I would never recommend that anyone use her lawyer, he is a total loser!","Based on new oil prices, the ugly windfarms being built in Scotland will quickly die! What a mess!","Why did Vince and the WWE give my speech and segment the most time last night on USA Network - because that's what people want to see!","Re Kerry admitting to “working” for Pastor Abedini’s release--why has US already released Iranian spies &amp, nuclear scientist? Dumb!","Speaking of our very stupid war with Iraq, it is totally disintegrating and Iran (with Russia) will walk in and take it over (lots of oil)!","The so called 87 year old \"\"lady\"\" was a vicious and skilled investor who was trying to rip me off with made up facts and a blowhard lawyer.","The \"\"lady\"\" in Chicago that I'm fighting owes me $500, 000 and is sophisticated  &amp, vicious. She made up a story &amp, plays the \"\"age card\"\" - bad!","We are leaving Iraq after expending a tremendous amount of blood and treasure. We should be reimbursed with oil! -- Don't give it to Iran.","Huff post gets it wrong re: Ferry Point...the only leakage of gas is from Arianna Huffington.","Is PM Cameron a dummy? With monumental cuts in UK spending, how come he continues to spend billions of pounds ...","Wacko John Bolton’s “exceedingly tedious”(New York Times) book is made up of lies &amp; fake stories. Said all good about me, in print, until the day I fired him. A disgruntled boring fool who only wanted to go to war. Never had a clue, was ostracized &amp; happily dumped. What a dope!","My Campaign for President was conclusively spied on. Nothing like this has ever happened in American Politics. A really bad situation. TREASON means long jail sentences, and this was TREASON!","So some day, if a Democrat becomes President and the Republicans win the House, even by a tiny margin, they can impeach the President, without due process or fairness or any legal rights. All Republicans must remember what they are witnessing here - a lynching. But we will WIN!","Sleepy Joe Biden has spent 47 years in politics being terrible to Hispanics. Now he is relying on Castro lover Bernie Sanders to help him out. That won’t work! Remember, Miami Cubans gave me the highly honored Bay of Pigs Award for all I have done for our great Cuban Population!","....They are anti-Israel, pro Al-Qaeda, and comment on the 9/11 attack, “some people did something.” Radical Left Democrats want Open Borders, which means drugs, crime, human trafficking, and much more....","Was Andy McCabe ever forced to pay back the $700,000 illegally given to him and his wife, for his wife’s political campaign, by Crooked Hillary Clinton while Hillary was under FBI investigation, and McCabe was the head of the FBI??? Just askin’?","As President I have an obligation to end CORRUPTION, even if that means requesting the help of a foreign country or countries. It is done all the time. This has NOTHING to do with politics or a political campaign against the Bidens. This does have to do with their corruption!","Twitter “SHADOW BANNING” prominent Republicans. Not good. We will look into this discriminatory and illegal practice at once! Many complaints.","In addition to winning the Electoral College in a landslide, I won the popular vote if you deduct the millions of people who voted illegally","...LaVar, you could have spent the next 5 to 10 years during Thanksgiving with your son in China, but no NBA contract to support you. But remember LaVar, shoplifting is NOT a little thing. It’s a really big deal, especially in China. Ungrateful fool!","Seriously failed presidential candidate, Senator Elizabeth “Pocahontas” Warren, just introduced an Amendment on the renaming of many of our legendary Military Bases from which we trained to WIN two World Wars. Hopefully our great Republican Senators won’t fall for this!","Rep, Elijah Cummings has been a brutal bully, shouting and screaming at the great men &amp, women of Border Patrol about conditions at the Southern Border, when actually his Baltimore district is FAR WORSE and more dangerous. His district is considered the Worst in the USA......","......MAKE FRANCE GREAT AGAIN!","STOCK MARKET UP ANOTHER 300 POINTS - GREATEST LEADING INDICATOR OF THEM ALL!!! DON’T RUIN IT WITH SLEEPY JOE!!!","DRAIN THE SWAMP!","....Kahn reminds me very much of our very dumb and incompetent Mayor of NYC, de Blasio, who has also done a terrible job - only half his height. In any event, I look forward to being a great friend to the United Kingdom, and am looking very much forward to my visit. Landing now!","Robert De Niro, a very Low IQ individual, has received to many shots to the head by real boxers in movies. I watched him last night and truly believe he may be “punch-drunk.” I guess he doesn’t...","So funny that The New York Times &amp, The Washington Post got a Pulitzer Prize for their coverage (100% NEGATIVE and FAKE!) of Collusion with Russia - And there was No Collusion! So, they were either duped or corrupt? In any event, their prizes should be taken away by the Committee!","We are not even into February and the cost of illegal immigration so far this year is $18,959,495,168. Cost Friday was $603,331,392. There are at least 25,772,342 illegal aliens, not the 11,000,000 that have been reported for years, in our Country. So ridiculous! DHS","I have never seen a thin person drinking  Diet Coke.","Mitt Romney never knew how to win. He is a pompous “ass” who has been fighting me from the beginning, except when he begged me for my endorsement for his Senate run (I gave it to him), and when he begged me to be Secretary of State (I didn’t give it to him). He is so bad for R’s!","We should have a contest as to which of the Networks, plus CNN and not including Fox, is the most dishonest, corrupt and/or distorted in its political coverage of your favorite President (me). They are all bad. Winner to receive the FAKE NEWS TROPHY!","See, dummy Danny Zuker, who I never heard until this, started something that he couldn't finish-gutless and unwilling to take my bet!","Eliot Spitzer has failed at everything he has ever done, and now he wants to be comptroller. Thrown out of politics and off of TV, CRAZY!","A certain whack job, Go Angelo, who doesn't have a life- spends his time hopelessly attacking me re: Macy's....","These are the things and events that happen when a sacred landslide election victory is so unceremoniously &amp; viciously stripped away from great patriots who have been badly &amp; unfairly treated for so long. Go home with love &amp; in peace. Remember this day forever!","....These THUGS are dishonoring the memory of George Floyd, and I won’t let that happen. Just spoke to Governor Tim Walz and told him that the Military is with him all the way. Any difficulty and we will assume control but, when the looting starts, the shooting starts. Thank you!","We are up BIG, but they are trying to STEAL the Election. We will never let them do it. Votes cannot be cast after the Polls are closed!","I got Impeached last night without one Republican vote being cast with the Do Nothing Dems on their continuation of the greatest Witch Hunt in American history. Now the Do Nothing Party want to Do Nothing with the Articles &amp, not deliver them to the Senate, but it’s Senate’s call!","Crazy Bernie Sanders recently equated the City of Baltimore to a THIRD WORLD COUNTRY! Based on that statement, I assume that Bernie must now be labeled a Racist, just as a Republican would if he used that term and standard! The fact is, Baltimore can be brought back, maybe......","Funny how lowly rated CNN, and others, can criticize me at will, even blaming me for the current spate of Bombs and ridiculously comparing this to September 11th and the Oklahoma City bombing, yet when I criticize them they go wild and scream, “it’s just not Presidential!”","...The consent decree signed by the “Secretary”, with the consent of Kemp, is perhaps even more poorly negotiated than the deal that John Kerry made with Iran. Now it turns out that Brad R’s brother works for China, and they definitely don’t want “Trump”. So disgusting! #MAGA","THEY SPIED ON MY CAMPAIGN (We will never forget)!","Just returned to Washington from France and the very successful G-7, only to find that the Fake News is still trying to perpetuate the phony story that I wanted to use Nuclear weapons to blow up hurricanes before they reach shore. This is so ridiculous, never happened!","The Theater must always be a safe and special place.The cast of Hamilton was very rude last night to a very good man, Mike Pence. Apologize!","Wow, nobody realized how far Mini Mike Bloomberg went in bribing ex-prisoners to go out and vote for Sleepy Joe. He is desperate to get back into the good graces of the people who not only badly beat him, but made him look like a total fool. Now he’s committed a serious crime!","There is NO WAY (ZERO!) that Mail-In Ballots will be anything less than substantially fraudulent. Mail boxes will be robbed, ballots will be forged &amp; even illegally printed out &amp; fraudulently signed. The Governor of California is sending Ballots to millions of people, anyone.....","FAKE NEWS - THE ENEMY OF THE PEOPLE!","CNN’S slogan is CNN, THE MOST TRUSTED NAME IN NEWS. Everyone knows this is not true, that this could, in fact, be a fraud on the American Public. There are many outlets that are far more trusted than Fake News CNN. Their slogan should be CNN, THE LEAST TRUSTED NAME IN NEWS!","When I looked up to the sky and jokingly said “I am the chosen one,” at a press conference two days ago, referring to taking on Trade with China, little did I realize that the media would claim that I had a “Messiah complex.” They knew I was kidding, being sarcastic, and just....","Ted Wheeler, the wacky Radical Left Do Nothing Democrat Mayor of Portland, who has watched great death and destruction of his City during his tenure, thinks this lawless situation should go on forever. Wrong! Portland will never recover with a fool for a Mayor....","I would NEVER have taken the endorsement of the man who, through gross incompetence, poisoned the people of Flint, Michigan. Former RINO Governor Rick Snyder should be ashamed of himself and his service. I was asked to help fix it. Biden took his endorsement. VOTE TRUMP!!!","It was just explained to me that for next weeks Fake Hearing (trial) in the House, as they interview Never Trumpers and others, I get NO LAWYER &amp, NO DUE PROCESS. It is a Pelosi, Schiff, Scam against the Republican Party and me. This Witch Hunt should not be allowed to proceed!","...It is all a GIANT AND ILLEGAL HOAX, developed long before the election itself, but used as an excuse by the Democrats as to why Crooked Hillary Clinton lost the Election! Someday the Fake News Media will turn honest &amp, report that Donald J. Trump was actually a GREAT Candidate!","Democrats, please do not distance yourselves from Nancy Pelosi. She is a wonderful person whose ideas &amp, policies may be bad, but who should definitely be given a 4th chance. She is trying very hard &amp, has every right to take down the Democrat Party if she has veered too far left!","....untruthful slime ball who was, as time has proven, a terrible Director of the FBI. His handling of the Crooked Hillary Clinton case, and the events surrounding it, will go down as one of the worst “botch jobs” of history. It was my great honor to fire James Comey!","....to President of the United States (on my first try). I think that would qualify as not smart, but genius....and a very stable genius at that!","Little Adam Schiff, who is desperate to run for higher office, is one of the biggest liars and leakers in Washington, right up there with Comey, Warner, Brennan and Clapper! Adam leaves closed committee hearings to illegally leak confidential information. Must be stopped!","A massive 200 Billion Dollar Sea Wall, built around New York to protect it from rare storms, is a costly, foolish &amp; environmentally unfriendly idea that, when needed, probably won’t work anyway. It will also look terrible. Sorry, you’ll just have to get your mops &amp; buckets ready!","Alec Baldwin, whose dying mediocre career was saved by his terrible impersonation of me on SNL, now says playing me was agony. Alec, it was agony for those who were forced to watch. Bring back Darrell Hammond, funnier and a far greater talent!","The Paris Agreement isn’t working out so well for Paris. Protests and riots all over France. People do not want to pay large sums of money, much to third world countries (that are questionably run), in order to maybe protect the environment. Chanting “We Want Trump!” Love France.","The Fake Mainstream Media has, from the time I announced I was running for President, run the most highly sophisticated &amp, dishonest Disinformation Campaign in the history of politics. No matter how well WE do, they find fault. But the forgotten men &amp, women WON, I’m President!","Mexico was just ranked the second deadliest country in the world, after only Syria. Drug trade is largely the cause. We will BUILD THE WALL!","Our record Economy would CRASH, just like in 1929, if any of those clowns became President!","The “Squad” is a very Racist group of troublemakers who are young, inexperienced, and not very smart. They are pulling the once great Democrat Party far left, and were against humanitarian aid at the Border...And are now against ICE and Homeland Security. So bad for our Country!","The Fake News Media has NEVER been more Dishonest or Corrupt than it is right now. There has never been a time like this in American History. Very exciting but also, very sad! Fake News is the absolute Enemy of the People and our Country itself!","For years Fake stories and investigations, then the phony Russia, Russia, Russia HOAX, next Ukraine and the failed Impeachment, now the crummy Atlantic Magazine’s MADE UP STORY, and lastly, the political hit job by rapidly fading Bob Woodward and his boring book. It never ends!","So funny to see little Adam Schitt (D-CA) talking about the fact that Acting Attorney General Matt Whitaker was not approved by the Senate, but not mentioning the fact that Bob Mueller (who is highly conflicted) was not approved by the Senate!","Is it legal for a sitting President to be \"\"wire tapping\"\" a race for president prior to an election? Turned down by court earlier. A NEW LOW!","Mini Mike Bloomberg, who made a fool of himself on the Dems debate stage when Elizabeth Warren &amp; the others simply took him apart, is going “crazy” trying to buy his way back into the Liberal Democrat’s hearts. His Florida ads are lies. I am much better for SENIORS than Sleepy!","Heading to Davos, Switzerland, to meet with World and Business Leaders and bring Good Policy and additional Hundreds of Billions of Dollars back to the United States of America! We are now NUMBER ONE in the Universe, by FAR!!","So Crazy to watch Senator Blumenthal of Connecticut lecture all on morals &amp; ethics when for 25 years he said he was a Great War Hero in Vietnam, and he was never even there. He lied &amp; cheated right up until the day he got caught. Thank you to those in military who turned him in!","NO COLLUSION, NO OBSTRUCTION, TOTAL EXONERATION. DEMOCRAT WITCH HUNT!","WHERE’S HUNTER?","George Conway, often referred to as Mr. Kellyanne Conway by those who know him, is VERY jealous of his wife’s success &amp, angry that I, with her help, didn’t give him the job he so desperately wanted. I barely know him but just take a look, a stone cold LOSER &amp, husband from hell!","TREASON?","Just heard Foreign Minister of North Korea speak at U.N. If he echoes thoughts of Little Rocket Man, they won't be around much longer!","A vote for Democrats in November is a vote to let MS-13 run wild in our communities, to let drugs pour into our cities, and to take jobs and benefits away from hardworking Americans. Democrats want anarchy, amnesty and chaos - Republicans want LAW, ORDER and JUSTICE!","Everywhere Marie Yovanovitch went turned bad. She started off in Somalia, how did that go? Then fast forward to Ukraine, where the new Ukrainian President spoke unfavorably about her in my second phone call with him. It is a U.S. President’s absolute right to appoint ambassadors.","What the Democrats have done in trying to steal a Presidential Election, first at the “ballot box” and then, after that failed, with the “Insurance Policy,” is the biggest Scandal in the history of our Country!",".....trial in the Senate, and so that our Country can get back to business. We will have Schiff, the Bidens, Pelosi and many more testify, and will reveal, for the first time, how corrupt our system really is. I was elected to “Clean the Swamp,” and that’s what I am doing!","A vote for Joe Biden is a vote to extinguish and eradicate your state’s auto industry. Biden is a corrupt politician who SOLD OUT Michigan to CHINA. Biden is the living embodiment of the decrepit and depraved political class that got rich bleeding America Dry!","I think that Crooked Hillary Clinton should enter the race to try and steal it away from Uber Left Elizabeth Warren. Only one condition. The Crooked one must explain all of her high crimes and misdemeanors including how &amp, why she deleted 33,000 Emails AFTER getting “C” Subpoena!","The Rigged Witch Hunt, originally headed by FBI lover boy Peter S (for one year) &amp, now, 13 Angry Democrats, should look into the missing DNC Server, Crooked Hillary’s illegally deleted Emails, the Pakistani Fraudster, Uranium One, Podesta &amp, so much more. It’s a Democrat Con Job!","Crooked Hillary Clinton’s top aid, Huma Abedin, has been accused of disregarding basic security protocols. She put Classified Passwords into the hands of foreign agents. Remember sailors pictures on submarine? Jail! Deep State Justice Dept must finally act? Also on Comey &amp, others","Mini Mike is now negotiating both to get on the Democrat Primary debate stage, and to have the right to stand on boxes, or a lift, during the debates. This is sometimes done, but really not fair!","Remember, Michael Cohen only became a “Rat” after the FBI did something which was absolutely unthinkable &amp, unheard of until the Witch Hunt was illegally started. They BROKE INTO AN ATTORNEY’S OFFICE! Why didn’t they break into the DNC to get the Server, or Crooked’s office?","Why did the Obama Administration start an investigation into the Trump Campaign (with zero proof of wrongdoing) long before the Election in November? Wanted to discredit so Crooked H would win. Unprecedented. Bigger than Watergate! Plus, Obama did NOTHING about Russian meddling.","The Dems have tried every trick in the playbook-call me everything under the sun. But if I’m all of those terrible things, how come I beat them so badly, 306-223? Maybe they’re just not very good! The fact is they are going CRAZY only because they know they can’t beat me in 2020!","Nobody wants to say that if Elizabeth Warren gets out of the race before Super Tuesday, Crazy Bernie Sanders wins virtually every state in a blowout...NOT EVEN CLOSE!  I haven’t heard one member of the Fake News Establishment even mention this irrefutable fact. FAKE NEWS!","I am the only person in America who could say that, “I’m bringing our great troops back home, with victory,” and get BAD press. It is Fake News and Pundits who have FAILED for years that are doing the complaining. If I stayed in Endless Wars forever, they would still be unhappy!","FAKE POLLING, just like 2016 (but worse)!","“WE’RE NOT GOING TO MAKE AMERICA GREAT AGAIN, IT WAS NEVER THAT GREAT.” Can you believe this is the Governor of the Highest Taxed State in the U.S., Andrew Cuomo, having a total meltdown!","Just out: MEDIAN HOUSEHOLD INCOME IS AT THE HIGHEST POINT EVER, EVER, EVER! How about saying it this way, IN THE HISTORY OF OUR COUNTRY! Also, MORE PEOPLE WORKING TODAY IN THE USA THAN AT ANY TIME IN HISTORY! Tough numbers for the Radical Left Democrats to beat! Impeach the Pres.","The Republican Party, and me, had a GREAT day yesterday with respect to the phony Impeachment Hoax, &amp, yet, when I got home to the White House &amp, checked out the news coverage on much of television, you would have no idea they were reporting on the same event. FAKE &amp, CORRUPT NEWS!","....History shows that a school shooting lasts, on average, 3 minutes. It takes police &amp, first responders approximately 5 to 8 minutes to get to site of crime. Highly trained, gun adept, teachers/coaches would solve the problem instantly, before police arrive. GREAT DETERRENT!","So it was indeed (just proven in court papers) “last in his class” (Annapolis) John McCain that sent the Fake Dossier to the FBI and Media hoping to have it printed BEFORE the Election. He &amp, the Dems, working together, failed (as usual). Even the Fake News refused this garbage!","Got to see, by accident, wacko comedian Bill Maher’s show - So many lies. He said patients in El Paso hospital didn’t want to meet with me. Wrong! Had really great meetings with numerous patients. Said I was on vacation. Wrong! Long planned fix up of W.H., stay here rather than..","Report just out: “China hacked Hillary Clinton’s private Email Server.” Are they sure it wasn’t Russia (just kidding!)? What are the odds that the FBI and DOJ are right on top of this? Actually, a very big story. Much classified information!","I guess the magazine, “Christianity Today,” is looking for Elizabeth Warren, Bernie Sanders, or those of the socialist/communist bent, to guard their religion. How about Sleepy Joe? The fact is, no President has ever done what I have done for Evangelicals, or religion itself!","...caused over so many years. Any attack by Iran, in any form, against the United States will be met with an attack on Iran that will be 1,000 times greater in magnitude!","PLENTY OF OIL!","WHO CHANGED THE LONG STANDING WHISTLEBLOWER RULES JUST BEFORE SUBMITTAL OF THE FAKE WHISTLEBLOWER REPORT? DRAIN THE SWAMP!","It wasn’t the White House, it wasn’t the State Department, it wasn’t father LaVar’s so-called people on the ground in China that got his son out of a long term prison sentence - IT WAS ME. Too bad! LaVar is just a poor man’s version of Don King, but without the hair. Just think..","Thank you to the Cherokee Nation for revealing that Elizabeth Warren, sometimes referred to as Pocahontas, is a complete and total Fraud!","I think what the Democrats are doing with the Border is TREASONOUS. Their Open Border mindset is putting our Country at risk. Will not let this happen!","Pocahontas (the bad version), sometimes referred to as Elizabeth Warren, is getting slammed. She took a bogus DNA test and it showed that she may be 1/1024, far less than the average American. Now Cherokee Nation denies her, “DNA test is useless.” Even they don’t want her. Phony!","Russia, Russia, Russia! That’s all you heard at the beginning of this Witch Hunt Hoax...And now Russia has disappeared because I had nothing to do with Russia helping me to get elected. It was a crime that didn’t exist. So now the Dems and their partner, the Fake News Media,.....","Almost nobody showed up to the Sleepy Joe Biden “Rally” in Ohio. The reporting and polls are a Media Con Job - Fake News. We have far more support and enthusiasm than even in 2016. November 3rd. will be a great day for America!!!  #MAGA","Reason I canceled my trip to London is that I am not a big fan of the Obama Administration having sold perhaps the best located and finest embassy in London for “peanuts,” only to build a new one in an off location for 1.2 billion dollars. Bad deal. Wanted me to cut ribbon-NO!","Just heard that Wacko John Bolton was talking of the fact that I discussed “love letters from Kim Jong Un” as though I viewed them as just that. Obviously, was just being sarcastic. Bolton was such a jerk!","....cause big disruption by going to Manhattan. Working almost all of the time, including evenings. Don’t have to be in W.H. to do that...And sooo many other false statements. He is right about one thing, though. I will win again in 2020. Otherwise, he pays 95% in taxes!","Airplanes are becoming far too complex to fly. Pilots are no longer needed, but rather computer scientists from MIT. I see it all the time in many products. Always seeking to go one unnecessary step further, when often old and simpler is far better. Split second decisions are....","The Florida Election should be called in favor of Rick Scott and Ron DeSantis in that large numbers of new ballots showed up out of nowhere, and many ballots are missing or forged. An honest vote count is no longer possible-ballots massively infected. Must go with Election Night!","Meryl Streep, one of the most over-rated actresses in Hollywood, doesn't know me but attacked last night at the Golden Globes. She is a.....","We cannot allow all of these people to invade our Country. When somebody comes in, we must immediately, with no Judges or Court Cases, bring them back from where they came. Our system is a mockery to good immigration policy and Law and Order. Most children come without parents...","A TOTAL WITCH HUNT!!!","I often stated, “One way or the other, Mexico is going to pay for the Wall.” This has never changed. Our new deal with Mexico (and Canada), the USMCA, is so much better than the old, very costly &amp, anti-USA NAFTA deal, that just by the money we save, MEXICO IS PAYING FOR THE WALL!","Elizabeth “Pocahontas” Warren, who was going nowhere except into Mini Mike’s head, just dropped out of the Democrat Primary...THREE DAYS TOO LATE. She cost Crazy Bernie, at least, Massachusetts, Minnesota and Texas. Probably cost him the nomination! Came in third in Mass.","Are any Democrat operatives, the DNC, or Crooked Hillary Clinton, blaming Russia, Russia, Russia for the Bernie Sanders win in Nevada. If so I suggest calling Bob Mueller &amp; the 13 Angry Democrats to do a new Mueller Report, Democrat Edition. Bob will get to the bottom of it!","Lyin’ Brian Williams of MSDNC, a Concast Scam Company, wouldn’t know the truth if it was nailed to his wooden forehead. Remember when he lied about his bravery in a helicopter? Totally made up story. He’s a true dummy who was thrown off Network News like a dog. Stay tuned!","....Mueller was NOT fired and was respectfully allowed to finish his work on what I, and many others, say was an illegal investigation (there was no crime), headed by a Trump hater who was highly conflicted, and a group of 18 VERY ANGRY Democrats. DRAIN THE SWAMP!","Mail-In Ballots will lead to massive electoral fraud and a rigged 2020 Election. Look at all of the cases and examples that are out there right now, with the Patterson, N.J., being the most recent example. Republicans, in particular, cannot let this happen!","Looking more &amp, more like the Trump Campaign for President was illegally being spied upon (surveillance) for the political gain of Crooked Hillary Clinton and the DNC. Ask her how that worked out - she did better with Crazy Bernie. Republicans must get tough now. An illegal Scam!","Failed RINO former Governor Rick Snyder of Michigan was a disaster with respect to the Flint Water CATASTROPHE, and a very bad Governor overall. He hurt so many people with his gross incompetence. He reminds me of Sleepy Joe!","..so called American Intelligence were Dirty Cops who have now proven to be sleazebags at the highest level like James Comey, proven liar James Clapper, &amp; perhaps the lowest of them all, Wacko John Brennan who headed the CIA, you could perhaps understand my reluctance to embrace!","Joe Biden got tongue tied over the weekend when he was unable to properly deliver a very simple line about his decision to run for President. Get used to it, another low I.Q. individual!","Every day, the brave men and women of ICE are liberating communities from savage gangs like MS-13. We will NOT stand for these vile Democrat smears in law enforcement. We will always stand proudly with the BRAVE HEROES of ICE and BORDER PATROL!","The Fake Washington Post keeps doing phony stories, with zero sources, that I am concerned with the Impeachment scam. I am not because I did nothing wrong. It is the other side, including Schiff and his made up story, that are concerned. Witch Hunt continues!","When will they open a Cold Case on the Psycho Joe Scarborough matter in Florida. Did he get away with murder? Some people think so. Why did he leave Congress so quietly and quickly? Isn’t it obvious? What’s happening now? A total nut job!","The Mueller Angry Democrats recently deleted approximately 19,000 Text messages between FBI Agent Lisa Page and her lover, Agent Peter S. These Texts were asked for and INVALUABLE to the truth of the Witch Hunt Hoax. This is a total Obstruction of Justice. All Texts Demanded!","....This is the biggest political crime in American History, by far. SIMPLY PUT, THE PARTY IN POWER ILLEGALLY SPIED ON MY CAMPAIGN, BOTH BEFORE AND AFTER THE ELECTION, IN ORDER TO CHANGE OR NULLIFY THE RESULTS OF THE ELECTION. IT CONTINUED ON WITH THE IMPEACHMENT HOAX. Terrible!","....care how many lives the ruin. These are Angry People, including the highly conflicted Bob Mueller, who worked for Obama for 8 years. They won’t even look at all of the bad acts and crimes on the other side. A TOTAL WITCH HUNT LIKE NO OTHER IN AMERICAN HISTORY!","....had happened to a Presidential candidate, or President, who was a Democrat, everybody involved would long ago be in jail for treason (and more), and it would be considered the CRIME OF THE CENTURY, far bigger and more sinister than Watergate!","Nothing funny about tired Saturday Night Live on Fake News NBC! Question is, how do the Networks get away with these total Republican hit jobs without retribution? Likewise for many other shows? Very unfair and should be looked into. This is the real Collusion!","There is No Collusion! The Robert Mueller Rigged Witch Hunt, headed now by 17 (increased from 13, including an Obama White House lawyer) Angry Democrats, was started by a fraudulent Dossier, paid for by Crooked Hillary and the DNC. Therefore, the Witch Hunt is an illegal Scam!","“I don’t think there’s any chance whatsoever of Senator Sanders defeating President Trump.” Mini Mike Bloomberg. Mini, there’s even less chance, especially after watching your debate performance last night, of you winning the Democrat nomination...But I hope you do!","The Stock Market is up massively since the Election, but is now taking a little pause - people want to see what happens with the Midterms. If you want your Stocks to go down, I strongly suggest voting Democrat. They like the Venezuela financial model, High Taxes &amp, Open Borders!"]