["Reason I canceled my trip to London is that I am not a big fan of the Obama Administration having sold perhaps the best located and finest embassy in London for “peanuts,” only to build a new one in an off location for 1.2 billion dollars. Bad deal. Wanted me to cut ribbon-NO!","Sorry, I don’t buy Rep. Tlaib’s tears. I have watched her violence, craziness and, most importantly, WORDS, for far too long. Now tears? She hates Israel and all Jewish people. She is an anti-Semite. She and her 3 friends are the new face of the Democrat Party. Live with it!","With autism being way up, what do we have to lose by having doctors give small dose vaccines vs. big pump doses into those tiny bodies?","Ted Cruz didn't win Iowa, he stole it. That is why all of the polls were so wrong and why he got far more votes than anticipated. Bad!","I am getting great credit for my press conference today. Crooked Hillary should be admonished for not having a press conference in 179 days.","So Robert Mueller has now asked for his long time Never Trumper lawyer to sit beside him and help with answers. What’s this all about? His lawyer represented the “basement server guy” who got off free in the Crooked Hillary case. This should NOT be allowed. Rigged Witch Hunt!","....They are anti-Israel, pro Al-Qaeda, and comment on the 9/11 attack, “some people did something.” Radical Left Democrats want Open Borders, which means drugs, crime, human trafficking, and much more....","....The Democrats, none of whom voted for Jeff Sessions, must love him now. Same thing with Lyin’ James Comey. The Dems all hated him, wanted him out, thought he was disgusting - UNTIL I FIRED HIM! Immediately he became a wonderful man, a saint like figure in fact. Really sick!","It's record cold all over the country and world - where the hell is global warming, we need some fast!","See you in Washington, DC, on January 6th. Don’t miss it. Information to follow!","Happy Father's Day to all, even the haters and losers!","The Whistleblower gave false information &amp, dealt with corrupt politician Schiff. He must be brought forward to testify. Written answers not acceptable! Where is the 2nd Whistleblower? He disappeared after I released the transcript. Does he even exist? Where is the informant? Con!","The Arab League stated that it wants nothing to do with an attack on Syria, but they want us to attack.Are our leaders insane or just stupid","Record low temperatures and massive amounts of snow. Where the hell is GLOBAL WARMING?","I recommend that Nervous Nancy Pelosi (who backed up Schiff’s lie), Shifty Adam Schiff, Sleepy Joe Biden, the Whistleblower (who miraculously disappeared after I released the transcript of the call), the 2nd Whistleblower (who also disappeared), &amp, the I.G., be part of the list!","....Paul Ryan almost killed the Republican Party. Weak, ineffective &amp, stupid are not exactly the qualities that Republicans, or the CITIZENS of our Country, were looking for. Right now our spirit is at an all time high, far better than the Radical Left Dems. You’ll see next year!","......MAKE FRANCE GREAT AGAIN!","Crazy Maxine Waters, said by some to be one of the most corrupt people in politics, is rapidly becoming, together with Nancy Pelosi, the FACE of the Democrat Party. Her ranting and raving, even referring to herself as a wounded animal, will make people flee the Democrats!","Lebron James was just interviewed by the dumbest man on television, Don Lemon. He made Lebron look smart, which isn’t easy to do. I like Mike!","Here we go! I stated long ago that we should cancel all flights from West Africa. Now we have Ebola in U.S., AND IT WILL ONLY GET WORSE!","Ebola patient will be brought to the U.S. in a few days - now I know for sure that our  leaders are incompetent. KEEP THEM OUT OF HERE!","Get smart on knockout assaults and crime - we have to be slightly more vicious (and violent) than the assaulter-and crime would end FAST!","So now tha Matt Lauer is gone when will the Fake News practitioners at NBC be terminating the contract of Phil Griffin? And will they terminate low ratings Joe Scarborough based on the “unsolved mystery” that took place in Florida years ago? Investigate!","Obama will let Ebola fly into US &amp, drugrunners cross our border daily. But he won't pressure Mexico on Sgt. Tahmooressi. #FreeOurMarine","Well, Obama refused to say (he just can't say it), that we are at WAR with RADICAL ISLAMIC TERRORISTS.","Mexico was just ranked the second deadliest country in the world, after only Syria. Drug trade is largely the cause. We will BUILD THE WALL!","Goofy Elizabeth Warren is now using the woman’s card like her friend crooked Hillary. See her dumb tweet “when a woman stands up to you...”","I think Senator Blumenthal should take a nice long vacation in Vietnam, where he lied about his service, so he can at least say he was there","No more massive injections. Tiny children are not horses—one vaccine at a time, over time.","Many people walked out on Madonna's concert when she told them to vote for Obama. Years ago I walked out because the concert was terrible!","So where are all the missing Text messages between fired FBI agents Peter S and the lovely Lisa Page, his lover. Just reported that they have been erased and wiped clean. What an outrage as the totally compromised and conflicted Witch Hunt moves ever so slowly forward. Want them!","Why did the Obama Administration start an investigation into the Trump Campaign (with zero proof of wrongdoing) long before the Election in November? Wanted to discredit so Crooked H would win. Unprecedented. Bigger than Watergate! Plus, Obama did NOTHING about Russian meddling.","....These THUGS are dishonoring the memory of George Floyd, and I won’t let that happen. Just spoke to Governor Tim Walz and told him that the Military is with him all the way. Any difficulty and we will assume control but, when the looting starts, the shooting starts. Thank you!","....FISA abuse, Christopher Steele &amp, his phony and corrupt Dossier, the Clinton Foundation, illegal surveillance of Trump Campaign, Russian collusion by Dems - and so much more. Open up the papers &amp, documents without redaction? Come on Jeff, you can do it, the country is waiting!","New polls out today are very good considering that much of the media is FAKE and almost always negative. Would still beat Hillary in .....","Joe Biden got tongue tied over the weekend when he was unable to properly deliver a very simple line about his decision to run for President. Get used to it, another low I.Q. individual!","If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!","Just like Radical Left New York is trying to destroy the NRA, if Biden becomes President your GREAT SECOND AMENDMENT doesn’t have a chance. Your guns will be taken away, immediately and without notice. No police, no guns!","They just happened to find 50,000 ballots late last night. The USA is embarrassed by fools. Our Election Process is worse than that of third world countries!","President Obama and other world leaders don't know how close they were to being seriously injured (or worse) standing next to psycho in  SA.","Radical Left Democrats are going CRAZY!","You must admit that Bryant Gumbel is one of the dumbest racists around - an arrogant dope with no talent. Failed at CBS etc-why still on TV?","There was No Collusion with Russia (except by the Democrats). When will this very expensive Witch Hunt Hoax ever end? So bad for our Country. Is the Special Counsel/Justice Department leaking my lawyers letters to the Fake News Media? Should be looking at Dems corruption instead?","So it was indeed (just proven in court papers) “last in his class” (Annapolis) John McCain that sent the Fake Dossier to the FBI and Media hoping to have it printed BEFORE the Election. He &amp, the Dems, working together,  failed (as usual). Even the Fake News refused this garbage!","More text messages between former FBI employees Peter Strzok and Lisa Page are a disaster and embarrassment to the FBI &amp, DOJ. This should never have happened but we are learning more and more by the hour. “Others were leaking like mad” in order to get the President! ........","...Maybe the best thing to do would be to cancel all future \"\"press briefings\"\" and hand out written responses for the sake of accuracy???","I guess Obama's Cairo Speech really worked out. The Muslim Brotherhood stormed our embassy on 9.11. Imagine if Obama speaks in Beijing?","Crooked Hillary Clinton made up facts about me, and \"\"forgot\"\" to mention the many problems of our country, in her very average scream!","....Russia, Iran, Syria &amp, many others are not happy about the U.S. leaving, despite what the Fake News says, because now they will have to fight ISIS and others, who they hate, without us. I am building by far the most powerful military in the world. ISIS hits us they are doomed!","The Mainstream Media is under fire and being scorned all over the World as being corrupt and FAKE. For two years they pushed the Russian Collusion Delusion when they always knew there was No Collusion. They truly are the Enemy of the People and the Real Opposition Party!","....non-existent “sources” and a drunk/drugged up loser who hates Michael, a fine person with a wonderful family. Michael is a businessman for his own account/lawyer who I have always liked &amp, respected. Most people will flip if the Government lets them out of trouble, even if....","Elizabeth Warren is being hammered, even by the Left. Her false claim of Indian heritage is only selling to VERY LOW I.Q. individuals!","...vacationing, relaxing &amp; making shady deals with other countries, &amp; that Barack was always playing golf, doing much of his traveling in a fume spewing 747 to play golf in Hawaii - Once even teeing off immediately after announcing the gruesome death of a great young man by ISIS!","CNN’S slogan is CNN, THE MOST TRUSTED NAME IN NEWS. Everyone knows this is not true, that this could, in fact, be a fraud on the American Public. There are many outlets that are far more trusted than Fake News CNN. Their slogan should be CNN, THE LEAST TRUSTED NAME IN NEWS!","Was President Obama in charge of this years Academy Awards - they remind me of the ObamaCare website!  #Oscars.","The Crazed and Dishonest Washington Post again purposely got it wrong. Mexico, for the first time in decades, is meaningfully apprehending illegals at THEIR Southern Border, before the long march up to the U.S. This is great and the way it should be. The big flow will stop.......","Windmills are the greatest threat in the US to both bald and golden eagles. Media claims fictional ‘global warming’ is worse.","Pelosi is now leading a delegation of 9, including Corrupt Adam Schiff, to Jordan to check out Syria. She should find out why Obama drew The Red Line In the Sand, &amp, then did NOTHING, losing Syria &amp, all respect. I did something, 58 missiles. One million died under Obama’s mistake!","The U.S. is spending fortunes at airports checking people coming in from West Africa, with uncertain results. STOP THE FLIGHTS YOU DUMB B's!","If the morons who killed all of those people at Charlie Hebdo would have just waited, the magazine would have folded - no money, no success!","Now Mini Mike Bloomberg is critical of Jack Wilson, who saved perhaps hundreds of people in a Church because he was carrying a gun, and knew how to use it. Jack quickly killed the shooter, who was beginning a rampage. Mini is against the 2nd A. His ads are Fake, just like him!","Iran is moving troops into Iraq under the guise that it is helping out. Actually, they will take over Iraq and all of their oil. Stupid U.S.","Just saw Crooked Hillary and Tim Kaine together. ISIS and our other enemies are drooling. They don't look presidential to me!","Now the press is trying to sell the fact that I wanted a Moot stuffed with alligators and snakes, with an electrified fence and sharp spikes on top, at our Southern Border. I may be tough on Border Security, but not that tough. The press has gone Crazy. Fake News!","....Dumb and Sick. A really bad show with low ratings - and will only get worse. CNN has been a proven and long term ratings and beyond disaster. In fact, it rewarded Chris Cuomo with a now unsuccessful prime time slot, despite his massive failure in the morning. Only on CNN!","The Radical Left Democrats and their Fake News Media partners, headed up again by Little Adam Schiff, and batting Zero for 21 against me, are at it again! They think I may have had a “dicey” conversation with a certain foreign leader based on a “highly partisan” whistleblowers..","....to President of the United States (on my first try). I think that would qualify as not smart, but genius....and a very stable genius at that!","Nobody wants to say that if Elizabeth Warren gets out of the race before Super Tuesday, Crazy Bernie Sanders wins virtually every state in a blowout...NOT EVEN CLOSE!  I haven’t heard one member of the Fake News Establishment even mention this irrefutable fact. FAKE NEWS!","WHO IS GOING TO GET IRAQ'S OIL???????","....Ever since Andrew came to my office to ask that I appoint him to the U.S. Supreme Court, and I said NO, he has been very hostile! Also asked for pardon for his friend. A good “pal” of low ratings Shepard Smith.",".....China does not want Tariffs!","I went to Wharton, made over $8 billion, employ thousands of people &amp, get insulted by morons who can’t get enough of me on twitter...!","Crazy Lawrence O’Donnell, who has been calling me wrong from even before I announced my run for the Presidency, even being previously forced by NBC to apologize, which he did while crying, for things he said about me &amp, The Apprentice, was again forced to apologize, this time.....","Nobody but Donald Trump will save Israel. You are wasting your time with these politicians and political clowns. Best! #SheldonAdelson","Thank you to the Cherokee Nation for revealing that Elizabeth Warren, sometimes referred to as Pocahontas, is a complete and total Fraud!","For the sake of New York City, all recent sexting victims of Anthony ‘Carlos Danger’ Weiner should come forward.","Isn't it interesting that immediately after September 11th, everybody was asking for, and indeed demanding, torture of any kind. No reports!","Eliot Spitzer has failed at everything he has ever done, and now he wants to be comptroller. Thrown out of politics and off of TV, CRAZY!","The concept of global warming was created by and for the Chinese in order to make U.S. manufacturing non-competitive.","Today Elizabeth Warren, sometimes referred to by me as Pocahontas, joined the race for President. Will she run as our first Native American presidential candidate, or has she decided that after 32 years, this is not playing so well anymore? See you on the campaign TRAIL, Liz!","Remember when \"\"comedian\"\" Bill Maher openly praised the disgusting terrorists who destroyed the World Trade Center-then got canned by ABC?","The \"\"Intelligence\"\" briefing on so-called \"\"Russian hacking\"\" was delayed until Friday, perhaps more time needed to build a case. Very strange!","So funny to watch Steve Kerr grovel and pander when asked a simple question about China. He chocked, and looks weak and pathetic. Don’t want him at the White House!","If Iran wants to fight, that will be the official end of Iran. Never threaten the United States again!","The Mueller Angry Democrats recently deleted approximately 19,000 Text messages between FBI Agent Lisa Page and her lover, Agent Peter S. These Texts were asked for and INVALUABLE to the truth of the Witch Hunt Hoax. This is a total Obstruction of Justice. All Texts Demanded!","Breaking News: 50,000 OHIO VOTERS getting WRONG ABSENTEE BALLOTS. Out of control. A Rigged Election!!!","Why are we sending thousands of ill-trained soldiers into Ebola infested areas of Africa! Bring the plague back to U.S.? Obama is so stupid.","Failed presidential candidate (thank you President Trump!), Carly Fiorina, said she will be voting for Corrupt Joe Biden. She lost so badly to me, twice in one campaign, that she should be voting for Joe. No complaints!!!","The Stock Market is up massively since the Election, but is now taking a little pause - people want to see what happens with the Midterms. If you want your Stocks to go down, I strongly suggest voting Democrat. They like the Venezuela financial model, High Taxes &amp, Open Borders!","If Illegal Immigrants are unhappy with the conditions in the quickly built or refitted detentions centers, just tell them not to come. All problems solved!","Low energy Jeb Bush just endorsed a man he truly hates, Lyin’ Ted Cruz. Honestly, I can’t blame Jeb in that I drove him into oblivion!","Ebola has been confirmed in N.Y.C., with officials frantically trying to find all of the people and things he had contact with.Obama's fault","Put pressure on the Democrats to end the horrible law that separates children from there parents once they cross the Border into the U.S. Catch and Release, Lottery and Chain must also go with it and we MUST continue building the WALL! DEMOCRATS ARE PROTECTING MS-13 THUGS.","Robert Mueller and Leakin’ Lyin’ James Comey are Best Friends, just one of many Mueller Conflicts of Interest. And bye the way, wasn’t the woman in charge of prosecuting Jerome Corsi (who I do not know) in charge of “legal” at the corrupt Clinton Foundation? A total Witch Hunt...","Looking more &amp, more like the Trump Campaign for President was illegally being spied upon (surveillance) for the political gain of Crooked Hillary Clinton and the DNC. Ask her how that worked out - she did better with Crazy Bernie. Republicans must get tough now. An illegal Scam!","Crooked Hillary should not be allowed to run for president. She deleted 33,000 e-mails AFTER getting a subpoena from U.S. Congress. RIGGED!","Our Crazy, Do Nothing (where’s USMCA, infrastructure, lower drug pricing &amp, much more?) Speaker of the House, Nervous Nancy Pelosi, who is petrified by her Radical Left knowing she will soon be gone (they &amp, Fake News Media are her BOSS), suggested on Sunday’s DEFACE THE NATION....","Biggest outrage yet in the long, winding and highly conflicted Mueller Witch Hunt is the fact that 19,000 demanded Text messages between Peter Strzok and his FBI lover, Lisa Page, were purposely &amp, illegally deleted. Would have explained whole Hoax, which is now under protest!","The President of Taiwan CALLED ME today to wish me congratulations on winning the Presidency. Thank you!","I love watching these poor, pathetic people (pundits) on television working so hard and so seriously to try and figure me out. They can't!","Nobody would fight harder for free speech than me but why  taunt, over and over again, in order to provoke possible death to audience. DUMB!","Speaking of our very stupid war with Iraq, it is totally disintegrating and Iran (with Russia) will walk in and take it over (lots of oil)!","Word is-early voting in FL is very dishonest. Little Marco, his State Chairman, &amp, their minions are working overtime-trying to rig the vote.","Has Barack Obama been caught red handed laundering money into his campaign from illegal online foreign donations? Media?","Twitter should let the banned Conservative Voices back onto their platform, without restriction. It’s called Freedom of Speech, remember. You are making a Giant Mistake!","Karl Rove is a total loser. Money given to him might as well be thrown down the drain.","A young military man working in Afghanistan told me that elections in Afghanistan are far more secure and much better run than the USA’s 2020 Election. Ours, with its millions and millions of corrupt Mail-In Ballots, was the election of a third world country. Fake President!","Joe Biden is a Low Energy Candidate the likes of which we have never seen before. The last thing our country needs is a Low Energy Individulal, especially when surrounded by High Energy Chess Players scattered all over the world. He’s back in his basement now - no schedule!","Ted Cruz is totally unelectable, if he even gets to run (born in Canada). Will loose big to Hillary. Polls show I beat Hillary easily! WIN!","Many good conversations with North Korea-it is going well! In the meantime, no Rocket Launches or Nuclear Testing in 8 months. All of Asia is thrilled. Only the Opposition Party, which includes the Fake News, is complaining. If not for me, we would now be at War with North Korea!","In certain swing states, there were more votes than people who voted, and in big numbers. Does that not really matter? Stopping Poll Watchers, voting for unsuspecting people, fake ballots and so much more. Such egregious conduct. We will win!","Terrible! Just found out that Obama had my \"\"wires tapped\"\" in Trump Tower just before the victory. Nothing found. This is McCarthyism!","Pelosi &amp; Schumer have no interest in making a deal that is good for our Country and our People. All they want is a trillion dollars, and much more, for their Radical Left Governed States, most of which are doing very badly. It is called a BAILOUT for many years of bad Dem Mgmt!","Failed RINO former Governor Rick Snyder of Michigan was a disaster with respect to the Flint Water CATASTROPHE, and a very bad Governor overall. He hurt so many people with his gross incompetence. He reminds me of Sleepy Joe!","After having written many best selling books, and somewhat priding myself on my ability to write, it should be noted that the Fake News constantly likes to pour over my tweets looking for a mistake. I capitalize certain words only for emphasis, not b/c they should be capitalized!","They are sending out 51,000,000 Ballots to people who haven’t even requested a Ballot. Many of those people don’t even exist. They are trying to STEAL this election. This should not be allowed!","Mini Mike Bloomberg can never recover from his incompetent debate performances. Also, as mayor he was very bad under pressure - a choker!","I am happy that \"\"The Job\"\" on CBS, the 16th. knockoff of the Apprentice, was just cancelled. I love to see my opponents lose (not nice)!","Biden can only enter the White House as President if he can prove that his ridiculous “80,000,000 votes” were not fraudulently or illegally obtained. When you see what happened in Detroit, Atlanta, Philadelphia &amp; Milwaukee, massive voter fraud, he’s got a big unsolvable problem!","I have never seen a thin person drinking  Diet Coke.","Why do losers &amp, haters always say I wear a “wig” when they know I don’t. Like it or not, it’s all mine—just ask Barbara Walters.","Iran will convince our incompetent President that they are trying to help us with Iraq, take over the country &amp, oil, and \"\"O\"\" will say thanks","Justice Ginsburg of the U.S. Supreme Court has embarrassed all by making very dumb political statements about me. Her mind is shot - resign!","I wonder if the Rutgers coach who had the audacity to yell at the player is a proponent of global warming?","If Michael Bloomberg ran again for Mayor of New York, he wouldn't get 10% of the vote - they would run him out of town!  #NeverHillary","As has been stated by numerous legal scholars, I have the absolute right to PARDON myself, but why would I do that when I have done nothing wrong? In the meantime, the never ending Witch Hunt, led by 13 very Angry and Conflicted Democrats (&amp, others) continues into the mid-terms!","Wow, I’m at 2,200,000  followers but I’d love to get rid of the haters &amp, losers—they’re such a waste of time!","Governor Cuomo is right about one thing - Attorney General Eric Schneiderman does wear eyeliner! What the hell is up with him?","Our record Economy would CRASH, just like in 1929, if any of those clowns became President!","So interesting to see “Progressive” Democrat Congresswomen, who originally came from countries whose governments are a complete and total catastrophe, the worst, most corrupt and inept anywhere in the world (if they even have a functioning government at all), now loudly......","Goofy Elizabeth Warren, sometimes referred to as Pocahontas, pretended to be a Native American in order to advance her career. Very racist!","...Biden is a corrupt globalist sellout who never missed a chance to stab American workers in the back. If Biden wins, China wins – it’s just that simple!","The Fake Mainstream Media has, from the time I announced I was running for President, run the most highly sophisticated &amp, dishonest Disinformation Campaign in the history of politics. No matter how well WE do, they find fault. But the forgotten men &amp, women WON, I’m President!","RIGGED ELECTION!","Losers and haters,even you, as low and dumb as you are, can learn from watching Apprentice and checking out my tweets-you can still succeed!","As President I have an obligation to end CORRUPTION, even if that means requesting the help of a foreign country or countries. It is done all the time. This has NOTHING to do with politics or a political campaign against the Bidens. This does have to do with their corruption!","Why did Vince and the WWE give my speech and segment the most time last night on USA Network - because that's what people want to see!","#OVERTURN","The Fake News is going crazy making up false stories and using only unnamed sources (who don’t exist). They are totally unhinged, and the great success of this Administration is making them do and say things that even they can’t believe they are saying. Truly bad people!","FAKE POLLING, just like 2016 (but worse)!","Crooked Hillary Clinton deleted 33,000 e-mails AFTER they were subpoenaed by the United States Congress. Guilty - cannot run. Rigged system!","Obama now wants to deny due process to the police. He’ll give all constitutional rights to the terrorists but not our cops.","Crooked Hillary said that I \"\"couldn't handle the rough and tumble of a political campaign.\"\" Really,I just beat 16 people and am beating her!","BREAKING NEWS:  Obama has just made a trade with Russia. They get Florida, California &amp, our gold supply. We get borscht &amp, a bottle of vodka.","The illegal Mueller Witch Hunt continues in search of a crime. There was never Collusion with Russia, except by the Clinton campaign, so the 17 Angry Democrats are looking at anything they can find. Very unfair and BAD for the country. ALSO, not allowed under the LAW!","If the people so violently shot down in Paris had guns, at least they would have had a fighting chance.","Google search results for “Trump News” shows only the viewing/reporting of Fake New Media. In other words, they have it RIGGED, for me &amp, others, so that almost all stories &amp, news is BAD. Fake CNN is prominent. Republican/Conservative &amp, Fair Media  is shut out. Illegal?  96% of...","Probably the only thing Barack Obama &amp; I have in common is that we both had the honor of firing Jim Mattis, the world’s most overrated General. I asked for his letter of resignation, &amp; felt great about it. His nickname was “Chaos”, which I didn’t like, &amp; changed to “Mad Dog”...","The inner workings of the Mueller investigation are a total mess. They have found no collusion and have gone absolutely nuts. They are screaming and shouting at people, horribly threatening them to come up with the answers they want. They are a disgrace to our Nation and don’t...","We should be able to negotiate a deal with Iran because they know we could blow them away to the Stone Age.They just don't believe we would."]